; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AC3EncodeContext = type { %struct.AVClass*, %struct.AC3EncOptions, %struct.AVCodecContext*, %struct.PutBitContext, %struct.AudioDSPContext, %struct.AVFloatDSPContext*, %struct.MECmpContext, %struct.AC3DSPContext, %struct.FFTContext, i16*, [6 x %struct.AC3Block], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i16], i64, i64, i32, i32, i32, i32, i32, i32, i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, [7 x i32], i32, i32, i32, i32, i32, [18 x i8], i32, i32, i32, i32, i32, i32, %struct.AC3BitAllocParameters, i32, [7 x i32], [7 x i32], i32, i32, i32, i16*, i16**, i8*, i8*, i32*, i32*, i8*, i8*, i16*, i16*, i16*, i16*, i8*, i8*, [7 x [6 x i8]], [7 x i8], i32, [7 x [6 x i8]], [7 x [6 x i8*]], i32, {}*, i32 (%struct.AC3EncodeContext*)*, i32 (%struct.AC3EncodeContext*)*, {}* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!934 = !DIEnumerator(name: "DBA_NONE", value: 2)
!935 = !DIEnumerator(name: "DBA_RESERVED", value: 3)
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !937, line: 49, size: 32, align: 32, elements: !938)
!937 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946, !947}
!939 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!940 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!941 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!942 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!943 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!944 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!945 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!946 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!947 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!948 = !{!949, !957, !958, !964}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !951, line: 221, size: 32, align: 8, elements: !952)
!951 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !950, file: !951, line: 221, baseType: !954, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !955, line: 51, baseType: !956)
!955 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!956 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !951, line: 222, size: 16, align: 8, elements: !960)
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !959, file: !951, line: 222, baseType: !962, size: 16, align: 16)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !955, line: 49, baseType: !963)
!963 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !955, line: 38, baseType: !966)
!966 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!967 = !{!968, !976, !2152, !2157, !2160, !2163, !2164, !2166, !2170, !2174}
!968 = distinct !DIGlobalVariable(name: "ff_ac3_channel_layouts", scope: !0, file: !969, line: 81, type: !970, isLocal: false, isDefinition: true, variable: [19 x i64]* @ff_ac3_channel_layouts)
!969 = !DIFile(filename: "libavcodec/ac3enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 1216, align: 64, elements: !974)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !955, line: 55, baseType: !973)
!973 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!974 = !{!975}
!975 = !DISubrange(count: 19)
!976 = distinct !DIGlobalVariable(name: "warn_once", scope: !977, file: !969, line: 1996, type: !966, isLocal: true, isDefinition: true, variable: i32* @ff_ac3_validate_metadata.warn_once)
!977 = distinct !DISubprogram(name: "ff_ac3_validate_metadata", scope: !969, file: !969, line: 1833, type: !978, isLocal: false, isDefinition: true, scopeLine: 1834, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2151)
!978 = !DISubroutineType(types: !979)
!979 = !{!966, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AC3EncodeContext", file: !982, line: 267, baseType: !983)
!982 = !DIFile(filename: "libavcodec/ac3enc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AC3EncodeContext", file: !982, line: 162, size: 27584, align: 64, elements: !984)
!984 = !{!985, !1068, !1099, !1772, !1783, !1809, !1851, !1894, !1962, !2007, !2011, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2117, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2134, !2135, !2136, !2137, !2139, !2140, !2145, !2149, !2150}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !983, file: !982, line: 163, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !989)
!989 = !{!990, !994, !998, !1027, !1028, !1029, !1030, !1034, !1040, !1042, !1046}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !988, file: !26, line: 72, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !988, file: !26, line: 78, baseType: !995, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!991, !957}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !988, file: !26, line: 85, baseType: !999, size: 64, align: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1023, !1024, !1025, !1026}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !4, line: 247, baseType: !991, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1001, file: !4, line: 253, baseType: !991, size: 64, align: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1001, file: !4, line: 259, baseType: !966, size: 32, align: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1001, file: !4, line: 271, baseType: !1008, size: 64, align: 64, offset: 192)
!1008 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1001, file: !4, line: 265, size: 64, align: 64, elements: !1009)
!1009 = !{!1010, !1013, !1015, !1016}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1008, file: !4, line: 266, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !955, line: 40, baseType: !1012)
!1012 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1008, file: !4, line: 267, baseType: !1014, size: 64, align: 64)
!1014 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1008, file: !4, line: 268, baseType: !991, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1008, file: !4, line: 270, baseType: !1017, size: 64, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1018, line: 61, baseType: !1019)
!1018 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1018, line: 58, size: 64, align: 32, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1019, file: !1018, line: 59, baseType: !966, size: 32, align: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1019, file: !1018, line: 60, baseType: !966, size: 32, align: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1001, file: !4, line: 272, baseType: !1014, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1001, file: !4, line: 273, baseType: !1014, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !4, line: 275, baseType: !966, size: 32, align: 32, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1001, file: !4, line: 300, baseType: !991, size: 64, align: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !988, file: !26, line: 93, baseType: !966, size: 32, align: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !988, file: !26, line: 99, baseType: !966, size: 32, align: 32, offset: 224)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !988, file: !26, line: 108, baseType: !966, size: 32, align: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !988, file: !26, line: 113, baseType: !1031, size: 64, align: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!957, !957, !957}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !988, file: !26, line: 123, baseType: !1035, size: 64, align: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1038, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !988, file: !26, line: 130, baseType: !1041, size: 32, align: 32, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !988, file: !26, line: 136, baseType: !1043, size: 64, align: 64, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!1041, !957}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !988, file: !26, line: 142, baseType: !1047, size: 64, align: 64, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!966, !1050, !957, !991, !966}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1053)
!1053 = !{!1054, !1066, !1067}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1052, file: !4, line: 360, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1058, file: !4, line: 307, baseType: !991, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1058, file: !4, line: 313, baseType: !1014, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1058, file: !4, line: 313, baseType: !1014, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1058, file: !4, line: 318, baseType: !1014, size: 64, align: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1058, file: !4, line: 318, baseType: !1014, size: 64, align: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1058, file: !4, line: 323, baseType: !966, size: 32, align: 32, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1052, file: !4, line: 364, baseType: !966, size: 32, align: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1052, file: !4, line: 368, baseType: !966, size: 32, align: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !983, file: !982, line: 164, baseType: !1069, size: 832, align: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AC3EncOptions", file: !982, line: 128, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AC3EncOptions", file: !982, line: 98, size: 832, align: 32, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "dialogue_level", scope: !1070, file: !982, line: 100, baseType: !966, size: 32, align: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_mode", scope: !1070, file: !982, line: 101, baseType: !966, size: 32, align: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "center_mix_level", scope: !1070, file: !982, line: 102, baseType: !1075, size: 32, align: 32, offset: 64)
!1075 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "surround_mix_level", scope: !1070, file: !982, line: 103, baseType: !1075, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "dolby_surround_mode", scope: !1070, file: !982, line: 104, baseType: !966, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "audio_production_info", scope: !1070, file: !982, line: 105, baseType: !966, size: 32, align: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mixing_level", scope: !1070, file: !982, line: 106, baseType: !966, size: 32, align: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "room_type", scope: !1070, file: !982, line: 107, baseType: !966, size: 32, align: 32, offset: 224)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "copyright", scope: !1070, file: !982, line: 108, baseType: !966, size: 32, align: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !1070, file: !982, line: 109, baseType: !966, size: 32, align: 32, offset: 288)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "extended_bsi_1", scope: !1070, file: !982, line: 110, baseType: !966, size: 32, align: 32, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_stereo_downmix", scope: !1070, file: !982, line: 111, baseType: !966, size: 32, align: 32, offset: 352)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ltrt_center_mix_level", scope: !1070, file: !982, line: 112, baseType: !1075, size: 32, align: 32, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ltrt_surround_mix_level", scope: !1070, file: !982, line: 113, baseType: !1075, size: 32, align: 32, offset: 416)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "loro_center_mix_level", scope: !1070, file: !982, line: 114, baseType: !1075, size: 32, align: 32, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "loro_surround_mix_level", scope: !1070, file: !982, line: 115, baseType: !1075, size: 32, align: 32, offset: 480)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "extended_bsi_2", scope: !1070, file: !982, line: 116, baseType: !966, size: 32, align: 32, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "dolby_surround_ex_mode", scope: !1070, file: !982, line: 117, baseType: !966, size: 32, align: 32, offset: 544)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "dolby_headphone_mode", scope: !1070, file: !982, line: 118, baseType: !966, size: 32, align: 32, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ad_converter_type", scope: !1070, file: !982, line: 119, baseType: !966, size: 32, align: 32, offset: 608)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "eac3_mixing_metadata", scope: !1070, file: !982, line: 120, baseType: !966, size: 32, align: 32, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "eac3_info_metadata", scope: !1070, file: !982, line: 121, baseType: !966, size: 32, align: 32, offset: 672)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "allow_per_frame_metadata", scope: !1070, file: !982, line: 124, baseType: !966, size: 32, align: 32, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_rematrixing", scope: !1070, file: !982, line: 125, baseType: !966, size: 32, align: 32, offset: 736)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "channel_coupling", scope: !1070, file: !982, line: 126, baseType: !966, size: 32, align: 32, offset: 768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "cpl_start", scope: !1070, file: !982, line: 127, baseType: !966, size: 32, align: 32, offset: 800)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !983, file: !982, line: 165, baseType: !1100, size: 64, align: 64, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1103)
!1103 = !{!1104, !1107, !1108, !1109, !1371, !1372, !1373, !1374, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1527, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1710, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1102, file: !57, line: 1561, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1102, file: !57, line: 1562, baseType: !966, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1102, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1102, file: !57, line: 1565, baseType: !1110, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1122, !1125, !1128, !1131, !1133, !1136, !1137, !1145, !1146, !1147, !1149, !1153, !1159, !1170, !1174, !1175, !1221, !1342, !1346, !1347, !1351, !1355, !1360, !1364, !1365, !1366}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !57, line: 3475, baseType: !991, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1112, file: !57, line: 3480, baseType: !991, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1112, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1112, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1112, file: !57, line: 3487, baseType: !966, size: 32, align: 32, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1112, file: !57, line: 3488, baseType: !1120, size: 64, align: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1112, file: !57, line: 3489, baseType: !1123, size: 64, align: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1112, file: !57, line: 3490, baseType: !1126, size: 64, align: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1112, file: !57, line: 3491, baseType: !1129, size: 64, align: 64, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1112, file: !57, line: 3492, baseType: !1132, size: 64, align: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1112, file: !57, line: 3493, baseType: !1134, size: 8, align: 8, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !955, line: 48, baseType: !1135)
!1135 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1112, file: !57, line: 3494, baseType: !1105, size: 64, align: 64, offset: 640)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1112, file: !57, line: 3495, baseType: !1138, size: 64, align: 64, offset: 704)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1142)
!1142 = !{!1143, !1144}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1141, file: !57, line: 3402, baseType: !966, size: 32, align: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1141, file: !57, line: 3403, baseType: !991, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1112, file: !57, line: 3507, baseType: !991, size: 64, align: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1112, file: !57, line: 3516, baseType: !966, size: 32, align: 32, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1112, file: !57, line: 3517, baseType: !1148, size: 64, align: 64, offset: 896)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1112, file: !57, line: 3527, baseType: !1150, size: 64, align: 64, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!966, !1100}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1112, file: !57, line: 3535, baseType: !1154, size: 64, align: 64, offset: 1024)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!966, !1100, !1157}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1112, file: !57, line: 3541, baseType: !1160, size: 64, align: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1164, line: 223, size: 128, align: 64, elements: !1165)
!1164 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1165 = !{!1166, !1169}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1163, file: !1164, line: 224, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1163, file: !1164, line: 225, baseType: !1167, size: 64, align: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1112, file: !57, line: 3549, baseType: !1171, size: 64, align: 64, offset: 1152)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{null, !1148}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1112, file: !57, line: 3551, baseType: !1150, size: 64, align: 64, offset: 1216)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1112, file: !57, line: 3552, baseType: !1176, size: 64, align: 64, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!966, !1100, !1179, !966, !1180}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1220}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1182, file: !57, line: 3921, baseType: !962, size: 16, align: 16)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1182, file: !57, line: 3922, baseType: !954, size: 32, align: 32, offset: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1182, file: !57, line: 3923, baseType: !954, size: 32, align: 32, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1182, file: !57, line: 3924, baseType: !956, size: 32, align: 32, offset: 96)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1182, file: !57, line: 3925, baseType: !1189, size: 64, align: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199, !1209, !1213, !1215, !1216, !1218, !1219}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1192, file: !57, line: 3886, baseType: !966, size: 32, align: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1192, file: !57, line: 3887, baseType: !966, size: 32, align: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1192, file: !57, line: 3888, baseType: !966, size: 32, align: 32, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1192, file: !57, line: 3889, baseType: !966, size: 32, align: 32, offset: 96)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1192, file: !57, line: 3890, baseType: !966, size: 32, align: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1192, file: !57, line: 3897, baseType: !1200, size: 768, align: 64, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1202)
!1202 = !{!1203, !1207}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !57, line: 3855, baseType: !1204, size: 512, align: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 512, align: 64, elements: !1205)
!1205 = !{!1206}
!1206 = !DISubrange(count: 8)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1201, file: !57, line: 3857, baseType: !1208, size: 256, align: 32, offset: 512)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 256, align: 32, elements: !1205)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !57, line: 3903, baseType: !1210, size: 256, align: 64, offset: 960)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 256, align: 64, elements: !1211)
!1211 = !{!1212}
!1212 = !DISubrange(count: 4)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1192, file: !57, line: 3904, baseType: !1214, size: 128, align: 32, offset: 1216)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 128, align: 32, elements: !1211)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1192, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1192, file: !57, line: 3908, baseType: !1217, size: 64, align: 64, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1192, file: !57, line: 3915, baseType: !1217, size: 64, align: 64, offset: 1472)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1192, file: !57, line: 3917, baseType: !966, size: 32, align: 32, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1182, file: !57, line: 3926, baseType: !1011, size: 64, align: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1112, file: !57, line: 3564, baseType: !1222, size: 64, align: 64, offset: 1344)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!966, !1100, !1225, !1259, !1341}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1228)
!1228 = !{!1229, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1255, !1256, !1257, !1258}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1227, file: !57, line: 1451, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1232, line: 94, baseType: !1233)
!1232 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1232, line: 81, size: 192, align: 64, elements: !1234)
!1234 = !{!1235, !1239, !1240}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1233, file: !1232, line: 82, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1232, line: 73, baseType: !1238)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1232, line: 73, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1233, file: !1232, line: 89, baseType: !1179, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1233, file: !1232, line: 93, baseType: !966, size: 32, align: 32, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1227, file: !57, line: 1461, baseType: !1011, size: 64, align: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1227, file: !57, line: 1467, baseType: !1011, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1227, file: !57, line: 1468, baseType: !1179, size: 64, align: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !57, line: 1469, baseType: !966, size: 32, align: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1227, file: !57, line: 1470, baseType: !966, size: 32, align: 32, offset: 288)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1227, file: !57, line: 1474, baseType: !966, size: 32, align: 32, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1227, file: !57, line: 1479, baseType: !1248, size: 64, align: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1250, file: !57, line: 1412, baseType: !1179, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1250, file: !57, line: 1413, baseType: !966, size: 32, align: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1250, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1227, file: !57, line: 1480, baseType: !966, size: 32, align: 32, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1227, file: !57, line: 1486, baseType: !1011, size: 64, align: 64, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1227, file: !57, line: 1488, baseType: !1011, size: 64, align: 64, offset: 576)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1227, file: !57, line: 1497, baseType: !1011, size: 64, align: 64, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1263)
!1263 = !{!1264, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1293, !1295, !1296, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1330, !1331, !1332, !1333, !1334, !1337, !1338, !1339, !1340}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1262, file: !780, line: 282, baseType: !1204, size: 512, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1262, file: !780, line: 299, baseType: !1208, size: 256, align: 32, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1262, file: !780, line: 315, baseType: !1267, size: 64, align: 64, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1262, file: !780, line: 326, baseType: !966, size: 32, align: 32, offset: 832)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1262, file: !780, line: 326, baseType: !966, size: 32, align: 32, offset: 864)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1262, file: !780, line: 334, baseType: !966, size: 32, align: 32, offset: 896)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1262, file: !780, line: 341, baseType: !966, size: 32, align: 32, offset: 928)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1262, file: !780, line: 346, baseType: !966, size: 32, align: 32, offset: 960)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1262, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1262, file: !780, line: 356, baseType: !1017, size: 64, align: 32, offset: 1024)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1262, file: !780, line: 361, baseType: !1011, size: 64, align: 64, offset: 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1262, file: !780, line: 369, baseType: !1011, size: 64, align: 64, offset: 1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1262, file: !780, line: 377, baseType: !1011, size: 64, align: 64, offset: 1216)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1262, file: !780, line: 382, baseType: !966, size: 32, align: 32, offset: 1280)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1262, file: !780, line: 386, baseType: !966, size: 32, align: 32, offset: 1312)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1262, file: !780, line: 391, baseType: !966, size: 32, align: 32, offset: 1344)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1262, file: !780, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1262, file: !780, line: 403, baseType: !1283, size: 512, align: 64, offset: 1472)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 512, align: 64, elements: !1205)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1262, file: !780, line: 410, baseType: !966, size: 32, align: 32, offset: 1984)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1262, file: !780, line: 415, baseType: !966, size: 32, align: 32, offset: 2016)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1262, file: !780, line: 420, baseType: !966, size: 32, align: 32, offset: 2048)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1262, file: !780, line: 425, baseType: !966, size: 32, align: 32, offset: 2080)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1262, file: !780, line: 435, baseType: !1011, size: 64, align: 64, offset: 2112)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1262, file: !780, line: 440, baseType: !966, size: 32, align: 32, offset: 2176)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1262, file: !780, line: 445, baseType: !972, size: 64, align: 64, offset: 2240)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1262, file: !780, line: 459, baseType: !1292, size: 512, align: 64, offset: 2304)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1230, size: 512, align: 64, elements: !1205)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1262, file: !780, line: 473, baseType: !1294, size: 64, align: 64, offset: 2816)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1262, file: !780, line: 477, baseType: !966, size: 32, align: 32, offset: 2880)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1262, file: !780, line: 479, baseType: !1297, size: 64, align: 64, offset: 2944)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1310}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1300, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1300, file: !780, line: 203, baseType: !1179, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1300, file: !780, line: 204, baseType: !966, size: 32, align: 32, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1300, file: !780, line: 205, baseType: !1306, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1308, line: 86, baseType: !1309)
!1308 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1308, line: 86, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1300, file: !780, line: 206, baseType: !1230, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1262, file: !780, line: 480, baseType: !966, size: 32, align: 32, offset: 3008)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1262, file: !780, line: 505, baseType: !966, size: 32, align: 32, offset: 3040)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1262, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1262, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1262, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1262, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1262, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1262, file: !780, line: 532, baseType: !1011, size: 64, align: 64, offset: 3264)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1262, file: !780, line: 539, baseType: !1011, size: 64, align: 64, offset: 3328)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1262, file: !780, line: 547, baseType: !1011, size: 64, align: 64, offset: 3392)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1262, file: !780, line: 554, baseType: !1306, size: 64, align: 64, offset: 3456)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1262, file: !780, line: 563, baseType: !966, size: 32, align: 32, offset: 3520)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1262, file: !780, line: 572, baseType: !966, size: 32, align: 32, offset: 3552)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1262, file: !780, line: 581, baseType: !966, size: 32, align: 32, offset: 3584)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1262, file: !780, line: 588, baseType: !1326, size: 64, align: 64, offset: 3648)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !955, line: 36, baseType: !1328)
!1328 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1262, file: !780, line: 593, baseType: !966, size: 32, align: 32, offset: 3712)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1262, file: !780, line: 596, baseType: !966, size: 32, align: 32, offset: 3744)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1262, file: !780, line: 599, baseType: !1230, size: 64, align: 64, offset: 3776)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1262, file: !780, line: 605, baseType: !1230, size: 64, align: 64, offset: 3840)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1262, file: !780, line: 616, baseType: !1230, size: 64, align: 64, offset: 3904)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1262, file: !780, line: 626, baseType: !1335, size: 64, align: 64, offset: 3968)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1336, line: 216, baseType: !973)
!1336 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1262, file: !780, line: 627, baseType: !1335, size: 64, align: 64, offset: 4032)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1262, file: !780, line: 628, baseType: !1335, size: 64, align: 64, offset: 4096)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1262, file: !780, line: 629, baseType: !1335, size: 64, align: 64, offset: 4160)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1262, file: !780, line: 645, baseType: !1230, size: 64, align: 64, offset: 4224)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1112, file: !57, line: 3566, baseType: !1343, size: 64, align: 64, offset: 1408)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!966, !1100, !957, !1341, !1225}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1112, file: !57, line: 3567, baseType: !1150, size: 64, align: 64, offset: 1472)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1112, file: !57, line: 3576, baseType: !1348, size: 64, align: 64, offset: 1536)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!966, !1100, !1259}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1112, file: !57, line: 3577, baseType: !1352, size: 64, align: 64, offset: 1600)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!966, !1100, !1225}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1112, file: !57, line: 3584, baseType: !1356, size: 64, align: 64, offset: 1664)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!966, !1100, !1359}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1112, file: !57, line: 3589, baseType: !1361, size: 64, align: 64, offset: 1728)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{null, !1100}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1112, file: !57, line: 3594, baseType: !966, size: 32, align: 32, offset: 1792)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1112, file: !57, line: 3600, baseType: !991, size: 64, align: 64, offset: 1856)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1112, file: !57, line: 3609, baseType: !1367, size: 64, align: 64, offset: 1920)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1102, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1102, file: !57, line: 1581, baseType: !956, size: 32, align: 32, offset: 224)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1102, file: !57, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1102, file: !57, line: 1591, baseType: !1375, size: 64, align: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1164, line: 129, size: 1664, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1400, !1401, !1407, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1376, file: !1164, line: 136, baseType: !966, size: 32, align: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1376, file: !1164, line: 151, baseType: !966, size: 32, align: 32, offset: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1376, file: !1164, line: 157, baseType: !966, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1376, file: !1164, line: 159, baseType: !1359, size: 64, align: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1376, file: !1164, line: 161, baseType: !1383, size: 64, align: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1164, line: 117, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1164, line: 100, size: 832, align: 64, elements: !1386)
!1386 = !{!1387, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1385, file: !1164, line: 105, baseType: !1388, size: 256, align: 64)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1389, size: 256, align: 64, elements: !1211)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1232, line: 238, baseType: !1391)
!1391 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1232, line: 238, flags: DIFlagFwdDecl)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1385, file: !1164, line: 110, baseType: !966, size: 32, align: 32, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1385, file: !1164, line: 111, baseType: !966, size: 32, align: 32, offset: 288)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1385, file: !1164, line: 111, baseType: !966, size: 32, align: 32, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1385, file: !1164, line: 112, baseType: !1208, size: 256, align: 32, offset: 352)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1385, file: !1164, line: 113, baseType: !1214, size: 128, align: 32, offset: 608)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1385, file: !1164, line: 114, baseType: !966, size: 32, align: 32, offset: 736)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1385, file: !1164, line: 115, baseType: !966, size: 32, align: 32, offset: 768)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1385, file: !1164, line: 116, baseType: !966, size: 32, align: 32, offset: 800)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1376, file: !1164, line: 163, baseType: !957, size: 64, align: 64, offset: 256)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1376, file: !1164, line: 165, baseType: !1402, size: 128, align: 64, offset: 320)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1164, line: 122, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1164, line: 119, size: 128, align: 64, elements: !1404)
!1404 = !{!1405, !1406}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1403, file: !1164, line: 120, baseType: !1225, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1403, file: !1164, line: 121, baseType: !1359, size: 64, align: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1376, file: !1164, line: 166, baseType: !1408, size: 128, align: 64, offset: 448)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1164, line: 127, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1164, line: 124, size: 128, align: 64, elements: !1410)
!1410 = !{!1411, !1484}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1409, file: !1164, line: 125, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1416)
!1416 = !{!1417, !1418, !1442, !1446, !1447, !1481, !1482, !1483}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1415, file: !57, line: 5751, baseType: !1105, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1415, file: !57, line: 5756, baseType: !1419, size: 64, align: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1422)
!1422 = !{!1423, !1424, !1427, !1428, !1429, !1433, !1437, !1441}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1421, file: !57, line: 5797, baseType: !991, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1421, file: !57, line: 5804, baseType: !1425, size: 64, align: 64, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1421, file: !57, line: 5815, baseType: !1105, size: 64, align: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1421, file: !57, line: 5825, baseType: !966, size: 32, align: 32, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1421, file: !57, line: 5826, baseType: !1430, size: 64, align: 64, offset: 256)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!966, !1413}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1421, file: !57, line: 5827, baseType: !1434, size: 64, align: 64, offset: 320)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!966, !1413, !1225}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1421, file: !57, line: 5828, baseType: !1438, size: 64, align: 64, offset: 384)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{null, !1413}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1421, file: !57, line: 5829, baseType: !1438, size: 64, align: 64, offset: 448)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1415, file: !57, line: 5762, baseType: !1443, size: 64, align: 64, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1445)
!1445 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1415, file: !57, line: 5768, baseType: !957, size: 64, align: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1415, file: !57, line: 5775, baseType: !1448, size: 64, align: 64, offset: 256)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1450, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1450, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1450, file: !57, line: 3948, baseType: !954, size: 32, align: 32, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1450, file: !57, line: 3958, baseType: !1179, size: 64, align: 64, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1450, file: !57, line: 3962, baseType: !966, size: 32, align: 32, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1450, file: !57, line: 3968, baseType: !966, size: 32, align: 32, offset: 224)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1450, file: !57, line: 3973, baseType: !1011, size: 64, align: 64, offset: 256)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1450, file: !57, line: 3986, baseType: !966, size: 32, align: 32, offset: 320)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1450, file: !57, line: 3999, baseType: !966, size: 32, align: 32, offset: 352)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1450, file: !57, line: 4004, baseType: !966, size: 32, align: 32, offset: 384)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1450, file: !57, line: 4005, baseType: !966, size: 32, align: 32, offset: 416)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1450, file: !57, line: 4010, baseType: !966, size: 32, align: 32, offset: 448)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1450, file: !57, line: 4011, baseType: !966, size: 32, align: 32, offset: 480)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1450, file: !57, line: 4020, baseType: !1017, size: 64, align: 32, offset: 512)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1450, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1450, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1450, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1450, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1450, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1450, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1450, file: !57, line: 4039, baseType: !966, size: 32, align: 32, offset: 768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1450, file: !57, line: 4046, baseType: !972, size: 64, align: 64, offset: 832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1450, file: !57, line: 4050, baseType: !966, size: 32, align: 32, offset: 896)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1450, file: !57, line: 4054, baseType: !966, size: 32, align: 32, offset: 928)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1450, file: !57, line: 4061, baseType: !966, size: 32, align: 32, offset: 960)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1450, file: !57, line: 4065, baseType: !966, size: 32, align: 32, offset: 992)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1450, file: !57, line: 4073, baseType: !966, size: 32, align: 32, offset: 1024)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1450, file: !57, line: 4080, baseType: !966, size: 32, align: 32, offset: 1056)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1450, file: !57, line: 4084, baseType: !966, size: 32, align: 32, offset: 1088)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1415, file: !57, line: 5781, baseType: !1448, size: 64, align: 64, offset: 320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1415, file: !57, line: 5787, baseType: !1017, size: 64, align: 32, offset: 384)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1415, file: !57, line: 5793, baseType: !1017, size: 64, align: 32, offset: 448)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1409, file: !1164, line: 126, baseType: !966, size: 32, align: 32, offset: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1376, file: !1164, line: 172, baseType: !1225, size: 64, align: 64, offset: 576)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1376, file: !1164, line: 177, baseType: !1179, size: 64, align: 64, offset: 640)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1376, file: !1164, line: 178, baseType: !956, size: 32, align: 32, offset: 704)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1376, file: !1164, line: 180, baseType: !957, size: 64, align: 64, offset: 768)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1376, file: !1164, line: 185, baseType: !966, size: 32, align: 32, offset: 832)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1376, file: !1164, line: 190, baseType: !957, size: 64, align: 64, offset: 896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1376, file: !1164, line: 195, baseType: !966, size: 32, align: 32, offset: 960)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1376, file: !1164, line: 200, baseType: !1225, size: 64, align: 64, offset: 1024)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1376, file: !1164, line: 201, baseType: !966, size: 32, align: 32, offset: 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1376, file: !1164, line: 202, baseType: !1359, size: 64, align: 64, offset: 1152)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1376, file: !1164, line: 203, baseType: !966, size: 32, align: 32, offset: 1216)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1376, file: !1164, line: 205, baseType: !966, size: 32, align: 32, offset: 1248)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1376, file: !1164, line: 206, baseType: !966, size: 32, align: 32, offset: 1280)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1376, file: !1164, line: 209, baseType: !1335, size: 64, align: 64, offset: 1344)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1376, file: !1164, line: 212, baseType: !1335, size: 64, align: 64, offset: 1408)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1376, file: !1164, line: 213, baseType: !1359, size: 64, align: 64, offset: 1472)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1376, file: !1164, line: 215, baseType: !966, size: 32, align: 32, offset: 1536)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1376, file: !1164, line: 217, baseType: !966, size: 32, align: 32, offset: 1568)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1376, file: !1164, line: 220, baseType: !966, size: 32, align: 32, offset: 1600)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1102, file: !57, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1102, file: !57, line: 1606, baseType: !1011, size: 64, align: 64, offset: 448)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1102, file: !57, line: 1614, baseType: !966, size: 32, align: 32, offset: 512)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1102, file: !57, line: 1622, baseType: !966, size: 32, align: 32, offset: 544)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1102, file: !57, line: 1628, baseType: !966, size: 32, align: 32, offset: 576)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1102, file: !57, line: 1636, baseType: !966, size: 32, align: 32, offset: 608)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1102, file: !57, line: 1643, baseType: !966, size: 32, align: 32, offset: 640)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1102, file: !57, line: 1657, baseType: !1179, size: 64, align: 64, offset: 704)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1102, file: !57, line: 1658, baseType: !966, size: 32, align: 32, offset: 768)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1102, file: !57, line: 1679, baseType: !1017, size: 64, align: 32, offset: 800)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1102, file: !57, line: 1688, baseType: !966, size: 32, align: 32, offset: 864)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1102, file: !57, line: 1712, baseType: !966, size: 32, align: 32, offset: 896)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1102, file: !57, line: 1729, baseType: !966, size: 32, align: 32, offset: 928)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1102, file: !57, line: 1729, baseType: !966, size: 32, align: 32, offset: 960)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1102, file: !57, line: 1744, baseType: !966, size: 32, align: 32, offset: 992)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1102, file: !57, line: 1744, baseType: !966, size: 32, align: 32, offset: 1024)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1102, file: !57, line: 1751, baseType: !966, size: 32, align: 32, offset: 1056)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1102, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1102, file: !57, line: 1791, baseType: !1523, size: 64, align: 64, offset: 1152)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{null, !1526, !1259, !1341, !966, !966, !966}
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1102, file: !57, line: 1808, baseType: !1528, size: 64, align: 64, offset: 1216)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!516, !1526, !1123}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1102, file: !57, line: 1816, baseType: !966, size: 32, align: 32, offset: 1280)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1102, file: !57, line: 1825, baseType: !1075, size: 32, align: 32, offset: 1312)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1102, file: !57, line: 1830, baseType: !966, size: 32, align: 32, offset: 1344)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1102, file: !57, line: 1838, baseType: !1075, size: 32, align: 32, offset: 1376)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1102, file: !57, line: 1846, baseType: !966, size: 32, align: 32, offset: 1408)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1102, file: !57, line: 1851, baseType: !966, size: 32, align: 32, offset: 1440)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1102, file: !57, line: 1861, baseType: !1075, size: 32, align: 32, offset: 1472)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1102, file: !57, line: 1868, baseType: !1075, size: 32, align: 32, offset: 1504)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1102, file: !57, line: 1875, baseType: !1075, size: 32, align: 32, offset: 1536)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1102, file: !57, line: 1882, baseType: !1075, size: 32, align: 32, offset: 1568)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1102, file: !57, line: 1889, baseType: !1075, size: 32, align: 32, offset: 1600)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1102, file: !57, line: 1896, baseType: !1075, size: 32, align: 32, offset: 1632)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1102, file: !57, line: 1903, baseType: !1075, size: 32, align: 32, offset: 1664)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1102, file: !57, line: 1910, baseType: !966, size: 32, align: 32, offset: 1696)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1102, file: !57, line: 1915, baseType: !966, size: 32, align: 32, offset: 1728)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1102, file: !57, line: 1926, baseType: !1341, size: 64, align: 64, offset: 1792)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1102, file: !57, line: 1935, baseType: !1017, size: 64, align: 32, offset: 1856)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1102, file: !57, line: 1942, baseType: !966, size: 32, align: 32, offset: 1920)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1102, file: !57, line: 1948, baseType: !966, size: 32, align: 32, offset: 1952)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1102, file: !57, line: 1954, baseType: !966, size: 32, align: 32, offset: 1984)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1102, file: !57, line: 1960, baseType: !966, size: 32, align: 32, offset: 2016)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1102, file: !57, line: 1984, baseType: !966, size: 32, align: 32, offset: 2048)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1102, file: !57, line: 1991, baseType: !966, size: 32, align: 32, offset: 2080)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1102, file: !57, line: 1996, baseType: !966, size: 32, align: 32, offset: 2112)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1102, file: !57, line: 2004, baseType: !966, size: 32, align: 32, offset: 2144)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1102, file: !57, line: 2011, baseType: !966, size: 32, align: 32, offset: 2176)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1102, file: !57, line: 2018, baseType: !966, size: 32, align: 32, offset: 2208)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1102, file: !57, line: 2027, baseType: !966, size: 32, align: 32, offset: 2240)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1102, file: !57, line: 2034, baseType: !966, size: 32, align: 32, offset: 2272)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1102, file: !57, line: 2044, baseType: !966, size: 32, align: 32, offset: 2304)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1102, file: !57, line: 2054, baseType: !1562, size: 64, align: 64, offset: 2368)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1102, file: !57, line: 2061, baseType: !1562, size: 64, align: 64, offset: 2432)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1102, file: !57, line: 2066, baseType: !966, size: 32, align: 32, offset: 2496)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1102, file: !57, line: 2070, baseType: !966, size: 32, align: 32, offset: 2528)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1102, file: !57, line: 2078, baseType: !966, size: 32, align: 32, offset: 2560)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1102, file: !57, line: 2085, baseType: !966, size: 32, align: 32, offset: 2592)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1102, file: !57, line: 2092, baseType: !966, size: 32, align: 32, offset: 2624)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1102, file: !57, line: 2099, baseType: !966, size: 32, align: 32, offset: 2656)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1102, file: !57, line: 2106, baseType: !966, size: 32, align: 32, offset: 2688)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1102, file: !57, line: 2113, baseType: !966, size: 32, align: 32, offset: 2720)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1102, file: !57, line: 2120, baseType: !966, size: 32, align: 32, offset: 2752)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1102, file: !57, line: 2125, baseType: !966, size: 32, align: 32, offset: 2784)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1102, file: !57, line: 2133, baseType: !966, size: 32, align: 32, offset: 2816)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1102, file: !57, line: 2140, baseType: !966, size: 32, align: 32, offset: 2848)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1102, file: !57, line: 2145, baseType: !966, size: 32, align: 32, offset: 2880)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1102, file: !57, line: 2153, baseType: !966, size: 32, align: 32, offset: 2912)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1102, file: !57, line: 2158, baseType: !966, size: 32, align: 32, offset: 2944)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1102, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1102, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1102, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1102, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1102, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1102, file: !57, line: 2203, baseType: !966, size: 32, align: 32, offset: 3136)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1102, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1102, file: !57, line: 2212, baseType: !966, size: 32, align: 32, offset: 3200)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1102, file: !57, line: 2213, baseType: !966, size: 32, align: 32, offset: 3232)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1102, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1102, file: !57, line: 2232, baseType: !966, size: 32, align: 32, offset: 3296)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1102, file: !57, line: 2243, baseType: !966, size: 32, align: 32, offset: 3328)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1102, file: !57, line: 2249, baseType: !966, size: 32, align: 32, offset: 3360)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1102, file: !57, line: 2256, baseType: !966, size: 32, align: 32, offset: 3392)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1102, file: !57, line: 2263, baseType: !972, size: 64, align: 64, offset: 3456)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1102, file: !57, line: 2270, baseType: !972, size: 64, align: 64, offset: 3520)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1102, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1102, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1102, file: !57, line: 2367, baseType: !1598, size: 64, align: 64, offset: 3648)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!966, !1526, !1359, !966}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1102, file: !57, line: 2383, baseType: !966, size: 32, align: 32, offset: 3712)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1102, file: !57, line: 2386, baseType: !1075, size: 32, align: 32, offset: 3744)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1102, file: !57, line: 2387, baseType: !1075, size: 32, align: 32, offset: 3776)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1102, file: !57, line: 2394, baseType: !966, size: 32, align: 32, offset: 3808)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1102, file: !57, line: 2401, baseType: !966, size: 32, align: 32, offset: 3840)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1102, file: !57, line: 2408, baseType: !966, size: 32, align: 32, offset: 3872)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1102, file: !57, line: 2415, baseType: !966, size: 32, align: 32, offset: 3904)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1102, file: !57, line: 2422, baseType: !966, size: 32, align: 32, offset: 3936)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1102, file: !57, line: 2423, baseType: !1610, size: 64, align: 64, offset: 3968)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1613)
!1613 = !{!1614, !1615, !1616, !1617}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1612, file: !57, line: 827, baseType: !966, size: 32, align: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1612, file: !57, line: 828, baseType: !966, size: 32, align: 32, offset: 32)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1612, file: !57, line: 829, baseType: !966, size: 32, align: 32, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1612, file: !57, line: 830, baseType: !1075, size: 32, align: 32, offset: 96)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1102, file: !57, line: 2430, baseType: !1011, size: 64, align: 64, offset: 4032)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1102, file: !57, line: 2437, baseType: !1011, size: 64, align: 64, offset: 4096)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1102, file: !57, line: 2444, baseType: !1075, size: 32, align: 32, offset: 4160)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1102, file: !57, line: 2451, baseType: !1075, size: 32, align: 32, offset: 4192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1102, file: !57, line: 2458, baseType: !966, size: 32, align: 32, offset: 4224)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1102, file: !57, line: 2469, baseType: !966, size: 32, align: 32, offset: 4256)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1102, file: !57, line: 2475, baseType: !966, size: 32, align: 32, offset: 4288)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1102, file: !57, line: 2481, baseType: !966, size: 32, align: 32, offset: 4320)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1102, file: !57, line: 2485, baseType: !966, size: 32, align: 32, offset: 4352)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1102, file: !57, line: 2489, baseType: !966, size: 32, align: 32, offset: 4384)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1102, file: !57, line: 2493, baseType: !966, size: 32, align: 32, offset: 4416)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1102, file: !57, line: 2501, baseType: !966, size: 32, align: 32, offset: 4448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1102, file: !57, line: 2506, baseType: !966, size: 32, align: 32, offset: 4480)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1102, file: !57, line: 2510, baseType: !966, size: 32, align: 32, offset: 4512)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1102, file: !57, line: 2514, baseType: !1011, size: 64, align: 64, offset: 4544)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1102, file: !57, line: 2528, baseType: !1634, size: 64, align: 64, offset: 4608)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{null, !1526, !957, !966, !966}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1102, file: !57, line: 2534, baseType: !966, size: 32, align: 32, offset: 4672)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1102, file: !57, line: 2545, baseType: !966, size: 32, align: 32, offset: 4704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1102, file: !57, line: 2547, baseType: !966, size: 32, align: 32, offset: 4736)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1102, file: !57, line: 2549, baseType: !966, size: 32, align: 32, offset: 4768)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1102, file: !57, line: 2551, baseType: !966, size: 32, align: 32, offset: 4800)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1102, file: !57, line: 2553, baseType: !966, size: 32, align: 32, offset: 4832)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1102, file: !57, line: 2555, baseType: !966, size: 32, align: 32, offset: 4864)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1102, file: !57, line: 2557, baseType: !966, size: 32, align: 32, offset: 4896)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1102, file: !57, line: 2559, baseType: !966, size: 32, align: 32, offset: 4928)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1102, file: !57, line: 2563, baseType: !966, size: 32, align: 32, offset: 4960)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1102, file: !57, line: 2571, baseType: !1217, size: 64, align: 64, offset: 4992)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1102, file: !57, line: 2579, baseType: !1217, size: 64, align: 64, offset: 5056)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1102, file: !57, line: 2586, baseType: !966, size: 32, align: 32, offset: 5120)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1102, file: !57, line: 2615, baseType: !966, size: 32, align: 32, offset: 5152)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1102, file: !57, line: 2627, baseType: !966, size: 32, align: 32, offset: 5184)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1102, file: !57, line: 2637, baseType: !966, size: 32, align: 32, offset: 5216)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1102, file: !57, line: 2681, baseType: !966, size: 32, align: 32, offset: 5248)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1102, file: !57, line: 2709, baseType: !1011, size: 64, align: 64, offset: 5312)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1102, file: !57, line: 2716, baseType: !1656, size: 64, align: 64, offset: 5376)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1666, !1670, !1674, !1675, !1676, !1677, !1683, !1684, !1685, !1686, !1687}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1658, file: !57, line: 3642, baseType: !991, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1658, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1658, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1658, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1658, file: !57, line: 3669, baseType: !966, size: 32, align: 32, offset: 160)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1658, file: !57, line: 3682, baseType: !1356, size: 64, align: 64, offset: 192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1658, file: !57, line: 3698, baseType: !1667, size: 64, align: 64, offset: 256)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!966, !1100, !1167, !954}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1658, file: !57, line: 3712, baseType: !1671, size: 64, align: 64, offset: 320)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!966, !1100, !966, !1167, !954}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1658, file: !57, line: 3726, baseType: !1667, size: 64, align: 64, offset: 384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1658, file: !57, line: 3737, baseType: !1150, size: 64, align: 64, offset: 448)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1658, file: !57, line: 3746, baseType: !966, size: 32, align: 32, offset: 512)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1658, file: !57, line: 3757, baseType: !1678, size: 64, align: 64, offset: 576)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1681}
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1658, file: !57, line: 3766, baseType: !1150, size: 64, align: 64, offset: 640)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1658, file: !57, line: 3774, baseType: !1150, size: 64, align: 64, offset: 704)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1658, file: !57, line: 3780, baseType: !966, size: 32, align: 32, offset: 768)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1658, file: !57, line: 3785, baseType: !966, size: 32, align: 32, offset: 800)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1658, file: !57, line: 3795, baseType: !1688, size: 64, align: 64, offset: 832)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!966, !1100, !1230}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1102, file: !57, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1102, file: !57, line: 2735, baseType: !1283, size: 512, align: 64, offset: 5504)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1102, file: !57, line: 2742, baseType: !966, size: 32, align: 32, offset: 6016)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1102, file: !57, line: 2755, baseType: !966, size: 32, align: 32, offset: 6048)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1102, file: !57, line: 2776, baseType: !966, size: 32, align: 32, offset: 6080)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1102, file: !57, line: 2783, baseType: !966, size: 32, align: 32, offset: 6112)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1102, file: !57, line: 2791, baseType: !966, size: 32, align: 32, offset: 6144)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1102, file: !57, line: 2802, baseType: !1359, size: 64, align: 64, offset: 6208)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1102, file: !57, line: 2811, baseType: !966, size: 32, align: 32, offset: 6272)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1102, file: !57, line: 2821, baseType: !966, size: 32, align: 32, offset: 6304)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1102, file: !57, line: 2830, baseType: !966, size: 32, align: 32, offset: 6336)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1102, file: !57, line: 2840, baseType: !966, size: 32, align: 32, offset: 6368)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1102, file: !57, line: 2851, baseType: !1704, size: 64, align: 64, offset: 6400)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!966, !1526, !1707, !957, !1341, !966, !966}
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!966, !1526, !957}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1102, file: !57, line: 2871, baseType: !1711, size: 64, align: 64, offset: 6464)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!966, !1526, !1714, !957, !1341, !966}
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!966, !1526, !957, !966, !966}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1102, file: !57, line: 2878, baseType: !966, size: 32, align: 32, offset: 6528)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1102, file: !57, line: 2885, baseType: !966, size: 32, align: 32, offset: 6560)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1102, file: !57, line: 3005, baseType: !966, size: 32, align: 32, offset: 6592)
