; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926, !929}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !928)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !930)
!930 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!931 = !{i32 2, !"Dwarf Version", i32 4}
!932 = !{i32 2, !"Debug Info Version", i32 3}
!933 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!934 = distinct !DISubprogram(name: "ff_msmpeg4_common_init", scope: !935, file: !935, line: 109, type: !936, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2594)
!935 = !DIFile(filename: "libavcodec/msmpeg4.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!936 = !DISubroutineType(types: !937)
!937 = !{null, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !940, line: 582, baseType: !941)
!940 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !940, line: 81, size: 86208, align: 64, elements: !942)
!942 = !{!943, !1028, !1029, !1030, !1031, !1035, !1036, !1050, !1051, !1052, !1053, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1758, !1759, !1814, !1816, !1817, !1818, !1819, !1820, !1831, !1832, !1833, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1849, !1851, !1853, !1854, !1855, !1856, !1857, !1858, !1863, !1865, !1866, !1867, !1868, !1869, !1870, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1897, !1898, !1899, !1900, !1916, !1923, !1935, !1951, !1973, !2013, !2026, !2053, !2068, !2082, !2095, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2116, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2129, !2131, !2132, !2133, !2134, !2135, !2136, !2139, !2141, !2143, !2144, !2147, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2214, !2215, !2217, !2218, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2240, !2241, !2242, !2245, !2246, !2247, !2248, !2250, !2252, !2253, !2254, !2255, !2256, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2338, !2339, !2340, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2469, !2470, !2471, !2472, !2476, !2477, !2481, !2485, !2489, !2490, !2495, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2510, !2511, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2529, !2530, !2531, !2581, !2582, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !941, file: !940, line: 82, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !947)
!947 = !{!948, !952, !957, !987, !988, !989, !990, !994, !1000, !1002, !1006}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !946, file: !26, line: 72, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !946, file: !26, line: 78, baseType: !953, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!949, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !946, file: !26, line: 85, baseType: !958, size: 64, align: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !961)
!961 = !{!962, !963, !964, !966, !967, !983, !984, !985, !986}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !960, file: !4, line: 247, baseType: !949, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !960, file: !4, line: 253, baseType: !949, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !960, file: !4, line: 259, baseType: !965, size: 32, align: 32, offset: 128)
!965 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !960, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !960, file: !4, line: 271, baseType: !968, size: 64, align: 64, offset: 192)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !960, file: !4, line: 265, size: 64, align: 64, elements: !969)
!969 = !{!970, !973, !975, !976}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !968, file: !4, line: 266, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !972)
!972 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !968, file: !4, line: 267, baseType: !974, size: 64, align: 64)
!974 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !968, file: !4, line: 268, baseType: !949, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !968, file: !4, line: 270, baseType: !977, size: 64, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !978, line: 61, baseType: !979)
!978 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !978, line: 58, size: 64, align: 32, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !979, file: !978, line: 59, baseType: !965, size: 32, align: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !979, file: !978, line: 60, baseType: !965, size: 32, align: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !960, file: !4, line: 272, baseType: !974, size: 64, align: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !960, file: !4, line: 273, baseType: !974, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !960, file: !4, line: 275, baseType: !965, size: 32, align: 32, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !960, file: !4, line: 300, baseType: !949, size: 64, align: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !946, file: !26, line: 93, baseType: !965, size: 32, align: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !946, file: !26, line: 99, baseType: !965, size: 32, align: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !946, file: !26, line: 108, baseType: !965, size: 32, align: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !946, file: !26, line: 113, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!956, !956, !956}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !946, file: !26, line: 123, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!998, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !946, file: !26, line: 130, baseType: !1001, size: 32, align: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !946, file: !26, line: 136, baseType: !1003, size: 64, align: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1001, !956}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !946, file: !26, line: 142, baseType: !1007, size: 64, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!965, !1010, !956, !949, !965}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1013)
!1013 = !{!1014, !1026, !1027}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1012, file: !4, line: 360, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1018, file: !4, line: 307, baseType: !949, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1018, file: !4, line: 313, baseType: !974, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1018, file: !4, line: 313, baseType: !974, size: 64, align: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1018, file: !4, line: 318, baseType: !974, size: 64, align: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1018, file: !4, line: 318, baseType: !974, size: 64, align: 64, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1018, file: !4, line: 323, baseType: !965, size: 32, align: 32, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1012, file: !4, line: 364, baseType: !965, size: 32, align: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1012, file: !4, line: 368, baseType: !965, size: 32, align: 32, offset: 96)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !941, file: !940, line: 84, baseType: !965, size: 32, align: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !941, file: !940, line: 84, baseType: !965, size: 32, align: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !941, file: !940, line: 85, baseType: !965, size: 32, align: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !941, file: !940, line: 86, baseType: !1032, size: 384, align: 32, offset: 160)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 384, align: 32, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 12)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !941, file: !940, line: 87, baseType: !965, size: 32, align: 32, offset: 544)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !941, file: !940, line: 90, baseType: !1037, size: 1088, align: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1039)
!1039 = !{!1040, !1045, !1049}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1038, file: !917, line: 32, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !1044)
!1044 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1038, file: !917, line: 33, baseType: !1046, size: 512, align: 8, offset: 64)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 512, align: 8, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1038, file: !917, line: 34, baseType: !1046, size: 512, align: 8, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !941, file: !940, line: 91, baseType: !1037, size: 1088, align: 64, offset: 1664)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !941, file: !940, line: 92, baseType: !1037, size: 1088, align: 64, offset: 2752)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !941, file: !940, line: 93, baseType: !1037, size: 1088, align: 64, offset: 3840)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !941, file: !940, line: 98, baseType: !1054, size: 64, align: 64, offset: 4928)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1056)
!1056 = !{!1057, !1060, !1061, !1062, !1325, !1326, !1327, !1328, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1480, !1484, !1485, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1663, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1055, file: !57, line: 1561, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1055, file: !57, line: 1562, baseType: !965, size: 32, align: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1055, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1055, file: !57, line: 1565, baseType: !1063, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1075, !1078, !1081, !1084, !1087, !1088, !1089, !1097, !1098, !1099, !1101, !1107, !1113, !1122, !1126, !1127, !1175, !1296, !1300, !1301, !1305, !1309, !1314, !1318, !1319, !1320}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !57, line: 3475, baseType: !949, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1065, file: !57, line: 3480, baseType: !949, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1065, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1065, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1065, file: !57, line: 3487, baseType: !965, size: 32, align: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1065, file: !57, line: 3488, baseType: !1073, size: 64, align: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1065, file: !57, line: 3489, baseType: !1076, size: 64, align: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1065, file: !57, line: 3490, baseType: !1079, size: 64, align: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1065, file: !57, line: 3491, baseType: !1082, size: 64, align: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1065, file: !57, line: 3492, baseType: !1085, size: 64, align: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1065, file: !57, line: 3493, baseType: !1043, size: 8, align: 8, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1065, file: !57, line: 3494, baseType: !1058, size: 64, align: 64, offset: 640)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1065, file: !57, line: 3495, baseType: !1090, size: 64, align: 64, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1093, file: !57, line: 3402, baseType: !965, size: 32, align: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !57, line: 3403, baseType: !949, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1065, file: !57, line: 3507, baseType: !949, size: 64, align: 64, offset: 768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1065, file: !57, line: 3516, baseType: !965, size: 32, align: 32, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !57, line: 3517, baseType: !1100, size: 64, align: 64, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1065, file: !57, line: 3527, baseType: !1102, size: 64, align: 64, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!965, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1055)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1065, file: !57, line: 3535, baseType: !1108, size: 64, align: 64, offset: 1024)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!965, !1105, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1065, file: !57, line: 3541, baseType: !1114, size: 64, align: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1118, line: 223, size: 128, align: 64, elements: !1119)
!1118 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1117, file: !1118, line: 224, baseType: !1041, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1117, file: !1118, line: 225, baseType: !1041, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1065, file: !57, line: 3549, baseType: !1123, size: 64, align: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !1100}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1065, file: !57, line: 3551, baseType: !1102, size: 64, align: 64, offset: 1216)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1065, file: !57, line: 3552, baseType: !1128, size: 64, align: 64, offset: 1280)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!965, !1105, !1131, !965, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1135)
!1135 = !{!1136, !1139, !1140, !1141, !1142, !1174}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1134, file: !57, line: 3921, baseType: !1137, size: 16, align: 16)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !1138)
!1138 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1134, file: !57, line: 3922, baseType: !926, size: 32, align: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1134, file: !57, line: 3923, baseType: !926, size: 32, align: 32, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1134, file: !57, line: 3924, baseType: !928, size: 32, align: 32, offset: 96)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1134, file: !57, line: 3925, baseType: !1143, size: 64, align: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1163, !1167, !1169, !1170, !1172, !1173}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1146, file: !57, line: 3886, baseType: !965, size: 32, align: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1146, file: !57, line: 3887, baseType: !965, size: 32, align: 32, offset: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1146, file: !57, line: 3888, baseType: !965, size: 32, align: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1146, file: !57, line: 3889, baseType: !965, size: 32, align: 32, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1146, file: !57, line: 3890, baseType: !965, size: 32, align: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1146, file: !57, line: 3897, baseType: !1154, size: 768, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1156)
!1156 = !{!1157, !1161}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !57, line: 3855, baseType: !1158, size: 512, align: 64)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !1159)
!1159 = !{!1160}
!1160 = !DISubrange(count: 8)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1155, file: !57, line: 3857, baseType: !1162, size: 256, align: 32, offset: 512)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 256, align: 32, elements: !1159)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !57, line: 3903, baseType: !1164, size: 256, align: 64, offset: 960)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 256, align: 64, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 4)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1146, file: !57, line: 3904, baseType: !1168, size: 128, align: 32, offset: 1216)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 128, align: 32, elements: !1165)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1146, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1146, file: !57, line: 3908, baseType: !1171, size: 64, align: 64, offset: 1408)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1146, file: !57, line: 3915, baseType: !1171, size: 64, align: 64, offset: 1472)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1146, file: !57, line: 3917, baseType: !965, size: 32, align: 32, offset: 1536)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1134, file: !57, line: 3926, baseType: !971, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1065, file: !57, line: 3564, baseType: !1176, size: 64, align: 64, offset: 1344)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!965, !1105, !1179, !1213, !1295}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1182)
!1182 = !{!1183, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1209, !1210, !1211, !1212}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1181, file: !57, line: 1451, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1186, line: 94, baseType: !1187)
!1186 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1186, line: 81, size: 192, align: 64, elements: !1188)
!1188 = !{!1189, !1193, !1194}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1187, file: !1186, line: 82, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1186, line: 73, baseType: !1192)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1186, line: 73, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !1186, line: 89, baseType: !1131, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1187, file: !1186, line: 93, baseType: !965, size: 32, align: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1181, file: !57, line: 1461, baseType: !971, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1181, file: !57, line: 1467, baseType: !971, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !57, line: 1468, baseType: !1131, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !57, line: 1469, baseType: !965, size: 32, align: 32, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1181, file: !57, line: 1470, baseType: !965, size: 32, align: 32, offset: 288)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1181, file: !57, line: 1474, baseType: !965, size: 32, align: 32, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1181, file: !57, line: 1479, baseType: !1202, size: 64, align: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !57, line: 1412, baseType: !1131, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !57, line: 1413, baseType: !965, size: 32, align: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1181, file: !57, line: 1480, baseType: !965, size: 32, align: 32, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1181, file: !57, line: 1486, baseType: !971, size: 64, align: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1181, file: !57, line: 1488, baseType: !971, size: 64, align: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1181, file: !57, line: 1497, baseType: !971, size: 64, align: 64, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1247, !1249, !1250, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1291, !1292, !1293, !1294}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !780, line: 282, baseType: !1158, size: 512, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1216, file: !780, line: 299, baseType: !1162, size: 256, align: 32, offset: 512)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1216, file: !780, line: 315, baseType: !1221, size: 64, align: 64, offset: 768)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1216, file: !780, line: 326, baseType: !965, size: 32, align: 32, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1216, file: !780, line: 326, baseType: !965, size: 32, align: 32, offset: 864)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1216, file: !780, line: 334, baseType: !965, size: 32, align: 32, offset: 896)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1216, file: !780, line: 341, baseType: !965, size: 32, align: 32, offset: 928)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1216, file: !780, line: 346, baseType: !965, size: 32, align: 32, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1216, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1216, file: !780, line: 356, baseType: !977, size: 64, align: 32, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1216, file: !780, line: 361, baseType: !971, size: 64, align: 64, offset: 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1216, file: !780, line: 369, baseType: !971, size: 64, align: 64, offset: 1152)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1216, file: !780, line: 377, baseType: !971, size: 64, align: 64, offset: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1216, file: !780, line: 382, baseType: !965, size: 32, align: 32, offset: 1280)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1216, file: !780, line: 386, baseType: !965, size: 32, align: 32, offset: 1312)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1216, file: !780, line: 391, baseType: !965, size: 32, align: 32, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1216, file: !780, line: 396, baseType: !956, size: 64, align: 64, offset: 1408)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1216, file: !780, line: 403, baseType: !1237, size: 512, align: 64, offset: 1472)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 512, align: 64, elements: !1159)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1216, file: !780, line: 410, baseType: !965, size: 32, align: 32, offset: 1984)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1216, file: !780, line: 415, baseType: !965, size: 32, align: 32, offset: 2016)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1216, file: !780, line: 420, baseType: !965, size: 32, align: 32, offset: 2048)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1216, file: !780, line: 425, baseType: !965, size: 32, align: 32, offset: 2080)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1216, file: !780, line: 435, baseType: !971, size: 64, align: 64, offset: 2112)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1216, file: !780, line: 440, baseType: !965, size: 32, align: 32, offset: 2176)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1216, file: !780, line: 445, baseType: !929, size: 64, align: 64, offset: 2240)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1216, file: !780, line: 459, baseType: !1246, size: 512, align: 64, offset: 2304)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 512, align: 64, elements: !1159)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1216, file: !780, line: 473, baseType: !1248, size: 64, align: 64, offset: 2816)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1216, file: !780, line: 477, baseType: !965, size: 32, align: 32, offset: 2880)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1216, file: !780, line: 479, baseType: !1251, size: 64, align: 64, offset: 2944)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1264}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !780, line: 203, baseType: !1131, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !780, line: 204, baseType: !965, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1254, file: !780, line: 205, baseType: !1260, size: 64, align: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1262, line: 86, baseType: !1263)
!1262 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1262, line: 86, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1254, file: !780, line: 206, baseType: !1184, size: 64, align: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1216, file: !780, line: 480, baseType: !965, size: 32, align: 32, offset: 3008)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1216, file: !780, line: 505, baseType: !965, size: 32, align: 32, offset: 3040)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1216, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1216, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1216, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1216, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1216, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1216, file: !780, line: 532, baseType: !971, size: 64, align: 64, offset: 3264)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1216, file: !780, line: 539, baseType: !971, size: 64, align: 64, offset: 3328)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1216, file: !780, line: 547, baseType: !971, size: 64, align: 64, offset: 3392)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1216, file: !780, line: 554, baseType: !1260, size: 64, align: 64, offset: 3456)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1216, file: !780, line: 563, baseType: !965, size: 32, align: 32, offset: 3520)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1216, file: !780, line: 572, baseType: !965, size: 32, align: 32, offset: 3552)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1216, file: !780, line: 581, baseType: !965, size: 32, align: 32, offset: 3584)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1216, file: !780, line: 588, baseType: !1280, size: 64, align: 64, offset: 3648)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1282)
!1282 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1216, file: !780, line: 593, baseType: !965, size: 32, align: 32, offset: 3712)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1216, file: !780, line: 596, baseType: !965, size: 32, align: 32, offset: 3744)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1216, file: !780, line: 599, baseType: !1184, size: 64, align: 64, offset: 3776)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1216, file: !780, line: 605, baseType: !1184, size: 64, align: 64, offset: 3840)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1216, file: !780, line: 616, baseType: !1184, size: 64, align: 64, offset: 3904)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1216, file: !780, line: 626, baseType: !1289, size: 64, align: 64, offset: 3968)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1290, line: 216, baseType: !930)
!1290 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1216, file: !780, line: 627, baseType: !1289, size: 64, align: 64, offset: 4032)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1216, file: !780, line: 628, baseType: !1289, size: 64, align: 64, offset: 4096)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1216, file: !780, line: 629, baseType: !1289, size: 64, align: 64, offset: 4160)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1216, file: !780, line: 645, baseType: !1184, size: 64, align: 64, offset: 4224)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1065, file: !57, line: 3566, baseType: !1297, size: 64, align: 64, offset: 1408)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!965, !1105, !956, !1295, !1179}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1065, file: !57, line: 3567, baseType: !1102, size: 64, align: 64, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1065, file: !57, line: 3576, baseType: !1302, size: 64, align: 64, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!965, !1105, !1213}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1065, file: !57, line: 3577, baseType: !1306, size: 64, align: 64, offset: 1600)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!965, !1105, !1179}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1065, file: !57, line: 3584, baseType: !1310, size: 64, align: 64, offset: 1664)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!965, !1105, !1313}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1065, file: !57, line: 3589, baseType: !1315, size: 64, align: 64, offset: 1728)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1105}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1065, file: !57, line: 3594, baseType: !965, size: 32, align: 32, offset: 1792)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1065, file: !57, line: 3600, baseType: !949, size: 64, align: 64, offset: 1856)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1065, file: !57, line: 3609, baseType: !1321, size: 64, align: 64, offset: 1920)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1324)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1055, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1055, file: !57, line: 1581, baseType: !928, size: 32, align: 32, offset: 224)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1055, file: !57, line: 1583, baseType: !956, size: 64, align: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1055, file: !57, line: 1591, baseType: !1329, size: 64, align: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1118, line: 129, size: 1664, align: 64, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1354, !1355, !1361, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1330, file: !1118, line: 136, baseType: !965, size: 32, align: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1330, file: !1118, line: 151, baseType: !965, size: 32, align: 32, offset: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1330, file: !1118, line: 157, baseType: !965, size: 32, align: 32, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1330, file: !1118, line: 159, baseType: !1313, size: 64, align: 64, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1330, file: !1118, line: 161, baseType: !1337, size: 64, align: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1118, line: 117, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1118, line: 100, size: 832, align: 64, elements: !1340)
!1340 = !{!1341, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1339, file: !1118, line: 105, baseType: !1342, size: 256, align: 64)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1343, size: 256, align: 64, elements: !1165)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1186, line: 238, baseType: !1345)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1186, line: 238, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1339, file: !1118, line: 110, baseType: !965, size: 32, align: 32, offset: 256)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1339, file: !1118, line: 111, baseType: !965, size: 32, align: 32, offset: 288)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1339, file: !1118, line: 111, baseType: !965, size: 32, align: 32, offset: 320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1339, file: !1118, line: 112, baseType: !1162, size: 256, align: 32, offset: 352)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1339, file: !1118, line: 113, baseType: !1168, size: 128, align: 32, offset: 608)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1339, file: !1118, line: 114, baseType: !965, size: 32, align: 32, offset: 736)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1339, file: !1118, line: 115, baseType: !965, size: 32, align: 32, offset: 768)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1339, file: !1118, line: 116, baseType: !965, size: 32, align: 32, offset: 800)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1330, file: !1118, line: 163, baseType: !956, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1330, file: !1118, line: 165, baseType: !1356, size: 128, align: 64, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1118, line: 122, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1118, line: 119, size: 128, align: 64, elements: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1357, file: !1118, line: 120, baseType: !1179, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1357, file: !1118, line: 121, baseType: !1313, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1330, file: !1118, line: 166, baseType: !1362, size: 128, align: 64, offset: 448)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1118, line: 127, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1118, line: 124, size: 128, align: 64, elements: !1364)
!1364 = !{!1365, !1438}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1363, file: !1118, line: 125, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1370)
!1370 = !{!1371, !1372, !1396, !1400, !1401, !1435, !1436, !1437}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1369, file: !57, line: 5751, baseType: !1058, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1369, file: !57, line: 5756, baseType: !1373, size: 64, align: 64, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1381, !1382, !1383, !1387, !1391, !1395}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1375, file: !57, line: 5797, baseType: !949, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1375, file: !57, line: 5804, baseType: !1379, size: 64, align: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1375, file: !57, line: 5815, baseType: !1058, size: 64, align: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1375, file: !57, line: 5825, baseType: !965, size: 32, align: 32, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1375, file: !57, line: 5826, baseType: !1384, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!965, !1367}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1375, file: !57, line: 5827, baseType: !1388, size: 64, align: 64, offset: 320)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!965, !1367, !1179}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1375, file: !57, line: 5828, baseType: !1392, size: 64, align: 64, offset: 384)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{null, !1367}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1375, file: !57, line: 5829, baseType: !1392, size: 64, align: 64, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1369, file: !57, line: 5762, baseType: !1397, size: 64, align: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1399)
!1399 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1369, file: !57, line: 5768, baseType: !956, size: 64, align: 64, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1369, file: !57, line: 5775, baseType: !1402, size: 64, align: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1405)
!1405 = !{!1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1404, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1404, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1404, file: !57, line: 3948, baseType: !926, size: 32, align: 32, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1404, file: !57, line: 3958, baseType: !1131, size: 64, align: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1404, file: !57, line: 3962, baseType: !965, size: 32, align: 32, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1404, file: !57, line: 3968, baseType: !965, size: 32, align: 32, offset: 224)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1404, file: !57, line: 3973, baseType: !971, size: 64, align: 64, offset: 256)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1404, file: !57, line: 3986, baseType: !965, size: 32, align: 32, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1404, file: !57, line: 3999, baseType: !965, size: 32, align: 32, offset: 352)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1404, file: !57, line: 4004, baseType: !965, size: 32, align: 32, offset: 384)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1404, file: !57, line: 4005, baseType: !965, size: 32, align: 32, offset: 416)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1404, file: !57, line: 4010, baseType: !965, size: 32, align: 32, offset: 448)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1404, file: !57, line: 4011, baseType: !965, size: 32, align: 32, offset: 480)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1404, file: !57, line: 4020, baseType: !977, size: 64, align: 32, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1404, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1404, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1404, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1404, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1404, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1404, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1404, file: !57, line: 4039, baseType: !965, size: 32, align: 32, offset: 768)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1404, file: !57, line: 4046, baseType: !929, size: 64, align: 64, offset: 832)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1404, file: !57, line: 4050, baseType: !965, size: 32, align: 32, offset: 896)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1404, file: !57, line: 4054, baseType: !965, size: 32, align: 32, offset: 928)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1404, file: !57, line: 4061, baseType: !965, size: 32, align: 32, offset: 960)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1404, file: !57, line: 4065, baseType: !965, size: 32, align: 32, offset: 992)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1404, file: !57, line: 4073, baseType: !965, size: 32, align: 32, offset: 1024)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1404, file: !57, line: 4080, baseType: !965, size: 32, align: 32, offset: 1056)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1404, file: !57, line: 4084, baseType: !965, size: 32, align: 32, offset: 1088)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1369, file: !57, line: 5781, baseType: !1402, size: 64, align: 64, offset: 320)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1369, file: !57, line: 5787, baseType: !977, size: 64, align: 32, offset: 384)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1369, file: !57, line: 5793, baseType: !977, size: 64, align: 32, offset: 448)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1363, file: !1118, line: 126, baseType: !965, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1330, file: !1118, line: 172, baseType: !1179, size: 64, align: 64, offset: 576)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1330, file: !1118, line: 177, baseType: !1131, size: 64, align: 64, offset: 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1330, file: !1118, line: 178, baseType: !928, size: 32, align: 32, offset: 704)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1330, file: !1118, line: 180, baseType: !956, size: 64, align: 64, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1330, file: !1118, line: 185, baseType: !965, size: 32, align: 32, offset: 832)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1330, file: !1118, line: 190, baseType: !956, size: 64, align: 64, offset: 896)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1330, file: !1118, line: 195, baseType: !965, size: 32, align: 32, offset: 960)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1330, file: !1118, line: 200, baseType: !1179, size: 64, align: 64, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1330, file: !1118, line: 201, baseType: !965, size: 32, align: 32, offset: 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1330, file: !1118, line: 202, baseType: !1313, size: 64, align: 64, offset: 1152)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1330, file: !1118, line: 203, baseType: !965, size: 32, align: 32, offset: 1216)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1330, file: !1118, line: 205, baseType: !965, size: 32, align: 32, offset: 1248)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1330, file: !1118, line: 206, baseType: !965, size: 32, align: 32, offset: 1280)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1330, file: !1118, line: 209, baseType: !1289, size: 64, align: 64, offset: 1344)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1330, file: !1118, line: 212, baseType: !1289, size: 64, align: 64, offset: 1408)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1330, file: !1118, line: 213, baseType: !1313, size: 64, align: 64, offset: 1472)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1330, file: !1118, line: 215, baseType: !965, size: 32, align: 32, offset: 1536)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1330, file: !1118, line: 217, baseType: !965, size: 32, align: 32, offset: 1568)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1330, file: !1118, line: 220, baseType: !965, size: 32, align: 32, offset: 1600)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1055, file: !57, line: 1598, baseType: !956, size: 64, align: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1055, file: !57, line: 1606, baseType: !971, size: 64, align: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1055, file: !57, line: 1614, baseType: !965, size: 32, align: 32, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1055, file: !57, line: 1622, baseType: !965, size: 32, align: 32, offset: 544)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1055, file: !57, line: 1628, baseType: !965, size: 32, align: 32, offset: 576)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1055, file: !57, line: 1636, baseType: !965, size: 32, align: 32, offset: 608)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1055, file: !57, line: 1643, baseType: !965, size: 32, align: 32, offset: 640)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1055, file: !57, line: 1657, baseType: !1131, size: 64, align: 64, offset: 704)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1055, file: !57, line: 1658, baseType: !965, size: 32, align: 32, offset: 768)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1055, file: !57, line: 1679, baseType: !977, size: 64, align: 32, offset: 800)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1055, file: !57, line: 1688, baseType: !965, size: 32, align: 32, offset: 864)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1055, file: !57, line: 1712, baseType: !965, size: 32, align: 32, offset: 896)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1055, file: !57, line: 1729, baseType: !965, size: 32, align: 32, offset: 928)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1055, file: !57, line: 1729, baseType: !965, size: 32, align: 32, offset: 960)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1055, file: !57, line: 1744, baseType: !965, size: 32, align: 32, offset: 992)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1055, file: !57, line: 1744, baseType: !965, size: 32, align: 32, offset: 1024)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1055, file: !57, line: 1751, baseType: !965, size: 32, align: 32, offset: 1056)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1055, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1055, file: !57, line: 1791, baseType: !1477, size: 64, align: 64, offset: 1152)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{null, !1054, !1213, !1295, !965, !965, !965}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1055, file: !57, line: 1808, baseType: !1481, size: 64, align: 64, offset: 1216)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!516, !1054, !1076}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1055, file: !57, line: 1816, baseType: !965, size: 32, align: 32, offset: 1280)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1055, file: !57, line: 1825, baseType: !1486, size: 32, align: 32, offset: 1312)
!1486 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1055, file: !57, line: 1830, baseType: !965, size: 32, align: 32, offset: 1344)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1055, file: !57, line: 1838, baseType: !1486, size: 32, align: 32, offset: 1376)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1055, file: !57, line: 1846, baseType: !965, size: 32, align: 32, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1055, file: !57, line: 1851, baseType: !965, size: 32, align: 32, offset: 1440)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1055, file: !57, line: 1861, baseType: !1486, size: 32, align: 32, offset: 1472)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1055, file: !57, line: 1868, baseType: !1486, size: 32, align: 32, offset: 1504)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1055, file: !57, line: 1875, baseType: !1486, size: 32, align: 32, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1055, file: !57, line: 1882, baseType: !1486, size: 32, align: 32, offset: 1568)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1055, file: !57, line: 1889, baseType: !1486, size: 32, align: 32, offset: 1600)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1055, file: !57, line: 1896, baseType: !1486, size: 32, align: 32, offset: 1632)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1055, file: !57, line: 1903, baseType: !1486, size: 32, align: 32, offset: 1664)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1055, file: !57, line: 1910, baseType: !965, size: 32, align: 32, offset: 1696)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1055, file: !57, line: 1915, baseType: !965, size: 32, align: 32, offset: 1728)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1055, file: !57, line: 1926, baseType: !1295, size: 64, align: 64, offset: 1792)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1055, file: !57, line: 1935, baseType: !977, size: 64, align: 32, offset: 1856)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1055, file: !57, line: 1942, baseType: !965, size: 32, align: 32, offset: 1920)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1055, file: !57, line: 1948, baseType: !965, size: 32, align: 32, offset: 1952)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1055, file: !57, line: 1954, baseType: !965, size: 32, align: 32, offset: 1984)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1055, file: !57, line: 1960, baseType: !965, size: 32, align: 32, offset: 2016)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1055, file: !57, line: 1984, baseType: !965, size: 32, align: 32, offset: 2048)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1055, file: !57, line: 1991, baseType: !965, size: 32, align: 32, offset: 2080)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1055, file: !57, line: 1996, baseType: !965, size: 32, align: 32, offset: 2112)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1055, file: !57, line: 2004, baseType: !965, size: 32, align: 32, offset: 2144)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1055, file: !57, line: 2011, baseType: !965, size: 32, align: 32, offset: 2176)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1055, file: !57, line: 2018, baseType: !965, size: 32, align: 32, offset: 2208)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1055, file: !57, line: 2027, baseType: !965, size: 32, align: 32, offset: 2240)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1055, file: !57, line: 2034, baseType: !965, size: 32, align: 32, offset: 2272)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1055, file: !57, line: 2044, baseType: !965, size: 32, align: 32, offset: 2304)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1055, file: !57, line: 2054, baseType: !1516, size: 64, align: 64, offset: 2368)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1055, file: !57, line: 2061, baseType: !1516, size: 64, align: 64, offset: 2432)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1055, file: !57, line: 2066, baseType: !965, size: 32, align: 32, offset: 2496)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1055, file: !57, line: 2070, baseType: !965, size: 32, align: 32, offset: 2528)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1055, file: !57, line: 2078, baseType: !965, size: 32, align: 32, offset: 2560)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1055, file: !57, line: 2085, baseType: !965, size: 32, align: 32, offset: 2592)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1055, file: !57, line: 2092, baseType: !965, size: 32, align: 32, offset: 2624)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1055, file: !57, line: 2099, baseType: !965, size: 32, align: 32, offset: 2656)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1055, file: !57, line: 2106, baseType: !965, size: 32, align: 32, offset: 2688)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1055, file: !57, line: 2113, baseType: !965, size: 32, align: 32, offset: 2720)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1055, file: !57, line: 2120, baseType: !965, size: 32, align: 32, offset: 2752)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1055, file: !57, line: 2125, baseType: !965, size: 32, align: 32, offset: 2784)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1055, file: !57, line: 2133, baseType: !965, size: 32, align: 32, offset: 2816)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1055, file: !57, line: 2140, baseType: !965, size: 32, align: 32, offset: 2848)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1055, file: !57, line: 2145, baseType: !965, size: 32, align: 32, offset: 2880)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1055, file: !57, line: 2153, baseType: !965, size: 32, align: 32, offset: 2912)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1055, file: !57, line: 2158, baseType: !965, size: 32, align: 32, offset: 2944)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1055, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1055, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1055, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1055, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1055, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1055, file: !57, line: 2203, baseType: !965, size: 32, align: 32, offset: 3136)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1055, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1055, file: !57, line: 2212, baseType: !965, size: 32, align: 32, offset: 3200)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1055, file: !57, line: 2213, baseType: !965, size: 32, align: 32, offset: 3232)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1055, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1055, file: !57, line: 2232, baseType: !965, size: 32, align: 32, offset: 3296)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1055, file: !57, line: 2243, baseType: !965, size: 32, align: 32, offset: 3328)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1055, file: !57, line: 2249, baseType: !965, size: 32, align: 32, offset: 3360)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1055, file: !57, line: 2256, baseType: !965, size: 32, align: 32, offset: 3392)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1055, file: !57, line: 2263, baseType: !929, size: 64, align: 64, offset: 3456)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1055, file: !57, line: 2270, baseType: !929, size: 64, align: 64, offset: 3520)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1055, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1055, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1055, file: !57, line: 2367, baseType: !1552, size: 64, align: 64, offset: 3648)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!965, !1054, !1313, !965}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1055, file: !57, line: 2383, baseType: !965, size: 32, align: 32, offset: 3712)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1055, file: !57, line: 2386, baseType: !1486, size: 32, align: 32, offset: 3744)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1055, file: !57, line: 2387, baseType: !1486, size: 32, align: 32, offset: 3776)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1055, file: !57, line: 2394, baseType: !965, size: 32, align: 32, offset: 3808)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1055, file: !57, line: 2401, baseType: !965, size: 32, align: 32, offset: 3840)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1055, file: !57, line: 2408, baseType: !965, size: 32, align: 32, offset: 3872)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1055, file: !57, line: 2415, baseType: !965, size: 32, align: 32, offset: 3904)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1055, file: !57, line: 2422, baseType: !965, size: 32, align: 32, offset: 3936)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1055, file: !57, line: 2423, baseType: !1564, size: 64, align: 64, offset: 3968)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1566, file: !57, line: 827, baseType: !965, size: 32, align: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1566, file: !57, line: 828, baseType: !965, size: 32, align: 32, offset: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1566, file: !57, line: 829, baseType: !965, size: 32, align: 32, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1566, file: !57, line: 830, baseType: !1486, size: 32, align: 32, offset: 96)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1055, file: !57, line: 2430, baseType: !971, size: 64, align: 64, offset: 4032)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1055, file: !57, line: 2437, baseType: !971, size: 64, align: 64, offset: 4096)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1055, file: !57, line: 2444, baseType: !1486, size: 32, align: 32, offset: 4160)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1055, file: !57, line: 2451, baseType: !1486, size: 32, align: 32, offset: 4192)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1055, file: !57, line: 2458, baseType: !965, size: 32, align: 32, offset: 4224)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1055, file: !57, line: 2469, baseType: !965, size: 32, align: 32, offset: 4256)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1055, file: !57, line: 2475, baseType: !965, size: 32, align: 32, offset: 4288)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1055, file: !57, line: 2481, baseType: !965, size: 32, align: 32, offset: 4320)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1055, file: !57, line: 2485, baseType: !965, size: 32, align: 32, offset: 4352)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1055, file: !57, line: 2489, baseType: !965, size: 32, align: 32, offset: 4384)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1055, file: !57, line: 2493, baseType: !965, size: 32, align: 32, offset: 4416)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1055, file: !57, line: 2501, baseType: !965, size: 32, align: 32, offset: 4448)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1055, file: !57, line: 2506, baseType: !965, size: 32, align: 32, offset: 4480)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1055, file: !57, line: 2510, baseType: !965, size: 32, align: 32, offset: 4512)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1055, file: !57, line: 2514, baseType: !971, size: 64, align: 64, offset: 4544)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1055, file: !57, line: 2528, baseType: !1588, size: 64, align: 64, offset: 4608)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1054, !956, !965, !965}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1055, file: !57, line: 2534, baseType: !965, size: 32, align: 32, offset: 4672)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1055, file: !57, line: 2545, baseType: !965, size: 32, align: 32, offset: 4704)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1055, file: !57, line: 2547, baseType: !965, size: 32, align: 32, offset: 4736)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1055, file: !57, line: 2549, baseType: !965, size: 32, align: 32, offset: 4768)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1055, file: !57, line: 2551, baseType: !965, size: 32, align: 32, offset: 4800)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1055, file: !57, line: 2553, baseType: !965, size: 32, align: 32, offset: 4832)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1055, file: !57, line: 2555, baseType: !965, size: 32, align: 32, offset: 4864)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1055, file: !57, line: 2557, baseType: !965, size: 32, align: 32, offset: 4896)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1055, file: !57, line: 2559, baseType: !965, size: 32, align: 32, offset: 4928)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1055, file: !57, line: 2563, baseType: !965, size: 32, align: 32, offset: 4960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1055, file: !57, line: 2571, baseType: !1171, size: 64, align: 64, offset: 4992)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1055, file: !57, line: 2579, baseType: !1171, size: 64, align: 64, offset: 5056)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1055, file: !57, line: 2586, baseType: !965, size: 32, align: 32, offset: 5120)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1055, file: !57, line: 2615, baseType: !965, size: 32, align: 32, offset: 5152)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1055, file: !57, line: 2627, baseType: !965, size: 32, align: 32, offset: 5184)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1055, file: !57, line: 2637, baseType: !965, size: 32, align: 32, offset: 5216)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1055, file: !57, line: 2681, baseType: !965, size: 32, align: 32, offset: 5248)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1055, file: !57, line: 2709, baseType: !971, size: 64, align: 64, offset: 5312)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1055, file: !57, line: 2716, baseType: !1610, size: 64, align: 64, offset: 5376)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1613)
!1613 = !{!1614, !1615, !1616, !1617, !1618, !1619, !1620, !1624, !1628, !1629, !1630, !1631, !1636, !1637, !1638, !1639, !1640}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1612, file: !57, line: 3642, baseType: !949, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1612, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1612, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1612, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1612, file: !57, line: 3669, baseType: !965, size: 32, align: 32, offset: 160)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1612, file: !57, line: 3682, baseType: !1310, size: 64, align: 64, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1612, file: !57, line: 3698, baseType: !1621, size: 64, align: 64, offset: 256)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!965, !1105, !1041, !926}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1612, file: !57, line: 3712, baseType: !1625, size: 64, align: 64, offset: 320)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!965, !1105, !965, !1041, !926}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1612, file: !57, line: 3726, baseType: !1621, size: 64, align: 64, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1612, file: !57, line: 3737, baseType: !1102, size: 64, align: 64, offset: 448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1612, file: !57, line: 3746, baseType: !965, size: 32, align: 32, offset: 512)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1612, file: !57, line: 3757, baseType: !1632, size: 64, align: 64, offset: 576)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{null, !1635}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1612, file: !57, line: 3766, baseType: !1102, size: 64, align: 64, offset: 640)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1612, file: !57, line: 3774, baseType: !1102, size: 64, align: 64, offset: 704)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1612, file: !57, line: 3780, baseType: !965, size: 32, align: 32, offset: 768)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1612, file: !57, line: 3785, baseType: !965, size: 32, align: 32, offset: 800)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1612, file: !57, line: 3795, baseType: !1641, size: 64, align: 64, offset: 832)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!965, !1105, !1184}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1055, file: !57, line: 2728, baseType: !956, size: 64, align: 64, offset: 5440)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1055, file: !57, line: 2735, baseType: !1237, size: 512, align: 64, offset: 5504)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1055, file: !57, line: 2742, baseType: !965, size: 32, align: 32, offset: 6016)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1055, file: !57, line: 2755, baseType: !965, size: 32, align: 32, offset: 6048)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1055, file: !57, line: 2776, baseType: !965, size: 32, align: 32, offset: 6080)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1055, file: !57, line: 2783, baseType: !965, size: 32, align: 32, offset: 6112)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1055, file: !57, line: 2791, baseType: !965, size: 32, align: 32, offset: 6144)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1055, file: !57, line: 2802, baseType: !1313, size: 64, align: 64, offset: 6208)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1055, file: !57, line: 2811, baseType: !965, size: 32, align: 32, offset: 6272)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1055, file: !57, line: 2821, baseType: !965, size: 32, align: 32, offset: 6304)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1055, file: !57, line: 2830, baseType: !965, size: 32, align: 32, offset: 6336)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1055, file: !57, line: 2840, baseType: !965, size: 32, align: 32, offset: 6368)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1055, file: !57, line: 2851, baseType: !1657, size: 64, align: 64, offset: 6400)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!965, !1054, !1660, !956, !1295, !965, !965}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{!965, !1054, !956}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1055, file: !57, line: 2871, baseType: !1664, size: 64, align: 64, offset: 6464)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!965, !1054, !1667, !956, !1295, !965}
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!965, !1054, !956, !965, !965}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1055, file: !57, line: 2878, baseType: !965, size: 32, align: 32, offset: 6528)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1055, file: !57, line: 2885, baseType: !965, size: 32, align: 32, offset: 6560)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1055, file: !57, line: 3005, baseType: !965, size: 32, align: 32, offset: 6592)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1055, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1055, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1055, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1055, file: !57, line: 3037, baseType: !1131, size: 64, align: 64, offset: 6720)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1055, file: !57, line: 3038, baseType: !965, size: 32, align: 32, offset: 6784)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1055, file: !57, line: 3050, baseType: !929, size: 64, align: 64, offset: 6848)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1055, file: !57, line: 3065, baseType: !965, size: 32, align: 32, offset: 6912)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1055, file: !57, line: 3083, baseType: !965, size: 32, align: 32, offset: 6944)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1055, file: !57, line: 3092, baseType: !977, size: 64, align: 32, offset: 6976)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1055, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1055, file: !57, line: 3106, baseType: !977, size: 64, align: 32, offset: 7072)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1055, file: !57, line: 3113, baseType: !1685, size: 64, align: 64, offset: 7168)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1687)
!1687 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1688)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1689)
!1689 = !{!1690, !1691, !1692, !1693, !1694, !1695, !1698}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1688, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1688, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1688, file: !57, line: 720, baseType: !949, size: 64, align: 64, offset: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1688, file: !57, line: 724, baseType: !949, size: 64, align: 64, offset: 128)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1688, file: !57, line: 728, baseType: !965, size: 32, align: 32, offset: 192)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1688, file: !57, line: 734, baseType: !1696, size: 64, align: 64, offset: 256)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
