; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vc1_mc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vc1_mc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!942 = distinct !DISubprogram(name: "ff_vc1_mc_4mv_chroma4", scope: !943, file: !943, line: 839, type: !944, isLocal: false, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2959)
!943 = !DIFile(filename: "libavcodec/vc1_mc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!944 = !DISubroutineType(types: !945)
!945 = !{null, !946, !977, !977, !977}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "VC1Context", file: !926, line: 403, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VC1Context", file: !926, line: 173, size: 135936, align: 64, elements: !949)
!949 = !{!950, !2610, !2691, !2692, !2752, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2840, !2841, !2842, !2843, !2844, !2845, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !948, file: !926, line: 174, baseType: !951, size: 86208, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !952, line: 582, baseType: !953)
!952 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !952, line: 81, size: 86208, align: 64, elements: !954)
!954 = !{!955, !1041, !1042, !1043, !1044, !1048, !1049, !1063, !1064, !1065, !1066, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1774, !1775, !1830, !1832, !1833, !1834, !1835, !1836, !1847, !1848, !1849, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1865, !1867, !1869, !1870, !1871, !1872, !1873, !1874, !1879, !1881, !1882, !1883, !1884, !1885, !1886, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1913, !1914, !1915, !1916, !1932, !1939, !1951, !1967, !1989, !2029, !2042, !2069, !2084, !2098, !2111, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2132, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2145, !2147, !2148, !2149, !2150, !2151, !2152, !2155, !2157, !2159, !2160, !2163, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2230, !2231, !2233, !2234, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2256, !2257, !2258, !2261, !2262, !2263, !2264, !2266, !2268, !2269, !2270, !2271, !2272, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2354, !2355, !2356, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2485, !2486, !2487, !2488, !2492, !2493, !2497, !2501, !2505, !2506, !2511, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2526, !2527, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2545, !2546, !2547, !2597, !2598, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !953, file: !952, line: 82, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !959)
!959 = !{!960, !964, !969, !1000, !1001, !1002, !1003, !1007, !1013, !1015, !1019}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !958, file: !26, line: 72, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !958, file: !26, line: 78, baseType: !965, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!961, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !958, file: !26, line: 85, baseType: !970, size: 64, align: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !973)
!973 = !{!974, !975, !976, !978, !979, !996, !997, !998, !999}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !4, line: 247, baseType: !961, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !972, file: !4, line: 253, baseType: !961, size: 64, align: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !972, file: !4, line: 259, baseType: !977, size: 32, align: 32, offset: 128)
!977 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !972, file: !4, line: 271, baseType: !980, size: 64, align: 64, offset: 192)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !972, file: !4, line: 265, size: 64, align: 64, elements: !981)
!981 = !{!982, !986, !988, !989}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !980, file: !4, line: 266, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !984, line: 40, baseType: !985)
!984 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!985 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !980, file: !4, line: 267, baseType: !987, size: 64, align: 64)
!987 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !980, file: !4, line: 268, baseType: !961, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !980, file: !4, line: 270, baseType: !990, size: 64, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !991, line: 61, baseType: !992)
!991 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !991, line: 58, size: 64, align: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !992, file: !991, line: 59, baseType: !977, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !992, file: !991, line: 60, baseType: !977, size: 32, align: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !972, file: !4, line: 272, baseType: !987, size: 64, align: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !972, file: !4, line: 273, baseType: !987, size: 64, align: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !4, line: 275, baseType: !977, size: 32, align: 32, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !972, file: !4, line: 300, baseType: !961, size: 64, align: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !958, file: !26, line: 93, baseType: !977, size: 32, align: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !958, file: !26, line: 99, baseType: !977, size: 32, align: 32, offset: 224)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !958, file: !26, line: 108, baseType: !977, size: 32, align: 32, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !958, file: !26, line: 113, baseType: !1004, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!968, !968, !968}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !958, file: !26, line: 123, baseType: !1008, size: 64, align: 64, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1011, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !958, file: !26, line: 130, baseType: !1014, size: 32, align: 32, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !958, file: !26, line: 136, baseType: !1016, size: 64, align: 64, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1014, !968}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !958, file: !26, line: 142, baseType: !1020, size: 64, align: 64, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!977, !1023, !968, !961, !977}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1026)
!1026 = !{!1027, !1039, !1040}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1025, file: !4, line: 360, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1031, file: !4, line: 307, baseType: !961, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1031, file: !4, line: 313, baseType: !987, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1031, file: !4, line: 313, baseType: !987, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1031, file: !4, line: 318, baseType: !987, size: 64, align: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1031, file: !4, line: 318, baseType: !987, size: 64, align: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1031, file: !4, line: 323, baseType: !977, size: 32, align: 32, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1025, file: !4, line: 364, baseType: !977, size: 32, align: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1025, file: !4, line: 368, baseType: !977, size: 32, align: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !953, file: !952, line: 84, baseType: !977, size: 32, align: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !953, file: !952, line: 84, baseType: !977, size: 32, align: 32, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !953, file: !952, line: 85, baseType: !977, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !953, file: !952, line: 86, baseType: !1045, size: 384, align: 32, offset: 160)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 384, align: 32, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 12)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !953, file: !952, line: 87, baseType: !977, size: 32, align: 32, offset: 544)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !953, file: !952, line: 90, baseType: !1050, size: 1088, align: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1052)
!1052 = !{!1053, !1058, !1062}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1051, file: !917, line: 32, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !984, line: 48, baseType: !1057)
!1057 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1051, file: !917, line: 33, baseType: !1059, size: 512, align: 8, offset: 64)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 512, align: 8, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1051, file: !917, line: 34, baseType: !1059, size: 512, align: 8, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !953, file: !952, line: 91, baseType: !1050, size: 1088, align: 64, offset: 1664)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !953, file: !952, line: 92, baseType: !1050, size: 1088, align: 64, offset: 2752)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !953, file: !952, line: 93, baseType: !1050, size: 1088, align: 64, offset: 3840)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !953, file: !952, line: 98, baseType: !1067, size: 64, align: 64, offset: 4928)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1069)
!1069 = !{!1070, !1073, !1074, !1075, !1341, !1342, !1343, !1344, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1496, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1679, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1068, file: !57, line: 1561, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1068, file: !57, line: 1562, baseType: !977, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1068, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1068, file: !57, line: 1565, baseType: !1076, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1088, !1091, !1094, !1097, !1102, !1103, !1104, !1112, !1113, !1114, !1116, !1122, !1128, !1137, !1141, !1142, !1191, !1312, !1316, !1317, !1321, !1325, !1330, !1334, !1335, !1336}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !57, line: 3475, baseType: !961, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1078, file: !57, line: 3480, baseType: !961, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1078, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1078, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1078, file: !57, line: 3487, baseType: !977, size: 32, align: 32, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1078, file: !57, line: 3488, baseType: !1086, size: 64, align: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1078, file: !57, line: 3489, baseType: !1089, size: 64, align: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1078, file: !57, line: 3490, baseType: !1092, size: 64, align: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1078, file: !57, line: 3491, baseType: !1095, size: 64, align: 64, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1078, file: !57, line: 3492, baseType: !1098, size: 64, align: 64, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !984, line: 55, baseType: !1101)
!1101 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1078, file: !57, line: 3493, baseType: !1056, size: 8, align: 8, offset: 576)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1078, file: !57, line: 3494, baseType: !1071, size: 64, align: 64, offset: 640)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1078, file: !57, line: 3495, baseType: !1105, size: 64, align: 64, offset: 704)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1108, file: !57, line: 3402, baseType: !977, size: 32, align: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1108, file: !57, line: 3403, baseType: !961, size: 64, align: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1078, file: !57, line: 3507, baseType: !961, size: 64, align: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1078, file: !57, line: 3516, baseType: !977, size: 32, align: 32, offset: 832)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1078, file: !57, line: 3517, baseType: !1115, size: 64, align: 64, offset: 896)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1078, file: !57, line: 3527, baseType: !1117, size: 64, align: 64, offset: 960)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!977, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1068)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1078, file: !57, line: 3535, baseType: !1123, size: 64, align: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!977, !1120, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1078, file: !57, line: 3541, baseType: !1129, size: 64, align: 64, offset: 1088)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1133, line: 223, size: 128, align: 64, elements: !1134)
!1133 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1132, file: !1133, line: 224, baseType: !1054, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1132, file: !1133, line: 225, baseType: !1054, size: 64, align: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1078, file: !57, line: 3549, baseType: !1138, size: 64, align: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{null, !1115}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1078, file: !57, line: 3551, baseType: !1117, size: 64, align: 64, offset: 1216)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1078, file: !57, line: 3552, baseType: !1143, size: 64, align: 64, offset: 1280)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!977, !1120, !1146, !977, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1150)
!1150 = !{!1151, !1154, !1156, !1157, !1158, !1190}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1149, file: !57, line: 3921, baseType: !1152, size: 16, align: 16)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !984, line: 49, baseType: !1153)
!1153 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1149, file: !57, line: 3922, baseType: !1155, size: 32, align: 32, offset: 32)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !984, line: 51, baseType: !939)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1149, file: !57, line: 3923, baseType: !1155, size: 32, align: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1149, file: !57, line: 3924, baseType: !939, size: 32, align: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1149, file: !57, line: 3925, baseType: !1159, size: 64, align: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1168, !1169, !1179, !1183, !1185, !1186, !1188, !1189}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1162, file: !57, line: 3886, baseType: !977, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1162, file: !57, line: 3887, baseType: !977, size: 32, align: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1162, file: !57, line: 3888, baseType: !977, size: 32, align: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1162, file: !57, line: 3889, baseType: !977, size: 32, align: 32, offset: 96)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1162, file: !57, line: 3890, baseType: !977, size: 32, align: 32, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1162, file: !57, line: 3897, baseType: !1170, size: 768, align: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1172)
!1172 = !{!1173, !1177}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !57, line: 3855, baseType: !1174, size: 512, align: 64)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 512, align: 64, elements: !1175)
!1175 = !{!1176}
!1176 = !DISubrange(count: 8)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1171, file: !57, line: 3857, baseType: !1178, size: 256, align: 32, offset: 512)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 256, align: 32, elements: !1175)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !57, line: 3903, baseType: !1180, size: 256, align: 64, offset: 960)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 256, align: 64, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 4)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1162, file: !57, line: 3904, baseType: !1184, size: 128, align: 32, offset: 1216)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, align: 32, elements: !1181)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1162, file: !57, line: 3908, baseType: !1187, size: 64, align: 64, offset: 1408)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1162, file: !57, line: 3915, baseType: !1187, size: 64, align: 64, offset: 1472)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1162, file: !57, line: 3917, baseType: !977, size: 32, align: 32, offset: 1536)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1149, file: !57, line: 3926, baseType: !983, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1078, file: !57, line: 3564, baseType: !1192, size: 64, align: 64, offset: 1344)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!977, !1120, !1195, !1229, !1311}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1198)
!1198 = !{!1199, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1225, !1226, !1227, !1228}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1197, file: !57, line: 1451, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1202, line: 94, baseType: !1203)
!1202 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1202, line: 81, size: 192, align: 64, elements: !1204)
!1204 = !{!1205, !1209, !1210}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1203, file: !1202, line: 82, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1202, line: 73, baseType: !1208)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1202, line: 73, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1203, file: !1202, line: 89, baseType: !1146, size: 64, align: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !1202, line: 93, baseType: !977, size: 32, align: 32, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1197, file: !57, line: 1461, baseType: !983, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1197, file: !57, line: 1467, baseType: !983, size: 64, align: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !57, line: 1468, baseType: !1146, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !57, line: 1469, baseType: !977, size: 32, align: 32, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1197, file: !57, line: 1470, baseType: !977, size: 32, align: 32, offset: 288)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1197, file: !57, line: 1474, baseType: !977, size: 32, align: 32, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1197, file: !57, line: 1479, baseType: !1218, size: 64, align: 64, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !57, line: 1412, baseType: !1146, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1220, file: !57, line: 1413, baseType: !977, size: 32, align: 32, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1220, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1197, file: !57, line: 1480, baseType: !977, size: 32, align: 32, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1197, file: !57, line: 1486, baseType: !983, size: 64, align: 64, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1197, file: !57, line: 1488, baseType: !983, size: 64, align: 64, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1197, file: !57, line: 1497, baseType: !983, size: 64, align: 64, offset: 640)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1263, !1265, !1266, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1299, !1300, !1301, !1302, !1303, !1304, !1307, !1308, !1309, !1310}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1232, file: !780, line: 282, baseType: !1174, size: 512, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1232, file: !780, line: 299, baseType: !1178, size: 256, align: 32, offset: 512)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1232, file: !780, line: 315, baseType: !1237, size: 64, align: 64, offset: 768)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1232, file: !780, line: 326, baseType: !977, size: 32, align: 32, offset: 832)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1232, file: !780, line: 326, baseType: !977, size: 32, align: 32, offset: 864)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1232, file: !780, line: 334, baseType: !977, size: 32, align: 32, offset: 896)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1232, file: !780, line: 341, baseType: !977, size: 32, align: 32, offset: 928)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1232, file: !780, line: 346, baseType: !977, size: 32, align: 32, offset: 960)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1232, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1232, file: !780, line: 356, baseType: !990, size: 64, align: 32, offset: 1024)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1232, file: !780, line: 361, baseType: !983, size: 64, align: 64, offset: 1088)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1232, file: !780, line: 369, baseType: !983, size: 64, align: 64, offset: 1152)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1232, file: !780, line: 377, baseType: !983, size: 64, align: 64, offset: 1216)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1232, file: !780, line: 382, baseType: !977, size: 32, align: 32, offset: 1280)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1232, file: !780, line: 386, baseType: !977, size: 32, align: 32, offset: 1312)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1232, file: !780, line: 391, baseType: !977, size: 32, align: 32, offset: 1344)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1232, file: !780, line: 396, baseType: !968, size: 64, align: 64, offset: 1408)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1232, file: !780, line: 403, baseType: !1253, size: 512, align: 64, offset: 1472)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 512, align: 64, elements: !1175)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1232, file: !780, line: 410, baseType: !977, size: 32, align: 32, offset: 1984)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1232, file: !780, line: 415, baseType: !977, size: 32, align: 32, offset: 2016)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1232, file: !780, line: 420, baseType: !977, size: 32, align: 32, offset: 2048)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1232, file: !780, line: 425, baseType: !977, size: 32, align: 32, offset: 2080)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1232, file: !780, line: 435, baseType: !983, size: 64, align: 64, offset: 2112)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1232, file: !780, line: 440, baseType: !977, size: 32, align: 32, offset: 2176)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1232, file: !780, line: 445, baseType: !1100, size: 64, align: 64, offset: 2240)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1232, file: !780, line: 459, baseType: !1262, size: 512, align: 64, offset: 2304)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 512, align: 64, elements: !1175)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1232, file: !780, line: 473, baseType: !1264, size: 64, align: 64, offset: 2816)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1232, file: !780, line: 477, baseType: !977, size: 32, align: 32, offset: 2880)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1232, file: !780, line: 479, baseType: !1267, size: 64, align: 64, offset: 2944)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275, !1280}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1270, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1270, file: !780, line: 203, baseType: !1146, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1270, file: !780, line: 204, baseType: !977, size: 32, align: 32, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1270, file: !780, line: 205, baseType: !1276, size: 64, align: 64, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1278, line: 86, baseType: !1279)
!1278 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1278, line: 86, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1270, file: !780, line: 206, baseType: !1200, size: 64, align: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1232, file: !780, line: 480, baseType: !977, size: 32, align: 32, offset: 3008)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1232, file: !780, line: 505, baseType: !977, size: 32, align: 32, offset: 3040)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1232, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1232, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1232, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1232, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1232, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1232, file: !780, line: 532, baseType: !983, size: 64, align: 64, offset: 3264)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1232, file: !780, line: 539, baseType: !983, size: 64, align: 64, offset: 3328)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1232, file: !780, line: 547, baseType: !983, size: 64, align: 64, offset: 3392)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1232, file: !780, line: 554, baseType: !1276, size: 64, align: 64, offset: 3456)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1232, file: !780, line: 563, baseType: !977, size: 32, align: 32, offset: 3520)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1232, file: !780, line: 572, baseType: !977, size: 32, align: 32, offset: 3552)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1232, file: !780, line: 581, baseType: !977, size: 32, align: 32, offset: 3584)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1232, file: !780, line: 588, baseType: !1296, size: 64, align: 64, offset: 3648)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !984, line: 36, baseType: !1298)
!1298 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1232, file: !780, line: 593, baseType: !977, size: 32, align: 32, offset: 3712)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1232, file: !780, line: 596, baseType: !977, size: 32, align: 32, offset: 3744)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1232, file: !780, line: 599, baseType: !1200, size: 64, align: 64, offset: 3776)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1232, file: !780, line: 605, baseType: !1200, size: 64, align: 64, offset: 3840)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1232, file: !780, line: 616, baseType: !1200, size: 64, align: 64, offset: 3904)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1232, file: !780, line: 626, baseType: !1305, size: 64, align: 64, offset: 3968)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1306, line: 216, baseType: !1101)
!1306 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1232, file: !780, line: 627, baseType: !1305, size: 64, align: 64, offset: 4032)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1232, file: !780, line: 628, baseType: !1305, size: 64, align: 64, offset: 4096)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1232, file: !780, line: 629, baseType: !1305, size: 64, align: 64, offset: 4160)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1232, file: !780, line: 645, baseType: !1200, size: 64, align: 64, offset: 4224)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1078, file: !57, line: 3566, baseType: !1313, size: 64, align: 64, offset: 1408)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!977, !1120, !968, !1311, !1195}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1078, file: !57, line: 3567, baseType: !1117, size: 64, align: 64, offset: 1472)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1078, file: !57, line: 3576, baseType: !1318, size: 64, align: 64, offset: 1536)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!977, !1120, !1229}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1078, file: !57, line: 3577, baseType: !1322, size: 64, align: 64, offset: 1600)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!977, !1120, !1195}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1078, file: !57, line: 3584, baseType: !1326, size: 64, align: 64, offset: 1664)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!977, !1120, !1329}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1078, file: !57, line: 3589, baseType: !1331, size: 64, align: 64, offset: 1728)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{null, !1120}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1078, file: !57, line: 3594, baseType: !977, size: 32, align: 32, offset: 1792)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1078, file: !57, line: 3600, baseType: !961, size: 64, align: 64, offset: 1856)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1078, file: !57, line: 3609, baseType: !1337, size: 64, align: 64, offset: 1920)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1340)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1068, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1068, file: !57, line: 1581, baseType: !939, size: 32, align: 32, offset: 224)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1068, file: !57, line: 1583, baseType: !968, size: 64, align: 64, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1068, file: !57, line: 1591, baseType: !1345, size: 64, align: 64, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1133, line: 129, size: 1664, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352, !1370, !1371, !1377, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1346, file: !1133, line: 136, baseType: !977, size: 32, align: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1346, file: !1133, line: 151, baseType: !977, size: 32, align: 32, offset: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1346, file: !1133, line: 157, baseType: !977, size: 32, align: 32, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1346, file: !1133, line: 159, baseType: !1329, size: 64, align: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1346, file: !1133, line: 161, baseType: !1353, size: 64, align: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1133, line: 117, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1133, line: 100, size: 832, align: 64, elements: !1356)
!1356 = !{!1357, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1355, file: !1133, line: 105, baseType: !1358, size: 256, align: 64)
!1358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1359, size: 256, align: 64, elements: !1181)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1202, line: 238, baseType: !1361)
!1361 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1202, line: 238, flags: DIFlagFwdDecl)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1355, file: !1133, line: 110, baseType: !977, size: 32, align: 32, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1355, file: !1133, line: 111, baseType: !977, size: 32, align: 32, offset: 288)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1355, file: !1133, line: 111, baseType: !977, size: 32, align: 32, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1355, file: !1133, line: 112, baseType: !1178, size: 256, align: 32, offset: 352)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1355, file: !1133, line: 113, baseType: !1184, size: 128, align: 32, offset: 608)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1355, file: !1133, line: 114, baseType: !977, size: 32, align: 32, offset: 736)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1355, file: !1133, line: 115, baseType: !977, size: 32, align: 32, offset: 768)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1355, file: !1133, line: 116, baseType: !977, size: 32, align: 32, offset: 800)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1346, file: !1133, line: 163, baseType: !968, size: 64, align: 64, offset: 256)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1346, file: !1133, line: 165, baseType: !1372, size: 128, align: 64, offset: 320)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1133, line: 122, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1133, line: 119, size: 128, align: 64, elements: !1374)
!1374 = !{!1375, !1376}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1373, file: !1133, line: 120, baseType: !1195, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1373, file: !1133, line: 121, baseType: !1329, size: 64, align: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1346, file: !1133, line: 166, baseType: !1378, size: 128, align: 64, offset: 448)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1133, line: 127, baseType: !1379)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1133, line: 124, size: 128, align: 64, elements: !1380)
!1380 = !{!1381, !1454}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1379, file: !1133, line: 125, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1412, !1416, !1417, !1451, !1452, !1453}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1385, file: !57, line: 5751, baseType: !1071, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1385, file: !57, line: 5756, baseType: !1389, size: 64, align: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1392)
!1392 = !{!1393, !1394, !1397, !1398, !1399, !1403, !1407, !1411}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1391, file: !57, line: 5797, baseType: !961, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1391, file: !57, line: 5804, baseType: !1395, size: 64, align: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1391, file: !57, line: 5815, baseType: !1071, size: 64, align: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1391, file: !57, line: 5825, baseType: !977, size: 32, align: 32, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1391, file: !57, line: 5826, baseType: !1400, size: 64, align: 64, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!977, !1383}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1391, file: !57, line: 5827, baseType: !1404, size: 64, align: 64, offset: 320)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!977, !1383, !1195}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1391, file: !57, line: 5828, baseType: !1408, size: 64, align: 64, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{null, !1383}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1391, file: !57, line: 5829, baseType: !1408, size: 64, align: 64, offset: 448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1385, file: !57, line: 5762, baseType: !1413, size: 64, align: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1415)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1385, file: !57, line: 5768, baseType: !968, size: 64, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1385, file: !57, line: 5775, baseType: !1418, size: 64, align: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1420, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1420, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1420, file: !57, line: 3948, baseType: !1155, size: 32, align: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1420, file: !57, line: 3958, baseType: !1146, size: 64, align: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1420, file: !57, line: 3962, baseType: !977, size: 32, align: 32, offset: 192)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1420, file: !57, line: 3968, baseType: !977, size: 32, align: 32, offset: 224)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1420, file: !57, line: 3973, baseType: !983, size: 64, align: 64, offset: 256)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1420, file: !57, line: 3986, baseType: !977, size: 32, align: 32, offset: 320)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1420, file: !57, line: 3999, baseType: !977, size: 32, align: 32, offset: 352)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1420, file: !57, line: 4004, baseType: !977, size: 32, align: 32, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1420, file: !57, line: 4005, baseType: !977, size: 32, align: 32, offset: 416)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1420, file: !57, line: 4010, baseType: !977, size: 32, align: 32, offset: 448)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1420, file: !57, line: 4011, baseType: !977, size: 32, align: 32, offset: 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1420, file: !57, line: 4020, baseType: !990, size: 64, align: 32, offset: 512)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1420, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1420, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1420, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1420, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1420, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1420, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1420, file: !57, line: 4039, baseType: !977, size: 32, align: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1420, file: !57, line: 4046, baseType: !1100, size: 64, align: 64, offset: 832)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1420, file: !57, line: 4050, baseType: !977, size: 32, align: 32, offset: 896)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1420, file: !57, line: 4054, baseType: !977, size: 32, align: 32, offset: 928)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1420, file: !57, line: 4061, baseType: !977, size: 32, align: 32, offset: 960)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1420, file: !57, line: 4065, baseType: !977, size: 32, align: 32, offset: 992)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1420, file: !57, line: 4073, baseType: !977, size: 32, align: 32, offset: 1024)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1420, file: !57, line: 4080, baseType: !977, size: 32, align: 32, offset: 1056)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1420, file: !57, line: 4084, baseType: !977, size: 32, align: 32, offset: 1088)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1385, file: !57, line: 5781, baseType: !1418, size: 64, align: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1385, file: !57, line: 5787, baseType: !990, size: 64, align: 32, offset: 384)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1385, file: !57, line: 5793, baseType: !990, size: 64, align: 32, offset: 448)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1379, file: !1133, line: 126, baseType: !977, size: 32, align: 32, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1346, file: !1133, line: 172, baseType: !1195, size: 64, align: 64, offset: 576)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1346, file: !1133, line: 177, baseType: !1146, size: 64, align: 64, offset: 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1346, file: !1133, line: 178, baseType: !939, size: 32, align: 32, offset: 704)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1346, file: !1133, line: 180, baseType: !968, size: 64, align: 64, offset: 768)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1346, file: !1133, line: 185, baseType: !977, size: 32, align: 32, offset: 832)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1346, file: !1133, line: 190, baseType: !968, size: 64, align: 64, offset: 896)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1346, file: !1133, line: 195, baseType: !977, size: 32, align: 32, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1346, file: !1133, line: 200, baseType: !1195, size: 64, align: 64, offset: 1024)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1346, file: !1133, line: 201, baseType: !977, size: 32, align: 32, offset: 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1346, file: !1133, line: 202, baseType: !1329, size: 64, align: 64, offset: 1152)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1346, file: !1133, line: 203, baseType: !977, size: 32, align: 32, offset: 1216)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1346, file: !1133, line: 205, baseType: !977, size: 32, align: 32, offset: 1248)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1346, file: !1133, line: 206, baseType: !977, size: 32, align: 32, offset: 1280)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1346, file: !1133, line: 209, baseType: !1305, size: 64, align: 64, offset: 1344)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1346, file: !1133, line: 212, baseType: !1305, size: 64, align: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1346, file: !1133, line: 213, baseType: !1329, size: 64, align: 64, offset: 1472)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1346, file: !1133, line: 215, baseType: !977, size: 32, align: 32, offset: 1536)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1346, file: !1133, line: 217, baseType: !977, size: 32, align: 32, offset: 1568)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1346, file: !1133, line: 220, baseType: !977, size: 32, align: 32, offset: 1600)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1068, file: !57, line: 1598, baseType: !968, size: 64, align: 64, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1068, file: !57, line: 1606, baseType: !983, size: 64, align: 64, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1068, file: !57, line: 1614, baseType: !977, size: 32, align: 32, offset: 512)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1068, file: !57, line: 1622, baseType: !977, size: 32, align: 32, offset: 544)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1068, file: !57, line: 1628, baseType: !977, size: 32, align: 32, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1068, file: !57, line: 1636, baseType: !977, size: 32, align: 32, offset: 608)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1068, file: !57, line: 1643, baseType: !977, size: 32, align: 32, offset: 640)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1068, file: !57, line: 1657, baseType: !1146, size: 64, align: 64, offset: 704)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1068, file: !57, line: 1658, baseType: !977, size: 32, align: 32, offset: 768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1068, file: !57, line: 1679, baseType: !990, size: 64, align: 32, offset: 800)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1068, file: !57, line: 1688, baseType: !977, size: 32, align: 32, offset: 864)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1068, file: !57, line: 1712, baseType: !977, size: 32, align: 32, offset: 896)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1068, file: !57, line: 1729, baseType: !977, size: 32, align: 32, offset: 928)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1068, file: !57, line: 1729, baseType: !977, size: 32, align: 32, offset: 960)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1068, file: !57, line: 1744, baseType: !977, size: 32, align: 32, offset: 992)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1068, file: !57, line: 1744, baseType: !977, size: 32, align: 32, offset: 1024)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1068, file: !57, line: 1751, baseType: !977, size: 32, align: 32, offset: 1056)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1068, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1068, file: !57, line: 1791, baseType: !1493, size: 64, align: 64, offset: 1152)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1067, !1229, !1311, !977, !977, !977}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1068, file: !57, line: 1808, baseType: !1497, size: 64, align: 64, offset: 1216)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!516, !1067, !1089}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1068, file: !57, line: 1816, baseType: !977, size: 32, align: 32, offset: 1280)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1068, file: !57, line: 1825, baseType: !1502, size: 32, align: 32, offset: 1312)
!1502 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1068, file: !57, line: 1830, baseType: !977, size: 32, align: 32, offset: 1344)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1068, file: !57, line: 1838, baseType: !1502, size: 32, align: 32, offset: 1376)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1068, file: !57, line: 1846, baseType: !977, size: 32, align: 32, offset: 1408)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1068, file: !57, line: 1851, baseType: !977, size: 32, align: 32, offset: 1440)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1068, file: !57, line: 1861, baseType: !1502, size: 32, align: 32, offset: 1472)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1068, file: !57, line: 1868, baseType: !1502, size: 32, align: 32, offset: 1504)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1068, file: !57, line: 1875, baseType: !1502, size: 32, align: 32, offset: 1536)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1068, file: !57, line: 1882, baseType: !1502, size: 32, align: 32, offset: 1568)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1068, file: !57, line: 1889, baseType: !1502, size: 32, align: 32, offset: 1600)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1068, file: !57, line: 1896, baseType: !1502, size: 32, align: 32, offset: 1632)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1068, file: !57, line: 1903, baseType: !1502, size: 32, align: 32, offset: 1664)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1068, file: !57, line: 1910, baseType: !977, size: 32, align: 32, offset: 1696)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1068, file: !57, line: 1915, baseType: !977, size: 32, align: 32, offset: 1728)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1068, file: !57, line: 1926, baseType: !1311, size: 64, align: 64, offset: 1792)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1068, file: !57, line: 1935, baseType: !990, size: 64, align: 32, offset: 1856)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1068, file: !57, line: 1942, baseType: !977, size: 32, align: 32, offset: 1920)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1068, file: !57, line: 1948, baseType: !977, size: 32, align: 32, offset: 1952)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1068, file: !57, line: 1954, baseType: !977, size: 32, align: 32, offset: 1984)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1068, file: !57, line: 1960, baseType: !977, size: 32, align: 32, offset: 2016)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1068, file: !57, line: 1984, baseType: !977, size: 32, align: 32, offset: 2048)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1068, file: !57, line: 1991, baseType: !977, size: 32, align: 32, offset: 2080)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1068, file: !57, line: 1996, baseType: !977, size: 32, align: 32, offset: 2112)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1068, file: !57, line: 2004, baseType: !977, size: 32, align: 32, offset: 2144)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1068, file: !57, line: 2011, baseType: !977, size: 32, align: 32, offset: 2176)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1068, file: !57, line: 2018, baseType: !977, size: 32, align: 32, offset: 2208)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1068, file: !57, line: 2027, baseType: !977, size: 32, align: 32, offset: 2240)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1068, file: !57, line: 2034, baseType: !977, size: 32, align: 32, offset: 2272)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1068, file: !57, line: 2044, baseType: !977, size: 32, align: 32, offset: 2304)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1068, file: !57, line: 2054, baseType: !1532, size: 64, align: 64, offset: 2368)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1068, file: !57, line: 2061, baseType: !1532, size: 64, align: 64, offset: 2432)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1068, file: !57, line: 2066, baseType: !977, size: 32, align: 32, offset: 2496)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1068, file: !57, line: 2070, baseType: !977, size: 32, align: 32, offset: 2528)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1068, file: !57, line: 2078, baseType: !977, size: 32, align: 32, offset: 2560)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1068, file: !57, line: 2085, baseType: !977, size: 32, align: 32, offset: 2592)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1068, file: !57, line: 2092, baseType: !977, size: 32, align: 32, offset: 2624)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1068, file: !57, line: 2099, baseType: !977, size: 32, align: 32, offset: 2656)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1068, file: !57, line: 2106, baseType: !977, size: 32, align: 32, offset: 2688)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1068, file: !57, line: 2113, baseType: !977, size: 32, align: 32, offset: 2720)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1068, file: !57, line: 2120, baseType: !977, size: 32, align: 32, offset: 2752)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1068, file: !57, line: 2125, baseType: !977, size: 32, align: 32, offset: 2784)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1068, file: !57, line: 2133, baseType: !977, size: 32, align: 32, offset: 2816)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1068, file: !57, line: 2140, baseType: !977, size: 32, align: 32, offset: 2848)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1068, file: !57, line: 2145, baseType: !977, size: 32, align: 32, offset: 2880)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1068, file: !57, line: 2153, baseType: !977, size: 32, align: 32, offset: 2912)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1068, file: !57, line: 2158, baseType: !977, size: 32, align: 32, offset: 2944)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1068, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1068, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1068, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1068, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1068, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1068, file: !57, line: 2203, baseType: !977, size: 32, align: 32, offset: 3136)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1068, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1068, file: !57, line: 2212, baseType: !977, size: 32, align: 32, offset: 3200)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1068, file: !57, line: 2213, baseType: !977, size: 32, align: 32, offset: 3232)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1068, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1068, file: !57, line: 2232, baseType: !977, size: 32, align: 32, offset: 3296)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1068, file: !57, line: 2243, baseType: !977, size: 32, align: 32, offset: 3328)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1068, file: !57, line: 2249, baseType: !977, size: 32, align: 32, offset: 3360)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1068, file: !57, line: 2256, baseType: !977, size: 32, align: 32, offset: 3392)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1068, file: !57, line: 2263, baseType: !1100, size: 64, align: 64, offset: 3456)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1068, file: !57, line: 2270, baseType: !1100, size: 64, align: 64, offset: 3520)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1068, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1068, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1068, file: !57, line: 2367, baseType: !1568, size: 64, align: 64, offset: 3648)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!977, !1067, !1329, !977}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1068, file: !57, line: 2383, baseType: !977, size: 32, align: 32, offset: 3712)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1068, file: !57, line: 2386, baseType: !1502, size: 32, align: 32, offset: 3744)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1068, file: !57, line: 2387, baseType: !1502, size: 32, align: 32, offset: 3776)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1068, file: !57, line: 2394, baseType: !977, size: 32, align: 32, offset: 3808)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1068, file: !57, line: 2401, baseType: !977, size: 32, align: 32, offset: 3840)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1068, file: !57, line: 2408, baseType: !977, size: 32, align: 32, offset: 3872)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1068, file: !57, line: 2415, baseType: !977, size: 32, align: 32, offset: 3904)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1068, file: !57, line: 2422, baseType: !977, size: 32, align: 32, offset: 3936)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1068, file: !57, line: 2423, baseType: !1580, size: 64, align: 64, offset: 3968)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1583)
!1583 = !{!1584, !1585, !1586, !1587}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1582, file: !57, line: 827, baseType: !977, size: 32, align: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1582, file: !57, line: 828, baseType: !977, size: 32, align: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1582, file: !57, line: 829, baseType: !977, size: 32, align: 32, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1582, file: !57, line: 830, baseType: !1502, size: 32, align: 32, offset: 96)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1068, file: !57, line: 2430, baseType: !983, size: 64, align: 64, offset: 4032)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1068, file: !57, line: 2437, baseType: !983, size: 64, align: 64, offset: 4096)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1068, file: !57, line: 2444, baseType: !1502, size: 32, align: 32, offset: 4160)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1068, file: !57, line: 2451, baseType: !1502, size: 32, align: 32, offset: 4192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1068, file: !57, line: 2458, baseType: !977, size: 32, align: 32, offset: 4224)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1068, file: !57, line: 2469, baseType: !977, size: 32, align: 32, offset: 4256)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1068, file: !57, line: 2475, baseType: !977, size: 32, align: 32, offset: 4288)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1068, file: !57, line: 2481, baseType: !977, size: 32, align: 32, offset: 4320)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1068, file: !57, line: 2485, baseType: !977, size: 32, align: 32, offset: 4352)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1068, file: !57, line: 2489, baseType: !977, size: 32, align: 32, offset: 4384)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1068, file: !57, line: 2493, baseType: !977, size: 32, align: 32, offset: 4416)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1068, file: !57, line: 2501, baseType: !977, size: 32, align: 32, offset: 4448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1068, file: !57, line: 2506, baseType: !977, size: 32, align: 32, offset: 4480)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1068, file: !57, line: 2510, baseType: !977, size: 32, align: 32, offset: 4512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1068, file: !57, line: 2514, baseType: !983, size: 64, align: 64, offset: 4544)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1068, file: !57, line: 2528, baseType: !1604, size: 64, align: 64, offset: 4608)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1067, !968, !977, !977}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1068, file: !57, line: 2534, baseType: !977, size: 32, align: 32, offset: 4672)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1068, file: !57, line: 2545, baseType: !977, size: 32, align: 32, offset: 4704)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1068, file: !57, line: 2547, baseType: !977, size: 32, align: 32, offset: 4736)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1068, file: !57, line: 2549, baseType: !977, size: 32, align: 32, offset: 4768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1068, file: !57, line: 2551, baseType: !977, size: 32, align: 32, offset: 4800)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1068, file: !57, line: 2553, baseType: !977, size: 32, align: 32, offset: 4832)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1068, file: !57, line: 2555, baseType: !977, size: 32, align: 32, offset: 4864)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1068, file: !57, line: 2557, baseType: !977, size: 32, align: 32, offset: 4896)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1068, file: !57, line: 2559, baseType: !977, size: 32, align: 32, offset: 4928)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1068, file: !57, line: 2563, baseType: !977, size: 32, align: 32, offset: 4960)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1068, file: !57, line: 2571, baseType: !1187, size: 64, align: 64, offset: 4992)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1068, file: !57, line: 2579, baseType: !1187, size: 64, align: 64, offset: 5056)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1068, file: !57, line: 2586, baseType: !977, size: 32, align: 32, offset: 5120)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1068, file: !57, line: 2615, baseType: !977, size: 32, align: 32, offset: 5152)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1068, file: !57, line: 2627, baseType: !977, size: 32, align: 32, offset: 5184)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1068, file: !57, line: 2637, baseType: !977, size: 32, align: 32, offset: 5216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1068, file: !57, line: 2681, baseType: !977, size: 32, align: 32, offset: 5248)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1068, file: !57, line: 2709, baseType: !983, size: 64, align: 64, offset: 5312)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1068, file: !57, line: 2716, baseType: !1626, size: 64, align: 64, offset: 5376)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1636, !1640, !1644, !1645, !1646, !1647, !1652, !1653, !1654, !1655, !1656}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1628, file: !57, line: 3642, baseType: !961, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1628, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1628, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1628, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1628, file: !57, line: 3669, baseType: !977, size: 32, align: 32, offset: 160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1628, file: !57, line: 3682, baseType: !1326, size: 64, align: 64, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1628, file: !57, line: 3698, baseType: !1637, size: 64, align: 64, offset: 256)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!977, !1120, !1054, !1155}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1628, file: !57, line: 3712, baseType: !1641, size: 64, align: 64, offset: 320)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!977, !1120, !977, !1054, !1155}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1628, file: !57, line: 3726, baseType: !1637, size: 64, align: 64, offset: 384)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1628, file: !57, line: 3737, baseType: !1117, size: 64, align: 64, offset: 448)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1628, file: !57, line: 3746, baseType: !977, size: 32, align: 32, offset: 512)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1628, file: !57, line: 3757, baseType: !1648, size: 64, align: 64, offset: 576)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1651}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1628, file: !57, line: 3766, baseType: !1117, size: 64, align: 64, offset: 640)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1628, file: !57, line: 3774, baseType: !1117, size: 64, align: 64, offset: 704)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1628, file: !57, line: 3780, baseType: !977, size: 32, align: 32, offset: 768)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1628, file: !57, line: 3785, baseType: !977, size: 32, align: 32, offset: 800)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1628, file: !57, line: 3795, baseType: !1657, size: 64, align: 64, offset: 832)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!977, !1120, !1200}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1068, file: !57, line: 2728, baseType: !968, size: 64, align: 64, offset: 5440)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1068, file: !57, line: 2735, baseType: !1253, size: 512, align: 64, offset: 5504)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1068, file: !57, line: 2742, baseType: !977, size: 32, align: 32, offset: 6016)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1068, file: !57, line: 2755, baseType: !977, size: 32, align: 32, offset: 6048)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1068, file: !57, line: 2776, baseType: !977, size: 32, align: 32, offset: 6080)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1068, file: !57, line: 2783, baseType: !977, size: 32, align: 32, offset: 6112)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1068, file: !57, line: 2791, baseType: !977, size: 32, align: 32, offset: 6144)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1068, file: !57, line: 2802, baseType: !1329, size: 64, align: 64, offset: 6208)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1068, file: !57, line: 2811, baseType: !977, size: 32, align: 32, offset: 6272)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1068, file: !57, line: 2821, baseType: !977, size: 32, align: 32, offset: 6304)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1068, file: !57, line: 2830, baseType: !977, size: 32, align: 32, offset: 6336)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1068, file: !57, line: 2840, baseType: !977, size: 32, align: 32, offset: 6368)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1068, file: !57, line: 2851, baseType: !1673, size: 64, align: 64, offset: 6400)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!977, !1067, !1676, !968, !1311, !977, !977}
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!977, !1067, !968}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1068, file: !57, line: 2871, baseType: !1680, size: 64, align: 64, offset: 6464)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!977, !1067, !1683, !968, !1311, !977}
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!977, !1067, !968, !977, !977}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1068, file: !57, line: 2878, baseType: !977, size: 32, align: 32, offset: 6528)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1068, file: !57, line: 2885, baseType: !977, size: 32, align: 32, offset: 6560)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1068, file: !57, line: 3005, baseType: !977, size: 32, align: 32, offset: 6592)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1068, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1068, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1068, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1068, file: !57, line: 3037, baseType: !1146, size: 64, align: 64, offset: 6720)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1068, file: !57, line: 3038, baseType: !977, size: 32, align: 32, offset: 6784)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1068, file: !57, line: 3050, baseType: !1100, size: 64, align: 64, offset: 6848)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1068, file: !57, line: 3065, baseType: !977, size: 32, align: 32, offset: 6912)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1068, file: !57, line: 3083, baseType: !977, size: 32, align: 32, offset: 6944)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1068, file: !57, line: 3092, baseType: !990, size: 64, align: 32, offset: 6976)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1068, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1068, file: !57, line: 3106, baseType: !990, size: 64, align: 32, offset: 7072)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1068, file: !57, line: 3113, baseType: !1701, size: 64, align: 64, offset: 7168)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1703)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1704)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1705)
!1705 = !{!1706, !1707, !1708, !1709, !1710, !1711, !1714}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1704, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1704, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1704, file: !57, line: 720, baseType: !961, size: 64, align: 64, offset: 64)
