; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_refs.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_refs.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MMCOOpcode", file: !888, line: 109, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/h264dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIEnumerator(name: "MMCO_END", value: 0)
!891 = !DIEnumerator(name: "MMCO_SHORT2UNUSED", value: 1)
!892 = !DIEnumerator(name: "MMCO_LONG2UNUSED", value: 2)
!893 = !DIEnumerator(name: "MMCO_SHORT2LONG", value: 3)
!894 = !DIEnumerator(name: "MMCO_SET_MAX_LONG", value: 4)
!895 = !DIEnumerator(name: "MMCO_RESET", value: 5)
!896 = !DIEnumerator(name: "MMCO_LONG", value: 6)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 45, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/h264_sei.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908}
!900 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME", value: 0)
!901 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_FIELD", value: 1)
!902 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_FIELD", value: 2)
!903 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_BOTTOM", value: 3)
!904 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_TOP", value: 4)
!905 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_BOTTOM_TOP", value: 5)
!906 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_TOP_BOTTOM", value: 6)
!907 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_DOUBLING", value: 7)
!908 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_TRIPLING", value: 8)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 60, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_CHECKERBOARD", value: 0)
!912 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_COLUMN", value: 1)
!913 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_ROW", value: 2)
!914 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_SIDE_BY_SIDE", value: 3)
!915 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_TOP_BOTTOM", value: 4)
!916 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_TEMPORAL", value: 5)
!917 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_2D", value: 6)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !919, line: 33, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavcodec/h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!921 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED", value: 0)
!922 = !DIEnumerator(name: "H264_NAL_SLICE", value: 1)
!923 = !DIEnumerator(name: "H264_NAL_DPA", value: 2)
!924 = !DIEnumerator(name: "H264_NAL_DPB", value: 3)
!925 = !DIEnumerator(name: "H264_NAL_DPC", value: 4)
!926 = !DIEnumerator(name: "H264_NAL_IDR_SLICE", value: 5)
!927 = !DIEnumerator(name: "H264_NAL_SEI", value: 6)
!928 = !DIEnumerator(name: "H264_NAL_SPS", value: 7)
!929 = !DIEnumerator(name: "H264_NAL_PPS", value: 8)
!930 = !DIEnumerator(name: "H264_NAL_AUD", value: 9)
!931 = !DIEnumerator(name: "H264_NAL_END_SEQUENCE", value: 10)
!932 = !DIEnumerator(name: "H264_NAL_END_STREAM", value: 11)
!933 = !DIEnumerator(name: "H264_NAL_FILLER_DATA", value: 12)
!934 = !DIEnumerator(name: "H264_NAL_SPS_EXT", value: 13)
!935 = !DIEnumerator(name: "H264_NAL_PREFIX", value: 14)
!936 = !DIEnumerator(name: "H264_NAL_SUB_SPS", value: 15)
!937 = !DIEnumerator(name: "H264_NAL_DPS", value: 16)
!938 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!939 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!940 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!941 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!942 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!943 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!944 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!945 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!946 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!947 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!948 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!949 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!950 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!951 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!952 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!953 = !{!954, !955, !956, !957, !1025, !1009, !984}
!954 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!955 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPS", file: !960, line: 136, baseType: !961)
!960 = !DIFile(filename: "libavcodec/h264_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PPS", file: !960, line: 109, size: 1391104, align: 64, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !972, !973, !974, !975, !976, !978, !979, !980, !981, !982, !990, !994, !998, !999, !1003, !1007, !1011, !1014, !1020}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !961, file: !960, line: 110, baseType: !955, size: 32, align: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !961, file: !960, line: 111, baseType: !954, size: 32, align: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present", scope: !961, file: !960, line: 112, baseType: !954, size: 32, align: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_count", scope: !961, file: !960, line: 113, baseType: !954, size: 32, align: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "mb_slice_group_map_type", scope: !961, file: !960, line: 114, baseType: !954, size: 32, align: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !961, file: !960, line: 115, baseType: !969, size: 64, align: 32, offset: 160)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 64, align: 32, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 2)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred", scope: !961, file: !960, line: 116, baseType: !954, size: 32, align: 32, offset: 224)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !961, file: !960, line: 117, baseType: !954, size: 32, align: 32, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "init_qp", scope: !961, file: !960, line: 118, baseType: !954, size: 32, align: 32, offset: 288)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "init_qs", scope: !961, file: !960, line: 119, baseType: !954, size: 32, align: 32, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !961, file: !960, line: 120, baseType: !977, size: 64, align: 32, offset: 352)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 64, align: 32, elements: !970)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_parameters_present", scope: !961, file: !960, line: 121, baseType: !954, size: 32, align: 32, offset: 416)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred", scope: !961, file: !960, line: 122, baseType: !954, size: 32, align: 32, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present", scope: !961, file: !960, line: 123, baseType: !954, size: 32, align: 32, offset: 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode", scope: !961, file: !960, line: 124, baseType: !954, size: 32, align: 32, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !961, file: !960, line: 125, baseType: !983, size: 768, align: 8, offset: 544)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 768, align: 8, elements: !987)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !985, line: 48, baseType: !986)
!985 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!986 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!987 = !{!988, !989}
!988 = !DISubrange(count: 6)
!989 = !DISubrange(count: 16)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !961, file: !960, line: 126, baseType: !991, size: 3072, align: 8, offset: 1312)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 3072, align: 8, elements: !992)
!992 = !{!988, !993}
!993 = !DISubrange(count: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !961, file: !960, line: 127, baseType: !995, size: 1408, align: 8, offset: 4384)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 1408, align: 8, elements: !996)
!996 = !{!971, !997}
!997 = !DISubrange(count: 88)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_diff", scope: !961, file: !960, line: 128, baseType: !954, size: 32, align: 32, offset: 5792)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !961, file: !960, line: 129, baseType: !1000, size: 32768, align: 8, offset: 5824)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 32768, align: 8, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 4096)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !961, file: !960, line: 130, baseType: !1004, size: 64, align: 64, offset: 38592)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1005, line: 216, baseType: !1006)
!1005 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1006 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_buffer", scope: !961, file: !960, line: 132, baseType: !1008, size: 270336, align: 32, offset: 38656)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 270336, align: 32, elements: !1010)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !985, line: 51, baseType: !955)
!1010 = !{!988, !997, !989}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_buffer", scope: !961, file: !960, line: 133, baseType: !1012, size: 1081344, align: 32, offset: 308992)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 1081344, align: 32, elements: !1013)
!1013 = !{!988, !997, !993}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_coeff", scope: !961, file: !960, line: 134, baseType: !1015, size: 384, align: 64, offset: 1390336)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 384, align: 64, elements: !1019)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 512, align: 32, elements: !1018)
!1018 = !{!989}
!1019 = !{!988}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_coeff", scope: !961, file: !960, line: 135, baseType: !1021, size: 384, align: 64, offset: 1390720)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 384, align: 64, elements: !1019)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 2048, align: 32, elements: !1024)
!1024 = !{!993}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1028, line: 221, size: 32, align: 8, elements: !1029)
!1028 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1027, file: !1028, line: 221, baseType: !1009, size: 32, align: 32)
!1031 = !{i32 2, !"Dwarf Version", i32 4}
!1032 = !{i32 2, !"Debug Info Version", i32 3}
!1033 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1034 = distinct !DISubprogram(name: "ff_h264_build_ref_list", scope: !1035, file: !1035, line: 299, type: !1036, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2623)
!1035 = !DIFile(filename: "libavcodec/h264_refs.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!954, !1038, !1946}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264Context", file: !888, line: 554, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264Context", file: !888, line: 337, size: 416128, align: 64, elements: !1041)
!1041 = !{!1042, !1086, !1766, !1780, !1863, !1875, !1889, !1941, !1943, !1944, !1945, !2255, !2256, !2257, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2352, !2356, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2372, !2373, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2473, !2474, !2488, !2490, !2492, !2493, !2497, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2519, !2520, !2521, !2522, !2616, !2617, !2618, !2619, !2620}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1040, file: !888, line: 338, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1047)
!1047 = !{!1048, !1052, !1056, !1060, !1061, !1062, !1063, !1067, !1073, !1075, !1079}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1046, file: !4, line: 72, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1046, file: !4, line: 78, baseType: !1053, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1049, !956}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1046, file: !4, line: 85, baseType: !1057, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1046, file: !4, line: 93, baseType: !954, size: 32, align: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1046, file: !4, line: 99, baseType: !954, size: 32, align: 32, offset: 224)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1046, file: !4, line: 108, baseType: !954, size: 32, align: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1046, file: !4, line: 113, baseType: !1064, size: 64, align: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!956, !956, !956}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1046, file: !4, line: 123, baseType: !1068, size: 64, align: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!1071, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1046, file: !4, line: 130, baseType: !1074, size: 32, align: 32, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1046, file: !4, line: 136, baseType: !1076, size: 64, align: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1074, !956}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1046, file: !4, line: 142, baseType: !1080, size: 64, align: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!954, !1083, !956, !1049, !954}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1040, file: !888, line: 339, baseType: !1087, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1364, !1365, !1366, !1367, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1520, !1524, !1525, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1704, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1089, file: !35, line: 1561, baseType: !1043, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1089, file: !35, line: 1562, baseType: !954, size: 32, align: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1089, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1089, file: !35, line: 1565, baseType: !1095, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1113, !1116, !1119, !1122, !1126, !1127, !1128, !1136, !1137, !1138, !1140, !1144, !1150, !1161, !1165, !1166, !1216, !1335, !1339, !1340, !1344, !1348, !1353, !1357, !1358, !1359}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1097, file: !35, line: 3475, baseType: !1049, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1097, file: !35, line: 3480, baseType: !1049, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1097, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1097, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1097, file: !35, line: 3487, baseType: !954, size: 32, align: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1097, file: !35, line: 3488, baseType: !1105, size: 64, align: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1108, line: 61, baseType: !1109)
!1108 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1108, line: 58, size: 64, align: 32, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1109, file: !1108, line: 59, baseType: !954, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1109, file: !1108, line: 60, baseType: !954, size: 32, align: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1097, file: !35, line: 3489, baseType: !1114, size: 64, align: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1097, file: !35, line: 3490, baseType: !1117, size: 64, align: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1097, file: !35, line: 3491, baseType: !1120, size: 64, align: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1097, file: !35, line: 3492, baseType: !1123, size: 64, align: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !985, line: 55, baseType: !1006)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1097, file: !35, line: 3493, baseType: !984, size: 8, align: 8, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1097, file: !35, line: 3494, baseType: !1043, size: 64, align: 64, offset: 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1097, file: !35, line: 3495, baseType: !1129, size: 64, align: 64, offset: 704)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1132, file: !35, line: 3402, baseType: !954, size: 32, align: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1132, file: !35, line: 3403, baseType: !1049, size: 64, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1097, file: !35, line: 3507, baseType: !1049, size: 64, align: 64, offset: 768)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1097, file: !35, line: 3516, baseType: !954, size: 32, align: 32, offset: 832)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1097, file: !35, line: 3517, baseType: !1139, size: 64, align: 64, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1097, file: !35, line: 3527, baseType: !1141, size: 64, align: 64, offset: 960)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!954, !1087}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1097, file: !35, line: 3535, baseType: !1145, size: 64, align: 64, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!954, !1087, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1097, file: !35, line: 3541, baseType: !1151, size: 64, align: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1155, line: 223, size: 128, align: 64, elements: !1156)
!1155 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1156 = !{!1157, !1160}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1154, file: !1155, line: 224, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1154, file: !1155, line: 225, baseType: !1158, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1097, file: !35, line: 3549, baseType: !1162, size: 64, align: 64, offset: 1152)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{null, !1139}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1097, file: !35, line: 3551, baseType: !1141, size: 64, align: 64, offset: 1216)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1097, file: !35, line: 3552, baseType: !1167, size: 64, align: 64, offset: 1280)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!954, !1087, !1170, !954, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1174)
!1174 = !{!1175, !1178, !1179, !1180, !1181, !1213}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1173, file: !35, line: 3921, baseType: !1176, size: 16, align: 16)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !985, line: 49, baseType: !1177)
!1177 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1173, file: !35, line: 3922, baseType: !1009, size: 32, align: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1173, file: !35, line: 3923, baseType: !1009, size: 32, align: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1173, file: !35, line: 3924, baseType: !955, size: 32, align: 32, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1173, file: !35, line: 3925, baseType: !1182, size: 64, align: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1202, !1206, !1208, !1209, !1211, !1212}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1185, file: !35, line: 3886, baseType: !954, size: 32, align: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1185, file: !35, line: 3887, baseType: !954, size: 32, align: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1185, file: !35, line: 3888, baseType: !954, size: 32, align: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1185, file: !35, line: 3889, baseType: !954, size: 32, align: 32, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1185, file: !35, line: 3890, baseType: !954, size: 32, align: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1185, file: !35, line: 3897, baseType: !1193, size: 768, align: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1195)
!1195 = !{!1196, !1200}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1194, file: !35, line: 3855, baseType: !1197, size: 512, align: 64)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 512, align: 64, elements: !1198)
!1198 = !{!1199}
!1199 = !DISubrange(count: 8)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1194, file: !35, line: 3857, baseType: !1201, size: 256, align: 32, offset: 512)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 256, align: 32, elements: !1198)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !35, line: 3903, baseType: !1203, size: 256, align: 64, offset: 960)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 256, align: 64, elements: !1204)
!1204 = !{!1205}
!1205 = !DISubrange(count: 4)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1185, file: !35, line: 3904, baseType: !1207, size: 128, align: 32, offset: 1216)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, align: 32, elements: !1204)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1185, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1185, file: !35, line: 3908, baseType: !1210, size: 64, align: 64, offset: 1408)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1185, file: !35, line: 3915, baseType: !1210, size: 64, align: 64, offset: 1472)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !35, line: 3917, baseType: !954, size: 32, align: 32, offset: 1536)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1173, file: !35, line: 3926, baseType: !1214, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !985, line: 40, baseType: !1215)
!1215 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1097, file: !35, line: 3564, baseType: !1217, size: 64, align: 64, offset: 1344)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!954, !1087, !1220, !1254, !1334}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1223)
!1223 = !{!1224, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1250, !1251, !1252, !1253}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1222, file: !35, line: 1451, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1227, line: 94, baseType: !1228)
!1227 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1227, line: 81, size: 192, align: 64, elements: !1229)
!1229 = !{!1230, !1234, !1235}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1228, file: !1227, line: 82, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1227, line: 73, baseType: !1233)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1227, line: 73, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1228, file: !1227, line: 89, baseType: !1170, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1228, file: !1227, line: 93, baseType: !954, size: 32, align: 32, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1222, file: !35, line: 1461, baseType: !1214, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1222, file: !35, line: 1467, baseType: !1214, size: 64, align: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1222, file: !35, line: 1468, baseType: !1170, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1222, file: !35, line: 1469, baseType: !954, size: 32, align: 32, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1222, file: !35, line: 1470, baseType: !954, size: 32, align: 32, offset: 288)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1222, file: !35, line: 1474, baseType: !954, size: 32, align: 32, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1222, file: !35, line: 1479, baseType: !1243, size: 64, align: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !35, line: 1412, baseType: !1170, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1245, file: !35, line: 1413, baseType: !954, size: 32, align: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1245, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1222, file: !35, line: 1480, baseType: !954, size: 32, align: 32, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1222, file: !35, line: 1486, baseType: !1214, size: 64, align: 64, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1222, file: !35, line: 1488, baseType: !1214, size: 64, align: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1222, file: !35, line: 1497, baseType: !1214, size: 64, align: 64, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1288, !1290, !1291, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1257, file: !758, line: 282, baseType: !1197, size: 512, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1257, file: !758, line: 299, baseType: !1201, size: 256, align: 32, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1257, file: !758, line: 315, baseType: !1262, size: 64, align: 64, offset: 768)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1257, file: !758, line: 326, baseType: !954, size: 32, align: 32, offset: 832)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1257, file: !758, line: 326, baseType: !954, size: 32, align: 32, offset: 864)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1257, file: !758, line: 334, baseType: !954, size: 32, align: 32, offset: 896)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1257, file: !758, line: 341, baseType: !954, size: 32, align: 32, offset: 928)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1257, file: !758, line: 346, baseType: !954, size: 32, align: 32, offset: 960)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1257, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1257, file: !758, line: 356, baseType: !1107, size: 64, align: 32, offset: 1024)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1257, file: !758, line: 361, baseType: !1214, size: 64, align: 64, offset: 1088)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1257, file: !758, line: 369, baseType: !1214, size: 64, align: 64, offset: 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1257, file: !758, line: 377, baseType: !1214, size: 64, align: 64, offset: 1216)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1257, file: !758, line: 382, baseType: !954, size: 32, align: 32, offset: 1280)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1257, file: !758, line: 386, baseType: !954, size: 32, align: 32, offset: 1312)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1257, file: !758, line: 391, baseType: !954, size: 32, align: 32, offset: 1344)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1257, file: !758, line: 396, baseType: !956, size: 64, align: 64, offset: 1408)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1257, file: !758, line: 403, baseType: !1278, size: 512, align: 64, offset: 1472)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 512, align: 64, elements: !1198)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1257, file: !758, line: 410, baseType: !954, size: 32, align: 32, offset: 1984)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1257, file: !758, line: 415, baseType: !954, size: 32, align: 32, offset: 2016)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1257, file: !758, line: 420, baseType: !954, size: 32, align: 32, offset: 2048)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1257, file: !758, line: 425, baseType: !954, size: 32, align: 32, offset: 2080)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1257, file: !758, line: 435, baseType: !1214, size: 64, align: 64, offset: 2112)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1257, file: !758, line: 440, baseType: !954, size: 32, align: 32, offset: 2176)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1257, file: !758, line: 445, baseType: !1125, size: 64, align: 64, offset: 2240)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1257, file: !758, line: 459, baseType: !1287, size: 512, align: 64, offset: 2304)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1225, size: 512, align: 64, elements: !1198)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1257, file: !758, line: 473, baseType: !1289, size: 64, align: 64, offset: 2816)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1257, file: !758, line: 477, baseType: !954, size: 32, align: 32, offset: 2880)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1257, file: !758, line: 479, baseType: !1292, size: 64, align: 64, offset: 2944)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1305}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1295, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1295, file: !758, line: 203, baseType: !1170, size: 64, align: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1295, file: !758, line: 204, baseType: !954, size: 32, align: 32, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1295, file: !758, line: 205, baseType: !1301, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1303, line: 86, baseType: !1304)
!1303 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1303, line: 86, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1295, file: !758, line: 206, baseType: !1225, size: 64, align: 64, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1257, file: !758, line: 480, baseType: !954, size: 32, align: 32, offset: 3008)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1257, file: !758, line: 505, baseType: !954, size: 32, align: 32, offset: 3040)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1257, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1257, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1257, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1257, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1257, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1257, file: !758, line: 532, baseType: !1214, size: 64, align: 64, offset: 3264)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1257, file: !758, line: 539, baseType: !1214, size: 64, align: 64, offset: 3328)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1257, file: !758, line: 547, baseType: !1214, size: 64, align: 64, offset: 3392)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1257, file: !758, line: 554, baseType: !1301, size: 64, align: 64, offset: 3456)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1257, file: !758, line: 563, baseType: !954, size: 32, align: 32, offset: 3520)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1257, file: !758, line: 572, baseType: !954, size: 32, align: 32, offset: 3552)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1257, file: !758, line: 581, baseType: !954, size: 32, align: 32, offset: 3584)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1257, file: !758, line: 588, baseType: !1321, size: 64, align: 64, offset: 3648)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !985, line: 36, baseType: !1323)
!1323 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1257, file: !758, line: 593, baseType: !954, size: 32, align: 32, offset: 3712)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1257, file: !758, line: 596, baseType: !954, size: 32, align: 32, offset: 3744)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1257, file: !758, line: 599, baseType: !1225, size: 64, align: 64, offset: 3776)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1257, file: !758, line: 605, baseType: !1225, size: 64, align: 64, offset: 3840)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1257, file: !758, line: 616, baseType: !1225, size: 64, align: 64, offset: 3904)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1257, file: !758, line: 626, baseType: !1004, size: 64, align: 64, offset: 3968)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1257, file: !758, line: 627, baseType: !1004, size: 64, align: 64, offset: 4032)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1257, file: !758, line: 628, baseType: !1004, size: 64, align: 64, offset: 4096)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1257, file: !758, line: 629, baseType: !1004, size: 64, align: 64, offset: 4160)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1257, file: !758, line: 645, baseType: !1225, size: 64, align: 64, offset: 4224)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1097, file: !35, line: 3566, baseType: !1336, size: 64, align: 64, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!954, !1087, !956, !1334, !1220}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1097, file: !35, line: 3567, baseType: !1141, size: 64, align: 64, offset: 1472)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1097, file: !35, line: 3576, baseType: !1341, size: 64, align: 64, offset: 1536)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!954, !1087, !1254}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1097, file: !35, line: 3577, baseType: !1345, size: 64, align: 64, offset: 1600)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!954, !1087, !1220}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1097, file: !35, line: 3584, baseType: !1349, size: 64, align: 64, offset: 1664)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!954, !1087, !1352}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1097, file: !35, line: 3589, baseType: !1354, size: 64, align: 64, offset: 1728)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{null, !1087}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1097, file: !35, line: 3594, baseType: !954, size: 32, align: 32, offset: 1792)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1097, file: !35, line: 3600, baseType: !1049, size: 64, align: 64, offset: 1856)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1097, file: !35, line: 3609, baseType: !1360, size: 64, align: 64, offset: 1920)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1089, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1089, file: !35, line: 1581, baseType: !955, size: 32, align: 32, offset: 224)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1089, file: !35, line: 1583, baseType: !956, size: 64, align: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1089, file: !35, line: 1591, baseType: !1368, size: 64, align: 64, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1155, line: 129, size: 1664, align: 64, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1374, !1375, !1393, !1394, !1400, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1369, file: !1155, line: 136, baseType: !954, size: 32, align: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1369, file: !1155, line: 151, baseType: !954, size: 32, align: 32, offset: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1369, file: !1155, line: 157, baseType: !954, size: 32, align: 32, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1369, file: !1155, line: 159, baseType: !1352, size: 64, align: 64, offset: 128)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1369, file: !1155, line: 161, baseType: !1376, size: 64, align: 64, offset: 192)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1155, line: 117, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1155, line: 100, size: 832, align: 64, elements: !1379)
!1379 = !{!1380, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1378, file: !1155, line: 105, baseType: !1381, size: 256, align: 64)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1382, size: 256, align: 64, elements: !1204)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1227, line: 238, baseType: !1384)
!1384 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1227, line: 238, flags: DIFlagFwdDecl)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1378, file: !1155, line: 110, baseType: !954, size: 32, align: 32, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1378, file: !1155, line: 111, baseType: !954, size: 32, align: 32, offset: 288)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1378, file: !1155, line: 111, baseType: !954, size: 32, align: 32, offset: 320)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1378, file: !1155, line: 112, baseType: !1201, size: 256, align: 32, offset: 352)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1378, file: !1155, line: 113, baseType: !1207, size: 128, align: 32, offset: 608)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1378, file: !1155, line: 114, baseType: !954, size: 32, align: 32, offset: 736)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1378, file: !1155, line: 115, baseType: !954, size: 32, align: 32, offset: 768)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1378, file: !1155, line: 116, baseType: !954, size: 32, align: 32, offset: 800)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1369, file: !1155, line: 163, baseType: !956, size: 64, align: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1369, file: !1155, line: 165, baseType: !1395, size: 128, align: 64, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1155, line: 122, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1155, line: 119, size: 128, align: 64, elements: !1397)
!1397 = !{!1398, !1399}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1396, file: !1155, line: 120, baseType: !1220, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1396, file: !1155, line: 121, baseType: !1352, size: 64, align: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1369, file: !1155, line: 166, baseType: !1401, size: 128, align: 64, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1155, line: 127, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1155, line: 124, size: 128, align: 64, elements: !1403)
!1403 = !{!1404, !1477}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1402, file: !1155, line: 125, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1409)
!1409 = !{!1410, !1411, !1435, !1439, !1440, !1474, !1475, !1476}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1408, file: !35, line: 5751, baseType: !1043, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1408, file: !35, line: 5756, baseType: !1412, size: 64, align: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1415)
!1415 = !{!1416, !1417, !1420, !1421, !1422, !1426, !1430, !1434}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1414, file: !35, line: 5797, baseType: !1049, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1414, file: !35, line: 5804, baseType: !1418, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1414, file: !35, line: 5815, baseType: !1043, size: 64, align: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1414, file: !35, line: 5825, baseType: !954, size: 32, align: 32, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1414, file: !35, line: 5826, baseType: !1423, size: 64, align: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!954, !1406}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1414, file: !35, line: 5827, baseType: !1427, size: 64, align: 64, offset: 320)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!954, !1406, !1220}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1414, file: !35, line: 5828, baseType: !1431, size: 64, align: 64, offset: 384)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{null, !1406}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1414, file: !35, line: 5829, baseType: !1431, size: 64, align: 64, offset: 448)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1408, file: !35, line: 5762, baseType: !1436, size: 64, align: 64, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1438)
!1438 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1408, file: !35, line: 5768, baseType: !956, size: 64, align: 64, offset: 192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1408, file: !35, line: 5775, baseType: !1441, size: 64, align: 64, offset: 256)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1443, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1443, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1443, file: !35, line: 3948, baseType: !1009, size: 32, align: 32, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1443, file: !35, line: 3958, baseType: !1170, size: 64, align: 64, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1443, file: !35, line: 3962, baseType: !954, size: 32, align: 32, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1443, file: !35, line: 3968, baseType: !954, size: 32, align: 32, offset: 224)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1443, file: !35, line: 3973, baseType: !1214, size: 64, align: 64, offset: 256)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1443, file: !35, line: 3986, baseType: !954, size: 32, align: 32, offset: 320)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1443, file: !35, line: 3999, baseType: !954, size: 32, align: 32, offset: 352)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1443, file: !35, line: 4004, baseType: !954, size: 32, align: 32, offset: 384)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1443, file: !35, line: 4005, baseType: !954, size: 32, align: 32, offset: 416)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1443, file: !35, line: 4010, baseType: !954, size: 32, align: 32, offset: 448)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1443, file: !35, line: 4011, baseType: !954, size: 32, align: 32, offset: 480)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1443, file: !35, line: 4020, baseType: !1107, size: 64, align: 32, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1443, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1443, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1443, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1443, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1443, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1443, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1443, file: !35, line: 4039, baseType: !954, size: 32, align: 32, offset: 768)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1443, file: !35, line: 4046, baseType: !1125, size: 64, align: 64, offset: 832)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1443, file: !35, line: 4050, baseType: !954, size: 32, align: 32, offset: 896)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1443, file: !35, line: 4054, baseType: !954, size: 32, align: 32, offset: 928)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1443, file: !35, line: 4061, baseType: !954, size: 32, align: 32, offset: 960)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1443, file: !35, line: 4065, baseType: !954, size: 32, align: 32, offset: 992)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1443, file: !35, line: 4073, baseType: !954, size: 32, align: 32, offset: 1024)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1443, file: !35, line: 4080, baseType: !954, size: 32, align: 32, offset: 1056)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1443, file: !35, line: 4084, baseType: !954, size: 32, align: 32, offset: 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1408, file: !35, line: 5781, baseType: !1441, size: 64, align: 64, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1408, file: !35, line: 5787, baseType: !1107, size: 64, align: 32, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1408, file: !35, line: 5793, baseType: !1107, size: 64, align: 32, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1402, file: !1155, line: 126, baseType: !954, size: 32, align: 32, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1369, file: !1155, line: 172, baseType: !1220, size: 64, align: 64, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1369, file: !1155, line: 177, baseType: !1170, size: 64, align: 64, offset: 640)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1369, file: !1155, line: 178, baseType: !955, size: 32, align: 32, offset: 704)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1369, file: !1155, line: 180, baseType: !956, size: 64, align: 64, offset: 768)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1369, file: !1155, line: 185, baseType: !954, size: 32, align: 32, offset: 832)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1369, file: !1155, line: 190, baseType: !956, size: 64, align: 64, offset: 896)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1369, file: !1155, line: 195, baseType: !954, size: 32, align: 32, offset: 960)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1369, file: !1155, line: 200, baseType: !1220, size: 64, align: 64, offset: 1024)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1369, file: !1155, line: 201, baseType: !954, size: 32, align: 32, offset: 1088)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1369, file: !1155, line: 202, baseType: !1352, size: 64, align: 64, offset: 1152)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1369, file: !1155, line: 203, baseType: !954, size: 32, align: 32, offset: 1216)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1369, file: !1155, line: 205, baseType: !954, size: 32, align: 32, offset: 1248)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1369, file: !1155, line: 206, baseType: !954, size: 32, align: 32, offset: 1280)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1369, file: !1155, line: 209, baseType: !1004, size: 64, align: 64, offset: 1344)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1369, file: !1155, line: 212, baseType: !1004, size: 64, align: 64, offset: 1408)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1369, file: !1155, line: 213, baseType: !1352, size: 64, align: 64, offset: 1472)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1369, file: !1155, line: 215, baseType: !954, size: 32, align: 32, offset: 1536)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1369, file: !1155, line: 217, baseType: !954, size: 32, align: 32, offset: 1568)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1369, file: !1155, line: 220, baseType: !954, size: 32, align: 32, offset: 1600)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1089, file: !35, line: 1598, baseType: !956, size: 64, align: 64, offset: 384)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1089, file: !35, line: 1606, baseType: !1214, size: 64, align: 64, offset: 448)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1089, file: !35, line: 1614, baseType: !954, size: 32, align: 32, offset: 512)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1089, file: !35, line: 1622, baseType: !954, size: 32, align: 32, offset: 544)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1089, file: !35, line: 1628, baseType: !954, size: 32, align: 32, offset: 576)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !35, line: 1636, baseType: !954, size: 32, align: 32, offset: 608)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1089, file: !35, line: 1643, baseType: !954, size: 32, align: 32, offset: 640)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1089, file: !35, line: 1657, baseType: !1170, size: 64, align: 64, offset: 704)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1089, file: !35, line: 1658, baseType: !954, size: 32, align: 32, offset: 768)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1089, file: !35, line: 1679, baseType: !1107, size: 64, align: 32, offset: 800)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1089, file: !35, line: 1688, baseType: !954, size: 32, align: 32, offset: 864)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1089, file: !35, line: 1712, baseType: !954, size: 32, align: 32, offset: 896)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1089, file: !35, line: 1729, baseType: !954, size: 32, align: 32, offset: 928)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1089, file: !35, line: 1729, baseType: !954, size: 32, align: 32, offset: 960)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1089, file: !35, line: 1744, baseType: !954, size: 32, align: 32, offset: 992)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1089, file: !35, line: 1744, baseType: !954, size: 32, align: 32, offset: 1024)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1089, file: !35, line: 1751, baseType: !954, size: 32, align: 32, offset: 1056)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1089, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1089, file: !35, line: 1791, baseType: !1516, size: 64, align: 64, offset: 1152)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{null, !1519, !1254, !1334, !954, !954, !954}
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1089, file: !35, line: 1808, baseType: !1521, size: 64, align: 64, offset: 1216)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!494, !1519, !1114}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1089, file: !35, line: 1816, baseType: !954, size: 32, align: 32, offset: 1280)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1089, file: !35, line: 1825, baseType: !1526, size: 32, align: 32, offset: 1312)
!1526 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1089, file: !35, line: 1830, baseType: !954, size: 32, align: 32, offset: 1344)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1089, file: !35, line: 1838, baseType: !1526, size: 32, align: 32, offset: 1376)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1089, file: !35, line: 1846, baseType: !954, size: 32, align: 32, offset: 1408)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1089, file: !35, line: 1851, baseType: !954, size: 32, align: 32, offset: 1440)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1089, file: !35, line: 1861, baseType: !1526, size: 32, align: 32, offset: 1472)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1089, file: !35, line: 1868, baseType: !1526, size: 32, align: 32, offset: 1504)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1089, file: !35, line: 1875, baseType: !1526, size: 32, align: 32, offset: 1536)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1089, file: !35, line: 1882, baseType: !1526, size: 32, align: 32, offset: 1568)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1089, file: !35, line: 1889, baseType: !1526, size: 32, align: 32, offset: 1600)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1089, file: !35, line: 1896, baseType: !1526, size: 32, align: 32, offset: 1632)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1089, file: !35, line: 1903, baseType: !1526, size: 32, align: 32, offset: 1664)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1089, file: !35, line: 1910, baseType: !954, size: 32, align: 32, offset: 1696)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1089, file: !35, line: 1915, baseType: !954, size: 32, align: 32, offset: 1728)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1089, file: !35, line: 1926, baseType: !1334, size: 64, align: 64, offset: 1792)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1089, file: !35, line: 1935, baseType: !1107, size: 64, align: 32, offset: 1856)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1089, file: !35, line: 1942, baseType: !954, size: 32, align: 32, offset: 1920)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1089, file: !35, line: 1948, baseType: !954, size: 32, align: 32, offset: 1952)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1089, file: !35, line: 1954, baseType: !954, size: 32, align: 32, offset: 1984)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1089, file: !35, line: 1960, baseType: !954, size: 32, align: 32, offset: 2016)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1089, file: !35, line: 1984, baseType: !954, size: 32, align: 32, offset: 2048)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1089, file: !35, line: 1991, baseType: !954, size: 32, align: 32, offset: 2080)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1089, file: !35, line: 1996, baseType: !954, size: 32, align: 32, offset: 2112)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1089, file: !35, line: 2004, baseType: !954, size: 32, align: 32, offset: 2144)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1089, file: !35, line: 2011, baseType: !954, size: 32, align: 32, offset: 2176)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1089, file: !35, line: 2018, baseType: !954, size: 32, align: 32, offset: 2208)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1089, file: !35, line: 2027, baseType: !954, size: 32, align: 32, offset: 2240)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1089, file: !35, line: 2034, baseType: !954, size: 32, align: 32, offset: 2272)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1089, file: !35, line: 2044, baseType: !954, size: 32, align: 32, offset: 2304)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1089, file: !35, line: 2054, baseType: !1556, size: 64, align: 64, offset: 2368)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1089, file: !35, line: 2061, baseType: !1556, size: 64, align: 64, offset: 2432)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1089, file: !35, line: 2066, baseType: !954, size: 32, align: 32, offset: 2496)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1089, file: !35, line: 2070, baseType: !954, size: 32, align: 32, offset: 2528)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1089, file: !35, line: 2078, baseType: !954, size: 32, align: 32, offset: 2560)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1089, file: !35, line: 2085, baseType: !954, size: 32, align: 32, offset: 2592)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1089, file: !35, line: 2092, baseType: !954, size: 32, align: 32, offset: 2624)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1089, file: !35, line: 2099, baseType: !954, size: 32, align: 32, offset: 2656)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1089, file: !35, line: 2106, baseType: !954, size: 32, align: 32, offset: 2688)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1089, file: !35, line: 2113, baseType: !954, size: 32, align: 32, offset: 2720)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1089, file: !35, line: 2120, baseType: !954, size: 32, align: 32, offset: 2752)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1089, file: !35, line: 2125, baseType: !954, size: 32, align: 32, offset: 2784)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1089, file: !35, line: 2133, baseType: !954, size: 32, align: 32, offset: 2816)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1089, file: !35, line: 2140, baseType: !954, size: 32, align: 32, offset: 2848)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1089, file: !35, line: 2145, baseType: !954, size: 32, align: 32, offset: 2880)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1089, file: !35, line: 2153, baseType: !954, size: 32, align: 32, offset: 2912)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1089, file: !35, line: 2158, baseType: !954, size: 32, align: 32, offset: 2944)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1089, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1089, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1089, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1089, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1089, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1089, file: !35, line: 2203, baseType: !954, size: 32, align: 32, offset: 3136)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1089, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1089, file: !35, line: 2212, baseType: !954, size: 32, align: 32, offset: 3200)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1089, file: !35, line: 2213, baseType: !954, size: 32, align: 32, offset: 3232)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1089, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1089, file: !35, line: 2232, baseType: !954, size: 32, align: 32, offset: 3296)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1089, file: !35, line: 2243, baseType: !954, size: 32, align: 32, offset: 3328)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1089, file: !35, line: 2249, baseType: !954, size: 32, align: 32, offset: 3360)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1089, file: !35, line: 2256, baseType: !954, size: 32, align: 32, offset: 3392)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1089, file: !35, line: 2263, baseType: !1125, size: 64, align: 64, offset: 3456)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1089, file: !35, line: 2270, baseType: !1125, size: 64, align: 64, offset: 3520)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1089, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1089, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1089, file: !35, line: 2367, baseType: !1592, size: 64, align: 64, offset: 3648)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!954, !1519, !1352, !954}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1089, file: !35, line: 2383, baseType: !954, size: 32, align: 32, offset: 3712)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1089, file: !35, line: 2386, baseType: !1526, size: 32, align: 32, offset: 3744)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1089, file: !35, line: 2387, baseType: !1526, size: 32, align: 32, offset: 3776)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1089, file: !35, line: 2394, baseType: !954, size: 32, align: 32, offset: 3808)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1089, file: !35, line: 2401, baseType: !954, size: 32, align: 32, offset: 3840)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1089, file: !35, line: 2408, baseType: !954, size: 32, align: 32, offset: 3872)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1089, file: !35, line: 2415, baseType: !954, size: 32, align: 32, offset: 3904)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1089, file: !35, line: 2422, baseType: !954, size: 32, align: 32, offset: 3936)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1089, file: !35, line: 2423, baseType: !1604, size: 64, align: 64, offset: 3968)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1611}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1606, file: !35, line: 827, baseType: !954, size: 32, align: 32)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1606, file: !35, line: 828, baseType: !954, size: 32, align: 32, offset: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1606, file: !35, line: 829, baseType: !954, size: 32, align: 32, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1606, file: !35, line: 830, baseType: !1526, size: 32, align: 32, offset: 96)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1089, file: !35, line: 2430, baseType: !1214, size: 64, align: 64, offset: 4032)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1089, file: !35, line: 2437, baseType: !1214, size: 64, align: 64, offset: 4096)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1089, file: !35, line: 2444, baseType: !1526, size: 32, align: 32, offset: 4160)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1089, file: !35, line: 2451, baseType: !1526, size: 32, align: 32, offset: 4192)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1089, file: !35, line: 2458, baseType: !954, size: 32, align: 32, offset: 4224)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1089, file: !35, line: 2469, baseType: !954, size: 32, align: 32, offset: 4256)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1089, file: !35, line: 2475, baseType: !954, size: 32, align: 32, offset: 4288)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1089, file: !35, line: 2481, baseType: !954, size: 32, align: 32, offset: 4320)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1089, file: !35, line: 2485, baseType: !954, size: 32, align: 32, offset: 4352)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1089, file: !35, line: 2489, baseType: !954, size: 32, align: 32, offset: 4384)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1089, file: !35, line: 2493, baseType: !954, size: 32, align: 32, offset: 4416)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1089, file: !35, line: 2501, baseType: !954, size: 32, align: 32, offset: 4448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1089, file: !35, line: 2506, baseType: !954, size: 32, align: 32, offset: 4480)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1089, file: !35, line: 2510, baseType: !954, size: 32, align: 32, offset: 4512)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1089, file: !35, line: 2514, baseType: !1214, size: 64, align: 64, offset: 4544)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1089, file: !35, line: 2528, baseType: !1628, size: 64, align: 64, offset: 4608)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{null, !1519, !956, !954, !954}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1089, file: !35, line: 2534, baseType: !954, size: 32, align: 32, offset: 4672)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1089, file: !35, line: 2545, baseType: !954, size: 32, align: 32, offset: 4704)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1089, file: !35, line: 2547, baseType: !954, size: 32, align: 32, offset: 4736)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1089, file: !35, line: 2549, baseType: !954, size: 32, align: 32, offset: 4768)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1089, file: !35, line: 2551, baseType: !954, size: 32, align: 32, offset: 4800)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1089, file: !35, line: 2553, baseType: !954, size: 32, align: 32, offset: 4832)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1089, file: !35, line: 2555, baseType: !954, size: 32, align: 32, offset: 4864)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1089, file: !35, line: 2557, baseType: !954, size: 32, align: 32, offset: 4896)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1089, file: !35, line: 2559, baseType: !954, size: 32, align: 32, offset: 4928)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1089, file: !35, line: 2563, baseType: !954, size: 32, align: 32, offset: 4960)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1089, file: !35, line: 2571, baseType: !1210, size: 64, align: 64, offset: 4992)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1089, file: !35, line: 2579, baseType: !1210, size: 64, align: 64, offset: 5056)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1089, file: !35, line: 2586, baseType: !954, size: 32, align: 32, offset: 5120)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1089, file: !35, line: 2615, baseType: !954, size: 32, align: 32, offset: 5152)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1089, file: !35, line: 2627, baseType: !954, size: 32, align: 32, offset: 5184)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1089, file: !35, line: 2637, baseType: !954, size: 32, align: 32, offset: 5216)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1089, file: !35, line: 2681, baseType: !954, size: 32, align: 32, offset: 5248)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1089, file: !35, line: 2709, baseType: !1214, size: 64, align: 64, offset: 5312)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1089, file: !35, line: 2716, baseType: !1650, size: 64, align: 64, offset: 5376)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1653)
!1653 = !{!1654, !1655, !1656, !1657, !1658, !1659, !1660, !1664, !1668, !1669, !1670, !1671, !1677, !1678, !1679, !1680, !1681}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1652, file: !35, line: 3642, baseType: !1049, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1652, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1652, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1652, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1652, file: !35, line: 3669, baseType: !954, size: 32, align: 32, offset: 160)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1652, file: !35, line: 3682, baseType: !1349, size: 64, align: 64, offset: 192)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1652, file: !35, line: 3698, baseType: !1661, size: 64, align: 64, offset: 256)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!954, !1087, !1158, !1009}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1652, file: !35, line: 3712, baseType: !1665, size: 64, align: 64, offset: 320)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!954, !1087, !954, !1158, !1009}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1652, file: !35, line: 3726, baseType: !1661, size: 64, align: 64, offset: 384)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1652, file: !35, line: 3737, baseType: !1141, size: 64, align: 64, offset: 448)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1652, file: !35, line: 3746, baseType: !954, size: 32, align: 32, offset: 512)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1652, file: !35, line: 3757, baseType: !1672, size: 64, align: 64, offset: 576)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null, !1675}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1652, file: !35, line: 3766, baseType: !1141, size: 64, align: 64, offset: 640)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1652, file: !35, line: 3774, baseType: !1141, size: 64, align: 64, offset: 704)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1652, file: !35, line: 3780, baseType: !954, size: 32, align: 32, offset: 768)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1652, file: !35, line: 3785, baseType: !954, size: 32, align: 32, offset: 800)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1652, file: !35, line: 3795, baseType: !1682, size: 64, align: 64, offset: 832)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!954, !1087, !1225}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1089, file: !35, line: 2728, baseType: !956, size: 64, align: 64, offset: 5440)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1089, file: !35, line: 2735, baseType: !1278, size: 512, align: 64, offset: 5504)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1089, file: !35, line: 2742, baseType: !954, size: 32, align: 32, offset: 6016)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1089, file: !35, line: 2755, baseType: !954, size: 32, align: 32, offset: 6048)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1089, file: !35, line: 2776, baseType: !954, size: 32, align: 32, offset: 6080)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1089, file: !35, line: 2783, baseType: !954, size: 32, align: 32, offset: 6112)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1089, file: !35, line: 2791, baseType: !954, size: 32, align: 32, offset: 6144)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1089, file: !35, line: 2802, baseType: !1352, size: 64, align: 64, offset: 6208)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1089, file: !35, line: 2811, baseType: !954, size: 32, align: 32, offset: 6272)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1089, file: !35, line: 2821, baseType: !954, size: 32, align: 32, offset: 6304)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1089, file: !35, line: 2830, baseType: !954, size: 32, align: 32, offset: 6336)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1089, file: !35, line: 2840, baseType: !954, size: 32, align: 32, offset: 6368)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1089, file: !35, line: 2851, baseType: !1698, size: 64, align: 64, offset: 6400)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!954, !1519, !1701, !956, !1334, !954, !954}
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!954, !1519, !956}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1089, file: !35, line: 2871, baseType: !1705, size: 64, align: 64, offset: 6464)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!954, !1519, !1708, !956, !1334, !954}
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DISubroutineType(types: !1710)
!1710 = !{!954, !1519, !956, !954, !954}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1089, file: !35, line: 2878, baseType: !954, size: 32, align: 32, offset: 6528)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1089, file: !35, line: 2885, baseType: !954, size: 32, align: 32, offset: 6560)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1089, file: !35, line: 3005, baseType: !954, size: 32, align: 32, offset: 6592)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1089, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1089, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
