; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--gif.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--gif.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!859 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!860 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!861 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!862 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!863 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!864 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!865 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!866 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!868 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!869 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!870 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 60, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/gif.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913}
!912 = !DIEnumerator(name: "GF_OFFSETTING", value: 1)
!913 = !DIEnumerator(name: "GF_TRANSDIFF", value: 2)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FF_LZW_MODES", file: !915, line: 37, size: 32, align: 32, elements: !916)
!915 = !DIFile(filename: "libavcodec/lzw.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!916 = !{!917, !918}
!917 = !DIEnumerator(name: "FF_LZW_GIF", value: 0)
!918 = !DIEnumerator(name: "FF_LZW_TIFF", value: 1)
!919 = !{!920, !921, !925, !1035, !931, !1042}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !923, line: 51, baseType: !924)
!923 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !928)
!928 = !{!929, !936, !939, !941, !942, !943, !944, !945, !946, !947, !954, !957, !958, !959, !960, !961, !962, !963, !967, !968, !969, !970, !971, !972, !973, !974, !987, !989, !990, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1031, !1032, !1033, !1034}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !927, file: !744, line: 282, baseType: !930, size: 512, align: 64)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 512, align: 64, elements: !934)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !923, line: 48, baseType: !933)
!933 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!934 = !{!935}
!935 = !DISubrange(count: 8)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !927, file: !744, line: 299, baseType: !937, size: 256, align: 32, offset: 512)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 256, align: 32, elements: !934)
!938 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !927, file: !744, line: 315, baseType: !940, size: 64, align: 64, offset: 768)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !927, file: !744, line: 326, baseType: !938, size: 32, align: 32, offset: 832)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !927, file: !744, line: 326, baseType: !938, size: 32, align: 32, offset: 864)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !927, file: !744, line: 334, baseType: !938, size: 32, align: 32, offset: 896)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !927, file: !744, line: 341, baseType: !938, size: 32, align: 32, offset: 928)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !927, file: !744, line: 346, baseType: !938, size: 32, align: 32, offset: 960)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !927, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !927, file: !744, line: 356, baseType: !948, size: 64, align: 32, offset: 1024)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !949, line: 61, baseType: !950)
!949 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !949, line: 58, size: 64, align: 32, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !950, file: !949, line: 59, baseType: !938, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !950, file: !949, line: 60, baseType: !938, size: 32, align: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !927, file: !744, line: 361, baseType: !955, size: 64, align: 64, offset: 1088)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !923, line: 40, baseType: !956)
!956 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !927, file: !744, line: 369, baseType: !955, size: 64, align: 64, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !927, file: !744, line: 377, baseType: !955, size: 64, align: 64, offset: 1216)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !927, file: !744, line: 382, baseType: !938, size: 32, align: 32, offset: 1280)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !927, file: !744, line: 386, baseType: !938, size: 32, align: 32, offset: 1312)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !927, file: !744, line: 391, baseType: !938, size: 32, align: 32, offset: 1344)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !927, file: !744, line: 396, baseType: !920, size: 64, align: 64, offset: 1408)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !927, file: !744, line: 403, baseType: !964, size: 512, align: 64, offset: 1472)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 512, align: 64, elements: !934)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !923, line: 55, baseType: !966)
!966 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !927, file: !744, line: 410, baseType: !938, size: 32, align: 32, offset: 1984)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !927, file: !744, line: 415, baseType: !938, size: 32, align: 32, offset: 2016)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !927, file: !744, line: 420, baseType: !938, size: 32, align: 32, offset: 2048)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !927, file: !744, line: 425, baseType: !938, size: 32, align: 32, offset: 2080)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !927, file: !744, line: 435, baseType: !955, size: 64, align: 64, offset: 2112)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !927, file: !744, line: 440, baseType: !938, size: 32, align: 32, offset: 2176)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !927, file: !744, line: 445, baseType: !965, size: 64, align: 64, offset: 2240)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !927, file: !744, line: 459, baseType: !975, size: 512, align: 64, offset: 2304)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 512, align: 64, elements: !934)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !978, line: 94, baseType: !979)
!978 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !978, line: 81, size: 192, align: 64, elements: !980)
!980 = !{!981, !985, !986}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !979, file: !978, line: 82, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !978, line: 73, baseType: !984)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !978, line: 73, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !979, file: !978, line: 89, baseType: !931, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !979, file: !978, line: 93, baseType: !938, size: 32, align: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !927, file: !744, line: 473, baseType: !988, size: 64, align: 64, offset: 2816)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !927, file: !744, line: 477, baseType: !938, size: 32, align: 32, offset: 2880)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !927, file: !744, line: 479, baseType: !991, size: 64, align: 64, offset: 2944)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !995)
!995 = !{!996, !997, !998, !999, !1004}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !994, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !994, file: !744, line: 203, baseType: !931, size: 64, align: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !994, file: !744, line: 204, baseType: !938, size: 32, align: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !994, file: !744, line: 205, baseType: !1000, size: 64, align: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1002, line: 86, baseType: !1003)
!1002 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1002, line: 86, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !994, file: !744, line: 206, baseType: !976, size: 64, align: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !927, file: !744, line: 480, baseType: !938, size: 32, align: 32, offset: 3008)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !927, file: !744, line: 505, baseType: !938, size: 32, align: 32, offset: 3040)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !927, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !927, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !927, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !927, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !927, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !927, file: !744, line: 532, baseType: !955, size: 64, align: 64, offset: 3264)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !927, file: !744, line: 539, baseType: !955, size: 64, align: 64, offset: 3328)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !927, file: !744, line: 547, baseType: !955, size: 64, align: 64, offset: 3392)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !927, file: !744, line: 554, baseType: !1000, size: 64, align: 64, offset: 3456)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !927, file: !744, line: 563, baseType: !938, size: 32, align: 32, offset: 3520)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !927, file: !744, line: 572, baseType: !938, size: 32, align: 32, offset: 3552)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !927, file: !744, line: 581, baseType: !938, size: 32, align: 32, offset: 3584)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !927, file: !744, line: 588, baseType: !1020, size: 64, align: 64, offset: 3648)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !923, line: 36, baseType: !1022)
!1022 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !927, file: !744, line: 593, baseType: !938, size: 32, align: 32, offset: 3712)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !927, file: !744, line: 596, baseType: !938, size: 32, align: 32, offset: 3744)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !927, file: !744, line: 599, baseType: !976, size: 64, align: 64, offset: 3776)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !927, file: !744, line: 605, baseType: !976, size: 64, align: 64, offset: 3840)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !927, file: !744, line: 616, baseType: !976, size: 64, align: 64, offset: 3904)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !927, file: !744, line: 626, baseType: !1029, size: 64, align: 64, offset: 3968)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1030, line: 216, baseType: !966)
!1030 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !927, file: !744, line: 627, baseType: !1029, size: 64, align: 64, offset: 4032)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !927, file: !744, line: 628, baseType: !1029, size: 64, align: 64, offset: 4096)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !927, file: !744, line: 629, baseType: !1029, size: 64, align: 64, offset: 4160)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !927, file: !744, line: 645, baseType: !976, size: 64, align: 64, offset: 4224)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1037, line: 222, size: 16, align: 8, elements: !1038)
!1037 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1036, file: !1037, line: 222, baseType: !1040, size: 16, align: 16)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !923, line: 49, baseType: !1041)
!1041 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1037, line: 221, size: 32, align: 8, elements: !1044)
!1044 = !{!1045}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1043, file: !1037, line: 221, baseType: !922, size: 32, align: 32)
!1046 = !{!1047, !1697, !1698, !1704}
!1047 = distinct !DIGlobalVariable(name: "ff_gif_encoder", scope: !0, file: !910, line: 486, type: !1048, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_gif_encoder)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1050)
!1050 = !{!1051, !1055, !1056, !1057, !1058, !1059, !1062, !1065, !1068, !1071, !1074, !1075, !1148, !1156, !1157, !1158, !1160, !1612, !1618, !1626, !1630, !1631, !1668, !1672, !1676, !1677, !1681, !1685, !1686, !1690, !1691, !1692}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1049, file: !14, line: 3475, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1049, file: !14, line: 3480, baseType: !1052, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1049, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1049, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1049, file: !14, line: 3487, baseType: !938, size: 32, align: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1049, file: !14, line: 3488, baseType: !1060, size: 64, align: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1049, file: !14, line: 3489, baseType: !1063, size: 64, align: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1049, file: !14, line: 3490, baseType: !1066, size: 64, align: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1049, file: !14, line: 3491, baseType: !1069, size: 64, align: 64, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1049, file: !14, line: 3492, baseType: !1072, size: 64, align: 64, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1049, file: !14, line: 3493, baseType: !932, size: 8, align: 8, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1049, file: !14, line: 3494, baseType: !1076, size: 64, align: 64, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1086, !1107, !1108, !1109, !1110, !1114, !1120, !1122, !1126}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1079, file: !713, line: 72, baseType: !1052, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1079, file: !713, line: 78, baseType: !1083, size: 64, align: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!1052, !920}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1079, file: !713, line: 85, baseType: !1087, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1103, !1104, !1105, !1106}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1089, file: !691, line: 247, baseType: !1052, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1089, file: !691, line: 253, baseType: !1052, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1089, file: !691, line: 259, baseType: !938, size: 32, align: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1089, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1089, file: !691, line: 271, baseType: !1096, size: 64, align: 64, offset: 192)
!1096 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1089, file: !691, line: 265, size: 64, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1101, !1102}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1096, file: !691, line: 266, baseType: !955, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1096, file: !691, line: 267, baseType: !1100, size: 64, align: 64)
!1100 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1096, file: !691, line: 268, baseType: !1052, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1096, file: !691, line: 270, baseType: !948, size: 64, align: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1089, file: !691, line: 272, baseType: !1100, size: 64, align: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1089, file: !691, line: 273, baseType: !1100, size: 64, align: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !691, line: 275, baseType: !938, size: 32, align: 32, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1089, file: !691, line: 300, baseType: !1052, size: 64, align: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1079, file: !713, line: 93, baseType: !938, size: 32, align: 32, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1079, file: !713, line: 99, baseType: !938, size: 32, align: 32, offset: 224)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1079, file: !713, line: 108, baseType: !938, size: 32, align: 32, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1079, file: !713, line: 113, baseType: !1111, size: 64, align: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!920, !920, !920}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1079, file: !713, line: 123, baseType: !1115, size: 64, align: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!1118, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1079, file: !713, line: 130, baseType: !1121, size: 32, align: 32, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1079, file: !713, line: 136, baseType: !1123, size: 64, align: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!1121, !920}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1079, file: !713, line: 142, baseType: !1127, size: 64, align: 64, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!938, !1130, !920, !1052, !938}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1133)
!1133 = !{!1134, !1146, !1147}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1132, file: !691, line: 360, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1138, file: !691, line: 307, baseType: !1052, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1138, file: !691, line: 313, baseType: !1100, size: 64, align: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1138, file: !691, line: 313, baseType: !1100, size: 64, align: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1138, file: !691, line: 318, baseType: !1100, size: 64, align: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1138, file: !691, line: 318, baseType: !1100, size: 64, align: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1138, file: !691, line: 323, baseType: !938, size: 32, align: 32, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1132, file: !691, line: 364, baseType: !938, size: 32, align: 32, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1132, file: !691, line: 368, baseType: !938, size: 32, align: 32, offset: 96)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1049, file: !14, line: 3495, baseType: !1149, size: 64, align: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1152, file: !14, line: 3402, baseType: !938, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !14, line: 3403, baseType: !1052, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1049, file: !14, line: 3507, baseType: !1052, size: 64, align: 64, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1049, file: !14, line: 3516, baseType: !938, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1049, file: !14, line: 3517, baseType: !1159, size: 64, align: 64, offset: 896)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1049, file: !14, line: 3527, baseType: !1161, size: 64, align: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!938, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1174, !1175, !1176, !1177, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1360, !1364, !1365, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1550, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1166, file: !14, line: 1561, baseType: !1076, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1166, file: !14, line: 1562, baseType: !938, size: 32, align: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1166, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1166, file: !14, line: 1565, baseType: !1172, size: 64, align: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1166, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1166, file: !14, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1166, file: !14, line: 1583, baseType: !920, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1166, file: !14, line: 1591, baseType: !1178, size: 64, align: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1180, line: 129, size: 1664, align: 64, elements: !1181)
!1180 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1207, !1208, !1237, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1179, file: !1180, line: 136, baseType: !938, size: 32, align: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1179, file: !1180, line: 151, baseType: !938, size: 32, align: 32, offset: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1179, file: !1180, line: 157, baseType: !938, size: 32, align: 32, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1179, file: !1180, line: 159, baseType: !925, size: 64, align: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1179, file: !1180, line: 161, baseType: !1187, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1180, line: 117, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1180, line: 100, size: 832, align: 64, elements: !1190)
!1190 = !{!1191, !1198, !1199, !1200, !1201, !1202, !1204, !1205, !1206}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1189, file: !1180, line: 105, baseType: !1192, size: 256, align: 64)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1193, size: 256, align: 64, elements: !1196)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !978, line: 238, baseType: !1195)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !978, line: 238, flags: DIFlagFwdDecl)
!1196 = !{!1197}
!1197 = !DISubrange(count: 4)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1189, file: !1180, line: 110, baseType: !938, size: 32, align: 32, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1189, file: !1180, line: 111, baseType: !938, size: 32, align: 32, offset: 288)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1189, file: !1180, line: 111, baseType: !938, size: 32, align: 32, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1189, file: !1180, line: 112, baseType: !937, size: 256, align: 32, offset: 352)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1189, file: !1180, line: 113, baseType: !1203, size: 128, align: 32, offset: 608)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 128, align: 32, elements: !1196)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1189, file: !1180, line: 114, baseType: !938, size: 32, align: 32, offset: 736)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1189, file: !1180, line: 115, baseType: !938, size: 32, align: 32, offset: 768)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1189, file: !1180, line: 116, baseType: !938, size: 32, align: 32, offset: 800)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1179, file: !1180, line: 163, baseType: !920, size: 64, align: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1179, file: !1180, line: 165, baseType: !1209, size: 128, align: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1180, line: 122, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1180, line: 119, size: 128, align: 64, elements: !1211)
!1211 = !{!1212, !1236}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1210, file: !1180, line: 120, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1232, !1233, !1234, !1235}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1215, file: !14, line: 1451, baseType: !976, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1215, file: !14, line: 1461, baseType: !955, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1215, file: !14, line: 1467, baseType: !955, size: 64, align: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !14, line: 1468, baseType: !931, size: 64, align: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1215, file: !14, line: 1469, baseType: !938, size: 32, align: 32, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1215, file: !14, line: 1470, baseType: !938, size: 32, align: 32, offset: 288)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1215, file: !14, line: 1474, baseType: !938, size: 32, align: 32, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1215, file: !14, line: 1479, baseType: !1225, size: 64, align: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1227, file: !14, line: 1412, baseType: !931, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !14, line: 1413, baseType: !938, size: 32, align: 32, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1227, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1215, file: !14, line: 1480, baseType: !938, size: 32, align: 32, offset: 448)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1215, file: !14, line: 1486, baseType: !955, size: 64, align: 64, offset: 512)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1215, file: !14, line: 1488, baseType: !955, size: 64, align: 64, offset: 576)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1215, file: !14, line: 1497, baseType: !955, size: 64, align: 64, offset: 640)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1210, file: !1180, line: 121, baseType: !925, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1179, file: !1180, line: 166, baseType: !1238, size: 128, align: 64, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1180, line: 127, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1180, line: 124, size: 128, align: 64, elements: !1240)
!1240 = !{!1241, !1314}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1239, file: !1180, line: 125, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1272, !1276, !1277, !1311, !1312, !1313}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1245, file: !14, line: 5751, baseType: !1076, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1245, file: !14, line: 5756, baseType: !1249, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1257, !1258, !1259, !1263, !1267, !1271}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1251, file: !14, line: 5797, baseType: !1052, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1251, file: !14, line: 5804, baseType: !1255, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1251, file: !14, line: 5815, baseType: !1076, size: 64, align: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1251, file: !14, line: 5825, baseType: !938, size: 32, align: 32, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1251, file: !14, line: 5826, baseType: !1260, size: 64, align: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!938, !1243}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1251, file: !14, line: 5827, baseType: !1264, size: 64, align: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!938, !1243, !1213}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1251, file: !14, line: 5828, baseType: !1268, size: 64, align: 64, offset: 384)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{null, !1243}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1251, file: !14, line: 5829, baseType: !1268, size: 64, align: 64, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1245, file: !14, line: 5762, baseType: !1273, size: 64, align: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1275)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1245, file: !14, line: 5768, baseType: !920, size: 64, align: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1245, file: !14, line: 5775, baseType: !1278, size: 64, align: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1280, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1280, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1280, file: !14, line: 3948, baseType: !922, size: 32, align: 32, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1280, file: !14, line: 3958, baseType: !931, size: 64, align: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1280, file: !14, line: 3962, baseType: !938, size: 32, align: 32, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1280, file: !14, line: 3968, baseType: !938, size: 32, align: 32, offset: 224)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1280, file: !14, line: 3973, baseType: !955, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1280, file: !14, line: 3986, baseType: !938, size: 32, align: 32, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1280, file: !14, line: 3999, baseType: !938, size: 32, align: 32, offset: 352)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1280, file: !14, line: 4004, baseType: !938, size: 32, align: 32, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1280, file: !14, line: 4005, baseType: !938, size: 32, align: 32, offset: 416)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1280, file: !14, line: 4010, baseType: !938, size: 32, align: 32, offset: 448)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1280, file: !14, line: 4011, baseType: !938, size: 32, align: 32, offset: 480)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1280, file: !14, line: 4020, baseType: !948, size: 64, align: 32, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1280, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1280, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1280, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1280, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1280, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1280, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1280, file: !14, line: 4039, baseType: !938, size: 32, align: 32, offset: 768)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1280, file: !14, line: 4046, baseType: !965, size: 64, align: 64, offset: 832)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1280, file: !14, line: 4050, baseType: !938, size: 32, align: 32, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1280, file: !14, line: 4054, baseType: !938, size: 32, align: 32, offset: 928)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1280, file: !14, line: 4061, baseType: !938, size: 32, align: 32, offset: 960)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1280, file: !14, line: 4065, baseType: !938, size: 32, align: 32, offset: 992)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1280, file: !14, line: 4073, baseType: !938, size: 32, align: 32, offset: 1024)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1280, file: !14, line: 4080, baseType: !938, size: 32, align: 32, offset: 1056)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1280, file: !14, line: 4084, baseType: !938, size: 32, align: 32, offset: 1088)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1245, file: !14, line: 5781, baseType: !1278, size: 64, align: 64, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1245, file: !14, line: 5787, baseType: !948, size: 64, align: 32, offset: 384)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1245, file: !14, line: 5793, baseType: !948, size: 64, align: 32, offset: 448)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1239, file: !1180, line: 126, baseType: !938, size: 32, align: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1179, file: !1180, line: 172, baseType: !1213, size: 64, align: 64, offset: 576)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1179, file: !1180, line: 177, baseType: !931, size: 64, align: 64, offset: 640)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1179, file: !1180, line: 178, baseType: !924, size: 32, align: 32, offset: 704)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1179, file: !1180, line: 180, baseType: !920, size: 64, align: 64, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1179, file: !1180, line: 185, baseType: !938, size: 32, align: 32, offset: 832)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1179, file: !1180, line: 190, baseType: !920, size: 64, align: 64, offset: 896)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1179, file: !1180, line: 195, baseType: !938, size: 32, align: 32, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1179, file: !1180, line: 200, baseType: !1213, size: 64, align: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1179, file: !1180, line: 201, baseType: !938, size: 32, align: 32, offset: 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1179, file: !1180, line: 202, baseType: !925, size: 64, align: 64, offset: 1152)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1179, file: !1180, line: 203, baseType: !938, size: 32, align: 32, offset: 1216)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1179, file: !1180, line: 205, baseType: !938, size: 32, align: 32, offset: 1248)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1179, file: !1180, line: 206, baseType: !938, size: 32, align: 32, offset: 1280)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1179, file: !1180, line: 209, baseType: !1029, size: 64, align: 64, offset: 1344)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1179, file: !1180, line: 212, baseType: !1029, size: 64, align: 64, offset: 1408)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1179, file: !1180, line: 213, baseType: !925, size: 64, align: 64, offset: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1179, file: !1180, line: 215, baseType: !938, size: 32, align: 32, offset: 1536)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1179, file: !1180, line: 217, baseType: !938, size: 32, align: 32, offset: 1568)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1179, file: !1180, line: 220, baseType: !938, size: 32, align: 32, offset: 1600)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1166, file: !14, line: 1598, baseType: !920, size: 64, align: 64, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1166, file: !14, line: 1606, baseType: !955, size: 64, align: 64, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1166, file: !14, line: 1614, baseType: !938, size: 32, align: 32, offset: 512)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1166, file: !14, line: 1622, baseType: !938, size: 32, align: 32, offset: 544)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1166, file: !14, line: 1628, baseType: !938, size: 32, align: 32, offset: 576)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1166, file: !14, line: 1636, baseType: !938, size: 32, align: 32, offset: 608)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1166, file: !14, line: 1643, baseType: !938, size: 32, align: 32, offset: 640)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1166, file: !14, line: 1657, baseType: !931, size: 64, align: 64, offset: 704)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1166, file: !14, line: 1658, baseType: !938, size: 32, align: 32, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1166, file: !14, line: 1679, baseType: !948, size: 64, align: 32, offset: 800)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1166, file: !14, line: 1688, baseType: !938, size: 32, align: 32, offset: 864)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1166, file: !14, line: 1712, baseType: !938, size: 32, align: 32, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1166, file: !14, line: 1729, baseType: !938, size: 32, align: 32, offset: 928)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1166, file: !14, line: 1729, baseType: !938, size: 32, align: 32, offset: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1166, file: !14, line: 1744, baseType: !938, size: 32, align: 32, offset: 992)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1166, file: !14, line: 1744, baseType: !938, size: 32, align: 32, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1166, file: !14, line: 1751, baseType: !938, size: 32, align: 32, offset: 1056)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1166, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1166, file: !14, line: 1791, baseType: !1353, size: 64, align: 64, offset: 1152)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{null, !1356, !1357, !1359, !938, !938, !938}
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1166, file: !14, line: 1808, baseType: !1361, size: 64, align: 64, offset: 1216)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!473, !1356, !1063}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1166, file: !14, line: 1816, baseType: !938, size: 32, align: 32, offset: 1280)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1166, file: !14, line: 1825, baseType: !1366, size: 32, align: 32, offset: 1312)
!1366 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1166, file: !14, line: 1830, baseType: !938, size: 32, align: 32, offset: 1344)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1166, file: !14, line: 1838, baseType: !1366, size: 32, align: 32, offset: 1376)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1166, file: !14, line: 1846, baseType: !938, size: 32, align: 32, offset: 1408)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1166, file: !14, line: 1851, baseType: !938, size: 32, align: 32, offset: 1440)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1166, file: !14, line: 1861, baseType: !1366, size: 32, align: 32, offset: 1472)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1166, file: !14, line: 1868, baseType: !1366, size: 32, align: 32, offset: 1504)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1166, file: !14, line: 1875, baseType: !1366, size: 32, align: 32, offset: 1536)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1166, file: !14, line: 1882, baseType: !1366, size: 32, align: 32, offset: 1568)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1166, file: !14, line: 1889, baseType: !1366, size: 32, align: 32, offset: 1600)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1166, file: !14, line: 1896, baseType: !1366, size: 32, align: 32, offset: 1632)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1166, file: !14, line: 1903, baseType: !1366, size: 32, align: 32, offset: 1664)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1166, file: !14, line: 1910, baseType: !938, size: 32, align: 32, offset: 1696)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1166, file: !14, line: 1915, baseType: !938, size: 32, align: 32, offset: 1728)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1166, file: !14, line: 1926, baseType: !1359, size: 64, align: 64, offset: 1792)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1166, file: !14, line: 1935, baseType: !948, size: 64, align: 32, offset: 1856)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1166, file: !14, line: 1942, baseType: !938, size: 32, align: 32, offset: 1920)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1166, file: !14, line: 1948, baseType: !938, size: 32, align: 32, offset: 1952)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1166, file: !14, line: 1954, baseType: !938, size: 32, align: 32, offset: 1984)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1166, file: !14, line: 1960, baseType: !938, size: 32, align: 32, offset: 2016)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1166, file: !14, line: 1984, baseType: !938, size: 32, align: 32, offset: 2048)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1166, file: !14, line: 1991, baseType: !938, size: 32, align: 32, offset: 2080)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1166, file: !14, line: 1996, baseType: !938, size: 32, align: 32, offset: 2112)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1166, file: !14, line: 2004, baseType: !938, size: 32, align: 32, offset: 2144)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1166, file: !14, line: 2011, baseType: !938, size: 32, align: 32, offset: 2176)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1166, file: !14, line: 2018, baseType: !938, size: 32, align: 32, offset: 2208)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1166, file: !14, line: 2027, baseType: !938, size: 32, align: 32, offset: 2240)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1166, file: !14, line: 2034, baseType: !938, size: 32, align: 32, offset: 2272)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1166, file: !14, line: 2044, baseType: !938, size: 32, align: 32, offset: 2304)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1166, file: !14, line: 2054, baseType: !1396, size: 64, align: 64, offset: 2368)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1166, file: !14, line: 2061, baseType: !1396, size: 64, align: 64, offset: 2432)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1166, file: !14, line: 2066, baseType: !938, size: 32, align: 32, offset: 2496)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1166, file: !14, line: 2070, baseType: !938, size: 32, align: 32, offset: 2528)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1166, file: !14, line: 2078, baseType: !938, size: 32, align: 32, offset: 2560)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1166, file: !14, line: 2085, baseType: !938, size: 32, align: 32, offset: 2592)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1166, file: !14, line: 2092, baseType: !938, size: 32, align: 32, offset: 2624)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1166, file: !14, line: 2099, baseType: !938, size: 32, align: 32, offset: 2656)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1166, file: !14, line: 2106, baseType: !938, size: 32, align: 32, offset: 2688)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1166, file: !14, line: 2113, baseType: !938, size: 32, align: 32, offset: 2720)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1166, file: !14, line: 2120, baseType: !938, size: 32, align: 32, offset: 2752)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1166, file: !14, line: 2125, baseType: !938, size: 32, align: 32, offset: 2784)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1166, file: !14, line: 2133, baseType: !938, size: 32, align: 32, offset: 2816)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1166, file: !14, line: 2140, baseType: !938, size: 32, align: 32, offset: 2848)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1166, file: !14, line: 2145, baseType: !938, size: 32, align: 32, offset: 2880)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1166, file: !14, line: 2153, baseType: !938, size: 32, align: 32, offset: 2912)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1166, file: !14, line: 2158, baseType: !938, size: 32, align: 32, offset: 2944)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1166, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1166, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1166, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1166, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1166, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1166, file: !14, line: 2203, baseType: !938, size: 32, align: 32, offset: 3136)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1166, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1166, file: !14, line: 2212, baseType: !938, size: 32, align: 32, offset: 3200)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1166, file: !14, line: 2213, baseType: !938, size: 32, align: 32, offset: 3232)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1166, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1166, file: !14, line: 2232, baseType: !938, size: 32, align: 32, offset: 3296)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1166, file: !14, line: 2243, baseType: !938, size: 32, align: 32, offset: 3328)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1166, file: !14, line: 2249, baseType: !938, size: 32, align: 32, offset: 3360)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1166, file: !14, line: 2256, baseType: !938, size: 32, align: 32, offset: 3392)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1166, file: !14, line: 2263, baseType: !965, size: 64, align: 64, offset: 3456)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1166, file: !14, line: 2270, baseType: !965, size: 64, align: 64, offset: 3520)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1166, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1166, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1166, file: !14, line: 2367, baseType: !1432, size: 64, align: 64, offset: 3648)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!938, !1356, !925, !938}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1166, file: !14, line: 2383, baseType: !938, size: 32, align: 32, offset: 3712)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1166, file: !14, line: 2386, baseType: !1366, size: 32, align: 32, offset: 3744)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1166, file: !14, line: 2387, baseType: !1366, size: 32, align: 32, offset: 3776)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1166, file: !14, line: 2394, baseType: !938, size: 32, align: 32, offset: 3808)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1166, file: !14, line: 2401, baseType: !938, size: 32, align: 32, offset: 3840)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1166, file: !14, line: 2408, baseType: !938, size: 32, align: 32, offset: 3872)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1166, file: !14, line: 2415, baseType: !938, size: 32, align: 32, offset: 3904)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1166, file: !14, line: 2422, baseType: !938, size: 32, align: 32, offset: 3936)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1166, file: !14, line: 2423, baseType: !1444, size: 64, align: 64, offset: 3968)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1446, file: !14, line: 827, baseType: !938, size: 32, align: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1446, file: !14, line: 828, baseType: !938, size: 32, align: 32, offset: 32)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1446, file: !14, line: 829, baseType: !938, size: 32, align: 32, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1446, file: !14, line: 830, baseType: !1366, size: 32, align: 32, offset: 96)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1166, file: !14, line: 2430, baseType: !955, size: 64, align: 64, offset: 4032)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1166, file: !14, line: 2437, baseType: !955, size: 64, align: 64, offset: 4096)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1166, file: !14, line: 2444, baseType: !1366, size: 32, align: 32, offset: 4160)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1166, file: !14, line: 2451, baseType: !1366, size: 32, align: 32, offset: 4192)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1166, file: !14, line: 2458, baseType: !938, size: 32, align: 32, offset: 4224)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1166, file: !14, line: 2469, baseType: !938, size: 32, align: 32, offset: 4256)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1166, file: !14, line: 2475, baseType: !938, size: 32, align: 32, offset: 4288)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1166, file: !14, line: 2481, baseType: !938, size: 32, align: 32, offset: 4320)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1166, file: !14, line: 2485, baseType: !938, size: 32, align: 32, offset: 4352)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1166, file: !14, line: 2489, baseType: !938, size: 32, align: 32, offset: 4384)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1166, file: !14, line: 2493, baseType: !938, size: 32, align: 32, offset: 4416)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1166, file: !14, line: 2501, baseType: !938, size: 32, align: 32, offset: 4448)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1166, file: !14, line: 2506, baseType: !938, size: 32, align: 32, offset: 4480)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1166, file: !14, line: 2510, baseType: !938, size: 32, align: 32, offset: 4512)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1166, file: !14, line: 2514, baseType: !955, size: 64, align: 64, offset: 4544)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1166, file: !14, line: 2528, baseType: !1468, size: 64, align: 64, offset: 4608)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{null, !1356, !920, !938, !938}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1166, file: !14, line: 2534, baseType: !938, size: 32, align: 32, offset: 4672)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1166, file: !14, line: 2545, baseType: !938, size: 32, align: 32, offset: 4704)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1166, file: !14, line: 2547, baseType: !938, size: 32, align: 32, offset: 4736)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1166, file: !14, line: 2549, baseType: !938, size: 32, align: 32, offset: 4768)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1166, file: !14, line: 2551, baseType: !938, size: 32, align: 32, offset: 4800)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1166, file: !14, line: 2553, baseType: !938, size: 32, align: 32, offset: 4832)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1166, file: !14, line: 2555, baseType: !938, size: 32, align: 32, offset: 4864)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1166, file: !14, line: 2557, baseType: !938, size: 32, align: 32, offset: 4896)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1166, file: !14, line: 2559, baseType: !938, size: 32, align: 32, offset: 4928)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1166, file: !14, line: 2563, baseType: !938, size: 32, align: 32, offset: 4960)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1166, file: !14, line: 2571, baseType: !1482, size: 64, align: 64, offset: 4992)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1166, file: !14, line: 2579, baseType: !1482, size: 64, align: 64, offset: 5056)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1166, file: !14, line: 2586, baseType: !938, size: 32, align: 32, offset: 5120)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1166, file: !14, line: 2615, baseType: !938, size: 32, align: 32, offset: 5152)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1166, file: !14, line: 2627, baseType: !938, size: 32, align: 32, offset: 5184)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1166, file: !14, line: 2637, baseType: !938, size: 32, align: 32, offset: 5216)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1166, file: !14, line: 2681, baseType: !938, size: 32, align: 32, offset: 5248)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1166, file: !14, line: 2709, baseType: !955, size: 64, align: 64, offset: 5312)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1166, file: !14, line: 2716, baseType: !1491, size: 64, align: 64, offset: 5376)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1493)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1494)
!1494 = !{!1495, !1496, !1497, !1498, !1499, !1500, !1504, !1510, !1514, !1515, !1516, !1517, !1523, !1524, !1525, !1526, !1527}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1493, file: !14, line: 3642, baseType: !1052, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1493, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1493, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1493, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1493, file: !14, line: 3669, baseType: !938, size: 32, align: 32, offset: 160)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1493, file: !14, line: 3682, baseType: !1501, size: 64, align: 64, offset: 192)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!938, !1164, !925}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1493, file: !14, line: 3698, baseType: !1505, size: 64, align: 64, offset: 256)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!938, !1164, !1508, !922}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1493, file: !14, line: 3712, baseType: !1511, size: 64, align: 64, offset: 320)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!938, !1164, !938, !1508, !922}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1493, file: !14, line: 3726, baseType: !1505, size: 64, align: 64, offset: 384)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1493, file: !14, line: 3737, baseType: !1161, size: 64, align: 64, offset: 448)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1493, file: !14, line: 3746, baseType: !938, size: 32, align: 32, offset: 512)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1493, file: !14, line: 3757, baseType: !1518, size: 64, align: 64, offset: 576)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{null, !1521}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1493, file: !14, line: 3766, baseType: !1161, size: 64, align: 64, offset: 640)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1493, file: !14, line: 3774, baseType: !1161, size: 64, align: 64, offset: 704)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1493, file: !14, line: 3780, baseType: !938, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1493, file: !14, line: 3785, baseType: !938, size: 32, align: 32, offset: 800)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1493, file: !14, line: 3795, baseType: !1528, size: 64, align: 64, offset: 832)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!938, !1164, !976}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1166, file: !14, line: 2728, baseType: !920, size: 64, align: 64, offset: 5440)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1166, file: !14, line: 2735, baseType: !964, size: 512, align: 64, offset: 5504)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1166, file: !14, line: 2742, baseType: !938, size: 32, align: 32, offset: 6016)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1166, file: !14, line: 2755, baseType: !938, size: 32, align: 32, offset: 6048)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1166, file: !14, line: 2776, baseType: !938, size: 32, align: 32, offset: 6080)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1166, file: !14, line: 2783, baseType: !938, size: 32, align: 32, offset: 6112)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1166, file: !14, line: 2791, baseType: !938, size: 32, align: 32, offset: 6144)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1166, file: !14, line: 2802, baseType: !925, size: 64, align: 64, offset: 6208)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1166, file: !14, line: 2811, baseType: !938, size: 32, align: 32, offset: 6272)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1166, file: !14, line: 2821, baseType: !938, size: 32, align: 32, offset: 6304)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1166, file: !14, line: 2830, baseType: !938, size: 32, align: 32, offset: 6336)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1166, file: !14, line: 2840, baseType: !938, size: 32, align: 32, offset: 6368)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1166, file: !14, line: 2851, baseType: !1544, size: 64, align: 64, offset: 6400)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!938, !1356, !1547, !920, !1359, !938, !938}
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!938, !1356, !920}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1166, file: !14, line: 2871, baseType: !1551, size: 64, align: 64, offset: 6464)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!938, !1356, !1554, !920, !1359, !938}
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!938, !1356, !920, !938, !938}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1166, file: !14, line: 2878, baseType: !938, size: 32, align: 32, offset: 6528)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1166, file: !14, line: 2885, baseType: !938, size: 32, align: 32, offset: 6560)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1166, file: !14, line: 3005, baseType: !938, size: 32, align: 32, offset: 6592)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1166, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1166, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1166, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1166, file: !14, line: 3037, baseType: !931, size: 64, align: 64, offset: 6720)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1166, file: !14, line: 3038, baseType: !938, size: 32, align: 32, offset: 6784)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1166, file: !14, line: 3050, baseType: !965, size: 64, align: 64, offset: 6848)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1166, file: !14, line: 3065, baseType: !938, size: 32, align: 32, offset: 6912)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1166, file: !14, line: 3083, baseType: !938, size: 32, align: 32, offset: 6944)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1166, file: !14, line: 3092, baseType: !948, size: 64, align: 32, offset: 6976)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1166, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1166, file: !14, line: 3106, baseType: !948, size: 64, align: 32, offset: 7072)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1166, file: !14, line: 3113, baseType: !1572, size: 64, align: 64, offset: 7168)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1576)
!1576 = !{!1577, !1578, !1579, !1580, !1581, !1582, !1585}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1575, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1575, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1575, file: !14, line: 720, baseType: !1052, size: 64, align: 64, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1575, file: !14, line: 724, baseType: !1052, size: 64, align: 64, offset: 128)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1575, file: !14, line: 728, baseType: !938, size: 32, align: 32, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1575, file: !14, line: 734, baseType: !1583, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1575, file: !14, line: 739, baseType: !1586, size: 64, align: 64, offset: 320)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1166, file: !14, line: 3129, baseType: !955, size: 64, align: 64, offset: 7232)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1166, file: !14, line: 3130, baseType: !955, size: 64, align: 64, offset: 7296)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1166, file: !14, line: 3131, baseType: !955, size: 64, align: 64, offset: 7360)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1166, file: !14, line: 3132, baseType: !955, size: 64, align: 64, offset: 7424)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1166, file: !14, line: 3139, baseType: !1482, size: 64, align: 64, offset: 7488)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1166, file: !14, line: 3147, baseType: !938, size: 32, align: 32, offset: 7552)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1166, file: !14, line: 3165, baseType: !938, size: 32, align: 32, offset: 7584)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1166, file: !14, line: 3172, baseType: !938, size: 32, align: 32, offset: 7616)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1166, file: !14, line: 3180, baseType: !938, size: 32, align: 32, offset: 7648)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1166, file: !14, line: 3191, baseType: !1396, size: 64, align: 64, offset: 7680)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1166, file: !14, line: 3199, baseType: !931, size: 64, align: 64, offset: 7744)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1166, file: !14, line: 3207, baseType: !1482, size: 64, align: 64, offset: 7808)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1166, file: !14, line: 3214, baseType: !924, size: 32, align: 32, offset: 7872)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1166, file: !14, line: 3224, baseType: !1225, size: 64, align: 64, offset: 7936)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1166, file: !14, line: 3225, baseType: !938, size: 32, align: 32, offset: 8000)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1166, file: !14, line: 3249, baseType: !976, size: 64, align: 64, offset: 8064)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1166, file: !14, line: 3256, baseType: !938, size: 32, align: 32, offset: 8128)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1166, file: !14, line: 3271, baseType: !938, size: 32, align: 32, offset: 8160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1166, file: !14, line: 3279, baseType: !955, size: 64, align: 64, offset: 8192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1166, file: !14, line: 3301, baseType: !976, size: 64, align: 64, offset: 8256)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1166, file: !14, line: 3310, baseType: !938, size: 32, align: 32, offset: 8320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1166, file: !14, line: 3337, baseType: !938, size: 32, align: 32, offset: 8352)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1166, file: !14, line: 3351, baseType: !938, size: 32, align: 32, offset: 8384)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1166, file: !14, line: 3359, baseType: !938, size: 32, align: 32, offset: 8416)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1049, file: !14, line: 3535, baseType: !1613, size: 64, align: 64, offset: 1024)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!938, !1164, !1616}
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1049, file: !14, line: 3541, baseType: !1619, size: 64, align: 64, offset: 1088)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1621)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1180, line: 223, size: 128, align: 64, elements: !1623)
!1623 = !{!1624, !1625}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1622, file: !1180, line: 224, baseType: !1508, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1622, file: !1180, line: 225, baseType: !1508, size: 64, align: 64, offset: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1049, file: !14, line: 3549, baseType: !1627, size: 64, align: 64, offset: 1152)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{null, !1159}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1049, file: !14, line: 3551, baseType: !1161, size: 64, align: 64, offset: 1216)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1049, file: !14, line: 3552, baseType: !1632, size: 64, align: 64, offset: 1280)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!938, !1164, !931, !938, !1635}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643, !1667}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1637, file: !14, line: 3921, baseType: !1040, size: 16, align: 16)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1637, file: !14, line: 3922, baseType: !922, size: 32, align: 32, offset: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1637, file: !14, line: 3923, baseType: !922, size: 32, align: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1637, file: !14, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1637, file: !14, line: 3925, baseType: !1644, size: 64, align: 64, offset: 128)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1648)
!1648 = !{!1649, !1650, !1651, !1652, !1653, !1654, !1660, !1662, !1663, !1664, !1665, !1666}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1647, file: !14, line: 3886, baseType: !938, size: 32, align: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1647, file: !14, line: 3887, baseType: !938, size: 32, align: 32, offset: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1647, file: !14, line: 3888, baseType: !938, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1647, file: !14, line: 3889, baseType: !938, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1647, file: !14, line: 3890, baseType: !938, size: 32, align: 32, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1647, file: !14, line: 3897, baseType: !1655, size: 768, align: 64, offset: 192)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1656)
!1656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1657)
!1657 = !{!1658, !1659}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1656, file: !14, line: 3855, baseType: !930, size: 512, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1656, file: !14, line: 3857, baseType: !937, size: 256, align: 32, offset: 512)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1647, file: !14, line: 3903, baseType: !1661, size: 256, align: 64, offset: 960)
!1661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 256, align: 64, elements: !1196)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1647, file: !14, line: 3904, baseType: !1203, size: 128, align: 32, offset: 1216)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1647, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1647, file: !14, line: 3908, baseType: !1482, size: 64, align: 64, offset: 1408)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1647, file: !14, line: 3915, baseType: !1482, size: 64, align: 64, offset: 1472)
