; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rv40dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rv40dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RV34DSPContext = type { [4 x [16 x void (i8*, i8*, i64)*]], [4 x [16 x void (i8*, i8*, i64)*]], [3 x void (i8*, i8*, i64, i32, i32, i32)*], [3 x void (i8*, i8*, i64, i32, i32, i32)*], [2 x [2 x void (i8*, i8*, i8*, i32, i32, i64)*]], void (i16*)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i32)*, [2 x void (i8*, i64, i32, i32, i32, i32, i32, i32, i32)*], [2 x void (i8*, i64, i32, i32, i32, i32)*], [2 x i32 (i8*, i64, i32, i32, i32, i32*, i32*)*] }
%struct.H264QpelContext = type { [4 x [16 x void (i8*, i8*, i64)*]], [4 x [16 x void (i8*, i8*, i64)*]] }
%union.unaligned_32 = type { i32 }

@ff_crop_tab = external constant [2304 x i8], align 16
@rv40_bias = internal constant [4 x [4 x i32]] [[4 x i32] [i32 0, i32 16, i32 32, i32 16], [4 x i32] [i32 32, i32 28, i32 32, i32 28], [4 x i32] [i32 0, i32 32, i32 16, i32 32], [4 x i32] [i32 32, i32 28, i32 32, i32 28]], align 16
@rv40_dither_l = internal constant [16 x i8] c"@P `0P@0P@P0` P@", align 16
@rv40_dither_r = internal constant [16 x i8] c"@0` P00@@@P0 `0@", align 16

; Function Attrs: cold nounwind optsize uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !14)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rv40dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !7, line: 221, size: 32, align: 8, elements: !8)
!7 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !6, file: !7, line: 221, baseType: !10, size: 32, align: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 51, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!12 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!14 = !{!15, !22, !29}
!15 = distinct !DIGlobalVariable(name: "rv40_bias", scope: !0, file: !16, line: 287, type: !17, isLocal: true, isDefinition: true, variable: [4 x [4 x i32]]* @rv40_bias)
!16 = !DIFile(filename: "libavcodec/rv40dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, align: 32, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !{!21, !21}
!21 = !DISubrange(count: 4)
!22 = distinct !DIGlobalVariable(name: "rv40_dither_l", scope: !0, file: !16, line: 413, type: !23, isLocal: true, isDefinition: true, variable: [16 x i8]* @rv40_dither_l)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, align: 8, elements: !27)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 48, baseType: !26)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !{!28}
!28 = !DISubrange(count: 16)
!29 = distinct !DIGlobalVariable(name: "rv40_dither_r", scope: !0, file: !16, line: 421, type: !23, isLocal: true, isDefinition: true, variable: [16 x i8]* @rv40_dither_r)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!33 = distinct !DISubprogram(name: "ff_rv40dsp_init", scope: !16, file: !16, line: 620, type: !34, isLocal: false, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "RV34DSPContext", file: !38, line: 75, baseType: !39)
!38 = !DIFile(filename: "libavcodec/rv34dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RV34DSPContext", file: !38, line: 57, size: 9472, align: 64, elements: !40)
!40 = !{!41, !54, !55, !64, !65, !73, !81, !82, !87, !92, !99, !105}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_tab", scope: !39, file: !38, line: 58, baseType: !42, size: 4096, align: 64)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 4096, align: 64, elements: !53)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "qpel_mc_func", file: !44, line: 65, baseType: !45)
!44 = !DIFile(filename: "libavcodec/qpeldsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !51, line: 149, baseType: !52)
!51 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !{!21, !28}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "avg_pixels_tab", scope: !39, file: !38, line: 59, baseType: !42, size: 4096, align: 64, offset: 4096)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "put_chroma_pixels_tab", scope: !39, file: !38, line: 60, baseType: !56, size: 192, align: 64, offset: 8192)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, align: 64, elements: !62)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_chroma_mc_func", file: !58, line: 25, baseType: !59)
!58 = !DIFile(filename: "libavcodec/h264chroma.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !48, !48, !50, !19, !19, !19}
!62 = !{!63}
!63 = !DISubrange(count: 3)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "avg_chroma_pixels_tab", scope: !39, file: !38, line: 61, baseType: !56, size: 192, align: 64, offset: 8384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_weight_pixels_tab", scope: !39, file: !38, line: 67, baseType: !66, size: 256, align: 64, offset: 8576)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, align: 64, elements: !71)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_weight_func", file: !38, line: 33, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !48, !48, !48, !19, !19, !50}
!71 = !{!72, !72}
!72 = !DISubrange(count: 2)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_inv_transform", scope: !39, file: !38, line: 68, baseType: !74, size: 64, align: 64, offset: 8832)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_inv_transform_func", file: !38, line: 38, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !11, line: 37, baseType: !80)
!80 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_inv_transform_dc", scope: !39, file: !38, line: 69, baseType: !74, size: 64, align: 64, offset: 8896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_idct_add", scope: !39, file: !38, line: 70, baseType: !83, size: 64, align: 64, offset: 8960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_idct_add_func", file: !38, line: 40, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !48, !50, !78}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_idct_dc_add", scope: !39, file: !38, line: 71, baseType: !88, size: 64, align: 64, offset: 9024)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_idct_dc_add_func", file: !38, line: 41, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !48, !50, !19}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_weak_loop_filter", scope: !39, file: !38, line: 72, baseType: !93, size: 128, align: 64, offset: 9088)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, align: 64, elements: !98)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_weak_loop_filter_func", file: !38, line: 44, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !48, !50, !19, !19, !19, !19, !19, !19, !19}
!98 = !{!72}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_strong_loop_filter", scope: !39, file: !38, line: 73, baseType: !100, size: 128, align: 64, offset: 9216)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 128, align: 64, elements: !98)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_strong_loop_filter_func", file: !38, line: 49, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !48, !50, !19, !19, !19, !19}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_loop_filter_strength", scope: !39, file: !38, line: 74, baseType: !106, size: 128, align: 64, offset: 9344)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, align: 64, elements: !98)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_loop_filter_strength_func", file: !38, line: 53, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!19, !48, !50, !19, !19, !19, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!112 = !DILocalVariable(name: "c", arg: 1, scope: !33, file: !16, line: 620, type: !36)
!113 = !DIExpression()
!114 = !DILocation(line: 620, column: 60, scope: !33)
!115 = !DILocalVariable(name: "qpel", scope: !33, file: !16, line: 622, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264QpelContext", file: !117, line: 30, baseType: !118)
!117 = !DIFile(filename: "libavcodec/h264qpel.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264QpelContext", file: !117, line: 27, size: 8192, align: 64, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "put_h264_qpel_pixels_tab", scope: !118, file: !117, line: 28, baseType: !42, size: 4096, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "avg_h264_qpel_pixels_tab", scope: !118, file: !117, line: 29, baseType: !42, size: 4096, align: 64, offset: 4096)
!122 = !DILocation(line: 622, column: 21, scope: !33)
!123 = !DILocation(line: 624, column: 21, scope: !33)
!124 = !DILocation(line: 624, column: 5, scope: !33)
!125 = !DILocation(line: 625, column: 5, scope: !33)
!126 = !DILocation(line: 627, column: 37, scope: !33)
!127 = !DILocation(line: 627, column: 32, scope: !33)
!128 = !DILocation(line: 627, column: 5, scope: !33)
!129 = !DILocation(line: 627, column: 8, scope: !33)
!130 = !DILocation(line: 627, column: 30, scope: !33)
!131 = !DILocation(line: 628, column: 5, scope: !33)
!132 = !DILocation(line: 628, column: 8, scope: !33)
!133 = !DILocation(line: 628, column: 30, scope: !33)
!134 = !DILocation(line: 629, column: 37, scope: !33)
!135 = !DILocation(line: 629, column: 32, scope: !33)
!136 = !DILocation(line: 629, column: 5, scope: !33)
!137 = !DILocation(line: 629, column: 8, scope: !33)
!138 = !DILocation(line: 629, column: 30, scope: !33)
!139 = !DILocation(line: 630, column: 5, scope: !33)
!140 = !DILocation(line: 630, column: 8, scope: !33)
!141 = !DILocation(line: 630, column: 30, scope: !33)
!142 = !DILocation(line: 631, column: 5, scope: !33)
!143 = !DILocation(line: 631, column: 8, scope: !33)
!144 = !DILocation(line: 631, column: 30, scope: !33)
!145 = !DILocation(line: 632, column: 5, scope: !33)
!146 = !DILocation(line: 632, column: 8, scope: !33)
!147 = !DILocation(line: 632, column: 30, scope: !33)
!148 = !DILocation(line: 633, column: 5, scope: !33)
!149 = !DILocation(line: 633, column: 8, scope: !33)
!150 = !DILocation(line: 633, column: 30, scope: !33)
!151 = !DILocation(line: 634, column: 5, scope: !33)
!152 = !DILocation(line: 634, column: 8, scope: !33)
!153 = !DILocation(line: 634, column: 30, scope: !33)
!154 = !DILocation(line: 635, column: 37, scope: !33)
!155 = !DILocation(line: 635, column: 32, scope: !33)
!156 = !DILocation(line: 635, column: 5, scope: !33)
!157 = !DILocation(line: 635, column: 8, scope: !33)
!158 = !DILocation(line: 635, column: 30, scope: !33)
!159 = !DILocation(line: 636, column: 5, scope: !33)
!160 = !DILocation(line: 636, column: 8, scope: !33)
!161 = !DILocation(line: 636, column: 30, scope: !33)
!162 = !DILocation(line: 637, column: 5, scope: !33)
!163 = !DILocation(line: 637, column: 8, scope: !33)
!164 = !DILocation(line: 637, column: 30, scope: !33)
!165 = !DILocation(line: 638, column: 5, scope: !33)
!166 = !DILocation(line: 638, column: 8, scope: !33)
!167 = !DILocation(line: 638, column: 30, scope: !33)
!168 = !DILocation(line: 639, column: 5, scope: !33)
!169 = !DILocation(line: 639, column: 8, scope: !33)
!170 = !DILocation(line: 639, column: 30, scope: !33)
!171 = !DILocation(line: 640, column: 5, scope: !33)
!172 = !DILocation(line: 640, column: 8, scope: !33)
!173 = !DILocation(line: 640, column: 30, scope: !33)
!174 = !DILocation(line: 641, column: 5, scope: !33)
!175 = !DILocation(line: 641, column: 8, scope: !33)
!176 = !DILocation(line: 641, column: 30, scope: !33)
!177 = !DILocation(line: 642, column: 5, scope: !33)
!178 = !DILocation(line: 642, column: 8, scope: !33)
!179 = !DILocation(line: 642, column: 30, scope: !33)
!180 = !DILocation(line: 643, column: 37, scope: !33)
!181 = !DILocation(line: 643, column: 32, scope: !33)
!182 = !DILocation(line: 643, column: 5, scope: !33)
!183 = !DILocation(line: 643, column: 8, scope: !33)
!184 = !DILocation(line: 643, column: 30, scope: !33)
!185 = !DILocation(line: 644, column: 5, scope: !33)
!186 = !DILocation(line: 644, column: 8, scope: !33)
!187 = !DILocation(line: 644, column: 30, scope: !33)
!188 = !DILocation(line: 645, column: 37, scope: !33)
!189 = !DILocation(line: 645, column: 32, scope: !33)
!190 = !DILocation(line: 645, column: 5, scope: !33)
!191 = !DILocation(line: 645, column: 8, scope: !33)
!192 = !DILocation(line: 645, column: 30, scope: !33)
!193 = !DILocation(line: 646, column: 5, scope: !33)
