; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbcdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbcdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!815 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!816 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!817 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!818 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!819 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!820 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!821 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!824 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!825 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!826 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!827 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!828 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!829 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!830 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!831 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!832 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!833 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!834 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!835 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!836 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!837 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!838 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!839 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!840 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!841 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!842 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!843 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!844 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!845 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!846 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!847 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!848 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!849 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!850 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!851 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !889, file: !888, line: 85, size: 32, align: 32, elements: !928)
!888 = !DIFile(filename: "libavcodec/sbc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sbc_frame", file: !888, line: 82, size: 17280, align: 128, elements: !890)
!890 = !{!891, !895, !896, !897, !898, !903, !904, !905, !908, !909, !916, !922, !923}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !889, file: !888, line: 83, baseType: !892, size: 8, align: 8)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !893, line: 48, baseType: !894)
!893 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!894 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !889, file: !888, line: 84, baseType: !892, size: 8, align: 8, offset: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !889, file: !888, line: 90, baseType: !887, size: 32, align: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !889, file: !888, line: 91, baseType: !892, size: 8, align: 8, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !889, file: !888, line: 95, baseType: !899, size: 32, align: 32, offset: 96)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !889, file: !888, line: 92, size: 32, align: 32, elements: !900)
!900 = !{!901, !902}
!901 = !DIEnumerator(name: "LOUDNESS", value: 0)
!902 = !DIEnumerator(name: "SNR", value: 1)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "subbands", scope: !889, file: !888, line: 96, baseType: !892, size: 8, align: 8, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bitpool", scope: !889, file: !888, line: 97, baseType: !892, size: 8, align: 8, offset: 136)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "codesize", scope: !889, file: !888, line: 98, baseType: !906, size: 16, align: 16, offset: 144)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !893, line: 49, baseType: !907)
!907 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "joint", scope: !889, file: !888, line: 101, baseType: !892, size: 8, align: 8, offset: 160)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "scale_factor", scope: !889, file: !888, line: 104, baseType: !910, size: 512, align: 32, offset: 256)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 512, align: 32, elements: !913)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !893, line: 51, baseType: !912)
!912 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!913 = !{!914, !915}
!914 = !DISubrange(count: 2)
!915 = !DISubrange(count: 8)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sb_sample_f", scope: !889, file: !888, line: 107, baseType: !917, size: 8192, align: 32, offset: 768)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 8192, align: 32, elements: !920)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !893, line: 38, baseType: !919)
!919 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!920 = !{!921, !914, !915}
!921 = !DISubrange(count: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sb_sample", scope: !889, file: !888, line: 110, baseType: !917, size: 8192, align: 32, offset: 8960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "crc_ctx", scope: !889, file: !888, line: 112, baseType: !924, size: 64, align: 64, offset: 17152)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCRC", file: !927, line: 47, baseType: !911)
!927 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "MONO", value: 0)
!930 = !DIEnumerator(name: "DUAL_CHANNEL", value: 1)
!931 = !DIEnumerator(name: "STEREO", value: 2)
!932 = !DIEnumerator(name: "JOINT_STEREO", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !927, line: 49, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943}
!935 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!936 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!937 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!938 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!939 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!940 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!941 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!942 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!943 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!944 = !{!918, !945, !947}
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !893, line: 55, baseType: !946)
!946 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias16", file: !949, line: 46, baseType: !950)
!949 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !949, line: 43, size: 16, align: 16, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !950, file: !949, line: 44, baseType: !906, size: 16, align: 16)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !950, file: !949, line: 45, baseType: !954, size: 16, align: 8)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 16, align: 8, elements: !955)
!955 = !{!914}
!956 = !{!957}
!957 = distinct !DIGlobalVariable(name: "ff_sbc_decoder", scope: !0, file: !958, line: 364, type: !959, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_sbc_decoder)
!958 = !DIFile(filename: "libavcodec/sbcdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !961)
!961 = !{!962, !966, !967, !968, !969, !970, !979, !982, !985, !988, !991, !992, !1034, !1042, !1043, !1044, !1046, !1596, !1602, !1610, !1614, !1615, !1652, !1656, !1660, !1661, !1665, !1669, !1670, !1674, !1675, !1676}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !960, file: !14, line: 3475, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !960, file: !14, line: 3480, baseType: !963, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !960, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !960, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !960, file: !14, line: 3487, baseType: !919, size: 32, align: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !960, file: !14, line: 3488, baseType: !971, size: 64, align: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !974, line: 61, baseType: !975)
!974 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !974, line: 58, size: 64, align: 32, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !975, file: !974, line: 59, baseType: !919, size: 32, align: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !975, file: !974, line: 60, baseType: !919, size: 32, align: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !960, file: !14, line: 3489, baseType: !980, size: 64, align: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !960, file: !14, line: 3490, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !960, file: !14, line: 3491, baseType: !986, size: 64, align: 64, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !960, file: !14, line: 3492, baseType: !989, size: 64, align: 64, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !960, file: !14, line: 3493, baseType: !892, size: 8, align: 8, offset: 576)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !960, file: !14, line: 3494, baseType: !993, size: 64, align: 64, offset: 640)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !997)
!997 = !{!998, !999, !1004, !1008, !1009, !1010, !1011, !1015, !1021, !1023, !1027}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !996, file: !691, line: 72, baseType: !963, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !996, file: !691, line: 78, baseType: !1000, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!963, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !996, file: !691, line: 85, baseType: !1005, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !996, file: !691, line: 93, baseType: !919, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !996, file: !691, line: 99, baseType: !919, size: 32, align: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !996, file: !691, line: 108, baseType: !919, size: 32, align: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !996, file: !691, line: 113, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1003, !1003, !1003}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !996, file: !691, line: 123, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !996, file: !691, line: 130, baseType: !1022, size: 32, align: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !996, file: !691, line: 136, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1022, !1003}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !996, file: !691, line: 142, baseType: !1028, size: 64, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!919, !1031, !1003, !963, !919}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !960, file: !14, line: 3495, baseType: !1035, size: 64, align: 64, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1038, file: !14, line: 3402, baseType: !919, size: 32, align: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !14, line: 3403, baseType: !963, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !960, file: !14, line: 3507, baseType: !963, size: 64, align: 64, offset: 768)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !960, file: !14, line: 3516, baseType: !919, size: 32, align: 32, offset: 832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !14, line: 3517, baseType: !1045, size: 64, align: 64, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !960, file: !14, line: 3527, baseType: !1047, size: 64, align: 64, offset: 960)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!919, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1060, !1061, !1062, !1063, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1344, !1348, !1349, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1534, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1052, file: !14, line: 1561, baseType: !993, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1052, file: !14, line: 1562, baseType: !919, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1052, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1052, file: !14, line: 1565, baseType: !1058, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1052, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1052, file: !14, line: 1581, baseType: !912, size: 32, align: 32, offset: 224)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1052, file: !14, line: 1583, baseType: !1003, size: 64, align: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1052, file: !14, line: 1591, baseType: !1064, size: 64, align: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1066, line: 129, size: 1664, align: 64, elements: !1067)
!1066 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1067 = !{!1068, !1069, !1070, !1071, !1170, !1191, !1192, !1221, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1065, file: !1066, line: 136, baseType: !919, size: 32, align: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1065, file: !1066, line: 151, baseType: !919, size: 32, align: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1065, file: !1066, line: 157, baseType: !919, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1065, file: !1066, line: 159, baseType: !1072, size: 64, align: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1075)
!1075 = !{!1076, !1080, !1082, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1122, !1124, !1125, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1158, !1159, !1160, !1161, !1162, !1163, !1166, !1167, !1168, !1169}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1074, file: !722, line: 282, baseType: !1077, size: 512, align: 64)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 512, align: 64, elements: !1079)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64, align: 64)
!1079 = !{!915}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1074, file: !722, line: 299, baseType: !1081, size: 256, align: 32, offset: 512)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 256, align: 32, elements: !1079)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1074, file: !722, line: 315, baseType: !1083, size: 64, align: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1074, file: !722, line: 326, baseType: !919, size: 32, align: 32, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1074, file: !722, line: 326, baseType: !919, size: 32, align: 32, offset: 864)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1074, file: !722, line: 334, baseType: !919, size: 32, align: 32, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1074, file: !722, line: 341, baseType: !919, size: 32, align: 32, offset: 928)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1074, file: !722, line: 346, baseType: !919, size: 32, align: 32, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1074, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1074, file: !722, line: 356, baseType: !973, size: 64, align: 32, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1074, file: !722, line: 361, baseType: !1092, size: 64, align: 64, offset: 1088)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !893, line: 40, baseType: !1093)
!1093 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1074, file: !722, line: 369, baseType: !1092, size: 64, align: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1074, file: !722, line: 377, baseType: !1092, size: 64, align: 64, offset: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1074, file: !722, line: 382, baseType: !919, size: 32, align: 32, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1074, file: !722, line: 386, baseType: !919, size: 32, align: 32, offset: 1312)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1074, file: !722, line: 391, baseType: !919, size: 32, align: 32, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1074, file: !722, line: 396, baseType: !1003, size: 64, align: 64, offset: 1408)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1074, file: !722, line: 403, baseType: !1101, size: 512, align: 64, offset: 1472)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 64, elements: !1079)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1074, file: !722, line: 410, baseType: !919, size: 32, align: 32, offset: 1984)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1074, file: !722, line: 415, baseType: !919, size: 32, align: 32, offset: 2016)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1074, file: !722, line: 420, baseType: !919, size: 32, align: 32, offset: 2048)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1074, file: !722, line: 425, baseType: !919, size: 32, align: 32, offset: 2080)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1074, file: !722, line: 435, baseType: !1092, size: 64, align: 64, offset: 2112)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1074, file: !722, line: 440, baseType: !919, size: 32, align: 32, offset: 2176)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1074, file: !722, line: 445, baseType: !945, size: 64, align: 64, offset: 2240)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1074, file: !722, line: 459, baseType: !1110, size: 512, align: 64, offset: 2304)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1079)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1113, line: 94, baseType: !1114)
!1113 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1113, line: 81, size: 192, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1121}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1114, file: !1113, line: 82, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1113, line: 73, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1113, line: 73, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !1113, line: 89, baseType: !1078, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1113, line: 93, baseType: !919, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1074, file: !722, line: 473, baseType: !1123, size: 64, align: 64, offset: 2816)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1074, file: !722, line: 477, baseType: !919, size: 32, align: 32, offset: 2880)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1074, file: !722, line: 479, baseType: !1126, size: 64, align: 64, offset: 2944)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1139}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !722, line: 203, baseType: !1078, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !722, line: 204, baseType: !919, size: 32, align: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1129, file: !722, line: 205, baseType: !1135, size: 64, align: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1137, line: 86, baseType: !1138)
!1137 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1137, line: 86, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1129, file: !722, line: 206, baseType: !1111, size: 64, align: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1074, file: !722, line: 480, baseType: !919, size: 32, align: 32, offset: 3008)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1074, file: !722, line: 505, baseType: !919, size: 32, align: 32, offset: 3040)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1074, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1074, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1074, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1074, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1074, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1074, file: !722, line: 532, baseType: !1092, size: 64, align: 64, offset: 3264)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1074, file: !722, line: 539, baseType: !1092, size: 64, align: 64, offset: 3328)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1074, file: !722, line: 547, baseType: !1092, size: 64, align: 64, offset: 3392)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1074, file: !722, line: 554, baseType: !1135, size: 64, align: 64, offset: 3456)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1074, file: !722, line: 563, baseType: !919, size: 32, align: 32, offset: 3520)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1074, file: !722, line: 572, baseType: !919, size: 32, align: 32, offset: 3552)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1074, file: !722, line: 581, baseType: !919, size: 32, align: 32, offset: 3584)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1074, file: !722, line: 588, baseType: !1155, size: 64, align: 64, offset: 3648)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !893, line: 36, baseType: !1157)
!1157 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1074, file: !722, line: 593, baseType: !919, size: 32, align: 32, offset: 3712)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1074, file: !722, line: 596, baseType: !919, size: 32, align: 32, offset: 3744)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1074, file: !722, line: 599, baseType: !1111, size: 64, align: 64, offset: 3776)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1074, file: !722, line: 605, baseType: !1111, size: 64, align: 64, offset: 3840)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1074, file: !722, line: 616, baseType: !1111, size: 64, align: 64, offset: 3904)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1074, file: !722, line: 626, baseType: !1164, size: 64, align: 64, offset: 3968)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1165, line: 216, baseType: !946)
!1165 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1074, file: !722, line: 627, baseType: !1164, size: 64, align: 64, offset: 4032)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1074, file: !722, line: 628, baseType: !1164, size: 64, align: 64, offset: 4096)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1074, file: !722, line: 629, baseType: !1164, size: 64, align: 64, offset: 4160)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1074, file: !722, line: 645, baseType: !1111, size: 64, align: 64, offset: 4224)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1065, file: !1066, line: 161, baseType: !1171, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1066, line: 117, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1066, line: 100, size: 832, align: 64, elements: !1174)
!1174 = !{!1175, !1182, !1183, !1184, !1185, !1186, !1188, !1189, !1190}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1173, file: !1066, line: 105, baseType: !1176, size: 256, align: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1177, size: 256, align: 64, elements: !1180)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1113, line: 238, baseType: !1179)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1113, line: 238, flags: DIFlagFwdDecl)
!1180 = !{!1181}
!1181 = !DISubrange(count: 4)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1173, file: !1066, line: 110, baseType: !919, size: 32, align: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1173, file: !1066, line: 111, baseType: !919, size: 32, align: 32, offset: 288)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1173, file: !1066, line: 111, baseType: !919, size: 32, align: 32, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1173, file: !1066, line: 112, baseType: !1081, size: 256, align: 32, offset: 352)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1173, file: !1066, line: 113, baseType: !1187, size: 128, align: 32, offset: 608)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 128, align: 32, elements: !1180)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1173, file: !1066, line: 114, baseType: !919, size: 32, align: 32, offset: 736)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1173, file: !1066, line: 115, baseType: !919, size: 32, align: 32, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1173, file: !1066, line: 116, baseType: !919, size: 32, align: 32, offset: 800)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1065, file: !1066, line: 163, baseType: !1003, size: 64, align: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1065, file: !1066, line: 165, baseType: !1193, size: 128, align: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1066, line: 122, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1066, line: 119, size: 128, align: 64, elements: !1195)
!1195 = !{!1196, !1220}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1194, file: !1066, line: 120, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1216, !1217, !1218, !1219}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1199, file: !14, line: 1451, baseType: !1111, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1199, file: !14, line: 1461, baseType: !1092, size: 64, align: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1199, file: !14, line: 1467, baseType: !1092, size: 64, align: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !14, line: 1468, baseType: !1078, size: 64, align: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1199, file: !14, line: 1469, baseType: !919, size: 32, align: 32, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1199, file: !14, line: 1470, baseType: !919, size: 32, align: 32, offset: 288)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !14, line: 1474, baseType: !919, size: 32, align: 32, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1199, file: !14, line: 1479, baseType: !1209, size: 64, align: 64, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !14, line: 1412, baseType: !1078, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !14, line: 1413, baseType: !919, size: 32, align: 32, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1211, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1199, file: !14, line: 1480, baseType: !919, size: 32, align: 32, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1199, file: !14, line: 1486, baseType: !1092, size: 64, align: 64, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1199, file: !14, line: 1488, baseType: !1092, size: 64, align: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1199, file: !14, line: 1497, baseType: !1092, size: 64, align: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1194, file: !1066, line: 121, baseType: !1072, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1065, file: !1066, line: 166, baseType: !1222, size: 128, align: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1066, line: 127, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1066, line: 124, size: 128, align: 64, elements: !1224)
!1224 = !{!1225, !1298}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1223, file: !1066, line: 125, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1256, !1260, !1261, !1295, !1296, !1297}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1229, file: !14, line: 5751, baseType: !993, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1229, file: !14, line: 5756, baseType: !1233, size: 64, align: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1241, !1242, !1243, !1247, !1251, !1255}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1235, file: !14, line: 5797, baseType: !963, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1235, file: !14, line: 5804, baseType: !1239, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1235, file: !14, line: 5815, baseType: !993, size: 64, align: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1235, file: !14, line: 5825, baseType: !919, size: 32, align: 32, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1235, file: !14, line: 5826, baseType: !1244, size: 64, align: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!919, !1227}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1235, file: !14, line: 5827, baseType: !1248, size: 64, align: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!919, !1227, !1197}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1235, file: !14, line: 5828, baseType: !1252, size: 64, align: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !1227}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1235, file: !14, line: 5829, baseType: !1252, size: 64, align: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1229, file: !14, line: 5762, baseType: !1257, size: 64, align: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1259)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1229, file: !14, line: 5768, baseType: !1003, size: 64, align: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1229, file: !14, line: 5775, baseType: !1262, size: 64, align: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1264, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1264, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1264, file: !14, line: 3948, baseType: !911, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1264, file: !14, line: 3958, baseType: !1078, size: 64, align: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1264, file: !14, line: 3962, baseType: !919, size: 32, align: 32, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1264, file: !14, line: 3968, baseType: !919, size: 32, align: 32, offset: 224)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1264, file: !14, line: 3973, baseType: !1092, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1264, file: !14, line: 3986, baseType: !919, size: 32, align: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1264, file: !14, line: 3999, baseType: !919, size: 32, align: 32, offset: 352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1264, file: !14, line: 4004, baseType: !919, size: 32, align: 32, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1264, file: !14, line: 4005, baseType: !919, size: 32, align: 32, offset: 416)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1264, file: !14, line: 4010, baseType: !919, size: 32, align: 32, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1264, file: !14, line: 4011, baseType: !919, size: 32, align: 32, offset: 480)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1264, file: !14, line: 4020, baseType: !973, size: 64, align: 32, offset: 512)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1264, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1264, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1264, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1264, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1264, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1264, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1264, file: !14, line: 4039, baseType: !919, size: 32, align: 32, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1264, file: !14, line: 4046, baseType: !945, size: 64, align: 64, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1264, file: !14, line: 4050, baseType: !919, size: 32, align: 32, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1264, file: !14, line: 4054, baseType: !919, size: 32, align: 32, offset: 928)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1264, file: !14, line: 4061, baseType: !919, size: 32, align: 32, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1264, file: !14, line: 4065, baseType: !919, size: 32, align: 32, offset: 992)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1264, file: !14, line: 4073, baseType: !919, size: 32, align: 32, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1264, file: !14, line: 4080, baseType: !919, size: 32, align: 32, offset: 1056)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1264, file: !14, line: 4084, baseType: !919, size: 32, align: 32, offset: 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1229, file: !14, line: 5781, baseType: !1262, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1229, file: !14, line: 5787, baseType: !973, size: 64, align: 32, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1229, file: !14, line: 5793, baseType: !973, size: 64, align: 32, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1223, file: !1066, line: 126, baseType: !919, size: 32, align: 32, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1065, file: !1066, line: 172, baseType: !1197, size: 64, align: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1065, file: !1066, line: 177, baseType: !1078, size: 64, align: 64, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1065, file: !1066, line: 178, baseType: !912, size: 32, align: 32, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1065, file: !1066, line: 180, baseType: !1003, size: 64, align: 64, offset: 768)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1065, file: !1066, line: 185, baseType: !919, size: 32, align: 32, offset: 832)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1065, file: !1066, line: 190, baseType: !1003, size: 64, align: 64, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1065, file: !1066, line: 195, baseType: !919, size: 32, align: 32, offset: 960)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1065, file: !1066, line: 200, baseType: !1197, size: 64, align: 64, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1065, file: !1066, line: 201, baseType: !919, size: 32, align: 32, offset: 1088)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1065, file: !1066, line: 202, baseType: !1072, size: 64, align: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1065, file: !1066, line: 203, baseType: !919, size: 32, align: 32, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1065, file: !1066, line: 205, baseType: !919, size: 32, align: 32, offset: 1248)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1065, file: !1066, line: 206, baseType: !919, size: 32, align: 32, offset: 1280)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1065, file: !1066, line: 209, baseType: !1164, size: 64, align: 64, offset: 1344)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1065, file: !1066, line: 212, baseType: !1164, size: 64, align: 64, offset: 1408)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1065, file: !1066, line: 213, baseType: !1072, size: 64, align: 64, offset: 1472)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1065, file: !1066, line: 215, baseType: !919, size: 32, align: 32, offset: 1536)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1065, file: !1066, line: 217, baseType: !919, size: 32, align: 32, offset: 1568)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1065, file: !1066, line: 220, baseType: !919, size: 32, align: 32, offset: 1600)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1052, file: !14, line: 1598, baseType: !1003, size: 64, align: 64, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1052, file: !14, line: 1606, baseType: !1092, size: 64, align: 64, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1052, file: !14, line: 1614, baseType: !919, size: 32, align: 32, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1052, file: !14, line: 1622, baseType: !919, size: 32, align: 32, offset: 544)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1052, file: !14, line: 1628, baseType: !919, size: 32, align: 32, offset: 576)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !14, line: 1636, baseType: !919, size: 32, align: 32, offset: 608)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1052, file: !14, line: 1643, baseType: !919, size: 32, align: 32, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1052, file: !14, line: 1657, baseType: !1078, size: 64, align: 64, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1052, file: !14, line: 1658, baseType: !919, size: 32, align: 32, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1052, file: !14, line: 1679, baseType: !973, size: 64, align: 32, offset: 800)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1052, file: !14, line: 1688, baseType: !919, size: 32, align: 32, offset: 864)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1052, file: !14, line: 1712, baseType: !919, size: 32, align: 32, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1052, file: !14, line: 1729, baseType: !919, size: 32, align: 32, offset: 928)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1052, file: !14, line: 1729, baseType: !919, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1052, file: !14, line: 1744, baseType: !919, size: 32, align: 32, offset: 992)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1052, file: !14, line: 1744, baseType: !919, size: 32, align: 32, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1052, file: !14, line: 1751, baseType: !919, size: 32, align: 32, offset: 1056)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1052, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1052, file: !14, line: 1791, baseType: !1337, size: 64, align: 64, offset: 1152)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !1340, !1341, !1343, !919, !919, !919}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1052, file: !14, line: 1808, baseType: !1345, size: 64, align: 64, offset: 1216)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!473, !1340, !980}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1052, file: !14, line: 1816, baseType: !919, size: 32, align: 32, offset: 1280)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1052, file: !14, line: 1825, baseType: !1350, size: 32, align: 32, offset: 1312)
!1350 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1052, file: !14, line: 1830, baseType: !919, size: 32, align: 32, offset: 1344)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1052, file: !14, line: 1838, baseType: !1350, size: 32, align: 32, offset: 1376)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1052, file: !14, line: 1846, baseType: !919, size: 32, align: 32, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1052, file: !14, line: 1851, baseType: !919, size: 32, align: 32, offset: 1440)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1052, file: !14, line: 1861, baseType: !1350, size: 32, align: 32, offset: 1472)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1052, file: !14, line: 1868, baseType: !1350, size: 32, align: 32, offset: 1504)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1052, file: !14, line: 1875, baseType: !1350, size: 32, align: 32, offset: 1536)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1052, file: !14, line: 1882, baseType: !1350, size: 32, align: 32, offset: 1568)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1052, file: !14, line: 1889, baseType: !1350, size: 32, align: 32, offset: 1600)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1052, file: !14, line: 1896, baseType: !1350, size: 32, align: 32, offset: 1632)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1052, file: !14, line: 1903, baseType: !1350, size: 32, align: 32, offset: 1664)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1052, file: !14, line: 1910, baseType: !919, size: 32, align: 32, offset: 1696)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1052, file: !14, line: 1915, baseType: !919, size: 32, align: 32, offset: 1728)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1052, file: !14, line: 1926, baseType: !1343, size: 64, align: 64, offset: 1792)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1052, file: !14, line: 1935, baseType: !973, size: 64, align: 32, offset: 1856)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1052, file: !14, line: 1942, baseType: !919, size: 32, align: 32, offset: 1920)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1052, file: !14, line: 1948, baseType: !919, size: 32, align: 32, offset: 1952)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1052, file: !14, line: 1954, baseType: !919, size: 32, align: 32, offset: 1984)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1052, file: !14, line: 1960, baseType: !919, size: 32, align: 32, offset: 2016)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1052, file: !14, line: 1984, baseType: !919, size: 32, align: 32, offset: 2048)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1052, file: !14, line: 1991, baseType: !919, size: 32, align: 32, offset: 2080)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1052, file: !14, line: 1996, baseType: !919, size: 32, align: 32, offset: 2112)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1052, file: !14, line: 2004, baseType: !919, size: 32, align: 32, offset: 2144)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1052, file: !14, line: 2011, baseType: !919, size: 32, align: 32, offset: 2176)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1052, file: !14, line: 2018, baseType: !919, size: 32, align: 32, offset: 2208)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1052, file: !14, line: 2027, baseType: !919, size: 32, align: 32, offset: 2240)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1052, file: !14, line: 2034, baseType: !919, size: 32, align: 32, offset: 2272)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1052, file: !14, line: 2044, baseType: !919, size: 32, align: 32, offset: 2304)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1052, file: !14, line: 2054, baseType: !1380, size: 64, align: 64, offset: 2368)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1052, file: !14, line: 2061, baseType: !1380, size: 64, align: 64, offset: 2432)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1052, file: !14, line: 2066, baseType: !919, size: 32, align: 32, offset: 2496)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1052, file: !14, line: 2070, baseType: !919, size: 32, align: 32, offset: 2528)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1052, file: !14, line: 2078, baseType: !919, size: 32, align: 32, offset: 2560)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1052, file: !14, line: 2085, baseType: !919, size: 32, align: 32, offset: 2592)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1052, file: !14, line: 2092, baseType: !919, size: 32, align: 32, offset: 2624)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1052, file: !14, line: 2099, baseType: !919, size: 32, align: 32, offset: 2656)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1052, file: !14, line: 2106, baseType: !919, size: 32, align: 32, offset: 2688)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1052, file: !14, line: 2113, baseType: !919, size: 32, align: 32, offset: 2720)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1052, file: !14, line: 2120, baseType: !919, size: 32, align: 32, offset: 2752)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1052, file: !14, line: 2125, baseType: !919, size: 32, align: 32, offset: 2784)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1052, file: !14, line: 2133, baseType: !919, size: 32, align: 32, offset: 2816)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1052, file: !14, line: 2140, baseType: !919, size: 32, align: 32, offset: 2848)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1052, file: !14, line: 2145, baseType: !919, size: 32, align: 32, offset: 2880)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1052, file: !14, line: 2153, baseType: !919, size: 32, align: 32, offset: 2912)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1052, file: !14, line: 2158, baseType: !919, size: 32, align: 32, offset: 2944)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1052, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1052, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1052, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1052, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1052, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1052, file: !14, line: 2203, baseType: !919, size: 32, align: 32, offset: 3136)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1052, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1052, file: !14, line: 2212, baseType: !919, size: 32, align: 32, offset: 3200)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1052, file: !14, line: 2213, baseType: !919, size: 32, align: 32, offset: 3232)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1052, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1052, file: !14, line: 2232, baseType: !919, size: 32, align: 32, offset: 3296)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1052, file: !14, line: 2243, baseType: !919, size: 32, align: 32, offset: 3328)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1052, file: !14, line: 2249, baseType: !919, size: 32, align: 32, offset: 3360)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1052, file: !14, line: 2256, baseType: !919, size: 32, align: 32, offset: 3392)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1052, file: !14, line: 2263, baseType: !945, size: 64, align: 64, offset: 3456)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1052, file: !14, line: 2270, baseType: !945, size: 64, align: 64, offset: 3520)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1052, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1052, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1052, file: !14, line: 2367, baseType: !1416, size: 64, align: 64, offset: 3648)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!919, !1340, !1072, !919}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1052, file: !14, line: 2383, baseType: !919, size: 32, align: 32, offset: 3712)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1052, file: !14, line: 2386, baseType: !1350, size: 32, align: 32, offset: 3744)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1052, file: !14, line: 2387, baseType: !1350, size: 32, align: 32, offset: 3776)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1052, file: !14, line: 2394, baseType: !919, size: 32, align: 32, offset: 3808)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1052, file: !14, line: 2401, baseType: !919, size: 32, align: 32, offset: 3840)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1052, file: !14, line: 2408, baseType: !919, size: 32, align: 32, offset: 3872)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1052, file: !14, line: 2415, baseType: !919, size: 32, align: 32, offset: 3904)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1052, file: !14, line: 2422, baseType: !919, size: 32, align: 32, offset: 3936)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1052, file: !14, line: 2423, baseType: !1428, size: 64, align: 64, offset: 3968)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1430, file: !14, line: 827, baseType: !919, size: 32, align: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1430, file: !14, line: 828, baseType: !919, size: 32, align: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1430, file: !14, line: 829, baseType: !919, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1430, file: !14, line: 830, baseType: !1350, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1052, file: !14, line: 2430, baseType: !1092, size: 64, align: 64, offset: 4032)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1052, file: !14, line: 2437, baseType: !1092, size: 64, align: 64, offset: 4096)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1052, file: !14, line: 2444, baseType: !1350, size: 32, align: 32, offset: 4160)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1052, file: !14, line: 2451, baseType: !1350, size: 32, align: 32, offset: 4192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1052, file: !14, line: 2458, baseType: !919, size: 32, align: 32, offset: 4224)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1052, file: !14, line: 2469, baseType: !919, size: 32, align: 32, offset: 4256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1052, file: !14, line: 2475, baseType: !919, size: 32, align: 32, offset: 4288)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1052, file: !14, line: 2481, baseType: !919, size: 32, align: 32, offset: 4320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1052, file: !14, line: 2485, baseType: !919, size: 32, align: 32, offset: 4352)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1052, file: !14, line: 2489, baseType: !919, size: 32, align: 32, offset: 4384)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1052, file: !14, line: 2493, baseType: !919, size: 32, align: 32, offset: 4416)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1052, file: !14, line: 2501, baseType: !919, size: 32, align: 32, offset: 4448)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1052, file: !14, line: 2506, baseType: !919, size: 32, align: 32, offset: 4480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1052, file: !14, line: 2510, baseType: !919, size: 32, align: 32, offset: 4512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1052, file: !14, line: 2514, baseType: !1092, size: 64, align: 64, offset: 4544)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1052, file: !14, line: 2528, baseType: !1452, size: 64, align: 64, offset: 4608)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !1340, !1003, !919, !919}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1052, file: !14, line: 2534, baseType: !919, size: 32, align: 32, offset: 4672)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1052, file: !14, line: 2545, baseType: !919, size: 32, align: 32, offset: 4704)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1052, file: !14, line: 2547, baseType: !919, size: 32, align: 32, offset: 4736)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1052, file: !14, line: 2549, baseType: !919, size: 32, align: 32, offset: 4768)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1052, file: !14, line: 2551, baseType: !919, size: 32, align: 32, offset: 4800)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1052, file: !14, line: 2553, baseType: !919, size: 32, align: 32, offset: 4832)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1052, file: !14, line: 2555, baseType: !919, size: 32, align: 32, offset: 4864)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1052, file: !14, line: 2557, baseType: !919, size: 32, align: 32, offset: 4896)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1052, file: !14, line: 2559, baseType: !919, size: 32, align: 32, offset: 4928)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1052, file: !14, line: 2563, baseType: !919, size: 32, align: 32, offset: 4960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1052, file: !14, line: 2571, baseType: !1466, size: 64, align: 64, offset: 4992)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1052, file: !14, line: 2579, baseType: !1466, size: 64, align: 64, offset: 5056)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1052, file: !14, line: 2586, baseType: !919, size: 32, align: 32, offset: 5120)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1052, file: !14, line: 2615, baseType: !919, size: 32, align: 32, offset: 5152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1052, file: !14, line: 2627, baseType: !919, size: 32, align: 32, offset: 5184)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1052, file: !14, line: 2637, baseType: !919, size: 32, align: 32, offset: 5216)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1052, file: !14, line: 2681, baseType: !919, size: 32, align: 32, offset: 5248)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1052, file: !14, line: 2709, baseType: !1092, size: 64, align: 64, offset: 5312)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1052, file: !14, line: 2716, baseType: !1475, size: 64, align: 64, offset: 5376)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1477)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1478)
!1478 = !{!1479, !1480, !1481, !1482, !1483, !1484, !1488, !1494, !1498, !1499, !1500, !1501, !1507, !1508, !1509, !1510, !1511}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1477, file: !14, line: 3642, baseType: !963, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1477, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1477, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1477, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1477, file: !14, line: 3669, baseType: !919, size: 32, align: 32, offset: 160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1477, file: !14, line: 3682, baseType: !1485, size: 64, align: 64, offset: 192)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!919, !1050, !1072}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1477, file: !14, line: 3698, baseType: !1489, size: 64, align: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!919, !1050, !1492, !911}
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1477, file: !14, line: 3712, baseType: !1495, size: 64, align: 64, offset: 320)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!919, !1050, !919, !1492, !911}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1477, file: !14, line: 3726, baseType: !1489, size: 64, align: 64, offset: 384)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1477, file: !14, line: 3737, baseType: !1047, size: 64, align: 64, offset: 448)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1477, file: !14, line: 3746, baseType: !919, size: 32, align: 32, offset: 512)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1477, file: !14, line: 3757, baseType: !1502, size: 64, align: 64, offset: 576)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{null, !1505}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1477, file: !14, line: 3766, baseType: !1047, size: 64, align: 64, offset: 640)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1477, file: !14, line: 3774, baseType: !1047, size: 64, align: 64, offset: 704)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1477, file: !14, line: 3780, baseType: !919, size: 32, align: 32, offset: 768)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1477, file: !14, line: 3785, baseType: !919, size: 32, align: 32, offset: 800)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1477, file: !14, line: 3795, baseType: !1512, size: 64, align: 64, offset: 832)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!919, !1050, !1111}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1052, file: !14, line: 2728, baseType: !1003, size: 64, align: 64, offset: 5440)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1052, file: !14, line: 2735, baseType: !1101, size: 512, align: 64, offset: 5504)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1052, file: !14, line: 2742, baseType: !919, size: 32, align: 32, offset: 6016)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1052, file: !14, line: 2755, baseType: !919, size: 32, align: 32, offset: 6048)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1052, file: !14, line: 2776, baseType: !919, size: 32, align: 32, offset: 6080)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1052, file: !14, line: 2783, baseType: !919, size: 32, align: 32, offset: 6112)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1052, file: !14, line: 2791, baseType: !919, size: 32, align: 32, offset: 6144)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1052, file: !14, line: 2802, baseType: !1072, size: 64, align: 64, offset: 6208)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1052, file: !14, line: 2811, baseType: !919, size: 32, align: 32, offset: 6272)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1052, file: !14, line: 2821, baseType: !919, size: 32, align: 32, offset: 6304)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1052, file: !14, line: 2830, baseType: !919, size: 32, align: 32, offset: 6336)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1052, file: !14, line: 2840, baseType: !919, size: 32, align: 32, offset: 6368)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1052, file: !14, line: 2851, baseType: !1528, size: 64, align: 64, offset: 6400)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!919, !1340, !1531, !1003, !1343, !919, !919}
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!919, !1340, !1003}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1052, file: !14, line: 2871, baseType: !1535, size: 64, align: 64, offset: 6464)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!919, !1340, !1538, !1003, !1343, !919}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!919, !1340, !1003, !919, !919}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1052, file: !14, line: 2878, baseType: !919, size: 32, align: 32, offset: 6528)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1052, file: !14, line: 2885, baseType: !919, size: 32, align: 32, offset: 6560)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1052, file: !14, line: 3005, baseType: !919, size: 32, align: 32, offset: 6592)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1052, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1052, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1052, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1052, file: !14, line: 3037, baseType: !1078, size: 64, align: 64, offset: 6720)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1052, file: !14, line: 3038, baseType: !919, size: 32, align: 32, offset: 6784)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1052, file: !14, line: 3050, baseType: !945, size: 64, align: 64, offset: 6848)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1052, file: !14, line: 3065, baseType: !919, size: 32, align: 32, offset: 6912)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1052, file: !14, line: 3083, baseType: !919, size: 32, align: 32, offset: 6944)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1052, file: !14, line: 3092, baseType: !973, size: 64, align: 32, offset: 6976)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1052, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1052, file: !14, line: 3106, baseType: !973, size: 64, align: 32, offset: 7072)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1052, file: !14, line: 3113, baseType: !1556, size: 64, align: 64, offset: 7168)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1558)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1560)
!1560 = !{!1561, !1562, !1563, !1564, !1565, !1566, !1569}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1559, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1559, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1559, file: !14, line: 720, baseType: !963, size: 64, align: 64, offset: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1559, file: !14, line: 724, baseType: !963, size: 64, align: 64, offset: 128)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1559, file: !14, line: 728, baseType: !919, size: 32, align: 32, offset: 192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1559, file: !14, line: 734, baseType: !1567, size: 64, align: 64, offset: 256)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1559, file: !14, line: 739, baseType: !1570, size: 64, align: 64, offset: 320)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1052, file: !14, line: 3129, baseType: !1092, size: 64, align: 64, offset: 7232)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1052, file: !14, line: 3130, baseType: !1092, size: 64, align: 64, offset: 7296)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1052, file: !14, line: 3131, baseType: !1092, size: 64, align: 64, offset: 7360)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1052, file: !14, line: 3132, baseType: !1092, size: 64, align: 64, offset: 7424)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1052, file: !14, line: 3139, baseType: !1466, size: 64, align: 64, offset: 7488)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1052, file: !14, line: 3147, baseType: !919, size: 32, align: 32, offset: 7552)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1052, file: !14, line: 3165, baseType: !919, size: 32, align: 32, offset: 7584)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1052, file: !14, line: 3172, baseType: !919, size: 32, align: 32, offset: 7616)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1052, file: !14, line: 3180, baseType: !919, size: 32, align: 32, offset: 7648)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1052, file: !14, line: 3191, baseType: !1380, size: 64, align: 64, offset: 7680)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1052, file: !14, line: 3199, baseType: !1078, size: 64, align: 64, offset: 7744)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1052, file: !14, line: 3207, baseType: !1466, size: 64, align: 64, offset: 7808)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1052, file: !14, line: 3214, baseType: !912, size: 32, align: 32, offset: 7872)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1052, file: !14, line: 3224, baseType: !1209, size: 64, align: 64, offset: 7936)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1052, file: !14, line: 3225, baseType: !919, size: 32, align: 32, offset: 8000)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1052, file: !14, line: 3249, baseType: !1111, size: 64, align: 64, offset: 8064)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1052, file: !14, line: 3256, baseType: !919, size: 32, align: 32, offset: 8128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1052, file: !14, line: 3271, baseType: !919, size: 32, align: 32, offset: 8160)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1052, file: !14, line: 3279, baseType: !1092, size: 64, align: 64, offset: 8192)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1052, file: !14, line: 3301, baseType: !1111, size: 64, align: 64, offset: 8256)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1052, file: !14, line: 3310, baseType: !919, size: 32, align: 32, offset: 8320)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1052, file: !14, line: 3337, baseType: !919, size: 32, align: 32, offset: 8352)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1052, file: !14, line: 3351, baseType: !919, size: 32, align: 32, offset: 8384)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1052, file: !14, line: 3359, baseType: !919, size: 32, align: 32, offset: 8416)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !960, file: !14, line: 3535, baseType: !1597, size: 64, align: 64, offset: 1024)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!919, !1050, !1600}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !960, file: !14, line: 3541, baseType: !1603, size: 64, align: 64, offset: 1088)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1605)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1066, line: 223, size: 128, align: 64, elements: !1607)
!1607 = !{!1608, !1609}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1606, file: !1066, line: 224, baseType: !1492, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1606, file: !1066, line: 225, baseType: !1492, size: 64, align: 64, offset: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !960, file: !14, line: 3549, baseType: !1611, size: 64, align: 64, offset: 1152)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{null, !1045}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !960, file: !14, line: 3551, baseType: !1047, size: 64, align: 64, offset: 1216)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !960, file: !14, line: 3552, baseType: !1616, size: 64, align: 64, offset: 1280)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!919, !1050, !1078, !919, !1619}
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1651}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1621, file: !14, line: 3921, baseType: !906, size: 16, align: 16)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1621, file: !14, line: 3922, baseType: !911, size: 32, align: 32, offset: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1621, file: !14, line: 3923, baseType: !911, size: 32, align: 32, offset: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1621, file: !14, line: 3924, baseType: !912, size: 32, align: 32, offset: 96)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1621, file: !14, line: 3925, baseType: !1628, size: 64, align: 64, offset: 128)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1631)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1636, !1637, !1638, !1644, !1646, !1647, !1648, !1649, !1650}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1631, file: !14, line: 3886, baseType: !919, size: 32, align: 32)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1631, file: !14, line: 3887, baseType: !919, size: 32, align: 32, offset: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1631, file: !14, line: 3888, baseType: !919, size: 32, align: 32, offset: 64)
