; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fits.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fits.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FITSHeader = type { i32, i32, i32, i64, i32, i32, [999 x i32], i32, i32, i32, i32, i32, double, double, i32, double, i32, double }
%struct.AVDictionary = type opaque

@.str = private unnamed_addr constant [7 x i8] c"SIMPLE\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"expected %s keyword, found %s = %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"not a standard FITS file\0A\00", align 1
@.str.3 = private unnamed_addr constant [46 x i8] c"invalid value of SIMPLE keyword, SIMPLE = %c\0A\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c"XTENSION\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"'IMAGE   '\00", align 1
@.str.6 = private unnamed_addr constant [7 x i8] c"BITPIX\00", align 1
@.str.7 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.8 = private unnamed_addr constant [38 x i8] c"invalid value of %s keyword, %s = %s\0A\00", align 1
@.str.9 = private unnamed_addr constant [6 x i8] c"NAXIS\00", align 1
@.str.10 = private unnamed_addr constant [8 x i8] c"NAXIS%d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fits.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FITSHeaderState", file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13}
!6 = !DIEnumerator(name: "STATE_SIMPLE", value: 0)
!7 = !DIEnumerator(name: "STATE_XTENSION", value: 1)
!8 = !DIEnumerator(name: "STATE_BITPIX", value: 2)
!9 = !DIEnumerator(name: "STATE_NAXIS", value: 3)
!10 = !DIEnumerator(name: "STATE_NAXIS_N", value: 4)
!11 = !DIEnumerator(name: "STATE_PCOUNT", value: 5)
!12 = !DIEnumerator(name: "STATE_GCOUNT", value: 6)
!13 = !DIEnumerator(name: "STATE_REST", value: 7)
!14 = !{!15, !16}
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!20 = distinct !DISubprogram(name: "avpriv_fits_header_init", scope: !21, file: !21, line: 26, type: !22, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!21 = !DIFile(filename: "libavcodec/fits.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!22 = !DISubroutineType(types: !23)
!23 = !{!15, !24, !29}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FITSHeader", file: !4, line: 62, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FITSHeader", file: !4, line: 43, size: 32768, align: 64, elements: !27)
!27 = !{!28, !30, !31, !32, !36, !37, !38, !42, !43, !44, !45, !46, !47, !49, !50, !51, !52, !53}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !26, file: !4, line: 44, baseType: !29, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "FITSHeaderState", file: !4, line: 38, baseType: !3)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "naxis_index", scope: !26, file: !4, line: 45, baseType: !16, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "bitpix", scope: !26, file: !4, line: 46, baseType: !15, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "blank", scope: !26, file: !4, line: 47, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !34, line: 40, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!35 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "blank_found", scope: !26, file: !4, line: 48, baseType: !15, size: 32, align: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "naxis", scope: !26, file: !4, line: 49, baseType: !15, size: 32, align: 32, offset: 224)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "naxisn", scope: !26, file: !4, line: 50, baseType: !39, size: 31968, align: 32, offset: 256)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 31968, align: 32, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 999)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !26, file: !4, line: 51, baseType: !15, size: 32, align: 32, offset: 32224)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "gcount", scope: !26, file: !4, line: 52, baseType: !15, size: 32, align: 32, offset: 32256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !26, file: !4, line: 53, baseType: !15, size: 32, align: 32, offset: 32288)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !26, file: !4, line: 54, baseType: !15, size: 32, align: 32, offset: 32320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "image_extension", scope: !26, file: !4, line: 55, baseType: !15, size: 32, align: 32, offset: 32352)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bscale", scope: !26, file: !4, line: 56, baseType: !48, size: 64, align: 64, offset: 32384)
!48 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bzero", scope: !26, file: !4, line: 57, baseType: !48, size: 64, align: 64, offset: 32448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data_min_found", scope: !26, file: !4, line: 58, baseType: !15, size: 32, align: 32, offset: 32512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data_min", scope: !26, file: !4, line: 59, baseType: !48, size: 64, align: 64, offset: 32576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data_max_found", scope: !26, file: !4, line: 60, baseType: !15, size: 32, align: 32, offset: 32640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data_max", scope: !26, file: !4, line: 61, baseType: !48, size: 64, align: 64, offset: 32704)
!54 = !{}
!55 = !DILocalVariable(name: "header", arg: 1, scope: !20, file: !21, line: 26, type: !24)
!56 = !DIExpression()
!57 = !DILocation(line: 26, column: 41, scope: !20)
!58 = !DILocalVariable(name: "state", arg: 2, scope: !20, file: !21, line: 26, type: !29)
!59 = !DILocation(line: 26, column: 65, scope: !20)
!60 = !DILocation(line: 28, column: 21, scope: !20)
!61 = !DILocation(line: 28, column: 5, scope: !20)
!62 = !DILocation(line: 28, column: 13, scope: !20)
!63 = !DILocation(line: 28, column: 19, scope: !20)
!64 = !DILocation(line: 29, column: 5, scope: !20)
!65 = !DILocation(line: 29, column: 13, scope: !20)
!66 = !DILocation(line: 29, column: 25, scope: !20)
!67 = !DILocation(line: 30, column: 5, scope: !20)
!68 = !DILocation(line: 30, column: 13, scope: !20)
!69 = !DILocation(line: 30, column: 25, scope: !20)
!70 = !DILocation(line: 31, column: 5, scope: !20)
!71 = !DILocation(line: 31, column: 13, scope: !20)
!72 = !DILocation(line: 31, column: 20, scope: !20)
!73 = !DILocation(line: 32, column: 5, scope: !20)
!74 = !DILocation(line: 32, column: 13, scope: !20)
!75 = !DILocation(line: 32, column: 20, scope: !20)
!76 = !DILocation(line: 33, column: 5, scope: !20)
!77 = !DILocation(line: 33, column: 13, scope: !20)
!78 = !DILocation(line: 33, column: 20, scope: !20)
!79 = !DILocation(line: 34, column: 5, scope: !20)
!80 = !DILocation(line: 34, column: 13, scope: !20)
!81 = !DILocation(line: 34, column: 17, scope: !20)
!82 = !DILocation(line: 35, column: 5, scope: !20)
!83 = !DILocation(line: 35, column: 13, scope: !20)
!84 = !DILocation(line: 35, column: 29, scope: !20)
!85 = !DILocation(line: 36, column: 5, scope: !20)
!86 = !DILocation(line: 36, column: 13, scope: !20)
!87 = !DILocation(line: 36, column: 20, scope: !20)
!88 = !DILocation(line: 37, column: 5, scope: !20)
!89 = !DILocation(line: 37, column: 13, scope: !20)
!90 = !DILocation(line: 37, column: 19, scope: !20)
!91 = !DILocation(line: 38, column: 5, scope: !20)
!92 = !DILocation(line: 38, column: 13, scope: !20)
!93 = !DILocation(line: 38, column: 28, scope: !20)
!94 = !DILocation(line: 39, column: 5, scope: !20)
!95 = !DILocation(line: 39, column: 13, scope: !20)
!96 = !DILocation(line: 39, column: 28, scope: !20)
!97 = !DILocation(line: 40, column: 5, scope: !20)
!98 = distinct !DISubprogram(name: "avpriv_fits_header_parse_line", scope: !21, file: !21, line: 108, type: !99, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!99 = !DISubroutineType(types: !100)
!100 = !{!15, !101, !24, !102, !106}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !34, line: 48, baseType: !105)
!105 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !110, line: 86, baseType: !111)
!110 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !110, line: 86, flags: DIFlagFwdDecl)
!112 = !DILocalVariable(name: "avcl", arg: 1, scope: !98, file: !21, line: 108, type: !101)
!113 = !DILocation(line: 108, column: 41, scope: !98)
!114 = !DILocalVariable(name: "header", arg: 2, scope: !98, file: !21, line: 108, type: !24)
