; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mjpegenc_common.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mjpegenc_common.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!1077 = !DILocation(line: 50, column: 27, scope: !1067)
!1078 = !DILocation(line: 50, column: 43, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1067, file: !1022, discriminator: 1)
!1080 = !DILocation(line: 50, column: 27, scope: !1079)
!1081 = !DILocation(line: 50, column: 55, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1067, file: !1022, discriminator: 2)
!1083 = !DILocation(line: 50, column: 53, scope: !1082)
!1084 = !DILocation(line: 50, column: 27, scope: !1082)
!1085 = !DILocation(line: 50, column: 27, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1067, file: !1022, discriminator: 3)
!1087 = !DILocation(line: 50, column: 17, scope: !1086)
!1088 = !DILocation(line: 52, column: 20, scope: !1067)
!1089 = !DILocation(line: 52, column: 24, scope: !1067)
!1090 = !DILocation(line: 52, column: 32, scope: !1067)
!1091 = !DILocation(line: 52, column: 30, scope: !1067)
!1092 = !DILocation(line: 52, column: 17, scope: !1067)
!1093 = !DILocation(line: 54, column: 41, scope: !1067)
!1094 = !DILocation(line: 54, column: 48, scope: !1067)
!1095 = !DILocation(line: 54, column: 26, scope: !1067)
!1096 = !DILocation(line: 54, column: 24, scope: !1067)
!1097 = !DILocation(line: 54, column: 53, scope: !1067)
!1098 = !DILocation(line: 54, column: 18, scope: !1067)
!1099 = !DILocation(line: 55, column: 25, scope: !1067)
!1100 = !DILocation(line: 55, column: 24, scope: !1067)
!1101 = !DILocation(line: 55, column: 30, scope: !1067)
!1102 = !DILocation(line: 55, column: 38, scope: !1067)
!1103 = !DILocation(line: 55, column: 36, scope: !1067)
!1104 = !DILocation(line: 55, column: 18, scope: !1067)
!1105 = !DILocation(line: 57, column: 33, scope: !1067)
!1106 = !DILocation(line: 57, column: 20, scope: !1067)
!1107 = !DILocation(line: 57, column: 41, scope: !1067)
!1108 = !DILocation(line: 57, column: 39, scope: !1067)
!1109 = !DILocation(line: 57, column: 17, scope: !1067)
!1110 = !DILocation(line: 59, column: 49, scope: !1067)
!1111 = !DILocation(line: 59, column: 30, scope: !1067)
!1112 = !DILocation(line: 59, column: 34, scope: !1067)
!1113 = !DILocation(line: 59, column: 42, scope: !1067)
!1114 = !DILocation(line: 59, column: 39, scope: !1067)
!1115 = !DILocation(line: 59, column: 13, scope: !1067)
!1116 = !DILocation(line: 59, column: 47, scope: !1067)
!1117 = !DILocation(line: 61, column: 9, scope: !1067)
!1118 = !DILocation(line: 48, column: 36, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1063, file: !1022, discriminator: 2)
!1120 = !DILocation(line: 48, column: 9, scope: !1119)
!1121 = distinct !{!1121, !1122}
!1122 = !DILocation(line: 48, column: 9, scope: !1048)
!1123 = !DILocation(line: 62, column: 5, scope: !1048)
!1124 = !DILocation(line: 43, column: 27, scope: !1125)
!1125 = !DILexicalBlockFile(scope: !1044, file: !1022, discriminator: 2)
!1126 = !DILocation(line: 43, column: 5, scope: !1125)
!1127 = distinct !{!1127, !1128}
!1128 = !DILocation(line: 43, column: 5, scope: !1021)
!1129 = !DILocation(line: 63, column: 1, scope: !1021)
!1130 = distinct !DISubprogram(name: "ff_mjpeg_init_hvsample", scope: !1022, file: !1022, line: 221, type: !1131, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1030)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !1133, !1450, !1450}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1136)
!1136 = !{!1137, !1221, !1222, !1223, !1480, !1481, !1482, !1483, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1636, !1640, !1641, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2753, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1135, file: !57, line: 1561, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1142)
!1142 = !{!1143, !1147, !1151, !1180, !1181, !1182, !1183, !1187, !1193, !1195, !1199}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1141, file: !26, line: 72, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1141, file: !26, line: 78, baseType: !1148, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1144, !999}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1141, file: !26, line: 85, baseType: !1152, size: 64, align: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1176, !1177, !1178, !1179}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1154, file: !4, line: 247, baseType: !1144, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1154, file: !4, line: 253, baseType: !1144, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1154, file: !4, line: 259, baseType: !1037, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1154, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1154, file: !4, line: 271, baseType: !1161, size: 64, align: 64, offset: 192)
!1161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1154, file: !4, line: 265, size: 64, align: 64, elements: !1162)
!1162 = !{!1163, !1166, !1168, !1169}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1161, file: !4, line: 266, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1005, line: 40, baseType: !1165)
!1165 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1161, file: !4, line: 267, baseType: !1167, size: 64, align: 64)
!1167 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1161, file: !4, line: 268, baseType: !1144, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1161, file: !4, line: 270, baseType: !1170, size: 64, align: 32)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1171, line: 61, baseType: !1172)
!1171 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1171, line: 58, size: 64, align: 32, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1172, file: !1171, line: 59, baseType: !1037, size: 32, align: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1172, file: !1171, line: 60, baseType: !1037, size: 32, align: 32, offset: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1154, file: !4, line: 272, baseType: !1167, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1154, file: !4, line: 273, baseType: !1167, size: 64, align: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !4, line: 275, baseType: !1037, size: 32, align: 32, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1154, file: !4, line: 300, baseType: !1144, size: 64, align: 64, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1141, file: !26, line: 93, baseType: !1037, size: 32, align: 32, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1141, file: !26, line: 99, baseType: !1037, size: 32, align: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1141, file: !26, line: 108, baseType: !1037, size: 32, align: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1141, file: !26, line: 113, baseType: !1184, size: 64, align: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!999, !999, !999}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1141, file: !26, line: 123, baseType: !1188, size: 64, align: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!1191, !1191}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1141, file: !26, line: 130, baseType: !1194, size: 32, align: 32, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1141, file: !26, line: 136, baseType: !1196, size: 64, align: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1194, !999}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1141, file: !26, line: 142, baseType: !1200, size: 64, align: 64, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1037, !1203, !999, !1144, !1037}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1206)
!1206 = !{!1207, !1219, !1220}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1205, file: !4, line: 360, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1218}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1211, file: !4, line: 307, baseType: !1144, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1211, file: !4, line: 313, baseType: !1167, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1211, file: !4, line: 313, baseType: !1167, size: 64, align: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1211, file: !4, line: 318, baseType: !1167, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1211, file: !4, line: 318, baseType: !1167, size: 64, align: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1211, file: !4, line: 323, baseType: !1037, size: 32, align: 32, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1205, file: !4, line: 364, baseType: !1037, size: 32, align: 32, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1205, file: !4, line: 368, baseType: !1037, size: 32, align: 32, offset: 96)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1135, file: !57, line: 1562, baseType: !1037, size: 32, align: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1135, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1135, file: !57, line: 1565, baseType: !1224, size: 64, align: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1236, !1239, !1242, !1245, !1249, !1250, !1251, !1259, !1260, !1261, !1263, !1267, !1273, !1282, !1286, !1287, !1332, !1451, !1455, !1456, !1460, !1464, !1469, !1473, !1474, !1475}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1226, file: !57, line: 3475, baseType: !1144, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1226, file: !57, line: 3480, baseType: !1144, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1226, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1226, file: !57, line: 3487, baseType: !1037, size: 32, align: 32, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1226, file: !57, line: 3488, baseType: !1234, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1226, file: !57, line: 3489, baseType: !1237, size: 64, align: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1226, file: !57, line: 3490, baseType: !1240, size: 64, align: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1226, file: !57, line: 3491, baseType: !1243, size: 64, align: 64, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1226, file: !57, line: 3492, baseType: !1246, size: 64, align: 64, offset: 512)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1005, line: 55, baseType: !1002)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1226, file: !57, line: 3493, baseType: !1027, size: 8, align: 8, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1226, file: !57, line: 3494, baseType: !1138, size: 64, align: 64, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1226, file: !57, line: 3495, baseType: !1252, size: 64, align: 64, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1255, file: !57, line: 3402, baseType: !1037, size: 32, align: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1255, file: !57, line: 3403, baseType: !1144, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1226, file: !57, line: 3507, baseType: !1144, size: 64, align: 64, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1226, file: !57, line: 3516, baseType: !1037, size: 32, align: 32, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1226, file: !57, line: 3517, baseType: !1262, size: 64, align: 64, offset: 896)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1226, file: !57, line: 3527, baseType: !1264, size: 64, align: 64, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!1037, !1133}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1226, file: !57, line: 3535, baseType: !1268, size: 64, align: 64, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!1037, !1133, !1271}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1226, file: !57, line: 3541, baseType: !1274, size: 64, align: 64, offset: 1088)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1278, line: 223, size: 128, align: 64, elements: !1279)
!1278 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1277, file: !1278, line: 224, baseType: !1025, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1277, file: !1278, line: 225, baseType: !1025, size: 64, align: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1226, file: !57, line: 3549, baseType: !1283, size: 64, align: 64, offset: 1152)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{null, !1262}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1226, file: !57, line: 3551, baseType: !1264, size: 64, align: 64, offset: 1216)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1226, file: !57, line: 3552, baseType: !1288, size: 64, align: 64, offset: 1280)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!1037, !1133, !1029, !1037, !1291}
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1331}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1293, file: !57, line: 3921, baseType: !1012, size: 16, align: 16)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1293, file: !57, line: 3922, baseType: !1004, size: 32, align: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1293, file: !57, line: 3923, baseType: !1004, size: 32, align: 32, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1293, file: !57, line: 3924, baseType: !1006, size: 32, align: 32, offset: 96)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1293, file: !57, line: 3925, baseType: !1300, size: 64, align: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1320, !1324, !1326, !1327, !1329, !1330}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1303, file: !57, line: 3886, baseType: !1037, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1303, file: !57, line: 3887, baseType: !1037, size: 32, align: 32, offset: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1303, file: !57, line: 3888, baseType: !1037, size: 32, align: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1303, file: !57, line: 3889, baseType: !1037, size: 32, align: 32, offset: 96)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1303, file: !57, line: 3890, baseType: !1037, size: 32, align: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1303, file: !57, line: 3897, baseType: !1311, size: 768, align: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1313)
!1313 = !{!1314, !1318}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1312, file: !57, line: 3855, baseType: !1315, size: 512, align: 64)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1316)
!1316 = !{!1317}
!1317 = !DISubrange(count: 8)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1312, file: !57, line: 3857, baseType: !1319, size: 256, align: 32, offset: 512)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 256, align: 32, elements: !1316)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1303, file: !57, line: 3903, baseType: !1321, size: 256, align: 64, offset: 960)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 256, align: 64, elements: !1322)
!1322 = !{!1323}
!1323 = !DISubrange(count: 4)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1303, file: !57, line: 3904, baseType: !1325, size: 128, align: 32, offset: 1216)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 128, align: 32, elements: !1322)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1303, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1303, file: !57, line: 3908, baseType: !1328, size: 64, align: 64, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1303, file: !57, line: 3915, baseType: !1328, size: 64, align: 64, offset: 1472)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1303, file: !57, line: 3917, baseType: !1037, size: 32, align: 32, offset: 1536)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1293, file: !57, line: 3926, baseType: !1164, size: 64, align: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1226, file: !57, line: 3564, baseType: !1333, size: 64, align: 64, offset: 1344)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!1037, !1133, !1336, !1370, !1450}
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1339)
!1339 = !{!1340, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1366, !1367, !1368, !1369}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1338, file: !57, line: 1451, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1343, line: 94, baseType: !1344)
!1343 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1343, line: 81, size: 192, align: 64, elements: !1345)
!1345 = !{!1346, !1350, !1351}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1344, file: !1343, line: 82, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1343, line: 73, baseType: !1349)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1343, line: 73, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1344, file: !1343, line: 89, baseType: !1029, size: 64, align: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1344, file: !1343, line: 93, baseType: !1037, size: 32, align: 32, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1338, file: !57, line: 1461, baseType: !1164, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1338, file: !57, line: 1467, baseType: !1164, size: 64, align: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1338, file: !57, line: 1468, baseType: !1029, size: 64, align: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1338, file: !57, line: 1469, baseType: !1037, size: 32, align: 32, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1338, file: !57, line: 1470, baseType: !1037, size: 32, align: 32, offset: 288)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1338, file: !57, line: 1474, baseType: !1037, size: 32, align: 32, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1338, file: !57, line: 1479, baseType: !1359, size: 64, align: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1361, file: !57, line: 1412, baseType: !1029, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1361, file: !57, line: 1413, baseType: !1037, size: 32, align: 32, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1361, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1338, file: !57, line: 1480, baseType: !1037, size: 32, align: 32, offset: 448)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1338, file: !57, line: 1486, baseType: !1164, size: 64, align: 64, offset: 512)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1338, file: !57, line: 1488, baseType: !1164, size: 64, align: 64, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1338, file: !57, line: 1497, baseType: !1164, size: 64, align: 64, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1404, !1406, !1407, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1373, file: !780, line: 282, baseType: !1315, size: 512, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1373, file: !780, line: 299, baseType: !1319, size: 256, align: 32, offset: 512)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1373, file: !780, line: 315, baseType: !1378, size: 64, align: 64, offset: 768)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1373, file: !780, line: 326, baseType: !1037, size: 32, align: 32, offset: 832)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1373, file: !780, line: 326, baseType: !1037, size: 32, align: 32, offset: 864)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1373, file: !780, line: 334, baseType: !1037, size: 32, align: 32, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1373, file: !780, line: 341, baseType: !1037, size: 32, align: 32, offset: 928)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1373, file: !780, line: 346, baseType: !1037, size: 32, align: 32, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1373, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1373, file: !780, line: 356, baseType: !1170, size: 64, align: 32, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1373, file: !780, line: 361, baseType: !1164, size: 64, align: 64, offset: 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1373, file: !780, line: 369, baseType: !1164, size: 64, align: 64, offset: 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1373, file: !780, line: 377, baseType: !1164, size: 64, align: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1373, file: !780, line: 382, baseType: !1037, size: 32, align: 32, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1373, file: !780, line: 386, baseType: !1037, size: 32, align: 32, offset: 1312)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1373, file: !780, line: 391, baseType: !1037, size: 32, align: 32, offset: 1344)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1373, file: !780, line: 396, baseType: !999, size: 64, align: 64, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1373, file: !780, line: 403, baseType: !1394, size: 512, align: 64, offset: 1472)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 512, align: 64, elements: !1316)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1373, file: !780, line: 410, baseType: !1037, size: 32, align: 32, offset: 1984)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1373, file: !780, line: 415, baseType: !1037, size: 32, align: 32, offset: 2016)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1373, file: !780, line: 420, baseType: !1037, size: 32, align: 32, offset: 2048)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1373, file: !780, line: 425, baseType: !1037, size: 32, align: 32, offset: 2080)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1373, file: !780, line: 435, baseType: !1164, size: 64, align: 64, offset: 2112)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1373, file: !780, line: 440, baseType: !1037, size: 32, align: 32, offset: 2176)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1373, file: !780, line: 445, baseType: !1248, size: 64, align: 64, offset: 2240)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1373, file: !780, line: 459, baseType: !1403, size: 512, align: 64, offset: 2304)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1341, size: 512, align: 64, elements: !1316)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1373, file: !780, line: 473, baseType: !1405, size: 64, align: 64, offset: 2816)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1373, file: !780, line: 477, baseType: !1037, size: 32, align: 32, offset: 2880)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1373, file: !780, line: 479, baseType: !1408, size: 64, align: 64, offset: 2944)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1415, !1416, !1421}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1411, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1411, file: !780, line: 203, baseType: !1029, size: 64, align: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1411, file: !780, line: 204, baseType: !1037, size: 32, align: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1411, file: !780, line: 205, baseType: !1417, size: 64, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1419, line: 86, baseType: !1420)
!1419 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1419, line: 86, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1411, file: !780, line: 206, baseType: !1341, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1373, file: !780, line: 480, baseType: !1037, size: 32, align: 32, offset: 3008)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1373, file: !780, line: 505, baseType: !1037, size: 32, align: 32, offset: 3040)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1373, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1373, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1373, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1373, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1373, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1373, file: !780, line: 532, baseType: !1164, size: 64, align: 64, offset: 3264)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1373, file: !780, line: 539, baseType: !1164, size: 64, align: 64, offset: 3328)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1373, file: !780, line: 547, baseType: !1164, size: 64, align: 64, offset: 3392)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1373, file: !780, line: 554, baseType: !1417, size: 64, align: 64, offset: 3456)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1373, file: !780, line: 563, baseType: !1037, size: 32, align: 32, offset: 3520)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1373, file: !780, line: 572, baseType: !1037, size: 32, align: 32, offset: 3552)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1373, file: !780, line: 581, baseType: !1037, size: 32, align: 32, offset: 3584)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1373, file: !780, line: 588, baseType: !1437, size: 64, align: 64, offset: 3648)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1005, line: 36, baseType: !1439)
!1439 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1373, file: !780, line: 593, baseType: !1037, size: 32, align: 32, offset: 3712)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1373, file: !780, line: 596, baseType: !1037, size: 32, align: 32, offset: 3744)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1373, file: !780, line: 599, baseType: !1341, size: 64, align: 64, offset: 3776)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1373, file: !780, line: 605, baseType: !1341, size: 64, align: 64, offset: 3840)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1373, file: !780, line: 616, baseType: !1341, size: 64, align: 64, offset: 3904)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1373, file: !780, line: 626, baseType: !1000, size: 64, align: 64, offset: 3968)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1373, file: !780, line: 627, baseType: !1000, size: 64, align: 64, offset: 4032)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1373, file: !780, line: 628, baseType: !1000, size: 64, align: 64, offset: 4096)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1373, file: !780, line: 629, baseType: !1000, size: 64, align: 64, offset: 4160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1373, file: !780, line: 645, baseType: !1341, size: 64, align: 64, offset: 4224)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1226, file: !57, line: 3566, baseType: !1452, size: 64, align: 64, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!1037, !1133, !999, !1450, !1336}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1226, file: !57, line: 3567, baseType: !1264, size: 64, align: 64, offset: 1472)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1226, file: !57, line: 3576, baseType: !1457, size: 64, align: 64, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!1037, !1133, !1370}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1226, file: !57, line: 3577, baseType: !1461, size: 64, align: 64, offset: 1600)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!1037, !1133, !1336}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1226, file: !57, line: 3584, baseType: !1465, size: 64, align: 64, offset: 1664)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!1037, !1133, !1468}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1226, file: !57, line: 3589, baseType: !1470, size: 64, align: 64, offset: 1728)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !1133}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1226, file: !57, line: 3594, baseType: !1037, size: 32, align: 32, offset: 1792)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1226, file: !57, line: 3600, baseType: !1144, size: 64, align: 64, offset: 1856)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1226, file: !57, line: 3609, baseType: !1476, size: 64, align: 64, offset: 1920)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1479)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1135, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1135, file: !57, line: 1581, baseType: !1006, size: 32, align: 32, offset: 224)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1135, file: !57, line: 1583, baseType: !999, size: 64, align: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1135, file: !57, line: 1591, baseType: !1484, size: 64, align: 64, offset: 320)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1278, line: 129, size: 1664, align: 64, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1509, !1510, !1516, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1485, file: !1278, line: 136, baseType: !1037, size: 32, align: 32)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1485, file: !1278, line: 151, baseType: !1037, size: 32, align: 32, offset: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1485, file: !1278, line: 157, baseType: !1037, size: 32, align: 32, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1485, file: !1278, line: 159, baseType: !1468, size: 64, align: 64, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1485, file: !1278, line: 161, baseType: !1492, size: 64, align: 64, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1278, line: 117, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1278, line: 100, size: 832, align: 64, elements: !1495)
!1495 = !{!1496, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1494, file: !1278, line: 105, baseType: !1497, size: 256, align: 64)
!1497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1498, size: 256, align: 64, elements: !1322)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1343, line: 238, baseType: !1500)
!1500 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1343, line: 238, flags: DIFlagFwdDecl)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1494, file: !1278, line: 110, baseType: !1037, size: 32, align: 32, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1494, file: !1278, line: 111, baseType: !1037, size: 32, align: 32, offset: 288)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1494, file: !1278, line: 111, baseType: !1037, size: 32, align: 32, offset: 320)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1494, file: !1278, line: 112, baseType: !1319, size: 256, align: 32, offset: 352)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1494, file: !1278, line: 113, baseType: !1325, size: 128, align: 32, offset: 608)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1494, file: !1278, line: 114, baseType: !1037, size: 32, align: 32, offset: 736)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1494, file: !1278, line: 115, baseType: !1037, size: 32, align: 32, offset: 768)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1494, file: !1278, line: 116, baseType: !1037, size: 32, align: 32, offset: 800)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1485, file: !1278, line: 163, baseType: !999, size: 64, align: 64, offset: 256)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1485, file: !1278, line: 165, baseType: !1511, size: 128, align: 64, offset: 320)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1278, line: 122, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1278, line: 119, size: 128, align: 64, elements: !1513)
!1513 = !{!1514, !1515}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1512, file: !1278, line: 120, baseType: !1336, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1512, file: !1278, line: 121, baseType: !1468, size: 64, align: 64, offset: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1485, file: !1278, line: 166, baseType: !1517, size: 128, align: 64, offset: 448)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1278, line: 127, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1278, line: 124, size: 128, align: 64, elements: !1519)
!1519 = !{!1520, !1593}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1518, file: !1278, line: 125, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1525)
!1525 = !{!1526, !1527, !1551, !1555, !1556, !1590, !1591, !1592}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1524, file: !57, line: 5751, baseType: !1138, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1524, file: !57, line: 5756, baseType: !1528, size: 64, align: 64, offset: 64)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1530)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1531)
!1531 = !{!1532, !1533, !1536, !1537, !1538, !1542, !1546, !1550}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1530, file: !57, line: 5797, baseType: !1144, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1530, file: !57, line: 5804, baseType: !1534, size: 64, align: 64, offset: 64)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1530, file: !57, line: 5815, baseType: !1138, size: 64, align: 64, offset: 128)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1530, file: !57, line: 5825, baseType: !1037, size: 32, align: 32, offset: 192)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1530, file: !57, line: 5826, baseType: !1539, size: 64, align: 64, offset: 256)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!1037, !1522}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1530, file: !57, line: 5827, baseType: !1543, size: 64, align: 64, offset: 320)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!1037, !1522, !1336}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1530, file: !57, line: 5828, baseType: !1547, size: 64, align: 64, offset: 384)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{null, !1522}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1530, file: !57, line: 5829, baseType: !1547, size: 64, align: 64, offset: 448)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1524, file: !57, line: 5762, baseType: !1552, size: 64, align: 64, offset: 128)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1554)
!1554 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1524, file: !57, line: 5768, baseType: !999, size: 64, align: 64, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1524, file: !57, line: 5775, baseType: !1557, size: 64, align: 64, offset: 256)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1560)
!1560 = !{!1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1559, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1559, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1559, file: !57, line: 3948, baseType: !1004, size: 32, align: 32, offset: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1559, file: !57, line: 3958, baseType: !1029, size: 64, align: 64, offset: 128)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1559, file: !57, line: 3962, baseType: !1037, size: 32, align: 32, offset: 192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1559, file: !57, line: 3968, baseType: !1037, size: 32, align: 32, offset: 224)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1559, file: !57, line: 3973, baseType: !1164, size: 64, align: 64, offset: 256)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1559, file: !57, line: 3986, baseType: !1037, size: 32, align: 32, offset: 320)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1559, file: !57, line: 3999, baseType: !1037, size: 32, align: 32, offset: 352)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1559, file: !57, line: 4004, baseType: !1037, size: 32, align: 32, offset: 384)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1559, file: !57, line: 4005, baseType: !1037, size: 32, align: 32, offset: 416)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1559, file: !57, line: 4010, baseType: !1037, size: 32, align: 32, offset: 448)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1559, file: !57, line: 4011, baseType: !1037, size: 32, align: 32, offset: 480)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1559, file: !57, line: 4020, baseType: !1170, size: 64, align: 32, offset: 512)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1559, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1559, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1559, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1559, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1559, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1559, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1559, file: !57, line: 4039, baseType: !1037, size: 32, align: 32, offset: 768)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1559, file: !57, line: 4046, baseType: !1248, size: 64, align: 64, offset: 832)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1559, file: !57, line: 4050, baseType: !1037, size: 32, align: 32, offset: 896)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1559, file: !57, line: 4054, baseType: !1037, size: 32, align: 32, offset: 928)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1559, file: !57, line: 4061, baseType: !1037, size: 32, align: 32, offset: 960)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1559, file: !57, line: 4065, baseType: !1037, size: 32, align: 32, offset: 992)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1559, file: !57, line: 4073, baseType: !1037, size: 32, align: 32, offset: 1024)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1559, file: !57, line: 4080, baseType: !1037, size: 32, align: 32, offset: 1056)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1559, file: !57, line: 4084, baseType: !1037, size: 32, align: 32, offset: 1088)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1524, file: !57, line: 5781, baseType: !1557, size: 64, align: 64, offset: 320)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1524, file: !57, line: 5787, baseType: !1170, size: 64, align: 32, offset: 384)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1524, file: !57, line: 5793, baseType: !1170, size: 64, align: 32, offset: 448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1518, file: !1278, line: 126, baseType: !1037, size: 32, align: 32, offset: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1485, file: !1278, line: 172, baseType: !1336, size: 64, align: 64, offset: 576)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1485, file: !1278, line: 177, baseType: !1029, size: 64, align: 64, offset: 640)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1485, file: !1278, line: 178, baseType: !1006, size: 32, align: 32, offset: 704)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1485, file: !1278, line: 180, baseType: !999, size: 64, align: 64, offset: 768)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1485, file: !1278, line: 185, baseType: !1037, size: 32, align: 32, offset: 832)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1485, file: !1278, line: 190, baseType: !999, size: 64, align: 64, offset: 896)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1485, file: !1278, line: 195, baseType: !1037, size: 32, align: 32, offset: 960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1485, file: !1278, line: 200, baseType: !1336, size: 64, align: 64, offset: 1024)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1485, file: !1278, line: 201, baseType: !1037, size: 32, align: 32, offset: 1088)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1485, file: !1278, line: 202, baseType: !1468, size: 64, align: 64, offset: 1152)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1485, file: !1278, line: 203, baseType: !1037, size: 32, align: 32, offset: 1216)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1485, file: !1278, line: 205, baseType: !1037, size: 32, align: 32, offset: 1248)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1485, file: !1278, line: 206, baseType: !1037, size: 32, align: 32, offset: 1280)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1485, file: !1278, line: 209, baseType: !1000, size: 64, align: 64, offset: 1344)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1485, file: !1278, line: 212, baseType: !1000, size: 64, align: 64, offset: 1408)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1485, file: !1278, line: 213, baseType: !1468, size: 64, align: 64, offset: 1472)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1485, file: !1278, line: 215, baseType: !1037, size: 32, align: 32, offset: 1536)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1485, file: !1278, line: 217, baseType: !1037, size: 32, align: 32, offset: 1568)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1485, file: !1278, line: 220, baseType: !1037, size: 32, align: 32, offset: 1600)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1135, file: !57, line: 1598, baseType: !999, size: 64, align: 64, offset: 384)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1135, file: !57, line: 1606, baseType: !1164, size: 64, align: 64, offset: 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1135, file: !57, line: 1614, baseType: !1037, size: 32, align: 32, offset: 512)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1135, file: !57, line: 1622, baseType: !1037, size: 32, align: 32, offset: 544)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1135, file: !57, line: 1628, baseType: !1037, size: 32, align: 32, offset: 576)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !57, line: 1636, baseType: !1037, size: 32, align: 32, offset: 608)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1135, file: !57, line: 1643, baseType: !1037, size: 32, align: 32, offset: 640)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1135, file: !57, line: 1657, baseType: !1029, size: 64, align: 64, offset: 704)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1135, file: !57, line: 1658, baseType: !1037, size: 32, align: 32, offset: 768)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1135, file: !57, line: 1679, baseType: !1170, size: 64, align: 32, offset: 800)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1135, file: !57, line: 1688, baseType: !1037, size: 32, align: 32, offset: 864)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1135, file: !57, line: 1712, baseType: !1037, size: 32, align: 32, offset: 896)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1135, file: !57, line: 1729, baseType: !1037, size: 32, align: 32, offset: 928)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1135, file: !57, line: 1729, baseType: !1037, size: 32, align: 32, offset: 960)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1135, file: !57, line: 1744, baseType: !1037, size: 32, align: 32, offset: 992)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1135, file: !57, line: 1744, baseType: !1037, size: 32, align: 32, offset: 1024)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1135, file: !57, line: 1751, baseType: !1037, size: 32, align: 32, offset: 1056)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1135, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1135, file: !57, line: 1791, baseType: !1632, size: 64, align: 64, offset: 1152)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{null, !1635, !1370, !1450, !1037, !1037, !1037}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1135, file: !57, line: 1808, baseType: !1637, size: 64, align: 64, offset: 1216)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!516, !1635, !1237}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1135, file: !57, line: 1816, baseType: !1037, size: 32, align: 32, offset: 1280)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1135, file: !57, line: 1825, baseType: !1642, size: 32, align: 32, offset: 1312)
!1642 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1135, file: !57, line: 1830, baseType: !1037, size: 32, align: 32, offset: 1344)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1135, file: !57, line: 1838, baseType: !1642, size: 32, align: 32, offset: 1376)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1135, file: !57, line: 1846, baseType: !1037, size: 32, align: 32, offset: 1408)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1135, file: !57, line: 1851, baseType: !1037, size: 32, align: 32, offset: 1440)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1135, file: !57, line: 1861, baseType: !1642, size: 32, align: 32, offset: 1472)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1135, file: !57, line: 1868, baseType: !1642, size: 32, align: 32, offset: 1504)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1135, file: !57, line: 1875, baseType: !1642, size: 32, align: 32, offset: 1536)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1135, file: !57, line: 1882, baseType: !1642, size: 32, align: 32, offset: 1568)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1135, file: !57, line: 1889, baseType: !1642, size: 32, align: 32, offset: 1600)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1135, file: !57, line: 1896, baseType: !1642, size: 32, align: 32, offset: 1632)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1135, file: !57, line: 1903, baseType: !1642, size: 32, align: 32, offset: 1664)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1135, file: !57, line: 1910, baseType: !1037, size: 32, align: 32, offset: 1696)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1135, file: !57, line: 1915, baseType: !1037, size: 32, align: 32, offset: 1728)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1135, file: !57, line: 1926, baseType: !1450, size: 64, align: 64, offset: 1792)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1135, file: !57, line: 1935, baseType: !1170, size: 64, align: 32, offset: 1856)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1135, file: !57, line: 1942, baseType: !1037, size: 32, align: 32, offset: 1920)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1135, file: !57, line: 1948, baseType: !1037, size: 32, align: 32, offset: 1952)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1135, file: !57, line: 1954, baseType: !1037, size: 32, align: 32, offset: 1984)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1135, file: !57, line: 1960, baseType: !1037, size: 32, align: 32, offset: 2016)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1135, file: !57, line: 1984, baseType: !1037, size: 32, align: 32, offset: 2048)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1135, file: !57, line: 1991, baseType: !1037, size: 32, align: 32, offset: 2080)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1135, file: !57, line: 1996, baseType: !1037, size: 32, align: 32, offset: 2112)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1135, file: !57, line: 2004, baseType: !1037, size: 32, align: 32, offset: 2144)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1135, file: !57, line: 2011, baseType: !1037, size: 32, align: 32, offset: 2176)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1135, file: !57, line: 2018, baseType: !1037, size: 32, align: 32, offset: 2208)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1135, file: !57, line: 2027, baseType: !1037, size: 32, align: 32, offset: 2240)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1135, file: !57, line: 2034, baseType: !1037, size: 32, align: 32, offset: 2272)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1135, file: !57, line: 2044, baseType: !1037, size: 32, align: 32, offset: 2304)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1135, file: !57, line: 2054, baseType: !1672, size: 64, align: 64, offset: 2368)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1135, file: !57, line: 2061, baseType: !1672, size: 64, align: 64, offset: 2432)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1135, file: !57, line: 2066, baseType: !1037, size: 32, align: 32, offset: 2496)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1135, file: !57, line: 2070, baseType: !1037, size: 32, align: 32, offset: 2528)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1135, file: !57, line: 2078, baseType: !1037, size: 32, align: 32, offset: 2560)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1135, file: !57, line: 2085, baseType: !1037, size: 32, align: 32, offset: 2592)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1135, file: !57, line: 2092, baseType: !1037, size: 32, align: 32, offset: 2624)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1135, file: !57, line: 2099, baseType: !1037, size: 32, align: 32, offset: 2656)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1135, file: !57, line: 2106, baseType: !1037, size: 32, align: 32, offset: 2688)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1135, file: !57, line: 2113, baseType: !1037, size: 32, align: 32, offset: 2720)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1135, file: !57, line: 2120, baseType: !1037, size: 32, align: 32, offset: 2752)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1135, file: !57, line: 2125, baseType: !1037, size: 32, align: 32, offset: 2784)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1135, file: !57, line: 2133, baseType: !1037, size: 32, align: 32, offset: 2816)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1135, file: !57, line: 2140, baseType: !1037, size: 32, align: 32, offset: 2848)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1135, file: !57, line: 2145, baseType: !1037, size: 32, align: 32, offset: 2880)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1135, file: !57, line: 2153, baseType: !1037, size: 32, align: 32, offset: 2912)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1135, file: !57, line: 2158, baseType: !1037, size: 32, align: 32, offset: 2944)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1135, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1135, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1135, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1135, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1135, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1135, file: !57, line: 2203, baseType: !1037, size: 32, align: 32, offset: 3136)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1135, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1135, file: !57, line: 2212, baseType: !1037, size: 32, align: 32, offset: 3200)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1135, file: !57, line: 2213, baseType: !1037, size: 32, align: 32, offset: 3232)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1135, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1135, file: !57, line: 2232, baseType: !1037, size: 32, align: 32, offset: 3296)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1135, file: !57, line: 2243, baseType: !1037, size: 32, align: 32, offset: 3328)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1135, file: !57, line: 2249, baseType: !1037, size: 32, align: 32, offset: 3360)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1135, file: !57, line: 2256, baseType: !1037, size: 32, align: 32, offset: 3392)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1135, file: !57, line: 2263, baseType: !1248, size: 64, align: 64, offset: 3456)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1135, file: !57, line: 2270, baseType: !1248, size: 64, align: 64, offset: 3520)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1135, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1135, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1135, file: !57, line: 2367, baseType: !1708, size: 64, align: 64, offset: 3648)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DISubroutineType(types: !1710)
!1710 = !{!1037, !1635, !1468, !1037}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1135, file: !57, line: 2383, baseType: !1037, size: 32, align: 32, offset: 3712)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1135, file: !57, line: 2386, baseType: !1642, size: 32, align: 32, offset: 3744)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1135, file: !57, line: 2387, baseType: !1642, size: 32, align: 32, offset: 3776)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1135, file: !57, line: 2394, baseType: !1037, size: 32, align: 32, offset: 3808)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1135, file: !57, line: 2401, baseType: !1037, size: 32, align: 32, offset: 3840)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1135, file: !57, line: 2408, baseType: !1037, size: 32, align: 32, offset: 3872)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1135, file: !57, line: 2415, baseType: !1037, size: 32, align: 32, offset: 3904)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1135, file: !57, line: 2422, baseType: !1037, size: 32, align: 32, offset: 3936)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1135, file: !57, line: 2423, baseType: !1720, size: 64, align: 64, offset: 3968)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1722)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1723)
!1723 = !{!1724, !1725, !1726, !1727}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1722, file: !57, line: 827, baseType: !1037, size: 32, align: 32)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1722, file: !57, line: 828, baseType: !1037, size: 32, align: 32, offset: 32)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1722, file: !57, line: 829, baseType: !1037, size: 32, align: 32, offset: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1722, file: !57, line: 830, baseType: !1642, size: 32, align: 32, offset: 96)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1135, file: !57, line: 2430, baseType: !1164, size: 64, align: 64, offset: 4032)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1135, file: !57, line: 2437, baseType: !1164, size: 64, align: 64, offset: 4096)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1135, file: !57, line: 2444, baseType: !1642, size: 32, align: 32, offset: 4160)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1135, file: !57, line: 2451, baseType: !1642, size: 32, align: 32, offset: 4192)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1135, file: !57, line: 2458, baseType: !1037, size: 32, align: 32, offset: 4224)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1135, file: !57, line: 2469, baseType: !1037, size: 32, align: 32, offset: 4256)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1135, file: !57, line: 2475, baseType: !1037, size: 32, align: 32, offset: 4288)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1135, file: !57, line: 2481, baseType: !1037, size: 32, align: 32, offset: 4320)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1135, file: !57, line: 2485, baseType: !1037, size: 32, align: 32, offset: 4352)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1135, file: !57, line: 2489, baseType: !1037, size: 32, align: 32, offset: 4384)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1135, file: !57, line: 2493, baseType: !1037, size: 32, align: 32, offset: 4416)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1135, file: !57, line: 2501, baseType: !1037, size: 32, align: 32, offset: 4448)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1135, file: !57, line: 2506, baseType: !1037, size: 32, align: 32, offset: 4480)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1135, file: !57, line: 2510, baseType: !1037, size: 32, align: 32, offset: 4512)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1135, file: !57, line: 2514, baseType: !1164, size: 64, align: 64, offset: 4544)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1135, file: !57, line: 2528, baseType: !1744, size: 64, align: 64, offset: 4608)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DISubroutineType(types: !1746)
!1746 = !{null, !1635, !999, !1037, !1037}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1135, file: !57, line: 2534, baseType: !1037, size: 32, align: 32, offset: 4672)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1135, file: !57, line: 2545, baseType: !1037, size: 32, align: 32, offset: 4704)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1135, file: !57, line: 2547, baseType: !1037, size: 32, align: 32, offset: 4736)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1135, file: !57, line: 2549, baseType: !1037, size: 32, align: 32, offset: 4768)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1135, file: !57, line: 2551, baseType: !1037, size: 32, align: 32, offset: 4800)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1135, file: !57, line: 2553, baseType: !1037, size: 32, align: 32, offset: 4832)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1135, file: !57, line: 2555, baseType: !1037, size: 32, align: 32, offset: 4864)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1135, file: !57, line: 2557, baseType: !1037, size: 32, align: 32, offset: 4896)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1135, file: !57, line: 2559, baseType: !1037, size: 32, align: 32, offset: 4928)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1135, file: !57, line: 2563, baseType: !1037, size: 32, align: 32, offset: 4960)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1135, file: !57, line: 2571, baseType: !1328, size: 64, align: 64, offset: 4992)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1135, file: !57, line: 2579, baseType: !1328, size: 64, align: 64, offset: 5056)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1135, file: !57, line: 2586, baseType: !1037, size: 32, align: 32, offset: 5120)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1135, file: !57, line: 2615, baseType: !1037, size: 32, align: 32, offset: 5152)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1135, file: !57, line: 2627, baseType: !1037, size: 32, align: 32, offset: 5184)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1135, file: !57, line: 2637, baseType: !1037, size: 32, align: 32, offset: 5216)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1135, file: !57, line: 2681, baseType: !1037, size: 32, align: 32, offset: 5248)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1135, file: !57, line: 2709, baseType: !1164, size: 64, align: 64, offset: 5312)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1135, file: !57, line: 2716, baseType: !1766, size: 64, align: 64, offset: 5376)
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1767, size: 64, align: 64)
!1767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1768)
!1768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1769)
!1769 = !{!1770, !1771, !1772, !1773, !1774, !1775, !1776, !1780, !1784, !1785, !1786, !1787, !2726, !2727, !2728, !2729, !2730}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1768, file: !57, line: 3642, baseType: !1144, size: 64, align: 64)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1768, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1768, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1768, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1768, file: !57, line: 3669, baseType: !1037, size: 32, align: 32, offset: 160)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1768, file: !57, line: 3682, baseType: !1465, size: 64, align: 64, offset: 192)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1768, file: !57, line: 3698, baseType: !1777, size: 64, align: 64, offset: 256)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{!1037, !1133, !1025, !1004}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1768, file: !57, line: 3712, baseType: !1781, size: 64, align: 64, offset: 320)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1782, size: 64, align: 64)
!1782 = !DISubroutineType(types: !1783)
!1783 = !{!1037, !1133, !1037, !1025, !1004}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1768, file: !57, line: 3726, baseType: !1777, size: 64, align: 64, offset: 384)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1768, file: !57, line: 3737, baseType: !1264, size: 64, align: 64, offset: 448)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1768, file: !57, line: 3746, baseType: !1037, size: 32, align: 32, offset: 512)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1768, file: !57, line: 3757, baseType: !1788, size: 64, align: 64, offset: 576)
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64, align: 64)
!1789 = !DISubroutineType(types: !1790)
!1790 = !{null, !1791}
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1793, line: 81, size: 86208, align: 64, elements: !1794)
!1793 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1794 = !{!1795, !1797, !1798, !1799, !1800, !1804, !1805, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1852, !1853, !1907, !1909, !1910, !1911, !1912, !1913, !1924, !1925, !1926, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1942, !1944, !1946, !1947, !1948, !1949, !1950, !1951, !1956, !1958, !1959, !1960, !1961, !1962, !1963, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1990, !1991, !1992, !1993, !2009, !2016, !2028, !2044, !2066, !2106, !2119, !2146, !2161, !2175, !2188, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2209, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2222, !2224, !2225, !2226, !2227, !2228, !2229, !2232, !2234, !2236, !2237, !2240, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2307, !2308, !2310, !2311, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2333, !2334, !2335, !2338, !2339, !2340, !2341, !2343, !2345, !2346, !2347, !2348, !2349, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2431, !2432, !2433, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2602, !2603, !2604, !2605, !2609, !2610, !2614, !2618, !2622, !2623, !2627, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2642, !2643, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2661, !2662, !2663, !2713, !2714, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725}
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1792, file: !1793, line: 82, baseType: !1796, size: 64, align: 64)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1792, file: !1793, line: 84, baseType: !1037, size: 32, align: 32, offset: 64)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1792, file: !1793, line: 84, baseType: !1037, size: 32, align: 32, offset: 96)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1792, file: !1793, line: 85, baseType: !1037, size: 32, align: 32, offset: 128)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1792, file: !1793, line: 86, baseType: !1801, size: 384, align: 32, offset: 160)
!1801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 384, align: 32, elements: !1802)
!1802 = !{!1803}
!1803 = !DISubrange(count: 12)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1792, file: !1793, line: 87, baseType: !1037, size: 32, align: 32, offset: 544)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1792, file: !1793, line: 90, baseType: !1806, size: 1088, align: 64, offset: 576)
!1806 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !908, line: 35, baseType: !1807)
!1807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !908, line: 31, size: 1088, align: 64, elements: !1808)
!1808 = !{!1809, !1810, !1814}
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1807, file: !908, line: 32, baseType: !1025, size: 64, align: 64)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1807, file: !908, line: 33, baseType: !1811, size: 512, align: 8, offset: 64)
!1811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 512, align: 8, elements: !1812)
!1812 = !{!1813}
!1813 = !DISubrange(count: 64)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1807, file: !908, line: 34, baseType: !1811, size: 512, align: 8, offset: 576)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1792, file: !1793, line: 91, baseType: !1806, size: 1088, align: 64, offset: 1664)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1792, file: !1793, line: 92, baseType: !1806, size: 1088, align: 64, offset: 2752)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1792, file: !1793, line: 93, baseType: !1806, size: 1088, align: 64, offset: 3840)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1792, file: !1793, line: 98, baseType: !1635, size: 64, align: 64, offset: 4928)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1792, file: !1793, line: 100, baseType: !1037, size: 32, align: 32, offset: 4992)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1792, file: !1793, line: 100, baseType: !1037, size: 32, align: 32, offset: 5024)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1792, file: !1793, line: 101, baseType: !1037, size: 32, align: 32, offset: 5056)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1792, file: !1793, line: 102, baseType: !1037, size: 32, align: 32, offset: 5088)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1792, file: !1793, line: 103, baseType: !1164, size: 64, align: 64, offset: 5120)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1792, file: !1793, line: 104, baseType: !900, size: 32, align: 32, offset: 5184)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1792, file: !1793, line: 105, baseType: !1037, size: 32, align: 32, offset: 5216)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1792, file: !1793, line: 106, baseType: !1037, size: 32, align: 32, offset: 5248)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1792, file: !1793, line: 109, baseType: !1037, size: 32, align: 32, offset: 5280)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1792, file: !1793, line: 110, baseType: !1037, size: 32, align: 32, offset: 5312)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1792, file: !1793, line: 112, baseType: !56, size: 32, align: 32, offset: 5344)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1792, file: !1793, line: 113, baseType: !1037, size: 32, align: 32, offset: 5376)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1792, file: !1793, line: 114, baseType: !1037, size: 32, align: 32, offset: 5408)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1792, file: !1793, line: 115, baseType: !1037, size: 32, align: 32, offset: 5440)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1792, file: !1793, line: 116, baseType: !1037, size: 32, align: 32, offset: 5472)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1792, file: !1793, line: 117, baseType: !1037, size: 32, align: 32, offset: 5504)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1792, file: !1793, line: 118, baseType: !1037, size: 32, align: 32, offset: 5536)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1792, file: !1793, line: 119, baseType: !1037, size: 32, align: 32, offset: 5568)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1792, file: !1793, line: 120, baseType: !1037, size: 32, align: 32, offset: 5600)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1792, file: !1793, line: 124, baseType: !1037, size: 32, align: 32, offset: 5632)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1792, file: !1793, line: 125, baseType: !1037, size: 32, align: 32, offset: 5664)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1792, file: !1793, line: 126, baseType: !1037, size: 32, align: 32, offset: 5696)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1792, file: !1793, line: 127, baseType: !1037, size: 32, align: 32, offset: 5728)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1792, file: !1793, line: 128, baseType: !1037, size: 32, align: 32, offset: 5760)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1792, file: !1793, line: 129, baseType: !1037, size: 32, align: 32, offset: 5792)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1792, file: !1793, line: 129, baseType: !1037, size: 32, align: 32, offset: 5824)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1792, file: !1793, line: 130, baseType: !1037, size: 32, align: 32, offset: 5856)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1792, file: !1793, line: 131, baseType: !1037, size: 32, align: 32, offset: 5888)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1792, file: !1793, line: 132, baseType: !1037, size: 32, align: 32, offset: 5920)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1792, file: !1793, line: 132, baseType: !1037, size: 32, align: 32, offset: 5952)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1792, file: !1793, line: 133, baseType: !1037, size: 32, align: 32, offset: 5984)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1792, file: !1793, line: 134, baseType: !1851, size: 64, align: 64, offset: 6016)
!1851 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1001, line: 149, baseType: !1165)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1792, file: !1793, line: 135, baseType: !1851, size: 64, align: 64, offset: 6080)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1792, file: !1793, line: 136, baseType: !1854, size: 64, align: 64, offset: 6144)
!1854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1855, size: 64, align: 64)
!1855 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1856, line: 91, baseType: !1857)
!1856 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1856, line: 45, size: 2624, align: 64, elements: !1858)
!1858 = !{!1859, !1861, !1872, !1873, !1874, !1876, !1882, !1883, !1884, !1885, !1886, !1887, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906}
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1857, file: !1856, line: 46, baseType: !1860, size: 64, align: 64)
!1860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1857, file: !1856, line: 47, baseType: !1862, size: 256, align: 64, offset: 64)
!1862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1863, line: 40, baseType: !1864)
!1863 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1863, line: 34, size: 256, align: 64, elements: !1865)
!1865 = !{!1866, !1867, !1871}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1864, file: !1863, line: 35, baseType: !1468, size: 64, align: 64)
