; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rv34dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rv34dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RV34DSPContext = type { [4 x [16 x void (i8*, i8*, i64)*]], [4 x [16 x void (i8*, i8*, i64)*]], [3 x void (i8*, i8*, i64, i32, i32, i32)*], [3 x void (i8*, i8*, i64, i32, i32, i32)*], [2 x [2 x void (i8*, i8*, i8*, i32, i32, i64)*]], void (i16*)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i32)*, [2 x void (i8*, i64, i32, i32, i32, i32, i32, i32, i32)*], [2 x void (i8*, i64, i32, i32, i32, i32)*], [2 x i32 (i8*, i64, i32, i32, i32, i32*, i32*)*] }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_rv34dsp_init(%struct.RV34DSPContext* %c) #0 !dbg !6 {
entry:
  %c.addr = alloca %struct.RV34DSPContext*, align 8
  store %struct.RV34DSPContext* %c, %struct.RV34DSPContext** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.RV34DSPContext** %c.addr, metadata !93, metadata !94), !dbg !95
  %0 = load %struct.RV34DSPContext*, %struct.RV34DSPContext** %c.addr, align 8, !dbg !96
  %rv34_inv_transform = getelementptr inbounds %struct.RV34DSPContext, %struct.RV34DSPContext* %0, i32 0, i32 5, !dbg !97

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rv34dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!6 = distinct !DISubprogram(name: "ff_rv34dsp_init", scope: !7, file: !7, line: 131, type: !8, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "libavcodec/rv34dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "RV34DSPContext", file: !12, line: 75, baseType: !13)
!12 = !DIFile(filename: "libavcodec/rv34dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RV34DSPContext", file: !12, line: 57, size: 9472, align: 64, elements: !14)
!14 = !{!15, !34, !35, !45, !46, !54, !62, !63, !68, !73, !80, !86}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_tab", scope: !13, file: !12, line: 58, baseType: !16, size: 4096, align: 64)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 4096, align: 64, elements: !31)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "qpel_mc_func", file: !18, line: 65, baseType: !19)
!18 = !DIFile(filename: "libavcodec/qpeldsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !26, !28}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 48, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !29, line: 149, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!30 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!31 = !{!32, !33}
!32 = !DISubrange(count: 4)
!33 = !DISubrange(count: 16)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "avg_pixels_tab", scope: !13, file: !12, line: 59, baseType: !16, size: 4096, align: 64, offset: 4096)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "put_chroma_pixels_tab", scope: !13, file: !12, line: 60, baseType: !36, size: 192, align: 64, offset: 8192)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 192, align: 64, elements: !43)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_chroma_mc_func", file: !38, line: 25, baseType: !39)
!38 = !DIFile(filename: "libavcodec/h264chroma.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !22, !22, !28, !42, !42, !42}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !{!44}
!44 = !DISubrange(count: 3)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "avg_chroma_pixels_tab", scope: !13, file: !12, line: 61, baseType: !36, size: 192, align: 64, offset: 8384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_weight_pixels_tab", scope: !13, file: !12, line: 67, baseType: !47, size: 256, align: 64, offset: 8576)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, align: 64, elements: !52)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_weight_func", file: !12, line: 33, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !22, !22, !22, !42, !42, !28}
!52 = !{!53, !53}
!53 = !DISubrange(count: 2)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_inv_transform", scope: !13, file: !12, line: 68, baseType: !55, size: 64, align: 64, offset: 8832)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_inv_transform_func", file: !12, line: 38, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !24, line: 37, baseType: !61)
!61 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_inv_transform_dc", scope: !13, file: !12, line: 69, baseType: !55, size: 64, align: 64, offset: 8896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_idct_add", scope: !13, file: !12, line: 70, baseType: !64, size: 64, align: 64, offset: 8960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_idct_add_func", file: !12, line: 40, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !22, !28, !59}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rv34_idct_dc_add", scope: !13, file: !12, line: 71, baseType: !69, size: 64, align: 64, offset: 9024)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv34_idct_dc_add_func", file: !12, line: 41, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !22, !28, !42}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_weak_loop_filter", scope: !13, file: !12, line: 72, baseType: !74, size: 128, align: 64, offset: 9088)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, align: 64, elements: !79)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_weak_loop_filter_func", file: !12, line: 44, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !22, !28, !42, !42, !42, !42, !42, !42, !42}
!79 = !{!53}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_strong_loop_filter", scope: !13, file: !12, line: 73, baseType: !81, size: 128, align: 64, offset: 9216)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, align: 64, elements: !79)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_strong_loop_filter_func", file: !12, line: 49, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !22, !28, !42, !42, !42, !42}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rv40_loop_filter_strength", scope: !13, file: !12, line: 74, baseType: !87, size: 128, align: 64, offset: 9344)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, align: 64, elements: !79)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "rv40_loop_filter_strength_func", file: !12, line: 53, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!42, !22, !28, !42, !42, !42, !92, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!93 = !DILocalVariable(name: "c", arg: 1, scope: !6, file: !7, line: 131, type: !10)
!94 = !DIExpression()
!95 = !DILocation(line: 131, column: 60, scope: !6)
!96 = !DILocation(line: 133, column: 5, scope: !6)
!97 = !DILocation(line: 133, column: 8, scope: !6)
!98 = !DILocation(line: 133, column: 27, scope: !6)
!99 = !DILocation(line: 134, column: 5, scope: !6)
!100 = !DILocation(line: 134, column: 8, scope: !6)
!101 = !DILocation(line: 134, column: 30, scope: !6)
!102 = !DILocation(line: 136, column: 5, scope: !6)
!103 = !DILocation(line: 136, column: 8, scope: !6)
!104 = !DILocation(line: 136, column: 22, scope: !6)
!105 = !DILocation(line: 137, column: 5, scope: !6)
!106 = !DILocation(line: 137, column: 8, scope: !6)
!107 = !DILocation(line: 137, column: 25, scope: !6)
!108 = !DILocation(line: 142, column: 29, scope: !109)
!109 = distinct !DILexicalBlock(scope: !6, file: !7, line: 141, column: 9)
!110 = !DILocation(line: 142, column: 9, scope: !109)
!111 = !DILocation(line: 143, column: 1, scope: !6)
!112 = distinct !DISubprogram(name: "rv34_inv_transform_noround_c", scope: !7, file: !7, line: 85, type: !57, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!113 = !DILocalVariable(name: "temp", arg: 1, scope: !114, file: !7, line: 36, type: !92)
!114 = distinct !DISubprogram(name: "rv34_row_transform", scope: !7, file: !7, line: 36, type: !115, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !92, !59}
!117 = !DILocation(line: 36, column: 74, scope: !114, inlinedAt: !118)
!118 = distinct !DILocation(line: 89, column: 5, scope: !112)
!119 = !DILocalVariable(name: "block", arg: 2, scope: !114, file: !7, line: 36, type: !59)
!120 = !DILocation(line: 36, column: 93, scope: !114, inlinedAt: !118)
!121 = !DILocalVariable(name: "i", scope: !114, file: !7, line: 38, type: !42)
!122 = !DILocation(line: 38, column: 9, scope: !114, inlinedAt: !118)
!123 = !DILocalVariable(name: "z0", scope: !124, file: !7, line: 41, type: !127)
!124 = distinct !DILexicalBlock(scope: !125, file: !7, line: 40, column: 27)
!125 = distinct !DILexicalBlock(scope: !126, file: !7, line: 40, column: 5)
!126 = distinct !DILexicalBlock(scope: !114, file: !7, line: 40, column: 5)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!128 = !DILocation(line: 41, column: 19, scope: !124, inlinedAt: !118)
!129 = !DILocalVariable(name: "z1", scope: !124, file: !7, line: 42, type: !127)
!130 = !DILocation(line: 42, column: 19, scope: !124, inlinedAt: !118)
!131 = !DILocalVariable(name: "z2", scope: !124, file: !7, line: 43, type: !127)
!132 = !DILocation(line: 43, column: 19, scope: !124, inlinedAt: !118)
!133 = !DILocalVariable(name: "z3", scope: !124, file: !7, line: 44, type: !127)
!134 = !DILocation(line: 44, column: 19, scope: !124, inlinedAt: !118)
!135 = !DILocalVariable(name: "block", arg: 1, scope: !112, file: !7, line: 85, type: !59)
!136 = !DILocation(line: 85, column: 51, scope: !112)
!137 = !DILocalVariable(name: "temp", scope: !112, file: !7, line: 86, type: !138)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, align: 32, elements: !139)
!139 = !{!33}
!140 = !DILocation(line: 86, column: 9, scope: !112)
