; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--movtextenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--movtextenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!842 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850}
!844 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!845 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!846 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!847 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!848 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!849 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!850 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889, !890, !898, !900, !906}
!888 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!889 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !892, line: 222, size: 16, align: 8, elements: !893)
!892 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !891, file: !892, line: 222, baseType: !895, size: 16, align: 16)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !896, line: 49, baseType: !897)
!896 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!897 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !892, line: 221, size: 32, align: 8, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !902, file: !892, line: 221, baseType: !905, size: 32, align: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !896, line: 51, baseType: !888)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!909 = !{!910, !1505, !1511, !1513, !1555}
!910 = distinct !DIGlobalVariable(name: "ff_movtext_encoder", scope: !0, file: !911, line: 432, type: !912, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_movtext_encoder)
!911 = !DIFile(filename: "libavcodec/movtextenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !929, !932, !935, !938, !943, !946, !988, !996, !997, !998, !1000, !1404, !1410, !1415, !1419, !1420, !1460, !1480, !1484, !1485, !1489, !1493, !1494, !1498, !1499, !1500}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !913, file: !14, line: 3475, baseType: !906, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !913, file: !14, line: 3480, baseType: !906, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !913, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !913, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !913, file: !14, line: 3487, baseType: !889, size: 32, align: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !913, file: !14, line: 3488, baseType: !921, size: 64, align: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !924, line: 61, baseType: !925)
!924 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !924, line: 58, size: 64, align: 32, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !925, file: !924, line: 59, baseType: !889, size: 32, align: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !925, file: !924, line: 60, baseType: !889, size: 32, align: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !913, file: !14, line: 3489, baseType: !930, size: 64, align: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !913, file: !14, line: 3490, baseType: !933, size: 64, align: 64, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !913, file: !14, line: 3491, baseType: !936, size: 64, align: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !913, file: !14, line: 3492, baseType: !939, size: 64, align: 64, offset: 512)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !896, line: 55, baseType: !942)
!942 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !913, file: !14, line: 3493, baseType: !944, size: 8, align: 8, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !896, line: 48, baseType: !945)
!945 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !913, file: !14, line: 3494, baseType: !947, size: 64, align: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !951)
!951 = !{!952, !953, !958, !962, !963, !964, !965, !969, !975, !977, !981}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !950, file: !691, line: 72, baseType: !906, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !950, file: !691, line: 78, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!906, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !950, file: !691, line: 85, baseType: !959, size: 64, align: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !950, file: !691, line: 93, baseType: !889, size: 32, align: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !950, file: !691, line: 99, baseType: !889, size: 32, align: 32, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !950, file: !691, line: 108, baseType: !889, size: 32, align: 32, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !950, file: !691, line: 113, baseType: !966, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!957, !957, !957}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !950, file: !691, line: 123, baseType: !970, size: 64, align: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !950, file: !691, line: 130, baseType: !976, size: 32, align: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !950, file: !691, line: 136, baseType: !978, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!976, !957}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !950, file: !691, line: 142, baseType: !982, size: 64, align: 64, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!889, !985, !957, !906, !889}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !913, file: !14, line: 3495, baseType: !989, size: 64, align: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !992, file: !14, line: 3402, baseType: !889, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !14, line: 3403, baseType: !906, size: 64, align: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !913, file: !14, line: 3507, baseType: !906, size: 64, align: 64, offset: 768)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !913, file: !14, line: 3516, baseType: !889, size: 32, align: 32, offset: 832)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !913, file: !14, line: 3517, baseType: !999, size: 64, align: 64, offset: 896)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !913, file: !14, line: 3527, baseType: !1001, size: 64, align: 64, offset: 960)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!889, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1014, !1015, !1016, !1017, !1020, !1021, !1024, !1025, !1026, !1027, !1028, !1029, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1144, !1148, !1149, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1335, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1006, file: !14, line: 1561, baseType: !947, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1006, file: !14, line: 1562, baseType: !889, size: 32, align: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1006, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1006, file: !14, line: 1565, baseType: !1012, size: 64, align: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1006, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1006, file: !14, line: 1581, baseType: !888, size: 32, align: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1006, file: !14, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1006, file: !14, line: 1591, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1006, file: !14, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1006, file: !14, line: 1606, baseType: !1022, size: 64, align: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !896, line: 40, baseType: !1023)
!1023 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1006, file: !14, line: 1614, baseType: !889, size: 32, align: 32, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1006, file: !14, line: 1622, baseType: !889, size: 32, align: 32, offset: 544)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1006, file: !14, line: 1628, baseType: !889, size: 32, align: 32, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1006, file: !14, line: 1636, baseType: !889, size: 32, align: 32, offset: 608)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1006, file: !14, line: 1643, baseType: !889, size: 32, align: 32, offset: 640)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1006, file: !14, line: 1657, baseType: !1030, size: 64, align: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1006, file: !14, line: 1658, baseType: !889, size: 32, align: 32, offset: 768)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1006, file: !14, line: 1679, baseType: !923, size: 64, align: 32, offset: 800)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1006, file: !14, line: 1688, baseType: !889, size: 32, align: 32, offset: 864)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1006, file: !14, line: 1712, baseType: !889, size: 32, align: 32, offset: 896)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1006, file: !14, line: 1729, baseType: !889, size: 32, align: 32, offset: 928)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1006, file: !14, line: 1729, baseType: !889, size: 32, align: 32, offset: 960)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1006, file: !14, line: 1744, baseType: !889, size: 32, align: 32, offset: 992)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1006, file: !14, line: 1744, baseType: !889, size: 32, align: 32, offset: 1024)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1006, file: !14, line: 1751, baseType: !889, size: 32, align: 32, offset: 1056)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1006, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1006, file: !14, line: 1791, baseType: !1042, size: 64, align: 64, offset: 1152)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !1045, !1046, !1143, !889, !889, !889}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1050)
!1050 = !{!1051, !1055, !1057, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1095, !1097, !1098, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1131, !1132, !1133, !1134, !1135, !1136, !1139, !1140, !1141, !1142}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !722, line: 282, baseType: !1052, size: 512, align: 64)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 512, align: 64, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 8)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1049, file: !722, line: 299, baseType: !1056, size: 256, align: 32, offset: 512)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 256, align: 32, elements: !1053)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1049, file: !722, line: 315, baseType: !1058, size: 64, align: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1049, file: !722, line: 326, baseType: !889, size: 32, align: 32, offset: 832)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1049, file: !722, line: 326, baseType: !889, size: 32, align: 32, offset: 864)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1049, file: !722, line: 334, baseType: !889, size: 32, align: 32, offset: 896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1049, file: !722, line: 341, baseType: !889, size: 32, align: 32, offset: 928)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1049, file: !722, line: 346, baseType: !889, size: 32, align: 32, offset: 960)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1049, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1049, file: !722, line: 356, baseType: !923, size: 64, align: 32, offset: 1024)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1049, file: !722, line: 361, baseType: !1022, size: 64, align: 64, offset: 1088)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1049, file: !722, line: 369, baseType: !1022, size: 64, align: 64, offset: 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1049, file: !722, line: 377, baseType: !1022, size: 64, align: 64, offset: 1216)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1049, file: !722, line: 382, baseType: !889, size: 32, align: 32, offset: 1280)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1049, file: !722, line: 386, baseType: !889, size: 32, align: 32, offset: 1312)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1049, file: !722, line: 391, baseType: !889, size: 32, align: 32, offset: 1344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1049, file: !722, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1049, file: !722, line: 403, baseType: !1074, size: 512, align: 64, offset: 1472)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 512, align: 64, elements: !1053)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1049, file: !722, line: 410, baseType: !889, size: 32, align: 32, offset: 1984)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1049, file: !722, line: 415, baseType: !889, size: 32, align: 32, offset: 2016)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1049, file: !722, line: 420, baseType: !889, size: 32, align: 32, offset: 2048)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1049, file: !722, line: 425, baseType: !889, size: 32, align: 32, offset: 2080)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1049, file: !722, line: 435, baseType: !1022, size: 64, align: 64, offset: 2112)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1049, file: !722, line: 440, baseType: !889, size: 32, align: 32, offset: 2176)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1049, file: !722, line: 445, baseType: !941, size: 64, align: 64, offset: 2240)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1049, file: !722, line: 459, baseType: !1083, size: 512, align: 64, offset: 2304)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, align: 64, elements: !1053)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1086, line: 94, baseType: !1087)
!1086 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1086, line: 81, size: 192, align: 64, elements: !1088)
!1088 = !{!1089, !1093, !1094}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1087, file: !1086, line: 82, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1086, line: 73, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1086, line: 73, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1086, line: 89, baseType: !1030, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !1086, line: 93, baseType: !889, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1049, file: !722, line: 473, baseType: !1096, size: 64, align: 64, offset: 2816)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1049, file: !722, line: 477, baseType: !889, size: 32, align: 32, offset: 2880)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1049, file: !722, line: 479, baseType: !1099, size: 64, align: 64, offset: 2944)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1112}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1102, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1102, file: !722, line: 203, baseType: !1030, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1102, file: !722, line: 204, baseType: !889, size: 32, align: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1102, file: !722, line: 205, baseType: !1108, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1110, line: 86, baseType: !1111)
!1110 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1110, line: 86, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1102, file: !722, line: 206, baseType: !1084, size: 64, align: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1049, file: !722, line: 480, baseType: !889, size: 32, align: 32, offset: 3008)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1049, file: !722, line: 505, baseType: !889, size: 32, align: 32, offset: 3040)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1049, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1049, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1049, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1049, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1049, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1049, file: !722, line: 532, baseType: !1022, size: 64, align: 64, offset: 3264)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1049, file: !722, line: 539, baseType: !1022, size: 64, align: 64, offset: 3328)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1049, file: !722, line: 547, baseType: !1022, size: 64, align: 64, offset: 3392)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1049, file: !722, line: 554, baseType: !1108, size: 64, align: 64, offset: 3456)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1049, file: !722, line: 563, baseType: !889, size: 32, align: 32, offset: 3520)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1049, file: !722, line: 572, baseType: !889, size: 32, align: 32, offset: 3552)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1049, file: !722, line: 581, baseType: !889, size: 32, align: 32, offset: 3584)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1049, file: !722, line: 588, baseType: !1128, size: 64, align: 64, offset: 3648)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !896, line: 36, baseType: !1130)
!1130 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1049, file: !722, line: 593, baseType: !889, size: 32, align: 32, offset: 3712)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1049, file: !722, line: 596, baseType: !889, size: 32, align: 32, offset: 3744)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1049, file: !722, line: 599, baseType: !1084, size: 64, align: 64, offset: 3776)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1049, file: !722, line: 605, baseType: !1084, size: 64, align: 64, offset: 3840)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1049, file: !722, line: 616, baseType: !1084, size: 64, align: 64, offset: 3904)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1049, file: !722, line: 626, baseType: !1137, size: 64, align: 64, offset: 3968)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1138, line: 216, baseType: !942)
!1138 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1049, file: !722, line: 627, baseType: !1137, size: 64, align: 64, offset: 4032)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1049, file: !722, line: 628, baseType: !1137, size: 64, align: 64, offset: 4096)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1049, file: !722, line: 629, baseType: !1137, size: 64, align: 64, offset: 4160)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1049, file: !722, line: 645, baseType: !1084, size: 64, align: 64, offset: 4224)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1006, file: !14, line: 1808, baseType: !1145, size: 64, align: 64, offset: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!473, !1045, !930}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1006, file: !14, line: 1816, baseType: !889, size: 32, align: 32, offset: 1280)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1006, file: !14, line: 1825, baseType: !1150, size: 32, align: 32, offset: 1312)
!1150 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1006, file: !14, line: 1830, baseType: !889, size: 32, align: 32, offset: 1344)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1006, file: !14, line: 1838, baseType: !1150, size: 32, align: 32, offset: 1376)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1006, file: !14, line: 1846, baseType: !889, size: 32, align: 32, offset: 1408)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1006, file: !14, line: 1851, baseType: !889, size: 32, align: 32, offset: 1440)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1006, file: !14, line: 1861, baseType: !1150, size: 32, align: 32, offset: 1472)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1006, file: !14, line: 1868, baseType: !1150, size: 32, align: 32, offset: 1504)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1006, file: !14, line: 1875, baseType: !1150, size: 32, align: 32, offset: 1536)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1006, file: !14, line: 1882, baseType: !1150, size: 32, align: 32, offset: 1568)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1006, file: !14, line: 1889, baseType: !1150, size: 32, align: 32, offset: 1600)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1006, file: !14, line: 1896, baseType: !1150, size: 32, align: 32, offset: 1632)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1006, file: !14, line: 1903, baseType: !1150, size: 32, align: 32, offset: 1664)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1006, file: !14, line: 1910, baseType: !889, size: 32, align: 32, offset: 1696)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1006, file: !14, line: 1915, baseType: !889, size: 32, align: 32, offset: 1728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1006, file: !14, line: 1926, baseType: !1143, size: 64, align: 64, offset: 1792)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1006, file: !14, line: 1935, baseType: !923, size: 64, align: 32, offset: 1856)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1006, file: !14, line: 1942, baseType: !889, size: 32, align: 32, offset: 1920)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1006, file: !14, line: 1948, baseType: !889, size: 32, align: 32, offset: 1952)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1006, file: !14, line: 1954, baseType: !889, size: 32, align: 32, offset: 1984)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1006, file: !14, line: 1960, baseType: !889, size: 32, align: 32, offset: 2016)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1006, file: !14, line: 1984, baseType: !889, size: 32, align: 32, offset: 2048)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1006, file: !14, line: 1991, baseType: !889, size: 32, align: 32, offset: 2080)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1006, file: !14, line: 1996, baseType: !889, size: 32, align: 32, offset: 2112)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1006, file: !14, line: 2004, baseType: !889, size: 32, align: 32, offset: 2144)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1006, file: !14, line: 2011, baseType: !889, size: 32, align: 32, offset: 2176)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1006, file: !14, line: 2018, baseType: !889, size: 32, align: 32, offset: 2208)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1006, file: !14, line: 2027, baseType: !889, size: 32, align: 32, offset: 2240)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1006, file: !14, line: 2034, baseType: !889, size: 32, align: 32, offset: 2272)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1006, file: !14, line: 2044, baseType: !889, size: 32, align: 32, offset: 2304)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1006, file: !14, line: 2054, baseType: !1180, size: 64, align: 64, offset: 2368)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1006, file: !14, line: 2061, baseType: !1180, size: 64, align: 64, offset: 2432)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1006, file: !14, line: 2066, baseType: !889, size: 32, align: 32, offset: 2496)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1006, file: !14, line: 2070, baseType: !889, size: 32, align: 32, offset: 2528)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1006, file: !14, line: 2078, baseType: !889, size: 32, align: 32, offset: 2560)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1006, file: !14, line: 2085, baseType: !889, size: 32, align: 32, offset: 2592)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1006, file: !14, line: 2092, baseType: !889, size: 32, align: 32, offset: 2624)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1006, file: !14, line: 2099, baseType: !889, size: 32, align: 32, offset: 2656)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1006, file: !14, line: 2106, baseType: !889, size: 32, align: 32, offset: 2688)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1006, file: !14, line: 2113, baseType: !889, size: 32, align: 32, offset: 2720)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1006, file: !14, line: 2120, baseType: !889, size: 32, align: 32, offset: 2752)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1006, file: !14, line: 2125, baseType: !889, size: 32, align: 32, offset: 2784)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1006, file: !14, line: 2133, baseType: !889, size: 32, align: 32, offset: 2816)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1006, file: !14, line: 2140, baseType: !889, size: 32, align: 32, offset: 2848)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1006, file: !14, line: 2145, baseType: !889, size: 32, align: 32, offset: 2880)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1006, file: !14, line: 2153, baseType: !889, size: 32, align: 32, offset: 2912)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1006, file: !14, line: 2158, baseType: !889, size: 32, align: 32, offset: 2944)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1006, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1006, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1006, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1006, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1006, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1006, file: !14, line: 2203, baseType: !889, size: 32, align: 32, offset: 3136)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1006, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1006, file: !14, line: 2212, baseType: !889, size: 32, align: 32, offset: 3200)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1006, file: !14, line: 2213, baseType: !889, size: 32, align: 32, offset: 3232)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1006, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1006, file: !14, line: 2232, baseType: !889, size: 32, align: 32, offset: 3296)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1006, file: !14, line: 2243, baseType: !889, size: 32, align: 32, offset: 3328)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1006, file: !14, line: 2249, baseType: !889, size: 32, align: 32, offset: 3360)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1006, file: !14, line: 2256, baseType: !889, size: 32, align: 32, offset: 3392)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1006, file: !14, line: 2263, baseType: !941, size: 64, align: 64, offset: 3456)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1006, file: !14, line: 2270, baseType: !941, size: 64, align: 64, offset: 3520)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1006, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1006, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1006, file: !14, line: 2367, baseType: !1216, size: 64, align: 64, offset: 3648)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!889, !1045, !1219, !889}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1006, file: !14, line: 2383, baseType: !889, size: 32, align: 32, offset: 3712)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1006, file: !14, line: 2386, baseType: !1150, size: 32, align: 32, offset: 3744)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1006, file: !14, line: 2387, baseType: !1150, size: 32, align: 32, offset: 3776)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1006, file: !14, line: 2394, baseType: !889, size: 32, align: 32, offset: 3808)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1006, file: !14, line: 2401, baseType: !889, size: 32, align: 32, offset: 3840)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1006, file: !14, line: 2408, baseType: !889, size: 32, align: 32, offset: 3872)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1006, file: !14, line: 2415, baseType: !889, size: 32, align: 32, offset: 3904)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1006, file: !14, line: 2422, baseType: !889, size: 32, align: 32, offset: 3936)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1006, file: !14, line: 2423, baseType: !1229, size: 64, align: 64, offset: 3968)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1231, file: !14, line: 827, baseType: !889, size: 32, align: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1231, file: !14, line: 828, baseType: !889, size: 32, align: 32, offset: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1231, file: !14, line: 829, baseType: !889, size: 32, align: 32, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1231, file: !14, line: 830, baseType: !1150, size: 32, align: 32, offset: 96)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1006, file: !14, line: 2430, baseType: !1022, size: 64, align: 64, offset: 4032)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1006, file: !14, line: 2437, baseType: !1022, size: 64, align: 64, offset: 4096)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1006, file: !14, line: 2444, baseType: !1150, size: 32, align: 32, offset: 4160)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1006, file: !14, line: 2451, baseType: !1150, size: 32, align: 32, offset: 4192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1006, file: !14, line: 2458, baseType: !889, size: 32, align: 32, offset: 4224)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1006, file: !14, line: 2469, baseType: !889, size: 32, align: 32, offset: 4256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1006, file: !14, line: 2475, baseType: !889, size: 32, align: 32, offset: 4288)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1006, file: !14, line: 2481, baseType: !889, size: 32, align: 32, offset: 4320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1006, file: !14, line: 2485, baseType: !889, size: 32, align: 32, offset: 4352)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1006, file: !14, line: 2489, baseType: !889, size: 32, align: 32, offset: 4384)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1006, file: !14, line: 2493, baseType: !889, size: 32, align: 32, offset: 4416)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1006, file: !14, line: 2501, baseType: !889, size: 32, align: 32, offset: 4448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1006, file: !14, line: 2506, baseType: !889, size: 32, align: 32, offset: 4480)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1006, file: !14, line: 2510, baseType: !889, size: 32, align: 32, offset: 4512)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1006, file: !14, line: 2514, baseType: !1022, size: 64, align: 64, offset: 4544)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1006, file: !14, line: 2528, baseType: !1253, size: 64, align: 64, offset: 4608)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !1045, !957, !889, !889}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1006, file: !14, line: 2534, baseType: !889, size: 32, align: 32, offset: 4672)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1006, file: !14, line: 2545, baseType: !889, size: 32, align: 32, offset: 4704)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1006, file: !14, line: 2547, baseType: !889, size: 32, align: 32, offset: 4736)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1006, file: !14, line: 2549, baseType: !889, size: 32, align: 32, offset: 4768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1006, file: !14, line: 2551, baseType: !889, size: 32, align: 32, offset: 4800)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1006, file: !14, line: 2553, baseType: !889, size: 32, align: 32, offset: 4832)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1006, file: !14, line: 2555, baseType: !889, size: 32, align: 32, offset: 4864)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1006, file: !14, line: 2557, baseType: !889, size: 32, align: 32, offset: 4896)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1006, file: !14, line: 2559, baseType: !889, size: 32, align: 32, offset: 4928)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1006, file: !14, line: 2563, baseType: !889, size: 32, align: 32, offset: 4960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1006, file: !14, line: 2571, baseType: !1267, size: 64, align: 64, offset: 4992)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1006, file: !14, line: 2579, baseType: !1267, size: 64, align: 64, offset: 5056)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1006, file: !14, line: 2586, baseType: !889, size: 32, align: 32, offset: 5120)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1006, file: !14, line: 2615, baseType: !889, size: 32, align: 32, offset: 5152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1006, file: !14, line: 2627, baseType: !889, size: 32, align: 32, offset: 5184)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1006, file: !14, line: 2637, baseType: !889, size: 32, align: 32, offset: 5216)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1006, file: !14, line: 2681, baseType: !889, size: 32, align: 32, offset: 5248)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1006, file: !14, line: 2709, baseType: !1022, size: 64, align: 64, offset: 5312)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1006, file: !14, line: 2716, baseType: !1276, size: 64, align: 64, offset: 5376)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1289, !1295, !1299, !1300, !1301, !1302, !1308, !1309, !1310, !1311, !1312}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !14, line: 3642, baseType: !906, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1278, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1278, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1278, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1278, file: !14, line: 3669, baseType: !889, size: 32, align: 32, offset: 160)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1278, file: !14, line: 3682, baseType: !1286, size: 64, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!889, !1004, !1219}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1278, file: !14, line: 3698, baseType: !1290, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!889, !1004, !1293, !905}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1278, file: !14, line: 3712, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!889, !1004, !889, !1293, !905}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1278, file: !14, line: 3726, baseType: !1290, size: 64, align: 64, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1278, file: !14, line: 3737, baseType: !1001, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1278, file: !14, line: 3746, baseType: !889, size: 32, align: 32, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1278, file: !14, line: 3757, baseType: !1303, size: 64, align: 64, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !1306}
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1278, file: !14, line: 3766, baseType: !1001, size: 64, align: 64, offset: 640)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1278, file: !14, line: 3774, baseType: !1001, size: 64, align: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1278, file: !14, line: 3780, baseType: !889, size: 32, align: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1278, file: !14, line: 3785, baseType: !889, size: 32, align: 32, offset: 800)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1278, file: !14, line: 3795, baseType: !1313, size: 64, align: 64, offset: 832)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!889, !1004, !1084}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1006, file: !14, line: 2728, baseType: !957, size: 64, align: 64, offset: 5440)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1006, file: !14, line: 2735, baseType: !1074, size: 512, align: 64, offset: 5504)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1006, file: !14, line: 2742, baseType: !889, size: 32, align: 32, offset: 6016)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1006, file: !14, line: 2755, baseType: !889, size: 32, align: 32, offset: 6048)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1006, file: !14, line: 2776, baseType: !889, size: 32, align: 32, offset: 6080)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1006, file: !14, line: 2783, baseType: !889, size: 32, align: 32, offset: 6112)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1006, file: !14, line: 2791, baseType: !889, size: 32, align: 32, offset: 6144)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1006, file: !14, line: 2802, baseType: !1219, size: 64, align: 64, offset: 6208)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1006, file: !14, line: 2811, baseType: !889, size: 32, align: 32, offset: 6272)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1006, file: !14, line: 2821, baseType: !889, size: 32, align: 32, offset: 6304)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1006, file: !14, line: 2830, baseType: !889, size: 32, align: 32, offset: 6336)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1006, file: !14, line: 2840, baseType: !889, size: 32, align: 32, offset: 6368)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1006, file: !14, line: 2851, baseType: !1329, size: 64, align: 64, offset: 6400)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!889, !1045, !1332, !957, !1143, !889, !889}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!889, !1045, !957}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1006, file: !14, line: 2871, baseType: !1336, size: 64, align: 64, offset: 6464)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!889, !1045, !1339, !957, !1143, !889}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!889, !1045, !957, !889, !889}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1006, file: !14, line: 2878, baseType: !889, size: 32, align: 32, offset: 6528)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1006, file: !14, line: 2885, baseType: !889, size: 32, align: 32, offset: 6560)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1006, file: !14, line: 3005, baseType: !889, size: 32, align: 32, offset: 6592)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1006, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1006, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1006, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1006, file: !14, line: 3037, baseType: !1030, size: 64, align: 64, offset: 6720)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1006, file: !14, line: 3038, baseType: !889, size: 32, align: 32, offset: 6784)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1006, file: !14, line: 3050, baseType: !941, size: 64, align: 64, offset: 6848)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1006, file: !14, line: 3065, baseType: !889, size: 32, align: 32, offset: 6912)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1006, file: !14, line: 3083, baseType: !889, size: 32, align: 32, offset: 6944)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1006, file: !14, line: 3092, baseType: !923, size: 64, align: 32, offset: 6976)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1006, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1006, file: !14, line: 3106, baseType: !923, size: 64, align: 32, offset: 7072)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1006, file: !14, line: 3113, baseType: !1357, size: 64, align: 64, offset: 7168)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1367, !1370}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1360, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1360, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1360, file: !14, line: 720, baseType: !906, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1360, file: !14, line: 724, baseType: !906, size: 64, align: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1360, file: !14, line: 728, baseType: !889, size: 32, align: 32, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1360, file: !14, line: 734, baseType: !1368, size: 64, align: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1360, file: !14, line: 739, baseType: !1371, size: 64, align: 64, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1006, file: !14, line: 3129, baseType: !1022, size: 64, align: 64, offset: 7232)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1006, file: !14, line: 3130, baseType: !1022, size: 64, align: 64, offset: 7296)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1006, file: !14, line: 3131, baseType: !1022, size: 64, align: 64, offset: 7360)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1006, file: !14, line: 3132, baseType: !1022, size: 64, align: 64, offset: 7424)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1006, file: !14, line: 3139, baseType: !1267, size: 64, align: 64, offset: 7488)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1006, file: !14, line: 3147, baseType: !889, size: 32, align: 32, offset: 7552)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1006, file: !14, line: 3165, baseType: !889, size: 32, align: 32, offset: 7584)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1006, file: !14, line: 3172, baseType: !889, size: 32, align: 32, offset: 7616)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1006, file: !14, line: 3180, baseType: !889, size: 32, align: 32, offset: 7648)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1006, file: !14, line: 3191, baseType: !1180, size: 64, align: 64, offset: 7680)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1006, file: !14, line: 3199, baseType: !1030, size: 64, align: 64, offset: 7744)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1006, file: !14, line: 3207, baseType: !1267, size: 64, align: 64, offset: 7808)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1006, file: !14, line: 3214, baseType: !888, size: 32, align: 32, offset: 7872)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1006, file: !14, line: 3224, baseType: !1387, size: 64, align: 64, offset: 7936)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1390)
!1390 = !{!1391, !1392, !1393}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1389, file: !14, line: 1412, baseType: !1030, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1389, file: !14, line: 1413, baseType: !889, size: 32, align: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1389, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1006, file: !14, line: 3225, baseType: !889, size: 32, align: 32, offset: 8000)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1006, file: !14, line: 3249, baseType: !1084, size: 64, align: 64, offset: 8064)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1006, file: !14, line: 3256, baseType: !889, size: 32, align: 32, offset: 8128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1006, file: !14, line: 3271, baseType: !889, size: 32, align: 32, offset: 8160)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1006, file: !14, line: 3279, baseType: !1022, size: 64, align: 64, offset: 8192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1006, file: !14, line: 3301, baseType: !1084, size: 64, align: 64, offset: 8256)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1006, file: !14, line: 3310, baseType: !889, size: 32, align: 32, offset: 8320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1006, file: !14, line: 3337, baseType: !889, size: 32, align: 32, offset: 8352)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1006, file: !14, line: 3351, baseType: !889, size: 32, align: 32, offset: 8384)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1006, file: !14, line: 3359, baseType: !889, size: 32, align: 32, offset: 8416)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !913, file: !14, line: 3535, baseType: !1405, size: 64, align: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!889, !1004, !1408}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !913, file: !14, line: 3541, baseType: !1411, size: 64, align: 64, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1414)
!1414 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !913, file: !14, line: 3549, baseType: !1416, size: 64, align: 64, offset: 1152)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{null, !999}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !913, file: !14, line: 3551, baseType: !1001, size: 64, align: 64, offset: 1216)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !913, file: !14, line: 3552, baseType: !1421, size: 64, align: 64, offset: 1280)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!889, !1004, !1030, !889, !1424}
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431, !1432, !1459}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1426, file: !14, line: 3921, baseType: !895, size: 16, align: 16)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1426, file: !14, line: 3922, baseType: !905, size: 32, align: 32, offset: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1426, file: !14, line: 3923, baseType: !905, size: 32, align: 32, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1426, file: !14, line: 3924, baseType: !888, size: 32, align: 32, offset: 96)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1426, file: !14, line: 3925, baseType: !1433, size: 64, align: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441, !1442, !1443, !1449, !1453, !1455, !1456, !1457, !1458}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1436, file: !14, line: 3886, baseType: !889, size: 32, align: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1436, file: !14, line: 3887, baseType: !889, size: 32, align: 32, offset: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1436, file: !14, line: 3888, baseType: !889, size: 32, align: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1436, file: !14, line: 3889, baseType: !889, size: 32, align: 32, offset: 96)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1436, file: !14, line: 3890, baseType: !889, size: 32, align: 32, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1436, file: !14, line: 3897, baseType: !1444, size: 768, align: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1446)
!1446 = !{!1447, !1448}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1445, file: !14, line: 3855, baseType: !1052, size: 512, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1445, file: !14, line: 3857, baseType: !1056, size: 256, align: 32, offset: 512)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1436, file: !14, line: 3903, baseType: !1450, size: 256, align: 64, offset: 960)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 256, align: 64, elements: !1451)
!1451 = !{!1452}
!1452 = !DISubrange(count: 4)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1436, file: !14, line: 3904, baseType: !1454, size: 128, align: 32, offset: 1216)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 128, align: 32, elements: !1451)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1436, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1436, file: !14, line: 3908, baseType: !1267, size: 64, align: 64, offset: 1408)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1436, file: !14, line: 3915, baseType: !1267, size: 64, align: 64, offset: 1472)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1436, file: !14, line: 3917, baseType: !889, size: 32, align: 32, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1426, file: !14, line: 3926, baseType: !1022, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !913, file: !14, line: 3564, baseType: !1461, size: 64, align: 64, offset: 1344)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!889, !1004, !1464, !1046, !1143}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1467)
!1467 = !{!1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1466, file: !14, line: 1451, baseType: !1084, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1466, file: !14, line: 1461, baseType: !1022, size: 64, align: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1466, file: !14, line: 1467, baseType: !1022, size: 64, align: 64, offset: 128)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1466, file: !14, line: 1468, baseType: !1030, size: 64, align: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1466, file: !14, line: 1469, baseType: !889, size: 32, align: 32, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1466, file: !14, line: 1470, baseType: !889, size: 32, align: 32, offset: 288)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1466, file: !14, line: 1474, baseType: !889, size: 32, align: 32, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1466, file: !14, line: 1479, baseType: !1387, size: 64, align: 64, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1466, file: !14, line: 1480, baseType: !889, size: 32, align: 32, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1466, file: !14, line: 1486, baseType: !1022, size: 64, align: 64, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1466, file: !14, line: 1488, baseType: !1022, size: 64, align: 64, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1466, file: !14, line: 1497, baseType: !1022, size: 64, align: 64, offset: 640)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !913, file: !14, line: 3566, baseType: !1481, size: 64, align: 64, offset: 1408)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!889, !1004, !957, !1143, !1464}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !913, file: !14, line: 3567, baseType: !1001, size: 64, align: 64, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !913, file: !14, line: 3576, baseType: !1486, size: 64, align: 64, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!889, !1004, !1046}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !913, file: !14, line: 3577, baseType: !1490, size: 64, align: 64, offset: 1600)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!889, !1004, !1464}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !913, file: !14, line: 3584, baseType: !1286, size: 64, align: 64, offset: 1664)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !913, file: !14, line: 3589, baseType: !1495, size: 64, align: 64, offset: 1728)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1004}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !913, file: !14, line: 3594, baseType: !889, size: 32, align: 32, offset: 1792)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !913, file: !14, line: 3600, baseType: !906, size: 64, align: 64, offset: 1856)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !913, file: !14, line: 3609, baseType: !1501, size: 64, align: 64, offset: 1920)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1504)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1505 = distinct !DIGlobalVariable(name: "text_sample_entry", scope: !1506, file: !911, line: 161, type: !1508, isLocal: true, isDefinition: true, variable: [48 x i8]* @mov_text_encode_init.text_sample_entry)
!1506 = distinct !DISubprogram(name: "mov_text_encode_init", scope: !911, file: !911, line: 155, type: !1002, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1507 = !{}
!1508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1294, size: 384, align: 8, elements: !1509)
!1509 = !{!1510}
!1510 = !DISubrange(count: 48)
!1511 = distinct !DIGlobalVariable(name: "box_count", scope: !0, file: !911, line: 153, type: !1512, isLocal: true, isDefinition: true, variable: i64 3)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1513 = distinct !DIGlobalVariable(name: "mov_text_callbacks", scope: !0, file: !911, line: 346, type: !1514, isLocal: true, isDefinition: true, variable: %struct.ASSCodesCallbacks* @mov_text_callbacks)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1515)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSCodesCallbacks", file: !1516, line: 184, baseType: !1517)
!1516 = !DIFile(filename: "libavcodec/ass_split.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1516, line: 154, size: 768, align: 64, elements: !1518)
!1518 = !{!1519, !1523, !1527, !1531, !1535, !1539, !1543, !1544, !1545, !1546, !1550, !1551}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1517, file: !1516, line: 159, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{null, !957, !906, !889}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "new_line", scope: !1517, file: !1516, line: 160, baseType: !1524, size: 64, align: 64, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !957, !889}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1517, file: !1516, line: 161, baseType: !1528, size: 64, align: 64, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{null, !957, !908, !889}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1517, file: !1516, line: 162, baseType: !1532, size: 64, align: 64, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{null, !957, !888, !888}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1517, file: !1516, line: 163, baseType: !1536, size: 64, align: 64, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{null, !957, !889, !889}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "font_name", scope: !1517, file: !1516, line: 164, baseType: !1540, size: 64, align: 64, offset: 320)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{null, !957, !906}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "font_size", scope: !1517, file: !1516, line: 165, baseType: !1524, size: 64, align: 64, offset: 384)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1517, file: !1516, line: 166, baseType: !1524, size: 64, align: 64, offset: 448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_overrides", scope: !1517, file: !1516, line: 167, baseType: !1540, size: 64, align: 64, offset: 512)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !1517, file: !1516, line: 174, baseType: !1547, size: 64, align: 64, offset: 576)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{null, !957, !889, !889, !889, !889, !889, !889}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !1517, file: !1516, line: 175, baseType: !1536, size: 64, align: 64, offset: 640)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1517, file: !1516, line: 182, baseType: !1552, size: 64, align: 64, offset: 704)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{null, !957}
!1555 = distinct !DIGlobalVariable(name: "box_types", scope: !0, file: !911, line: 147, type: !1556, isLocal: true, isDefinition: true, variable: [3 x %struct.Box]* @box_types)
!1556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1557, size: 384, align: 64, elements: !1621)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1558)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Box", file: !911, line: 81, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !911, line: 78, size: 128, align: 64, elements: !1560)
!1560 = !{!1561, !1562}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1559, file: !911, line: 79, baseType: !905, size: 32, align: 32)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !1559, file: !911, line: 80, baseType: !1563, size: 64, align: 64, offset: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{null, !1566, !905}
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovTextContext", file: !911, line: 76, baseType: !1568)
!1568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !911, line: 59, size: 8704, align: 64, elements: !1569)
!1569 = !{!1570, !1571, !1575, !1592, !1601, !1602, !1608, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1568, file: !911, line: 60, baseType: !1004, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "ass_ctx", scope: !1568, file: !911, line: 62, baseType: !1572, size: 64, align: 64, offset: 64)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSSplitContext", file: !1516, line: 101, baseType: !1574)
!1574 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASSSplitContext", file: !1516, line: 101, flags: DIFlagFwdDecl)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1568, file: !911, line: 63, baseType: !1576, size: 8192, align: 64, offset: 128)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1577, line: 82, baseType: !1578)
!1577 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1577, line: 82, size: 8192, align: 64, elements: !1579)
!1579 = !{!1580, !1581, !1582, !1583, !1584, !1588}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1578, file: !1577, line: 82, baseType: !1267, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1578, file: !1577, line: 82, baseType: !888, size: 32, align: 32, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1578, file: !1577, line: 82, baseType: !888, size: 32, align: 32, offset: 96)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1578, file: !1577, line: 82, baseType: !888, size: 32, align: 32, offset: 128)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1578, file: !1577, line: 82, baseType: !1585, size: 8, align: 8, offset: 160)
!1585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 8, align: 8, elements: !1586)
!1586 = !{!1587}
!1587 = !DISubrange(count: 1)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1578, file: !1577, line: 82, baseType: !1589, size: 8000, align: 8, offset: 168)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 8000, align: 8, elements: !1590)
!1590 = !{!1591}
!1591 = !DISubrange(count: 1000)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "style_attributes", scope: !1568, file: !911, line: 64, baseType: !1593, size: 64, align: 64, offset: 8320)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleBox", file: !911, line: 48, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !911, line: 44, size: 48, align: 16, elements: !1597)
!1597 = !{!1598, !1599, !1600}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "style_start", scope: !1596, file: !911, line: 45, baseType: !895, size: 16, align: 16)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "style_end", scope: !1596, file: !911, line: 46, baseType: !895, size: 16, align: 16, offset: 16)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "style_flag", scope: !1596, file: !911, line: 47, baseType: !944, size: 8, align: 8, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "style_attributes_temp", scope: !1568, file: !911, line: 65, baseType: !1594, size: 64, align: 64, offset: 8384)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "hlit", scope: !1568, file: !911, line: 66, baseType: !1603, size: 32, align: 16, offset: 8448)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "HighlightBox", file: !911, line: 53, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !911, line: 50, size: 32, align: 16, elements: !1605)
!1605 = !{!1606, !1607}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1604, file: !911, line: 51, baseType: !895, size: 16, align: 16)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1604, file: !911, line: 52, baseType: !895, size: 16, align: 16, offset: 16)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "hclr", scope: !1568, file: !911, line: 67, baseType: !1609, size: 32, align: 32, offset: 8480)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "HilightcolorBox", file: !911, line: 57, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !911, line: 55, size: 32, align: 32, elements: !1611)
!1611 = !{!1612}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1610, file: !911, line: 56, baseType: !905, size: 32, align: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1568, file: !911, line: 68, baseType: !889, size: 32, align: 32, offset: 8512)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "box_flags", scope: !1568, file: !911, line: 69, baseType: !944, size: 8, align: 8, offset: 8544)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "style_entries", scope: !1568, file: !911, line: 70, baseType: !895, size: 16, align: 16, offset: 8560)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "style_fontID", scope: !1568, file: !911, line: 71, baseType: !895, size: 16, align: 16, offset: 8576)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "style_fontsize", scope: !1568, file: !911, line: 72, baseType: !944, size: 8, align: 8, offset: 8592)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "style_color", scope: !1568, file: !911, line: 73, baseType: !905, size: 32, align: 32, offset: 8608)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "text_pos", scope: !1568, file: !911, line: 74, baseType: !895, size: 16, align: 16, offset: 8640)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "byte_count", scope: !1568, file: !911, line: 75, baseType: !895, size: 16, align: 16, offset: 8656)
!1621 = !{!1622}
!1622 = !DISubrange(count: 3)
!1623 = !{i32 2, !"Dwarf Version", i32 4}
!1624 = !{i32 2, !"Debug Info Version", i32 3}
!1625 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1626 = !DILocalVariable(name: "avctx", arg: 1, scope: !1506, file: !911, line: 155, type: !1004)
!1627 = !DIExpression()
!1628 = !DILocation(line: 155, column: 71, scope: !1506)
!1629 = !DILocalVariable(name: "s", scope: !1506, file: !911, line: 192, type: !1566)
!1630 = !DILocation(line: 192, column: 21, scope: !1506)
!1631 = !DILocation(line: 192, column: 25, scope: !1506)
!1632 = !DILocation(line: 192, column: 32, scope: !1506)
!1633 = !DILocation(line: 193, column: 16, scope: !1506)
!1634 = !DILocation(line: 193, column: 5, scope: !1506)
!1635 = !DILocation(line: 193, column: 8, scope: !1506)
!1636 = !DILocation(line: 193, column: 14, scope: !1506)
!1637 = !DILocation(line: 195, column: 5, scope: !1506)
!1638 = !DILocation(line: 195, column: 12, scope: !1506)
!1639 = !DILocation(line: 195, column: 27, scope: !1506)
!1640 = !DILocation(line: 196, column: 35, scope: !1506)
!1641 = !DILocation(line: 196, column: 42, scope: !1506)
!1642 = !DILocation(line: 196, column: 57, scope: !1506)
!1643 = !DILocation(line: 196, column: 24, scope: !1506)
!1644 = !DILocation(line: 196, column: 5, scope: !1506)
!1645 = !DILocation(line: 196, column: 12, scope: !1506)
!1646 = !DILocation(line: 196, column: 22, scope: !1506)
!1647 = !DILocation(line: 197, column: 10, scope: !1648)
!1648 = distinct !DILexicalBlock(scope: !1506, file: !911, line: 197, column: 9)
!1649 = !DILocation(line: 197, column: 17, scope: !1648)
!1650 = !DILocation(line: 197, column: 9, scope: !1506)
!1651 = !DILocation(line: 198, column: 9, scope: !1648)
!1652 = !DILocation(line: 200, column: 21, scope: !1506)
!1653 = !DILocation(line: 200, column: 24, scope: !1506)
!1654 = !DILocation(line: 200, column: 5, scope: !1506)
!1655 = !DILocation(line: 202, column: 12, scope: !1506)
!1656 = !DILocation(line: 202, column: 19, scope: !1506)
!1657 = !DILocation(line: 202, column: 49, scope: !1506)
!1658 = !DILocation(line: 202, column: 56, scope: !1506)
!1659 = !DILocation(line: 202, column: 5, scope: !1506)
!1660 = !DILocation(line: 204, column: 31, scope: !1506)
!1661 = !DILocation(line: 204, column: 38, scope: !1506)
!1662 = !DILocation(line: 204, column: 18, scope: !1506)
!1663 = !DILocation(line: 204, column: 5, scope: !1506)
!1664 = !DILocation(line: 204, column: 8, scope: !1506)
!1665 = !DILocation(line: 204, column: 16, scope: !1506)
!1666 = !DILocation(line: 205, column: 12, scope: !1506)
!1667 = !DILocation(line: 205, column: 15, scope: !1506)
!1668 = !DILocation(line: 205, column: 5, scope: !1506)
!1669 = !DILocation(line: 206, column: 1, scope: !1506)
!1670 = distinct !DISubprogram(name: "mov_text_encode_frame", scope: !911, file: !911, line: 353, type: !1671, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!889, !1004, !1673, !889, !1674}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1676)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1426)
!1677 = !DILocalVariable(name: "x", arg: 1, scope: !1678, file: !1679, line: 58, type: !895)
!1678 = distinct !DISubprogram(name: "av_bswap16", scope: !1679, file: !1679, line: 58, type: !1680, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1679 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!895, !895}
!1682 = !DILocation(line: 58, column: 98, scope: !1678, inlinedAt: !1683)
!1683 = distinct !DILocation(line: 397, column: 45, scope: !1670)
!1684 = !DILocalVariable(name: "avctx", arg: 1, scope: !1670, file: !911, line: 353, type: !1004)
!1685 = !DILocation(line: 353, column: 50, scope: !1670)
!1686 = !DILocalVariable(name: "buf", arg: 2, scope: !1670, file: !911, line: 353, type: !1673)
!1687 = !DILocation(line: 353, column: 72, scope: !1670)
!1688 = !DILocalVariable(name: "bufsize", arg: 3, scope: !1670, file: !911, line: 354, type: !889)
!1689 = !DILocation(line: 354, column: 38, scope: !1670)
!1690 = !DILocalVariable(name: "sub", arg: 4, scope: !1670, file: !911, line: 354, type: !1674)
!1691 = !DILocation(line: 354, column: 65, scope: !1670)
!1692 = !DILocalVariable(name: "s", scope: !1670, file: !911, line: 356, type: !1566)
!1693 = !DILocation(line: 356, column: 21, scope: !1670)
!1694 = !DILocation(line: 356, column: 25, scope: !1670)
!1695 = !DILocation(line: 356, column: 32, scope: !1670)
!1696 = !DILocalVariable(name: "dialog", scope: !1670, file: !911, line: 357, type: !1697)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSDialog", file: !1516, line: 85, baseType: !1699)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1516, line: 71, size: 512, align: 64, elements: !1700)
!1700 = !{!1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1699, file: !1516, line: 72, baseType: !889, size: 32, align: 32)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1699, file: !1516, line: 73, baseType: !889, size: 32, align: 32, offset: 32)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1699, file: !1516, line: 74, baseType: !889, size: 32, align: 32, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1699, file: !1516, line: 75, baseType: !889, size: 32, align: 32, offset: 96)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1699, file: !1516, line: 76, baseType: !1267, size: 64, align: 64, offset: 128)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1699, file: !1516, line: 77, baseType: !1267, size: 64, align: 64, offset: 192)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "margin_l", scope: !1699, file: !1516, line: 78, baseType: !889, size: 32, align: 32, offset: 256)
