; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--hevc_sei.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--hevc_sei.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.HEVCSEI = type { %struct.HEVCSEIPictureHash, %struct.HEVCSEIFramePacking, %struct.HEVCSEIDisplayOrientation, %struct.HEVCSEIPictureTiming, %struct.HEVCSEIA53Caption, %struct.HEVCSEIMasteringDisplay, %struct.HEVCSEIContentLight, i32, %struct.HEVCSEIAlternativeTransfer }
%struct.HEVCSEIPictureHash = type { [3 x [16 x i8]], i8 }
%struct.HEVCSEIFramePacking = type { i32, i32, i32, i32, i32 }
%struct.HEVCSEIDisplayOrientation = type { i32, i32, i32, i32 }
%struct.HEVCSEIPictureTiming = type { i32 }
%struct.HEVCSEIA53Caption = type { i32, i8* }
%struct.HEVCSEIMasteringDisplay = type { i32, [3 x [2 x i16]], [2 x i16], i32, i32 }
%struct.HEVCSEIContentLight = type { i32, i16, i16 }
%struct.HEVCSEIAlternativeTransfer = type { i32, i32 }
%struct.HEVCParamSets = type { [16 x %struct.AVBufferRef*], [16 x %struct.AVBufferRef*], [64 x %struct.AVBufferRef*], %struct.HEVCVPS*, %struct.HEVCSPS*, %struct.HEVCPPS* }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!241 = !DIEnumerator(name: "HEVC_NAL_AUD", value: 35)
!242 = !DIEnumerator(name: "HEVC_NAL_EOS_NUT", value: 36)
!243 = !DIEnumerator(name: "HEVC_NAL_EOB_NUT", value: 37)
!244 = !DIEnumerator(name: "HEVC_NAL_FD_NUT", value: 38)
!245 = !DIEnumerator(name: "HEVC_NAL_SEI_PREFIX", value: 39)
!246 = !DIEnumerator(name: "HEVC_NAL_SEI_SUFFIX", value: 40)
!247 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL41", value: 41)
!248 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL42", value: 42)
!249 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL43", value: 43)
!250 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL44", value: 44)
!251 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL45", value: 45)
!252 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL46", value: 46)
!253 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL47", value: 47)
!254 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!255 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!256 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!257 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!258 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!259 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!260 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!261 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!262 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!263 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!264 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!265 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!266 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!267 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!268 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!269 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !271, line: 5085, size: 32, align: 32, elements: !272)
!271 = !DIFile(filename: "libavcodec/avcodec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!272 = !{!273, !274, !275, !276}
!273 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!274 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!275 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!276 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 101, size: 32, align: 32, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!279 = !DIEnumerator(name: "HEVC_MAX_LAYERS", value: 63)
!280 = !DIEnumerator(name: "HEVC_MAX_SUB_LAYERS", value: 7)
!281 = !DIEnumerator(name: "HEVC_MAX_LAYER_SETS", value: 1024)
!282 = !DIEnumerator(name: "HEVC_MAX_VPS_COUNT", value: 16)
!283 = !DIEnumerator(name: "HEVC_MAX_SPS_COUNT", value: 16)
!284 = !DIEnumerator(name: "HEVC_MAX_PPS_COUNT", value: 64)
!285 = !DIEnumerator(name: "HEVC_MAX_DPB_SIZE", value: 16)
!286 = !DIEnumerator(name: "HEVC_MAX_REFS", value: 16)
!287 = !DIEnumerator(name: "HEVC_MAX_SHORT_TERM_REF_PIC_SETS", value: 64)
!288 = !DIEnumerator(name: "HEVC_MAX_LONG_TERM_REF_PICS", value: 32)
!289 = !DIEnumerator(name: "HEVC_MIN_LOG2_CTB_SIZE", value: 4)
!290 = !DIEnumerator(name: "HEVC_MAX_LOG2_CTB_SIZE", value: 6)
!291 = !DIEnumerator(name: "HEVC_MAX_CPB_CNT", value: 32)
!292 = !DIEnumerator(name: "HEVC_MAX_LUMA_PS", value: 35651584)
!293 = !DIEnumerator(name: "HEVC_MAX_WIDTH", value: 16888)
!294 = !DIEnumerator(name: "HEVC_MAX_HEIGHT", value: 16888)
!295 = !DIEnumerator(name: "HEVC_MAX_TILE_ROWS", value: 22)
!296 = !DIEnumerator(name: "HEVC_MAX_TILE_COLUMNS", value: 20)
!297 = !DIEnumerator(name: "HEVC_MAX_SLICE_SEGMENTS", value: 600)
!298 = !DIEnumerator(name: "HEVC_MAX_ENTRY_POINT_OFFSETS", value: 2700)
!299 = !{!300, !301, !302, !310, !312}
!300 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!301 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !305, line: 221, size: 32, align: 8, elements: !306)
!305 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !304, file: !305, line: 221, baseType: !308, size: 32, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !309, line: 51, baseType: !301)
!309 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !309, line: 48, baseType: !311)
!311 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSPS", file: !314, line: 319, baseType: !315)
!314 = !DIFile(filename: "libavcodec/hevc_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSPS", file: !314, line: 225, size: 140544, align: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !328, !329, !330, !331, !332, !333, !334, !335, !336, !345, !346, !389, !414, !415, !429, !430, !443, !444, !445, !446, !450, !451, !452, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !496, !497, !498, !502}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vps_id", scope: !315, file: !314, line: 226, baseType: !301, size: 32, align: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !315, file: !314, line: 227, baseType: !300, size: 32, align: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !315, file: !314, line: 228, baseType: !310, size: 8, align: 8, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "output_window", scope: !315, file: !314, line: 230, baseType: !321, size: 128, align: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCWindow", file: !314, line: 130, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCWindow", file: !314, line: 125, size: 128, align: 32, elements: !323)
!323 = !{!324, !325, !326, !327}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "left_offset", scope: !322, file: !314, line: 126, baseType: !301, size: 32, align: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "right_offset", scope: !322, file: !314, line: 127, baseType: !301, size: 32, align: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "top_offset", scope: !322, file: !314, line: 128, baseType: !301, size: 32, align: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_offset", scope: !322, file: !314, line: 129, baseType: !301, size: 32, align: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pic_conf_win", scope: !315, file: !314, line: 232, baseType: !321, size: 128, align: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !315, file: !314, line: 234, baseType: !300, size: 32, align: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !315, file: !314, line: 235, baseType: !300, size: 32, align: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_shift", scope: !315, file: !314, line: 236, baseType: !300, size: 32, align: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !315, file: !314, line: 237, baseType: !3, size: 32, align: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !315, file: !314, line: 239, baseType: !301, size: 32, align: 32, offset: 480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_enabled_flag", scope: !315, file: !314, line: 240, baseType: !300, size: 32, align: 32, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "max_sub_layers", scope: !315, file: !314, line: 242, baseType: !300, size: 32, align: 32, offset: 544)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_layer", scope: !315, file: !314, line: 247, baseType: !337, size: 672, align: 32, offset: 576)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 672, align: 32, elements: !343)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !314, line: 243, size: 96, align: 32, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_pic_buffering", scope: !338, file: !314, line: 244, baseType: !300, size: 32, align: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_pics", scope: !338, file: !314, line: 245, baseType: !300, size: 32, align: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "max_latency_increase", scope: !338, file: !314, line: 246, baseType: !300, size: 32, align: 32, offset: 64)
!343 = !{!344}
!344 = !DISubrange(count: 7)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id_nesting_flag", scope: !315, file: !314, line: 248, baseType: !310, size: 8, align: 8, offset: 1248)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !315, file: !314, line: 250, baseType: !347, size: 1120, align: 32, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "VUI", file: !314, line: 173, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VUI", file: !314, line: 132, size: 1120, align: 32, elements: !349)
!349 = !{!350, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !348, file: !314, line: 133, baseType: !351, size: 64, align: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !352, line: 61, baseType: !353)
!352 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !352, line: 58, size: 64, align: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !353, file: !352, line: 59, baseType: !300, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !353, file: !352, line: 60, baseType: !300, size: 32, align: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !348, file: !314, line: 135, baseType: !300, size: 32, align: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !348, file: !314, line: 136, baseType: !300, size: 32, align: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !348, file: !314, line: 138, baseType: !300, size: 32, align: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !348, file: !314, line: 139, baseType: !300, size: 32, align: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !348, file: !314, line: 140, baseType: !300, size: 32, align: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !348, file: !314, line: 141, baseType: !300, size: 32, align: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !348, file: !314, line: 142, baseType: !310, size: 8, align: 8, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristic", scope: !348, file: !314, line: 143, baseType: !310, size: 8, align: 8, offset: 264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coeffs", scope: !348, file: !314, line: 144, baseType: !310, size: 8, align: 8, offset: 272)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_loc_info_present_flag", scope: !348, file: !314, line: 146, baseType: !300, size: 32, align: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !348, file: !314, line: 147, baseType: !300, size: 32, align: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !348, file: !314, line: 148, baseType: !300, size: 32, align: 32, offset: 352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "neutra_chroma_indication_flag", scope: !348, file: !314, line: 149, baseType: !300, size: 32, align: 32, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "field_seq_flag", scope: !348, file: !314, line: 151, baseType: !300, size: 32, align: 32, offset: 416)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "frame_field_info_present_flag", scope: !348, file: !314, line: 152, baseType: !300, size: 32, align: 32, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "default_display_window_flag", scope: !348, file: !314, line: 154, baseType: !300, size: 32, align: 32, offset: 480)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win", scope: !348, file: !314, line: 155, baseType: !321, size: 128, align: 32, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vui_timing_info_present_flag", scope: !348, file: !314, line: 157, baseType: !300, size: 32, align: 32, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_units_in_tick", scope: !348, file: !314, line: 158, baseType: !308, size: 32, align: 32, offset: 672)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vui_time_scale", scope: !348, file: !314, line: 159, baseType: !308, size: 32, align: 32, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vui_poc_proportional_to_timing_flag", scope: !348, file: !314, line: 160, baseType: !300, size: 32, align: 32, offset: 736)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_ticks_poc_diff_one_minus1", scope: !348, file: !314, line: 161, baseType: !300, size: 32, align: 32, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vui_hrd_parameters_present_flag", scope: !348, file: !314, line: 162, baseType: !300, size: 32, align: 32, offset: 800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !348, file: !314, line: 164, baseType: !300, size: 32, align: 32, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_fixed_structure_flag", scope: !348, file: !314, line: 165, baseType: !300, size: 32, align: 32, offset: 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !348, file: !314, line: 166, baseType: !300, size: 32, align: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "restricted_ref_pic_lists_flag", scope: !348, file: !314, line: 167, baseType: !300, size: 32, align: 32, offset: 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "min_spatial_segmentation_idc", scope: !348, file: !314, line: 168, baseType: !300, size: 32, align: 32, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !348, file: !314, line: 169, baseType: !300, size: 32, align: 32, offset: 992)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_min_cu_denom", scope: !348, file: !314, line: 170, baseType: !300, size: 32, align: 32, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !348, file: !314, line: 171, baseType: !300, size: 32, align: 32, offset: 1056)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !348, file: !314, line: 172, baseType: !300, size: 32, align: 32, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !315, file: !314, line: 251, baseType: !390, size: 2672, align: 8, offset: 2400)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTL", file: !314, line: 193, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTL", file: !314, line: 187, size: 2672, align: 8, elements: !392)
!392 = !{!393, !409, !411, !413}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "general_ptl", scope: !391, file: !314, line: 188, baseType: !394, size: 320, align: 8)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTLCommon", file: !314, line: 185, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTLCommon", file: !314, line: 175, size: 320, align: 8, elements: !396)
!396 = !{!397, !398, !399, !400, !404, !405, !406, !407, !408}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "profile_space", scope: !395, file: !314, line: 176, baseType: !310, size: 8, align: 8)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tier_flag", scope: !395, file: !314, line: 177, baseType: !310, size: 8, align: 8, offset: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !395, file: !314, line: 178, baseType: !310, size: 8, align: 8, offset: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "profile_compatibility_flag", scope: !395, file: !314, line: 179, baseType: !401, size: 256, align: 8, offset: 24)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 256, align: 8, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !395, file: !314, line: 180, baseType: !310, size: 8, align: 8, offset: 280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_source_flag", scope: !395, file: !314, line: 181, baseType: !310, size: 8, align: 8, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_source_flag", scope: !395, file: !314, line: 182, baseType: !310, size: 8, align: 8, offset: 296)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "non_packed_constraint_flag", scope: !395, file: !314, line: 183, baseType: !310, size: 8, align: 8, offset: 304)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_only_constraint_flag", scope: !395, file: !314, line: 184, baseType: !310, size: 8, align: 8, offset: 312)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_ptl", scope: !391, file: !314, line: 189, baseType: !410, size: 2240, align: 8, offset: 320)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 2240, align: 8, elements: !343)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_present_flag", scope: !391, file: !314, line: 191, baseType: !412, size: 56, align: 8, offset: 2560)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 56, align: 8, elements: !343)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_level_present_flag", scope: !391, file: !314, line: 192, baseType: !412, size: 56, align: 8, offset: 2616)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_enable_flag", scope: !315, file: !314, line: 253, baseType: !310, size: 8, align: 8, offset: 5072)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !315, file: !314, line: 254, baseType: !416, size: 12384, align: 8, offset: 5080)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScalingList", file: !314, line: 223, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScalingList", file: !314, line: 218, size: 12384, align: 8, elements: !418)
!418 = !{!419, !425}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sl", scope: !417, file: !314, line: 221, baseType: !420, size: 12288, align: 8)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 12288, align: 8, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DISubrange(count: 4)
!423 = !DISubrange(count: 6)
!424 = !DISubrange(count: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sl_dc", scope: !417, file: !314, line: 222, baseType: !426, size: 96, align: 8, offset: 12288)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 96, align: 8, elements: !427)
!427 = !{!428, !423}
!428 = !DISubrange(count: 2)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_st_rps", scope: !315, file: !314, line: 256, baseType: !301, size: 32, align: 32, offset: 17472)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_rps", scope: !315, file: !314, line: 257, baseType: !431, size: 88064, align: 32, offset: 17504)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 88064, align: 32, elements: !442)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShortTermRPS", file: !314, line: 40, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShortTermRPS", file: !314, line: 34, size: 1376, align: 32, elements: !434)
!434 = !{!435, !436, !437, !438, !441}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "num_negative_pics", scope: !433, file: !314, line: 35, baseType: !301, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_delta_pocs", scope: !433, file: !314, line: 36, baseType: !300, size: 32, align: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rps_idx_num_delta_pocs", scope: !433, file: !314, line: 37, baseType: !300, size: 32, align: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "delta_poc", scope: !433, file: !314, line: 38, baseType: !439, size: 1024, align: 32, offset: 96)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 1024, align: 32, elements: !402)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !309, line: 38, baseType: !300)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !433, file: !314, line: 39, baseType: !401, size: 256, align: 8, offset: 1120)
!442 = !{!424}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "amp_enabled_flag", scope: !315, file: !314, line: 259, baseType: !310, size: 8, align: 8, offset: 105568)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sao_enabled", scope: !315, file: !314, line: 260, baseType: !310, size: 8, align: 8, offset: 105576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_ref_pics_present_flag", scope: !315, file: !314, line: 262, baseType: !310, size: 8, align: 8, offset: 105584)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lt_ref_pic_poc_lsb_sps", scope: !315, file: !314, line: 263, baseType: !447, size: 512, align: 16, offset: 105600)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 512, align: 16, elements: !402)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !309, line: 49, baseType: !449)
!449 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_lt_sps_flag", scope: !315, file: !314, line: 264, baseType: !401, size: 256, align: 8, offset: 106112)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "num_long_term_ref_pics_sps", scope: !315, file: !314, line: 265, baseType: !310, size: 8, align: 8, offset: 106368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pcm", scope: !315, file: !314, line: 273, baseType: !453, size: 128, align: 32, offset: 106400)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !314, line: 267, size: 128, align: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !453, file: !314, line: 268, baseType: !310, size: 8, align: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !453, file: !314, line: 269, baseType: !310, size: 8, align: 8, offset: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pcm_cb_size", scope: !453, file: !314, line: 270, baseType: !301, size: 32, align: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pcm_cb_size", scope: !453, file: !314, line: 271, baseType: !301, size: 32, align: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_disable_flag", scope: !453, file: !314, line: 272, baseType: !310, size: 8, align: 8, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sps_temporal_mvp_enabled_flag", scope: !315, file: !314, line: 274, baseType: !310, size: 8, align: 8, offset: 106528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sps_strong_intra_smoothing_enable_flag", scope: !315, file: !314, line: 275, baseType: !310, size: 8, align: 8, offset: 106536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_cb_size", scope: !315, file: !314, line: 277, baseType: !301, size: 32, align: 32, offset: 106560)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_coding_block_size", scope: !315, file: !314, line: 278, baseType: !301, size: 32, align: 32, offset: 106592)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_tb_size", scope: !315, file: !314, line: 279, baseType: !301, size: 32, align: 32, offset: 106624)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_trafo_size", scope: !315, file: !314, line: 280, baseType: !301, size: 32, align: 32, offset: 106656)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "log2_ctb_size", scope: !315, file: !314, line: 281, baseType: !301, size: 32, align: 32, offset: 106688)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pu_size", scope: !315, file: !314, line: 282, baseType: !301, size: 32, align: 32, offset: 106720)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_inter", scope: !315, file: !314, line: 284, baseType: !300, size: 32, align: 32, offset: 106752)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_intra", scope: !315, file: !314, line: 285, baseType: !300, size: 32, align: 32, offset: 106784)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sps_range_extension_flag", scope: !315, file: !314, line: 287, baseType: !300, size: 32, align: 32, offset: 106816)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_rotation_enabled_flag", scope: !315, file: !314, line: 288, baseType: !300, size: 32, align: 32, offset: 106848)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_context_enabled_flag", scope: !315, file: !314, line: 289, baseType: !300, size: 32, align: 32, offset: 106880)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_rdpcm_enabled_flag", scope: !315, file: !314, line: 290, baseType: !300, size: 32, align: 32, offset: 106912)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_rdpcm_enabled_flag", scope: !315, file: !314, line: 291, baseType: !300, size: 32, align: 32, offset: 106944)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "extended_precision_processing_flag", scope: !315, file: !314, line: 292, baseType: !300, size: 32, align: 32, offset: 106976)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "intra_smoothing_disabled_flag", scope: !315, file: !314, line: 293, baseType: !300, size: 32, align: 32, offset: 107008)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_offsets_enabled_flag", scope: !315, file: !314, line: 294, baseType: !300, size: 32, align: 32, offset: 107040)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_rice_adaptation_enabled_flag", scope: !315, file: !314, line: 295, baseType: !300, size: 32, align: 32, offset: 107072)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_bypass_alignment_enabled_flag", scope: !315, file: !314, line: 296, baseType: !300, size: 32, align: 32, offset: 107104)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !315, file: !314, line: 299, baseType: !300, size: 32, align: 32, offset: 107136)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !315, file: !314, line: 300, baseType: !300, size: 32, align: 32, offset: 107168)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_width", scope: !315, file: !314, line: 301, baseType: !300, size: 32, align: 32, offset: 107200)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_height", scope: !315, file: !314, line: 302, baseType: !300, size: 32, align: 32, offset: 107232)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_size", scope: !315, file: !314, line: 303, baseType: !300, size: 32, align: 32, offset: 107264)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_width", scope: !315, file: !314, line: 304, baseType: !300, size: 32, align: 32, offset: 107296)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_height", scope: !315, file: !314, line: 305, baseType: !300, size: 32, align: 32, offset: 107328)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_width", scope: !315, file: !314, line: 306, baseType: !300, size: 32, align: 32, offset: 107360)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_height", scope: !315, file: !314, line: 307, baseType: !300, size: 32, align: 32, offset: 107392)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_width", scope: !315, file: !314, line: 308, baseType: !300, size: 32, align: 32, offset: 107424)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_height", scope: !315, file: !314, line: 309, baseType: !300, size: 32, align: 32, offset: 107456)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tb_mask", scope: !315, file: !314, line: 310, baseType: !300, size: 32, align: 32, offset: 107488)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hshift", scope: !315, file: !314, line: 312, baseType: !493, size: 96, align: 32, offset: 107520)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 96, align: 32, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 3)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vshift", scope: !315, file: !314, line: 313, baseType: !493, size: 96, align: 32, offset: 107616)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "qp_bd_offset", scope: !315, file: !314, line: 315, baseType: !300, size: 32, align: 32, offset: 107712)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !314, line: 317, baseType: !499, size: 32768, align: 8, offset: 107744)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 32768, align: 8, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 4096)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !315, file: !314, line: 318, baseType: !300, size: 32, align: 32, offset: 140512)
!503 = !{i32 2, !"Dwarf Version", i32 4}
!504 = !{i32 2, !"Debug Info Version", i32 3}
!505 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!506 = distinct !DISubprogram(name: "ff_hevc_decode_nal_sei", scope: !507, file: !507, line: 351, type: !508, isLocal: false, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !714)
!507 = !DIFile(filename: "libavcodec/hevc_sei.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!508 = !DISubroutineType(types: !509)
!509 = !{!300, !510, !522, !523, !593, !300}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !512, line: 70, baseType: !513)
!512 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !512, line: 61, size: 256, align: 64, elements: !514)
!514 = !{!515, !518, !519, !520, !521}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !513, file: !512, line: 62, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !513, file: !512, line: 62, baseType: !516, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !513, file: !512, line: 67, baseType: !300, size: 32, align: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !513, file: !512, line: 68, baseType: !300, size: 32, align: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !513, file: !512, line: 69, baseType: !300, size: 32, align: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEI", file: !525, line: 118, baseType: !526)
!525 = !DIFile(filename: "libavcodec/hevc_sei.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEI", file: !525, line: 108, size: 1280, align: 64, elements: !527)
!527 = !{!528, !537, !546, !554, !559, !566, !579, !586, !587}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "picture_hash", scope: !526, file: !525, line: 109, baseType: !529, size: 392, align: 8)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIPictureHash", file: !525, line: 64, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIPictureHash", file: !525, line: 61, size: 392, align: 8, elements: !531)
!531 = !{!532, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !530, file: !525, line: 62, baseType: !533, size: 384, align: 8)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 384, align: 8, elements: !534)
!534 = !{!495, !535}
!535 = !DISubrange(count: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "is_md5", scope: !530, file: !525, line: 63, baseType: !310, size: 8, align: 8, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "frame_packing", scope: !526, file: !525, line: 110, baseType: !538, size: 160, align: 32, offset: 416)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIFramePacking", file: !525, line: 72, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIFramePacking", file: !525, line: 66, size: 160, align: 32, elements: !540)
!540 = !{!541, !542, !543, !544, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !539, file: !525, line: 67, baseType: !300, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "arrangement_type", scope: !539, file: !525, line: 68, baseType: !300, size: 32, align: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "content_interpretation_type", scope: !539, file: !525, line: 69, baseType: !300, size: 32, align: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "quincunx_subsampling", scope: !539, file: !525, line: 70, baseType: !300, size: 32, align: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame_is_frame0_flag", scope: !539, file: !525, line: 71, baseType: !300, size: 32, align: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "display_orientation", scope: !526, file: !525, line: 111, baseType: !547, size: 128, align: 32, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIDisplayOrientation", file: !525, line: 78, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIDisplayOrientation", file: !525, line: 74, size: 128, align: 32, elements: !549)
!549 = !{!550, !551, !552, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !548, file: !525, line: 75, baseType: !300, size: 32, align: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "anticlockwise_rotation", scope: !548, file: !525, line: 76, baseType: !300, size: 32, align: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hflip", scope: !548, file: !525, line: 77, baseType: !300, size: 32, align: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "vflip", scope: !548, file: !525, line: 77, baseType: !300, size: 32, align: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "picture_timing", scope: !526, file: !525, line: 112, baseType: !555, size: 32, align: 32, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIPictureTiming", file: !525, line: 82, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIPictureTiming", file: !525, line: 80, size: 32, align: 32, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "picture_struct", scope: !556, file: !525, line: 81, baseType: !300, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption", scope: !526, file: !525, line: 113, baseType: !560, size: 128, align: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIA53Caption", file: !525, line: 87, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIA53Caption", file: !525, line: 84, size: 128, align: 64, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption_size", scope: !561, file: !525, line: 85, baseType: !300, size: 32, align: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption", scope: !561, file: !525, line: 86, baseType: !565, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mastering_display", scope: !526, file: !525, line: 114, baseType: !567, size: 224, align: 32, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIMasteringDisplay", file: !525, line: 95, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIMasteringDisplay", file: !525, line: 89, size: 224, align: 32, elements: !569)
!569 = !{!570, !571, !574, !577, !578}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !568, file: !525, line: 90, baseType: !300, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !568, file: !525, line: 91, baseType: !572, size: 96, align: 16, offset: 32)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 96, align: 16, elements: !573)
!573 = !{!495, !428}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !568, file: !525, line: 92, baseType: !575, size: 32, align: 16, offset: 128)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 32, align: 16, elements: !576)
!576 = !{!428}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !568, file: !525, line: 93, baseType: !308, size: 32, align: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !568, file: !525, line: 94, baseType: !308, size: 32, align: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "content_light", scope: !526, file: !525, line: 115, baseType: !580, size: 64, align: 32, offset: 1120)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIContentLight", file: !525, line: 101, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIContentLight", file: !525, line: 97, size: 64, align: 32, elements: !582)
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !581, file: !525, line: 98, baseType: !300, size: 32, align: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "max_content_light_level", scope: !581, file: !525, line: 99, baseType: !448, size: 16, align: 16, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "max_pic_average_light_level", scope: !581, file: !525, line: 100, baseType: !448, size: 16, align: 16, offset: 48)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "active_seq_parameter_set_id", scope: !526, file: !525, line: 116, baseType: !300, size: 32, align: 32, offset: 1184)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "alternative_transfer", scope: !526, file: !525, line: 117, baseType: !588, size: 64, align: 32, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIAlternativeTransfer", file: !525, line: 106, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIAlternativeTransfer", file: !525, line: 103, size: 64, align: 32, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !589, file: !525, line: 104, baseType: !300, size: 32, align: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_transfer_characteristics", scope: !589, file: !525, line: 105, baseType: !300, size: 32, align: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCParamSets", file: !314, line: 408, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCParamSets", file: !314, line: 399, size: 6336, align: 64, elements: !597)
!597 = !{!598, !612, !613, !615, !640, !643}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vps_list", scope: !596, file: !314, line: 400, baseType: !599, size: 1024, align: 64)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1024, align: 64, elements: !611)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !602, line: 94, baseType: !603)
!602 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !602, line: 81, size: 192, align: 64, elements: !604)
!604 = !{!605, !609, !610}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !603, file: !602, line: 82, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !602, line: 73, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !602, line: 73, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !603, file: !602, line: 89, baseType: !565, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !603, file: !602, line: 93, baseType: !300, size: 32, align: 32, offset: 128)
!611 = !{!535}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sps_list", scope: !596, file: !314, line: 401, baseType: !599, size: 1024, align: 64, offset: 1024)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pps_list", scope: !596, file: !314, line: 402, baseType: !614, size: 4096, align: 64, offset: 2048)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 4096, align: 64, elements: !442)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vps", scope: !596, file: !314, line: 405, baseType: !616, size: 64, align: 64, offset: 6144)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCVPS", file: !314, line: 216, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCVPS", file: !314, line: 195, size: 36544, align: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vps_temporal_id_nesting_flag", scope: !619, file: !314, line: 196, baseType: !310, size: 8, align: 8)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layers", scope: !619, file: !314, line: 197, baseType: !300, size: 32, align: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_sub_layers", scope: !619, file: !314, line: 198, baseType: !300, size: 32, align: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !619, file: !314, line: 200, baseType: !390, size: 2672, align: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vps_sub_layer_ordering_info_present_flag", scope: !619, file: !314, line: 201, baseType: !300, size: 32, align: 32, offset: 2784)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_dec_pic_buffering", scope: !619, file: !314, line: 202, baseType: !627, size: 224, align: 32, offset: 2816)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 224, align: 32, elements: !343)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_reorder_pics", scope: !619, file: !314, line: 203, baseType: !627, size: 224, align: 32, offset: 3040)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_latency_increase", scope: !619, file: !314, line: 204, baseType: !627, size: 224, align: 32, offset: 3264)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layer_id", scope: !619, file: !314, line: 205, baseType: !300, size: 32, align: 32, offset: 3488)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_layer_sets", scope: !619, file: !314, line: 206, baseType: !300, size: 32, align: 32, offset: 3520)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vps_timing_info_present_flag", scope: !619, file: !314, line: 207, baseType: !310, size: 8, align: 8, offset: 3552)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_units_in_tick", scope: !619, file: !314, line: 208, baseType: !308, size: 32, align: 32, offset: 3584)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "vps_time_scale", scope: !619, file: !314, line: 209, baseType: !308, size: 32, align: 32, offset: 3616)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vps_poc_proportional_to_timing_flag", scope: !619, file: !314, line: 210, baseType: !310, size: 8, align: 8, offset: 3648)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_ticks_poc_diff_one", scope: !619, file: !314, line: 211, baseType: !300, size: 32, align: 32, offset: 3680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_hrd_parameters", scope: !619, file: !314, line: 212, baseType: !300, size: 32, align: 32, offset: 3712)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !314, line: 214, baseType: !499, size: 32768, align: 8, offset: 3744)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !619, file: !314, line: 215, baseType: !300, size: 32, align: 32, offset: 36512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !596, file: !314, line: 406, baseType: !641, size: 64, align: 64, offset: 6208)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !596, file: !314, line: 407, baseType: !644, size: 64, align: 64, offset: 6272)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCPPS", file: !314, line: 397, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCPPS", file: !314, line: 321, size: 46784, align: 64, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !696, !697, !698, !699, !701, !702, !703, !704, !706, !707, !708, !709, !710, !711, !712, !713}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !647, file: !314, line: 322, baseType: !301, size: 32, align: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sign_data_hiding_flag", scope: !647, file: !314, line: 324, baseType: !310, size: 8, align: 8, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_init_present_flag", scope: !647, file: !314, line: 326, baseType: !310, size: 8, align: 8, offset: 40)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_default_active", scope: !647, file: !314, line: 328, baseType: !300, size: 32, align: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_default_active", scope: !647, file: !314, line: 329, baseType: !300, size: 32, align: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !647, file: !314, line: 330, baseType: !300, size: 32, align: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !647, file: !314, line: 332, baseType: !310, size: 8, align: 8, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_enabled_flag", scope: !647, file: !314, line: 333, baseType: !310, size: 8, align: 8, offset: 168)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cu_qp_delta_enabled_flag", scope: !647, file: !314, line: 335, baseType: !310, size: 8, align: 8, offset: 176)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_qp_delta_depth", scope: !647, file: !314, line: 336, baseType: !300, size: 32, align: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset", scope: !647, file: !314, line: 338, baseType: !300, size: 32, align: 32, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset", scope: !647, file: !314, line: 339, baseType: !300, size: 32, align: 32, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pic_slice_level_chroma_qp_offsets_present_flag", scope: !647, file: !314, line: 340, baseType: !310, size: 8, align: 8, offset: 288)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !647, file: !314, line: 341, baseType: !310, size: 8, align: 8, offset: 296)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_flag", scope: !647, file: !314, line: 342, baseType: !310, size: 8, align: 8, offset: 304)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "output_flag_present_flag", scope: !647, file: !314, line: 343, baseType: !310, size: 8, align: 8, offset: 312)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "transquant_bypass_enable_flag", scope: !647, file: !314, line: 344, baseType: !310, size: 8, align: 8, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dependent_slice_segments_enabled_flag", scope: !647, file: !314, line: 346, baseType: !310, size: 8, align: 8, offset: 328)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_enabled_flag", scope: !647, file: !314, line: 347, baseType: !310, size: 8, align: 8, offset: 336)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_sync_enabled_flag", scope: !647, file: !314, line: 348, baseType: !310, size: 8, align: 8, offset: 344)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_columns", scope: !647, file: !314, line: 350, baseType: !300, size: 32, align: 32, offset: 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_rows", scope: !647, file: !314, line: 351, baseType: !300, size: 32, align: 32, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "uniform_spacing_flag", scope: !647, file: !314, line: 352, baseType: !310, size: 8, align: 8, offset: 416)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_across_tiles_enabled_flag", scope: !647, file: !314, line: 353, baseType: !310, size: 8, align: 8, offset: 424)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "seq_loop_filter_across_slices_enabled_flag", scope: !647, file: !314, line: 355, baseType: !310, size: 8, align: 8, offset: 432)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !647, file: !314, line: 357, baseType: !310, size: 8, align: 8, offset: 440)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_override_enabled_flag", scope: !647, file: !314, line: 358, baseType: !310, size: 8, align: 8, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dbf", scope: !647, file: !314, line: 359, baseType: !310, size: 8, align: 8, offset: 456)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "beta_offset", scope: !647, file: !314, line: 360, baseType: !300, size: 32, align: 32, offset: 480)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tc_offset", scope: !647, file: !314, line: 361, baseType: !300, size: 32, align: 32, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_data_present_flag", scope: !647, file: !314, line: 363, baseType: !310, size: 8, align: 8, offset: 544)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !647, file: !314, line: 364, baseType: !416, size: 12384, align: 8, offset: 552)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lists_modification_present_flag", scope: !647, file: !314, line: 366, baseType: !310, size: 8, align: 8, offset: 12936)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "log2_parallel_merge_level", scope: !647, file: !314, line: 367, baseType: !300, size: 32, align: 32, offset: 12960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra_slice_header_bits", scope: !647, file: !314, line: 368, baseType: !300, size: 32, align: 32, offset: 12992)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "slice_header_extension_present_flag", scope: !647, file: !314, line: 369, baseType: !310, size: 8, align: 8, offset: 13024)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_transform_skip_block_size", scope: !647, file: !314, line: 370, baseType: !310, size: 8, align: 8, offset: 13032)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pps_range_extensions_flag", scope: !647, file: !314, line: 371, baseType: !310, size: 8, align: 8, offset: 13040)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cross_component_prediction_enabled_flag", scope: !647, file: !314, line: 372, baseType: !310, size: 8, align: 8, offset: 13048)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_enabled_flag", scope: !647, file: !314, line: 373, baseType: !310, size: 8, align: 8, offset: 13056)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_chroma_qp_offset_depth", scope: !647, file: !314, line: 374, baseType: !310, size: 8, align: 8, offset: 13064)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_len_minus1", scope: !647, file: !314, line: 375, baseType: !310, size: 8, align: 8, offset: 13072)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset_list", scope: !647, file: !314, line: 376, baseType: !692, size: 48, align: 8, offset: 13080)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 48, align: 8, elements: !695)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !309, line: 36, baseType: !694)
!694 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!695 = !{!423}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset_list", scope: !647, file: !314, line: 377, baseType: !692, size: 48, align: 8, offset: 13128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_luma", scope: !647, file: !314, line: 378, baseType: !310, size: 8, align: 8, offset: 13176)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_chroma", scope: !647, file: !314, line: 379, baseType: !310, size: 8, align: 8, offset: 13184)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "column_width", scope: !647, file: !314, line: 382, baseType: !700, size: 64, align: 64, offset: 13248)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "row_height", scope: !647, file: !314, line: 383, baseType: !700, size: 64, align: 64, offset: 13312)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "col_bd", scope: !647, file: !314, line: 384, baseType: !700, size: 64, align: 64, offset: 13376)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "row_bd", scope: !647, file: !314, line: 385, baseType: !700, size: 64, align: 64, offset: 13440)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "col_idxX", scope: !647, file: !314, line: 386, baseType: !705, size: 64, align: 64, offset: 13504)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_rs_to_ts", scope: !647, file: !314, line: 388, baseType: !705, size: 64, align: 64, offset: 13568)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_ts_to_rs", scope: !647, file: !314, line: 389, baseType: !705, size: 64, align: 64, offset: 13632)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tile_id", scope: !647, file: !314, line: 390, baseType: !705, size: 64, align: 64, offset: 13696)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tile_pos_rs", scope: !647, file: !314, line: 391, baseType: !705, size: 64, align: 64, offset: 13760)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs", scope: !647, file: !314, line: 392, baseType: !705, size: 64, align: 64, offset: 13824)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs_tab", scope: !647, file: !314, line: 393, baseType: !705, size: 64, align: 64, offset: 13888)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !647, file: !314, line: 395, baseType: !499, size: 32768, align: 8, offset: 13952)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !647, file: !314, line: 396, baseType: !300, size: 32, align: 32, offset: 46720)
!714 = !{}
!715 = !DILocalVariable(name: "gb", arg: 1, scope: !506, file: !507, line: 351, type: !510)
!716 = !DIExpression()
!717 = !DILocation(line: 351, column: 43, scope: !506)
!718 = !DILocalVariable(name: "logctx", arg: 2, scope: !506, file: !507, line: 351, type: !522)
!719 = !DILocation(line: 351, column: 53, scope: !506)
!720 = !DILocalVariable(name: "s", arg: 3, scope: !506, file: !507, line: 351, type: !523)
!721 = !DILocation(line: 351, column: 70, scope: !506)
!722 = !DILocalVariable(name: "ps", arg: 4, scope: !506, file: !507, line: 352, type: !593)
!723 = !DILocation(line: 352, column: 49, scope: !506)
!724 = !DILocalVariable(name: "type", arg: 5, scope: !506, file: !507, line: 352, type: !300)
!725 = !DILocation(line: 352, column: 57, scope: !506)
!726 = !DILocalVariable(name: "ret", scope: !506, file: !507, line: 354, type: !300)
!727 = !DILocation(line: 354, column: 9, scope: !506)
!728 = !DILocation(line: 356, column: 5, scope: !506)
!729 = distinct !{!729, !728}
!730 = !DILocation(line: 357, column: 38, scope: !731)
!731 = distinct !DILexicalBlock(scope: !506, file: !507, line: 356, column: 8)
!732 = !DILocation(line: 357, column: 42, scope: !731)
!733 = !DILocation(line: 357, column: 50, scope: !731)
!734 = !DILocation(line: 357, column: 53, scope: !731)
!735 = !DILocation(line: 357, column: 57, scope: !731)
!736 = !DILocation(line: 357, column: 15, scope: !731)
!737 = !DILocation(line: 357, column: 13, scope: !731)
!738 = !DILocation(line: 358, column: 13, scope: !739)
!739 = distinct !DILexicalBlock(scope: !731, file: !507, line: 358, column: 13)
!740 = !DILocation(line: 358, column: 17, scope: !739)
!741 = !DILocation(line: 358, column: 13, scope: !731)
!742 = !DILocation(line: 359, column: 20, scope: !739)
!743 = !DILocation(line: 359, column: 13, scope: !739)
!744 = !DILocation(line: 360, column: 5, scope: !731)
!745 = !DILocation(line: 360, column: 29, scope: !746)
!746 = !DILexicalBlockFile(scope: !506, file: !507, discriminator: 1)
!747 = !DILocation(line: 360, column: 14, scope: !746)
!748 = !DILocation(line: 360, column: 5, scope: !746)
!749 = !DILocation(line: 361, column: 5, scope: !506)
!750 = !DILocation(line: 362, column: 1, scope: !506)
!751 = distinct !DISubprogram(name: "decode_nal_sei_message", scope: !507, file: !507, line: 318, type: !508, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !714)
!752 = !DILocalVariable(name: "gb", arg: 1, scope: !751, file: !507, line: 318, type: !510)
!753 = !DILocation(line: 318, column: 50, scope: !751)
!754 = !DILocalVariable(name: "logctx", arg: 2, scope: !751, file: !507, line: 318, type: !522)
!755 = !DILocation(line: 318, column: 60, scope: !751)
!756 = !DILocalVariable(name: "s", arg: 3, scope: !751, file: !507, line: 318, type: !523)
!757 = !DILocation(line: 318, column: 77, scope: !751)
!758 = !DILocalVariable(name: "ps", arg: 4, scope: !751, file: !507, line: 319, type: !593)
!759 = !DILocation(line: 319, column: 56, scope: !751)
!760 = !DILocalVariable(name: "nal_unit_type", arg: 5, scope: !751, file: !507, line: 319, type: !300)
!761 = !DILocation(line: 319, column: 64, scope: !751)
!762 = !DILocalVariable(name: "payload_type", scope: !751, file: !507, line: 321, type: !300)
!763 = !DILocation(line: 321, column: 9, scope: !751)
!764 = !DILocalVariable(name: "payload_size", scope: !751, file: !507, line: 322, type: !300)
!765 = !DILocation(line: 322, column: 9, scope: !751)
!766 = !DILocalVariable(name: "byte", scope: !751, file: !507, line: 323, type: !300)
!767 = !DILocation(line: 323, column: 9, scope: !751)
!768 = !DILocation(line: 324, column: 12, scope: !751)
!769 = !DILocation(line: 324, column: 5, scope: !751)
!770 = !DILocation(line: 326, column: 5, scope: !751)
!771 = !DILocation(line: 326, column: 12, scope: !772)
