; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cavs.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cavs.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cavs_vector = type { i16, i16, i16, i16 }
%struct.AVSContext = type { %struct.AVCodecContext*, %struct.BlockDSPContext, %struct.H264ChromaContext, %struct.IDCTDSPContext, %struct.VideoDSPContext, %struct.CAVSDSPContext, %struct.GetBitContext, %struct.AVSFrame, [2 x %struct.AVSFrame], [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i32, i8*, [24 x %struct.cavs_vector], [2 x %struct.cavs_vector*], %struct.cavs_vector*, [9 x i32], i32*, i64, i64, [4 x i32], i32, i32, i32, i32, %struct.ScanTable, i8*, i8*, i8*, [26 x i8], [10 x i8], [10 x i8], [26 x i8], i8, i8, i8, [8 x void (i8*, i8*, i8*, i64)*], [7 x void (i8*, i8*, i8*, i64)*], i8*, i32, [2 x i32], [2 x i32], i8*, i32, i16* }

!947 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_intra_luma", file: !897, line: 83, size: 32, align: 32, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956}
!949 = !DIEnumerator(name: "INTRA_L_VERT", value: 0)
!950 = !DIEnumerator(name: "INTRA_L_HORIZ", value: 1)
!951 = !DIEnumerator(name: "INTRA_L_LP", value: 2)
!952 = !DIEnumerator(name: "INTRA_L_DOWN_LEFT", value: 3)
!953 = !DIEnumerator(name: "INTRA_L_DOWN_RIGHT", value: 4)
!954 = !DIEnumerator(name: "INTRA_L_LP_LEFT", value: 5)
!955 = !DIEnumerator(name: "INTRA_L_LP_TOP", value: 6)
!956 = !DIEnumerator(name: "INTRA_L_DC_128", value: 7)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cavs_intra_chroma", file: !897, line: 94, size: 32, align: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965}
!959 = !DIEnumerator(name: "INTRA_C_LP", value: 0)
!960 = !DIEnumerator(name: "INTRA_C_HORIZ", value: 1)
!961 = !DIEnumerator(name: "INTRA_C_VERT", value: 2)
!962 = !DIEnumerator(name: "INTRA_C_PLANE", value: 3)
!963 = !DIEnumerator(name: "INTRA_C_LP_LEFT", value: 4)
!964 = !DIEnumerator(name: "INTRA_C_LP_TOP", value: 5)
!965 = !DIEnumerator(name: "INTRA_C_DC_128", value: 6)
!966 = !{!967, !976, !977, !979, !980, !985, !986}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !970, line: 220, size: 64, align: 8, elements: !971)
!970 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !969, file: !970, line: 220, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !974, line: 55, baseType: !975)
!974 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!975 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!976 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !974, line: 37, baseType: !978)
!978 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !970, line: 221, size: 32, align: 8, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !982, file: !970, line: 221, baseType: !985, size: 32, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !974, line: 51, baseType: !976)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!987 = !{!988, !996, !997, !998, !1005, !1009, !1010, !1011}
!988 = distinct !DIGlobalVariable(name: "alpha_tab", scope: !0, file: !989, line: 38, type: !990, isLocal: true, isDefinition: true, variable: [64 x i8]* @alpha_tab)
!989 = !DIFile(filename: "libavcodec/cavs.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 512, align: 8, elements: !994)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !974, line: 48, baseType: !993)
!993 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!994 = !{!995}
!995 = !DISubrange(count: 64)
!996 = distinct !DIGlobalVariable(name: "beta_tab", scope: !0, file: !989, line: 45, type: !990, isLocal: true, isDefinition: true, variable: [64 x i8]* @beta_tab)
!997 = distinct !DIGlobalVariable(name: "tc_tab", scope: !0, file: !989, line: 52, type: !990, isLocal: true, isDefinition: true, variable: [64 x i8]* @tc_tab)
!998 = distinct !DIGlobalVariable(name: "left_modifier_l", scope: !0, file: !989, line: 63, type: !999, isLocal: true, isDefinition: true, variable: [8 x i8]* @left_modifier_l)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 64, align: 8, elements: !1003)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !974, line: 36, baseType: !1002)
!1002 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1003 = !{!1004}
!1004 = !DISubrange(count: 8)
!1005 = distinct !DIGlobalVariable(name: "left_modifier_c", scope: !0, file: !989, line: 65, type: !1006, isLocal: true, isDefinition: true, variable: [7 x i8]* @left_modifier_c)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 56, align: 8, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 7)
!1009 = distinct !DIGlobalVariable(name: "top_modifier_l", scope: !0, file: !989, line: 64, type: !999, isLocal: true, isDefinition: true, variable: [8 x i8]* @top_modifier_l)
!1010 = distinct !DIGlobalVariable(name: "top_modifier_c", scope: !0, file: !989, line: 66, type: !1006, isLocal: true, isDefinition: true, variable: [7 x i8]* @top_modifier_c)
!1011 = distinct !DIGlobalVariable(name: "un_mv", scope: !0, file: !989, line: 61, type: !1012, isLocal: true, isDefinition: true, variable: %struct.cavs_vector* @un_mv)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "cavs_vector", file: !897, line: 148, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !897, line: 143, size: 64, align: 16, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1014, file: !897, line: 144, baseType: !977, size: 16, align: 16)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1014, file: !897, line: 145, baseType: !977, size: 16, align: 16, offset: 16)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1014, file: !897, line: 146, baseType: !977, size: 16, align: 16, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1014, file: !897, line: 147, baseType: !977, size: 16, align: 16, offset: 48)
!1020 = !{i32 2, !"Dwarf Version", i32 4}
!1021 = !{i32 2, !"Debug Info Version", i32 3}
!1022 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1023 = distinct !DISubprogram(name: "ff_cavs_filter", scope: !989, file: !989, line: 109, type: !1024, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1948)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !1026, !896}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSContext", file: !897, line: 243, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSContext", file: !897, line: 163, size: 13952, align: 64, elements: !1029)
!1029 = !{!1030, !1750, !1770, !1782, !1805, !1818, !1845, !1855, !1861, !1863, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1895, !1898, !1899, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1918, !1919, !1920, !1921, !1925, !1929, !1930, !1931, !1932, !1933, !1934, !1939, !1941, !1942, !1943, !1944, !1945, !1946, !1947}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1028, file: !897, line: 164, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1034)
!1034 = !{!1035, !1080, !1081, !1082, !1348, !1349, !1350, !1351, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1504, !1508, !1509, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1688, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1033, file: !35, line: 1561, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1040)
!1040 = !{!1041, !1045, !1049, !1053, !1055, !1056, !1057, !1061, !1067, !1069, !1073}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1039, file: !4, line: 72, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1039, file: !4, line: 78, baseType: !1046, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1042, !979}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1039, file: !4, line: 85, baseType: !1050, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1039, file: !4, line: 93, baseType: !1054, size: 32, align: 32, offset: 192)
!1054 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1039, file: !4, line: 99, baseType: !1054, size: 32, align: 32, offset: 224)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1039, file: !4, line: 108, baseType: !1054, size: 32, align: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1039, file: !4, line: 113, baseType: !1058, size: 64, align: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!979, !979, !979}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1039, file: !4, line: 123, baseType: !1062, size: 64, align: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!1065, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1039, file: !4, line: 130, baseType: !1068, size: 32, align: 32, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1039, file: !4, line: 136, baseType: !1070, size: 64, align: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!1068, !979}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1039, file: !4, line: 142, baseType: !1074, size: 64, align: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1054, !1077, !979, !1042, !1054}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1033, file: !35, line: 1562, baseType: !1054, size: 32, align: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1033, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1033, file: !35, line: 1565, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1101, !1104, !1107, !1110, !1113, !1114, !1115, !1123, !1124, !1125, !1127, !1131, !1137, !1147, !1151, !1152, !1200, !1319, !1323, !1324, !1328, !1332, !1337, !1341, !1342, !1343}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !35, line: 3475, baseType: !1042, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1085, file: !35, line: 3480, baseType: !1042, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1085, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1085, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1085, file: !35, line: 3487, baseType: !1054, size: 32, align: 32, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1085, file: !35, line: 3488, baseType: !1093, size: 64, align: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1096, line: 61, baseType: !1097)
!1096 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1096, line: 58, size: 64, align: 32, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1097, file: !1096, line: 59, baseType: !1054, size: 32, align: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1097, file: !1096, line: 60, baseType: !1054, size: 32, align: 32, offset: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1085, file: !35, line: 3489, baseType: !1102, size: 64, align: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1085, file: !35, line: 3490, baseType: !1105, size: 64, align: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1085, file: !35, line: 3491, baseType: !1108, size: 64, align: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1085, file: !35, line: 3492, baseType: !1111, size: 64, align: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1085, file: !35, line: 3493, baseType: !992, size: 8, align: 8, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1085, file: !35, line: 3494, baseType: !1036, size: 64, align: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1085, file: !35, line: 3495, baseType: !1116, size: 64, align: 64, offset: 704)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1119, file: !35, line: 3402, baseType: !1054, size: 32, align: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1119, file: !35, line: 3403, baseType: !1042, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1085, file: !35, line: 3507, baseType: !1042, size: 64, align: 64, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1085, file: !35, line: 3516, baseType: !1054, size: 32, align: 32, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !35, line: 3517, baseType: !1126, size: 64, align: 64, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1085, file: !35, line: 3527, baseType: !1128, size: 64, align: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!1054, !1031}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1085, file: !35, line: 3535, baseType: !1132, size: 64, align: 64, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!1054, !1031, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1085, file: !35, line: 3541, baseType: !1138, size: 64, align: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1142, line: 223, size: 128, align: 64, elements: !1143)
!1142 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1143 = !{!1144, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1141, file: !1142, line: 224, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1141, file: !1142, line: 225, baseType: !1145, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1085, file: !35, line: 3549, baseType: !1148, size: 64, align: 64, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{null, !1126}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1085, file: !35, line: 3551, baseType: !1128, size: 64, align: 64, offset: 1216)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1085, file: !35, line: 3552, baseType: !1153, size: 64, align: 64, offset: 1280)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!1054, !1031, !1156, !1054, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1160)
!1160 = !{!1161, !1164, !1165, !1166, !1167, !1197}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1159, file: !35, line: 3921, baseType: !1162, size: 16, align: 16)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !974, line: 49, baseType: !1163)
!1163 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1159, file: !35, line: 3922, baseType: !985, size: 32, align: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1159, file: !35, line: 3923, baseType: !985, size: 32, align: 32, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1159, file: !35, line: 3924, baseType: !976, size: 32, align: 32, offset: 96)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1159, file: !35, line: 3925, baseType: !1168, size: 64, align: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1186, !1190, !1192, !1193, !1195, !1196}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1171, file: !35, line: 3886, baseType: !1054, size: 32, align: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1171, file: !35, line: 3887, baseType: !1054, size: 32, align: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1171, file: !35, line: 3888, baseType: !1054, size: 32, align: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1171, file: !35, line: 3889, baseType: !1054, size: 32, align: 32, offset: 96)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1171, file: !35, line: 3890, baseType: !1054, size: 32, align: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1171, file: !35, line: 3897, baseType: !1179, size: 768, align: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1181)
!1181 = !{!1182, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1180, file: !35, line: 3855, baseType: !1183, size: 512, align: 64)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 512, align: 64, elements: !1003)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1180, file: !35, line: 3857, baseType: !1185, size: 256, align: 32, offset: 512)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 256, align: 32, elements: !1003)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !35, line: 3903, baseType: !1187, size: 256, align: 64, offset: 960)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 256, align: 64, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 4)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1171, file: !35, line: 3904, baseType: !1191, size: 128, align: 32, offset: 1216)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 128, align: 32, elements: !1188)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1171, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1171, file: !35, line: 3908, baseType: !1194, size: 64, align: 64, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1171, file: !35, line: 3915, baseType: !1194, size: 64, align: 64, offset: 1472)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !35, line: 3917, baseType: !1054, size: 32, align: 32, offset: 1536)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1159, file: !35, line: 3926, baseType: !1198, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !974, line: 40, baseType: !1199)
!1199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1085, file: !35, line: 3564, baseType: !1201, size: 64, align: 64, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!1054, !1031, !1204, !1238, !1318}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1207)
!1207 = !{!1208, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1234, !1235, !1236, !1237}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1206, file: !35, line: 1451, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1211, line: 94, baseType: !1212)
!1211 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1211, line: 81, size: 192, align: 64, elements: !1213)
!1213 = !{!1214, !1218, !1219}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1212, file: !1211, line: 82, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1211, line: 73, baseType: !1217)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1211, line: 73, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1212, file: !1211, line: 89, baseType: !1156, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !1211, line: 93, baseType: !1054, size: 32, align: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1206, file: !35, line: 1461, baseType: !1198, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1206, file: !35, line: 1467, baseType: !1198, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1206, file: !35, line: 1468, baseType: !1156, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1206, file: !35, line: 1469, baseType: !1054, size: 32, align: 32, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1206, file: !35, line: 1470, baseType: !1054, size: 32, align: 32, offset: 288)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1206, file: !35, line: 1474, baseType: !1054, size: 32, align: 32, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1206, file: !35, line: 1479, baseType: !1227, size: 64, align: 64, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1229, file: !35, line: 1412, baseType: !1156, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1229, file: !35, line: 1413, baseType: !1054, size: 32, align: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1229, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1206, file: !35, line: 1480, baseType: !1054, size: 32, align: 32, offset: 448)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1206, file: !35, line: 1486, baseType: !1198, size: 64, align: 64, offset: 512)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1206, file: !35, line: 1488, baseType: !1198, size: 64, align: 64, offset: 576)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1206, file: !35, line: 1497, baseType: !1198, size: 64, align: 64, offset: 640)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1272, !1274, !1275, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1306, !1307, !1308, !1309, !1310, !1311, !1314, !1315, !1316, !1317}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1241, file: !758, line: 282, baseType: !1183, size: 512, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1241, file: !758, line: 299, baseType: !1185, size: 256, align: 32, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1241, file: !758, line: 315, baseType: !1246, size: 64, align: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1241, file: !758, line: 326, baseType: !1054, size: 32, align: 32, offset: 832)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1241, file: !758, line: 326, baseType: !1054, size: 32, align: 32, offset: 864)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1241, file: !758, line: 334, baseType: !1054, size: 32, align: 32, offset: 896)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1241, file: !758, line: 341, baseType: !1054, size: 32, align: 32, offset: 928)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1241, file: !758, line: 346, baseType: !1054, size: 32, align: 32, offset: 960)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1241, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1241, file: !758, line: 356, baseType: !1095, size: 64, align: 32, offset: 1024)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1241, file: !758, line: 361, baseType: !1198, size: 64, align: 64, offset: 1088)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1241, file: !758, line: 369, baseType: !1198, size: 64, align: 64, offset: 1152)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1241, file: !758, line: 377, baseType: !1198, size: 64, align: 64, offset: 1216)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1241, file: !758, line: 382, baseType: !1054, size: 32, align: 32, offset: 1280)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1241, file: !758, line: 386, baseType: !1054, size: 32, align: 32, offset: 1312)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1241, file: !758, line: 391, baseType: !1054, size: 32, align: 32, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1241, file: !758, line: 396, baseType: !979, size: 64, align: 64, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1241, file: !758, line: 403, baseType: !1262, size: 512, align: 64, offset: 1472)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 64, elements: !1003)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1241, file: !758, line: 410, baseType: !1054, size: 32, align: 32, offset: 1984)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1241, file: !758, line: 415, baseType: !1054, size: 32, align: 32, offset: 2016)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1241, file: !758, line: 420, baseType: !1054, size: 32, align: 32, offset: 2048)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1241, file: !758, line: 425, baseType: !1054, size: 32, align: 32, offset: 2080)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1241, file: !758, line: 435, baseType: !1198, size: 64, align: 64, offset: 2112)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1241, file: !758, line: 440, baseType: !1054, size: 32, align: 32, offset: 2176)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1241, file: !758, line: 445, baseType: !973, size: 64, align: 64, offset: 2240)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1241, file: !758, line: 459, baseType: !1271, size: 512, align: 64, offset: 2304)
!1271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 512, align: 64, elements: !1003)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1241, file: !758, line: 473, baseType: !1273, size: 64, align: 64, offset: 2816)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1241, file: !758, line: 477, baseType: !1054, size: 32, align: 32, offset: 2880)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1241, file: !758, line: 479, baseType: !1276, size: 64, align: 64, offset: 2944)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284, !1289}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1279, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1279, file: !758, line: 203, baseType: !1156, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1279, file: !758, line: 204, baseType: !1054, size: 32, align: 32, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1279, file: !758, line: 205, baseType: !1285, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1287, line: 86, baseType: !1288)
!1287 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1287, line: 86, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1279, file: !758, line: 206, baseType: !1209, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1241, file: !758, line: 480, baseType: !1054, size: 32, align: 32, offset: 3008)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1241, file: !758, line: 505, baseType: !1054, size: 32, align: 32, offset: 3040)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1241, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1241, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1241, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1241, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1241, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1241, file: !758, line: 532, baseType: !1198, size: 64, align: 64, offset: 3264)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1241, file: !758, line: 539, baseType: !1198, size: 64, align: 64, offset: 3328)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1241, file: !758, line: 547, baseType: !1198, size: 64, align: 64, offset: 3392)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1241, file: !758, line: 554, baseType: !1285, size: 64, align: 64, offset: 3456)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1241, file: !758, line: 563, baseType: !1054, size: 32, align: 32, offset: 3520)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1241, file: !758, line: 572, baseType: !1054, size: 32, align: 32, offset: 3552)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1241, file: !758, line: 581, baseType: !1054, size: 32, align: 32, offset: 3584)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1241, file: !758, line: 588, baseType: !1305, size: 64, align: 64, offset: 3648)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1241, file: !758, line: 593, baseType: !1054, size: 32, align: 32, offset: 3712)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1241, file: !758, line: 596, baseType: !1054, size: 32, align: 32, offset: 3744)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1241, file: !758, line: 599, baseType: !1209, size: 64, align: 64, offset: 3776)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1241, file: !758, line: 605, baseType: !1209, size: 64, align: 64, offset: 3840)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1241, file: !758, line: 616, baseType: !1209, size: 64, align: 64, offset: 3904)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1241, file: !758, line: 626, baseType: !1312, size: 64, align: 64, offset: 3968)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1313, line: 216, baseType: !975)
!1313 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1241, file: !758, line: 627, baseType: !1312, size: 64, align: 64, offset: 4032)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1241, file: !758, line: 628, baseType: !1312, size: 64, align: 64, offset: 4096)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1241, file: !758, line: 629, baseType: !1312, size: 64, align: 64, offset: 4160)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1241, file: !758, line: 645, baseType: !1209, size: 64, align: 64, offset: 4224)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1085, file: !35, line: 3566, baseType: !1320, size: 64, align: 64, offset: 1408)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!1054, !1031, !979, !1318, !1204}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1085, file: !35, line: 3567, baseType: !1128, size: 64, align: 64, offset: 1472)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1085, file: !35, line: 3576, baseType: !1325, size: 64, align: 64, offset: 1536)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!1054, !1031, !1238}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1085, file: !35, line: 3577, baseType: !1329, size: 64, align: 64, offset: 1600)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!1054, !1031, !1204}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1085, file: !35, line: 3584, baseType: !1333, size: 64, align: 64, offset: 1664)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!1054, !1031, !1336}
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1085, file: !35, line: 3589, baseType: !1338, size: 64, align: 64, offset: 1728)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !1031}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1085, file: !35, line: 3594, baseType: !1054, size: 32, align: 32, offset: 1792)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1085, file: !35, line: 3600, baseType: !1042, size: 64, align: 64, offset: 1856)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1085, file: !35, line: 3609, baseType: !1344, size: 64, align: 64, offset: 1920)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1347 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1033, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1033, file: !35, line: 1581, baseType: !976, size: 32, align: 32, offset: 224)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1033, file: !35, line: 1583, baseType: !979, size: 64, align: 64, offset: 256)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1033, file: !35, line: 1591, baseType: !1352, size: 64, align: 64, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1142, line: 129, size: 1664, align: 64, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1358, !1359, !1377, !1378, !1384, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1353, file: !1142, line: 136, baseType: !1054, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1353, file: !1142, line: 151, baseType: !1054, size: 32, align: 32, offset: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1353, file: !1142, line: 157, baseType: !1054, size: 32, align: 32, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1353, file: !1142, line: 159, baseType: !1336, size: 64, align: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1353, file: !1142, line: 161, baseType: !1360, size: 64, align: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1142, line: 117, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1142, line: 100, size: 832, align: 64, elements: !1363)
!1363 = !{!1364, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1362, file: !1142, line: 105, baseType: !1365, size: 256, align: 64)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1366, size: 256, align: 64, elements: !1188)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1211, line: 238, baseType: !1368)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1211, line: 238, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1362, file: !1142, line: 110, baseType: !1054, size: 32, align: 32, offset: 256)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1362, file: !1142, line: 111, baseType: !1054, size: 32, align: 32, offset: 288)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1362, file: !1142, line: 111, baseType: !1054, size: 32, align: 32, offset: 320)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1362, file: !1142, line: 112, baseType: !1185, size: 256, align: 32, offset: 352)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1362, file: !1142, line: 113, baseType: !1191, size: 128, align: 32, offset: 608)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1362, file: !1142, line: 114, baseType: !1054, size: 32, align: 32, offset: 736)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1362, file: !1142, line: 115, baseType: !1054, size: 32, align: 32, offset: 768)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1362, file: !1142, line: 116, baseType: !1054, size: 32, align: 32, offset: 800)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1353, file: !1142, line: 163, baseType: !979, size: 64, align: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1353, file: !1142, line: 165, baseType: !1379, size: 128, align: 64, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1142, line: 122, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1142, line: 119, size: 128, align: 64, elements: !1381)
!1381 = !{!1382, !1383}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1380, file: !1142, line: 120, baseType: !1204, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1380, file: !1142, line: 121, baseType: !1336, size: 64, align: 64, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1353, file: !1142, line: 166, baseType: !1385, size: 128, align: 64, offset: 448)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1142, line: 127, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1142, line: 124, size: 128, align: 64, elements: !1387)
!1387 = !{!1388, !1461}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1386, file: !1142, line: 125, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1419, !1423, !1424, !1458, !1459, !1460}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1392, file: !35, line: 5751, baseType: !1036, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1392, file: !35, line: 5756, baseType: !1396, size: 64, align: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1399)
!1399 = !{!1400, !1401, !1404, !1405, !1406, !1410, !1414, !1418}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1398, file: !35, line: 5797, baseType: !1042, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1398, file: !35, line: 5804, baseType: !1402, size: 64, align: 64, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1398, file: !35, line: 5815, baseType: !1036, size: 64, align: 64, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1398, file: !35, line: 5825, baseType: !1054, size: 32, align: 32, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1398, file: !35, line: 5826, baseType: !1407, size: 64, align: 64, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!1054, !1390}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1398, file: !35, line: 5827, baseType: !1411, size: 64, align: 64, offset: 320)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!1054, !1390, !1204}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1398, file: !35, line: 5828, baseType: !1415, size: 64, align: 64, offset: 384)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1390}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1398, file: !35, line: 5829, baseType: !1415, size: 64, align: 64, offset: 448)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1392, file: !35, line: 5762, baseType: !1420, size: 64, align: 64, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1422)
!1422 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1392, file: !35, line: 5768, baseType: !979, size: 64, align: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1392, file: !35, line: 5775, baseType: !1425, size: 64, align: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1428)
!1428 = !{!1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1427, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1427, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1427, file: !35, line: 3948, baseType: !985, size: 32, align: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1427, file: !35, line: 3958, baseType: !1156, size: 64, align: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1427, file: !35, line: 3962, baseType: !1054, size: 32, align: 32, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1427, file: !35, line: 3968, baseType: !1054, size: 32, align: 32, offset: 224)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1427, file: !35, line: 3973, baseType: !1198, size: 64, align: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1427, file: !35, line: 3986, baseType: !1054, size: 32, align: 32, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1427, file: !35, line: 3999, baseType: !1054, size: 32, align: 32, offset: 352)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1427, file: !35, line: 4004, baseType: !1054, size: 32, align: 32, offset: 384)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1427, file: !35, line: 4005, baseType: !1054, size: 32, align: 32, offset: 416)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1427, file: !35, line: 4010, baseType: !1054, size: 32, align: 32, offset: 448)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1427, file: !35, line: 4011, baseType: !1054, size: 32, align: 32, offset: 480)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1427, file: !35, line: 4020, baseType: !1095, size: 64, align: 32, offset: 512)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1427, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1427, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1427, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1427, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1427, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1427, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1427, file: !35, line: 4039, baseType: !1054, size: 32, align: 32, offset: 768)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1427, file: !35, line: 4046, baseType: !973, size: 64, align: 64, offset: 832)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1427, file: !35, line: 4050, baseType: !1054, size: 32, align: 32, offset: 896)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1427, file: !35, line: 4054, baseType: !1054, size: 32, align: 32, offset: 928)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1427, file: !35, line: 4061, baseType: !1054, size: 32, align: 32, offset: 960)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1427, file: !35, line: 4065, baseType: !1054, size: 32, align: 32, offset: 992)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1427, file: !35, line: 4073, baseType: !1054, size: 32, align: 32, offset: 1024)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1427, file: !35, line: 4080, baseType: !1054, size: 32, align: 32, offset: 1056)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1427, file: !35, line: 4084, baseType: !1054, size: 32, align: 32, offset: 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1392, file: !35, line: 5781, baseType: !1425, size: 64, align: 64, offset: 320)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1392, file: !35, line: 5787, baseType: !1095, size: 64, align: 32, offset: 384)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1392, file: !35, line: 5793, baseType: !1095, size: 64, align: 32, offset: 448)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1386, file: !1142, line: 126, baseType: !1054, size: 32, align: 32, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1353, file: !1142, line: 172, baseType: !1204, size: 64, align: 64, offset: 576)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1353, file: !1142, line: 177, baseType: !1156, size: 64, align: 64, offset: 640)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1353, file: !1142, line: 178, baseType: !976, size: 32, align: 32, offset: 704)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1353, file: !1142, line: 180, baseType: !979, size: 64, align: 64, offset: 768)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1353, file: !1142, line: 185, baseType: !1054, size: 32, align: 32, offset: 832)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1353, file: !1142, line: 190, baseType: !979, size: 64, align: 64, offset: 896)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1353, file: !1142, line: 195, baseType: !1054, size: 32, align: 32, offset: 960)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1353, file: !1142, line: 200, baseType: !1204, size: 64, align: 64, offset: 1024)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1353, file: !1142, line: 201, baseType: !1054, size: 32, align: 32, offset: 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1353, file: !1142, line: 202, baseType: !1336, size: 64, align: 64, offset: 1152)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1353, file: !1142, line: 203, baseType: !1054, size: 32, align: 32, offset: 1216)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1353, file: !1142, line: 205, baseType: !1054, size: 32, align: 32, offset: 1248)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1353, file: !1142, line: 206, baseType: !1054, size: 32, align: 32, offset: 1280)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1353, file: !1142, line: 209, baseType: !1312, size: 64, align: 64, offset: 1344)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1353, file: !1142, line: 212, baseType: !1312, size: 64, align: 64, offset: 1408)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1353, file: !1142, line: 213, baseType: !1336, size: 64, align: 64, offset: 1472)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1353, file: !1142, line: 215, baseType: !1054, size: 32, align: 32, offset: 1536)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1353, file: !1142, line: 217, baseType: !1054, size: 32, align: 32, offset: 1568)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1353, file: !1142, line: 220, baseType: !1054, size: 32, align: 32, offset: 1600)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1033, file: !35, line: 1598, baseType: !979, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1033, file: !35, line: 1606, baseType: !1198, size: 64, align: 64, offset: 448)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1033, file: !35, line: 1614, baseType: !1054, size: 32, align: 32, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1033, file: !35, line: 1622, baseType: !1054, size: 32, align: 32, offset: 544)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1033, file: !35, line: 1628, baseType: !1054, size: 32, align: 32, offset: 576)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1033, file: !35, line: 1636, baseType: !1054, size: 32, align: 32, offset: 608)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1033, file: !35, line: 1643, baseType: !1054, size: 32, align: 32, offset: 640)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1033, file: !35, line: 1657, baseType: !1156, size: 64, align: 64, offset: 704)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1033, file: !35, line: 1658, baseType: !1054, size: 32, align: 32, offset: 768)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1033, file: !35, line: 1679, baseType: !1095, size: 64, align: 32, offset: 800)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1033, file: !35, line: 1688, baseType: !1054, size: 32, align: 32, offset: 864)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1033, file: !35, line: 1712, baseType: !1054, size: 32, align: 32, offset: 896)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1033, file: !35, line: 1729, baseType: !1054, size: 32, align: 32, offset: 928)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1033, file: !35, line: 1729, baseType: !1054, size: 32, align: 32, offset: 960)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1033, file: !35, line: 1744, baseType: !1054, size: 32, align: 32, offset: 992)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1033, file: !35, line: 1744, baseType: !1054, size: 32, align: 32, offset: 1024)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1033, file: !35, line: 1751, baseType: !1054, size: 32, align: 32, offset: 1056)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1033, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1033, file: !35, line: 1791, baseType: !1500, size: 64, align: 64, offset: 1152)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !1503, !1238, !1318, !1054, !1054, !1054}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1033, file: !35, line: 1808, baseType: !1505, size: 64, align: 64, offset: 1216)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!494, !1503, !1102}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1033, file: !35, line: 1816, baseType: !1054, size: 32, align: 32, offset: 1280)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1033, file: !35, line: 1825, baseType: !1510, size: 32, align: 32, offset: 1312)
!1510 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1033, file: !35, line: 1830, baseType: !1054, size: 32, align: 32, offset: 1344)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1033, file: !35, line: 1838, baseType: !1510, size: 32, align: 32, offset: 1376)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1033, file: !35, line: 1846, baseType: !1054, size: 32, align: 32, offset: 1408)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1033, file: !35, line: 1851, baseType: !1054, size: 32, align: 32, offset: 1440)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1033, file: !35, line: 1861, baseType: !1510, size: 32, align: 32, offset: 1472)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1033, file: !35, line: 1868, baseType: !1510, size: 32, align: 32, offset: 1504)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1033, file: !35, line: 1875, baseType: !1510, size: 32, align: 32, offset: 1536)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1033, file: !35, line: 1882, baseType: !1510, size: 32, align: 32, offset: 1568)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1033, file: !35, line: 1889, baseType: !1510, size: 32, align: 32, offset: 1600)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1033, file: !35, line: 1896, baseType: !1510, size: 32, align: 32, offset: 1632)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1033, file: !35, line: 1903, baseType: !1510, size: 32, align: 32, offset: 1664)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1033, file: !35, line: 1910, baseType: !1054, size: 32, align: 32, offset: 1696)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1033, file: !35, line: 1915, baseType: !1054, size: 32, align: 32, offset: 1728)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1033, file: !35, line: 1926, baseType: !1318, size: 64, align: 64, offset: 1792)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1033, file: !35, line: 1935, baseType: !1095, size: 64, align: 32, offset: 1856)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1033, file: !35, line: 1942, baseType: !1054, size: 32, align: 32, offset: 1920)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1033, file: !35, line: 1948, baseType: !1054, size: 32, align: 32, offset: 1952)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1033, file: !35, line: 1954, baseType: !1054, size: 32, align: 32, offset: 1984)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1033, file: !35, line: 1960, baseType: !1054, size: 32, align: 32, offset: 2016)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1033, file: !35, line: 1984, baseType: !1054, size: 32, align: 32, offset: 2048)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1033, file: !35, line: 1991, baseType: !1054, size: 32, align: 32, offset: 2080)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1033, file: !35, line: 1996, baseType: !1054, size: 32, align: 32, offset: 2112)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1033, file: !35, line: 2004, baseType: !1054, size: 32, align: 32, offset: 2144)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1033, file: !35, line: 2011, baseType: !1054, size: 32, align: 32, offset: 2176)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1033, file: !35, line: 2018, baseType: !1054, size: 32, align: 32, offset: 2208)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1033, file: !35, line: 2027, baseType: !1054, size: 32, align: 32, offset: 2240)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1033, file: !35, line: 2034, baseType: !1054, size: 32, align: 32, offset: 2272)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1033, file: !35, line: 2044, baseType: !1054, size: 32, align: 32, offset: 2304)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1033, file: !35, line: 2054, baseType: !1540, size: 64, align: 64, offset: 2368)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1033, file: !35, line: 2061, baseType: !1540, size: 64, align: 64, offset: 2432)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1033, file: !35, line: 2066, baseType: !1054, size: 32, align: 32, offset: 2496)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1033, file: !35, line: 2070, baseType: !1054, size: 32, align: 32, offset: 2528)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1033, file: !35, line: 2078, baseType: !1054, size: 32, align: 32, offset: 2560)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1033, file: !35, line: 2085, baseType: !1054, size: 32, align: 32, offset: 2592)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1033, file: !35, line: 2092, baseType: !1054, size: 32, align: 32, offset: 2624)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1033, file: !35, line: 2099, baseType: !1054, size: 32, align: 32, offset: 2656)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1033, file: !35, line: 2106, baseType: !1054, size: 32, align: 32, offset: 2688)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1033, file: !35, line: 2113, baseType: !1054, size: 32, align: 32, offset: 2720)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1033, file: !35, line: 2120, baseType: !1054, size: 32, align: 32, offset: 2752)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1033, file: !35, line: 2125, baseType: !1054, size: 32, align: 32, offset: 2784)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1033, file: !35, line: 2133, baseType: !1054, size: 32, align: 32, offset: 2816)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1033, file: !35, line: 2140, baseType: !1054, size: 32, align: 32, offset: 2848)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1033, file: !35, line: 2145, baseType: !1054, size: 32, align: 32, offset: 2880)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1033, file: !35, line: 2153, baseType: !1054, size: 32, align: 32, offset: 2912)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1033, file: !35, line: 2158, baseType: !1054, size: 32, align: 32, offset: 2944)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1033, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1033, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1033, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1033, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1033, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1033, file: !35, line: 2203, baseType: !1054, size: 32, align: 32, offset: 3136)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1033, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1033, file: !35, line: 2212, baseType: !1054, size: 32, align: 32, offset: 3200)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1033, file: !35, line: 2213, baseType: !1054, size: 32, align: 32, offset: 3232)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1033, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1033, file: !35, line: 2232, baseType: !1054, size: 32, align: 32, offset: 3296)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1033, file: !35, line: 2243, baseType: !1054, size: 32, align: 32, offset: 3328)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1033, file: !35, line: 2249, baseType: !1054, size: 32, align: 32, offset: 3360)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1033, file: !35, line: 2256, baseType: !1054, size: 32, align: 32, offset: 3392)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1033, file: !35, line: 2263, baseType: !973, size: 64, align: 64, offset: 3456)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1033, file: !35, line: 2270, baseType: !973, size: 64, align: 64, offset: 3520)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1033, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1033, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1033, file: !35, line: 2367, baseType: !1576, size: 64, align: 64, offset: 3648)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!1054, !1503, !1336, !1054}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1033, file: !35, line: 2383, baseType: !1054, size: 32, align: 32, offset: 3712)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1033, file: !35, line: 2386, baseType: !1510, size: 32, align: 32, offset: 3744)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1033, file: !35, line: 2387, baseType: !1510, size: 32, align: 32, offset: 3776)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1033, file: !35, line: 2394, baseType: !1054, size: 32, align: 32, offset: 3808)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1033, file: !35, line: 2401, baseType: !1054, size: 32, align: 32, offset: 3840)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1033, file: !35, line: 2408, baseType: !1054, size: 32, align: 32, offset: 3872)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1033, file: !35, line: 2415, baseType: !1054, size: 32, align: 32, offset: 3904)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1033, file: !35, line: 2422, baseType: !1054, size: 32, align: 32, offset: 3936)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1033, file: !35, line: 2423, baseType: !1588, size: 64, align: 64, offset: 3968)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1590, file: !35, line: 827, baseType: !1054, size: 32, align: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1590, file: !35, line: 828, baseType: !1054, size: 32, align: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1590, file: !35, line: 829, baseType: !1054, size: 32, align: 32, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1590, file: !35, line: 830, baseType: !1510, size: 32, align: 32, offset: 96)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1033, file: !35, line: 2430, baseType: !1198, size: 64, align: 64, offset: 4032)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1033, file: !35, line: 2437, baseType: !1198, size: 64, align: 64, offset: 4096)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1033, file: !35, line: 2444, baseType: !1510, size: 32, align: 32, offset: 4160)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1033, file: !35, line: 2451, baseType: !1510, size: 32, align: 32, offset: 4192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1033, file: !35, line: 2458, baseType: !1054, size: 32, align: 32, offset: 4224)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1033, file: !35, line: 2469, baseType: !1054, size: 32, align: 32, offset: 4256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1033, file: !35, line: 2475, baseType: !1054, size: 32, align: 32, offset: 4288)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1033, file: !35, line: 2481, baseType: !1054, size: 32, align: 32, offset: 4320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1033, file: !35, line: 2485, baseType: !1054, size: 32, align: 32, offset: 4352)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1033, file: !35, line: 2489, baseType: !1054, size: 32, align: 32, offset: 4384)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1033, file: !35, line: 2493, baseType: !1054, size: 32, align: 32, offset: 4416)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1033, file: !35, line: 2501, baseType: !1054, size: 32, align: 32, offset: 4448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1033, file: !35, line: 2506, baseType: !1054, size: 32, align: 32, offset: 4480)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1033, file: !35, line: 2510, baseType: !1054, size: 32, align: 32, offset: 4512)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1033, file: !35, line: 2514, baseType: !1198, size: 64, align: 64, offset: 4544)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1033, file: !35, line: 2528, baseType: !1612, size: 64, align: 64, offset: 4608)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{null, !1503, !979, !1054, !1054}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1033, file: !35, line: 2534, baseType: !1054, size: 32, align: 32, offset: 4672)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1033, file: !35, line: 2545, baseType: !1054, size: 32, align: 32, offset: 4704)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1033, file: !35, line: 2547, baseType: !1054, size: 32, align: 32, offset: 4736)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1033, file: !35, line: 2549, baseType: !1054, size: 32, align: 32, offset: 4768)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1033, file: !35, line: 2551, baseType: !1054, size: 32, align: 32, offset: 4800)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1033, file: !35, line: 2553, baseType: !1054, size: 32, align: 32, offset: 4832)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1033, file: !35, line: 2555, baseType: !1054, size: 32, align: 32, offset: 4864)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1033, file: !35, line: 2557, baseType: !1054, size: 32, align: 32, offset: 4896)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1033, file: !35, line: 2559, baseType: !1054, size: 32, align: 32, offset: 4928)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1033, file: !35, line: 2563, baseType: !1054, size: 32, align: 32, offset: 4960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1033, file: !35, line: 2571, baseType: !1194, size: 64, align: 64, offset: 4992)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1033, file: !35, line: 2579, baseType: !1194, size: 64, align: 64, offset: 5056)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1033, file: !35, line: 2586, baseType: !1054, size: 32, align: 32, offset: 5120)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1033, file: !35, line: 2615, baseType: !1054, size: 32, align: 32, offset: 5152)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1033, file: !35, line: 2627, baseType: !1054, size: 32, align: 32, offset: 5184)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1033, file: !35, line: 2637, baseType: !1054, size: 32, align: 32, offset: 5216)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1033, file: !35, line: 2681, baseType: !1054, size: 32, align: 32, offset: 5248)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1033, file: !35, line: 2709, baseType: !1198, size: 64, align: 64, offset: 5312)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1033, file: !35, line: 2716, baseType: !1634, size: 64, align: 64, offset: 5376)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641, !1642, !1643, !1644, !1648, !1652, !1653, !1654, !1655, !1661, !1662, !1663, !1664, !1665}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1636, file: !35, line: 3642, baseType: !1042, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1636, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1636, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1636, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1636, file: !35, line: 3669, baseType: !1054, size: 32, align: 32, offset: 160)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1636, file: !35, line: 3682, baseType: !1333, size: 64, align: 64, offset: 192)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1636, file: !35, line: 3698, baseType: !1645, size: 64, align: 64, offset: 256)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!1054, !1031, !1145, !985}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1636, file: !35, line: 3712, baseType: !1649, size: 64, align: 64, offset: 320)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!1054, !1031, !1054, !1145, !985}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1636, file: !35, line: 3726, baseType: !1645, size: 64, align: 64, offset: 384)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1636, file: !35, line: 3737, baseType: !1128, size: 64, align: 64, offset: 448)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1636, file: !35, line: 3746, baseType: !1054, size: 32, align: 32, offset: 512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1636, file: !35, line: 3757, baseType: !1656, size: 64, align: 64, offset: 576)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1659}
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1636, file: !35, line: 3766, baseType: !1128, size: 64, align: 64, offset: 640)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1636, file: !35, line: 3774, baseType: !1128, size: 64, align: 64, offset: 704)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1636, file: !35, line: 3780, baseType: !1054, size: 32, align: 32, offset: 768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1636, file: !35, line: 3785, baseType: !1054, size: 32, align: 32, offset: 800)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1636, file: !35, line: 3795, baseType: !1666, size: 64, align: 64, offset: 832)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!1054, !1031, !1209}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1033, file: !35, line: 2728, baseType: !979, size: 64, align: 64, offset: 5440)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1033, file: !35, line: 2735, baseType: !1262, size: 512, align: 64, offset: 5504)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1033, file: !35, line: 2742, baseType: !1054, size: 32, align: 32, offset: 6016)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1033, file: !35, line: 2755, baseType: !1054, size: 32, align: 32, offset: 6048)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1033, file: !35, line: 2776, baseType: !1054, size: 32, align: 32, offset: 6080)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1033, file: !35, line: 2783, baseType: !1054, size: 32, align: 32, offset: 6112)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1033, file: !35, line: 2791, baseType: !1054, size: 32, align: 32, offset: 6144)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1033, file: !35, line: 2802, baseType: !1336, size: 64, align: 64, offset: 6208)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1033, file: !35, line: 2811, baseType: !1054, size: 32, align: 32, offset: 6272)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1033, file: !35, line: 2821, baseType: !1054, size: 32, align: 32, offset: 6304)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1033, file: !35, line: 2830, baseType: !1054, size: 32, align: 32, offset: 6336)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1033, file: !35, line: 2840, baseType: !1054, size: 32, align: 32, offset: 6368)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1033, file: !35, line: 2851, baseType: !1682, size: 64, align: 64, offset: 6400)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!1054, !1503, !1685, !979, !1318, !1054, !1054}
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!1054, !1503, !979}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1033, file: !35, line: 2871, baseType: !1689, size: 64, align: 64, offset: 6464)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!1054, !1503, !1692, !979, !1318, !1054}
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!1054, !1503, !979, !1054, !1054}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1033, file: !35, line: 2878, baseType: !1054, size: 32, align: 32, offset: 6528)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1033, file: !35, line: 2885, baseType: !1054, size: 32, align: 32, offset: 6560)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1033, file: !35, line: 3005, baseType: !1054, size: 32, align: 32, offset: 6592)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1033, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1033, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1033, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1033, file: !35, line: 3037, baseType: !1156, size: 64, align: 64, offset: 6720)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1033, file: !35, line: 3038, baseType: !1054, size: 32, align: 32, offset: 6784)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1033, file: !35, line: 3050, baseType: !973, size: 64, align: 64, offset: 6848)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1033, file: !35, line: 3065, baseType: !1054, size: 32, align: 32, offset: 6912)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1033, file: !35, line: 3083, baseType: !1054, size: 32, align: 32, offset: 6944)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1033, file: !35, line: 3092, baseType: !1095, size: 64, align: 32, offset: 6976)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1033, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1033, file: !35, line: 3106, baseType: !1095, size: 64, align: 32, offset: 7072)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1033, file: !35, line: 3113, baseType: !1710, size: 64, align: 64, offset: 7168)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1712)
!1712 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1713)
!1713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1714)
!1714 = !{!1715, !1716, !1717, !1718, !1719, !1720, !1723}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1713, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1713, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1713, file: !35, line: 720, baseType: !1042, size: 64, align: 64, offset: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1713, file: !35, line: 724, baseType: !1042, size: 64, align: 64, offset: 128)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1713, file: !35, line: 728, baseType: !1054, size: 32, align: 32, offset: 192)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1713, file: !35, line: 734, baseType: !1721, size: 64, align: 64, offset: 256)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1713, file: !35, line: 739, baseType: !1724, size: 64, align: 64, offset: 320)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1033, file: !35, line: 3129, baseType: !1198, size: 64, align: 64, offset: 7232)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1033, file: !35, line: 3130, baseType: !1198, size: 64, align: 64, offset: 7296)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1033, file: !35, line: 3131, baseType: !1198, size: 64, align: 64, offset: 7360)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1033, file: !35, line: 3132, baseType: !1198, size: 64, align: 64, offset: 7424)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1033, file: !35, line: 3139, baseType: !1194, size: 64, align: 64, offset: 7488)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1033, file: !35, line: 3147, baseType: !1054, size: 32, align: 32, offset: 7552)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1033, file: !35, line: 3165, baseType: !1054, size: 32, align: 32, offset: 7584)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1033, file: !35, line: 3172, baseType: !1054, size: 32, align: 32, offset: 7616)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1033, file: !35, line: 3180, baseType: !1054, size: 32, align: 32, offset: 7648)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1033, file: !35, line: 3191, baseType: !1540, size: 64, align: 64, offset: 7680)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1033, file: !35, line: 3199, baseType: !1156, size: 64, align: 64, offset: 7744)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1033, file: !35, line: 3207, baseType: !1194, size: 64, align: 64, offset: 7808)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1033, file: !35, line: 3214, baseType: !976, size: 32, align: 32, offset: 7872)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1033, file: !35, line: 3224, baseType: !1227, size: 64, align: 64, offset: 7936)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1033, file: !35, line: 3225, baseType: !1054, size: 32, align: 32, offset: 8000)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1033, file: !35, line: 3249, baseType: !1209, size: 64, align: 64, offset: 8064)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1033, file: !35, line: 3256, baseType: !1054, size: 32, align: 32, offset: 8128)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1033, file: !35, line: 3271, baseType: !1054, size: 32, align: 32, offset: 8160)
