; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--options.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--options.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!844 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!845 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!846 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!847 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!848 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!849 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!850 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !517, line: 493, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!853 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!854 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!855 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!856 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!857 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!858 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!859 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!860 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!861 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!862 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!863 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!864 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!865 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!866 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!867 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!868 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!869 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !517, line: 538, size: 32, align: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879}
!872 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!873 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !{!910, !914, !915, !917}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !912, line: 48, baseType: !913)
!912 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!913 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !912, line: 40, baseType: !916)
!916 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !922)
!922 = !{!923, !927, !931, !959, !960, !961, !962, !966, !972, !974, !978}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !921, file: !26, line: 72, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !921, file: !26, line: 78, baseType: !928, size: 64, align: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!924, !914}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !921, file: !26, line: 85, baseType: !932, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !935)
!935 = !{!936, !937, !938, !940, !941, !955, !956, !957, !958}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !934, file: !4, line: 247, baseType: !924, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !934, file: !4, line: 253, baseType: !924, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !934, file: !4, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !934, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !934, file: !4, line: 271, baseType: !942, size: 64, align: 64, offset: 192)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !934, file: !4, line: 265, size: 64, align: 64, elements: !943)
!943 = !{!944, !945, !947, !948}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !942, file: !4, line: 266, baseType: !915, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !942, file: !4, line: 267, baseType: !946, size: 64, align: 64)
!946 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !942, file: !4, line: 268, baseType: !924, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !942, file: !4, line: 270, baseType: !949, size: 64, align: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !950, line: 61, baseType: !951)
!950 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !950, line: 58, size: 64, align: 32, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !951, file: !950, line: 59, baseType: !939, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !951, file: !950, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !934, file: !4, line: 272, baseType: !946, size: 64, align: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !934, file: !4, line: 273, baseType: !946, size: 64, align: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !934, file: !4, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !934, file: !4, line: 300, baseType: !924, size: 64, align: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !921, file: !26, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !921, file: !26, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !921, file: !26, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !921, file: !26, line: 113, baseType: !963, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!914, !914, !914}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !921, file: !26, line: 123, baseType: !967, size: 64, align: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !921, file: !26, line: 130, baseType: !973, size: 32, align: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !921, file: !26, line: 136, baseType: !975, size: 64, align: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!973, !914}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !921, file: !26, line: 142, baseType: !979, size: 64, align: 64, offset: 576)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!939, !982, !914, !924, !939}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !985)
!985 = !{!986, !998, !999}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !984, file: !4, line: 360, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !990, file: !4, line: 307, baseType: !924, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !990, file: !4, line: 313, baseType: !946, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !990, file: !4, line: 313, baseType: !946, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !990, file: !4, line: 318, baseType: !946, size: 64, align: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !990, file: !4, line: 318, baseType: !946, size: 64, align: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !990, file: !4, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !984, file: !4, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !984, file: !4, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1000 = !{!1001, !1003, !1010, !1011, !1015, !1016}
!1001 = distinct !DIGlobalVariable(name: "av_codec_context_class", scope: !0, file: !1002, line: 79, type: !919, isLocal: true, isDefinition: true, variable: %struct.AVClass* @av_codec_context_class)
!1002 = !DIFile(filename: "libavcodec/options.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1003 = distinct !DIGlobalVariable(name: "avcodec_options", scope: !0, file: !1004, line: 44, type: !1005, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @avcodec_options)
!1004 = !DIFile(filename: "libavcodec/options_table.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 197632, align: 64, elements: !1008)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !934)
!1008 = !{!1009}
!1009 = !DISubrange(count: 386)
!1010 = distinct !DIGlobalVariable(name: "av_frame_class", scope: !0, file: !1002, line: 314, type: !919, isLocal: true, isDefinition: true, variable: %struct.AVClass* @av_frame_class)
!1011 = distinct !DIGlobalVariable(name: "frame_options", scope: !0, file: !1002, line: 301, type: !1012, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @frame_options)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 5120, align: 64, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 10)
!1015 = distinct !DIGlobalVariable(name: "av_subtitle_rect_class", scope: !0, file: !1002, line: 339, type: !919, isLocal: true, isDefinition: true, variable: %struct.AVClass* @av_subtitle_rect_class)
!1016 = distinct !DIGlobalVariable(name: "subtitle_rect_options", scope: !0, file: !1002, line: 328, type: !1017, isLocal: true, isDefinition: true, variable: [8 x %struct.AVOption]* @subtitle_rect_options)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 4096, align: 64, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 8)
!1020 = !{i32 2, !"Dwarf Version", i32 4}
!1021 = !{i32 2, !"Debug Info Version", i32 3}
!1022 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1023 = distinct !DISubprogram(name: "avcodec_get_context_defaults3", scope: !1002, file: !1002, line: 150, type: !1024, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1702)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!939, !1026, !1699}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1297, !1298, !1299, !1300, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1453, !1457, !1458, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1637, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1028, file: !57, line: 1561, baseType: !918, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1028, file: !57, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1028, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1028, file: !57, line: 1565, baseType: !1034, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043, !1046, !1049, !1052, !1055, !1060, !1061, !1062, !1070, !1071, !1072, !1074, !1078, !1084, !1095, !1099, !1100, !1147, !1268, !1272, !1273, !1277, !1281, !1286, !1290, !1291, !1292}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !57, line: 3475, baseType: !924, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1036, file: !57, line: 3480, baseType: !924, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1036, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1036, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1036, file: !57, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1036, file: !57, line: 3488, baseType: !1044, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1036, file: !57, line: 3489, baseType: !1047, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1036, file: !57, line: 3490, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1036, file: !57, line: 3491, baseType: !1053, size: 64, align: 64, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1036, file: !57, line: 3492, baseType: !1056, size: 64, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !912, line: 55, baseType: !1059)
!1059 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1036, file: !57, line: 3493, baseType: !911, size: 8, align: 8, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1036, file: !57, line: 3494, baseType: !918, size: 64, align: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1036, file: !57, line: 3495, baseType: !1063, size: 64, align: 64, offset: 704)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1066, file: !57, line: 3402, baseType: !939, size: 32, align: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1066, file: !57, line: 3403, baseType: !924, size: 64, align: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1036, file: !57, line: 3507, baseType: !924, size: 64, align: 64, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1036, file: !57, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1036, file: !57, line: 3517, baseType: !1073, size: 64, align: 64, offset: 896)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1036, file: !57, line: 3527, baseType: !1075, size: 64, align: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!939, !1026}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1036, file: !57, line: 3535, baseType: !1079, size: 64, align: 64, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!939, !1026, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1036, file: !57, line: 3541, baseType: !1085, size: 64, align: 64, offset: 1088)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1089, line: 223, size: 128, align: 64, elements: !1090)
!1089 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1090 = !{!1091, !1094}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1088, file: !1089, line: 224, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1088, file: !1089, line: 225, baseType: !1092, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1036, file: !57, line: 3549, baseType: !1096, size: 64, align: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1073}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1036, file: !57, line: 3551, baseType: !1075, size: 64, align: 64, offset: 1216)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1036, file: !57, line: 3552, baseType: !1101, size: 64, align: 64, offset: 1280)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!939, !1026, !910, !939, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1107)
!1107 = !{!1108, !1111, !1114, !1115, !1116, !1146}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1106, file: !57, line: 3921, baseType: !1109, size: 16, align: 16)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !912, line: 49, baseType: !1110)
!1110 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1106, file: !57, line: 3922, baseType: !1112, size: 32, align: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !912, line: 51, baseType: !1113)
!1113 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1106, file: !57, line: 3923, baseType: !1112, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1106, file: !57, line: 3924, baseType: !1113, size: 32, align: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1106, file: !57, line: 3925, baseType: !1117, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1135, !1139, !1141, !1142, !1144, !1145}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1120, file: !57, line: 3886, baseType: !939, size: 32, align: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1120, file: !57, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1120, file: !57, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1120, file: !57, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1120, file: !57, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1120, file: !57, line: 3897, baseType: !1128, size: 768, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1130)
!1130 = !{!1131, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !57, line: 3855, baseType: !1132, size: 512, align: 64)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 512, align: 64, elements: !1018)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1129, file: !57, line: 3857, baseType: !1134, size: 256, align: 32, offset: 512)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1018)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !57, line: 3903, baseType: !1136, size: 256, align: 64, offset: 960)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 256, align: 64, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 4)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1120, file: !57, line: 3904, baseType: !1140, size: 128, align: 32, offset: 1216)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1137)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1120, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1120, file: !57, line: 3908, baseType: !1143, size: 64, align: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1120, file: !57, line: 3915, baseType: !1143, size: 64, align: 64, offset: 1472)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1120, file: !57, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1106, file: !57, line: 3926, baseType: !915, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1036, file: !57, line: 3564, baseType: !1148, size: 64, align: 64, offset: 1344)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!939, !1026, !1151, !1185, !1267}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1154)
!1154 = !{!1155, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1181, !1182, !1183, !1184}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !57, line: 1451, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1158, line: 94, baseType: !1159)
!1158 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1158, line: 81, size: 192, align: 64, elements: !1160)
!1160 = !{!1161, !1165, !1166}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1159, file: !1158, line: 82, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1158, line: 73, baseType: !1164)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1158, line: 73, flags: DIFlagFwdDecl)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !1158, line: 89, baseType: !910, size: 64, align: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !1158, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1153, file: !57, line: 1461, baseType: !915, size: 64, align: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1153, file: !57, line: 1467, baseType: !915, size: 64, align: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !57, line: 1468, baseType: !910, size: 64, align: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !57, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1153, file: !57, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1153, file: !57, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1153, file: !57, line: 1479, baseType: !1174, size: 64, align: 64, offset: 384)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1177)
!1177 = !{!1178, !1179, !1180}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1176, file: !57, line: 1412, baseType: !910, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1176, file: !57, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1176, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1153, file: !57, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1153, file: !57, line: 1486, baseType: !915, size: 64, align: 64, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1153, file: !57, line: 1488, baseType: !915, size: 64, align: 64, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1153, file: !57, line: 1497, baseType: !915, size: 64, align: 64, offset: 640)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1219, !1221, !1222, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1255, !1256, !1257, !1258, !1259, !1260, !1263, !1264, !1265, !1266}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1188, file: !780, line: 282, baseType: !1132, size: 512, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1188, file: !780, line: 299, baseType: !1134, size: 256, align: 32, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1188, file: !780, line: 315, baseType: !1193, size: 64, align: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1188, file: !780, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1188, file: !780, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1188, file: !780, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1188, file: !780, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1188, file: !780, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1188, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1188, file: !780, line: 356, baseType: !949, size: 64, align: 32, offset: 1024)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1188, file: !780, line: 361, baseType: !915, size: 64, align: 64, offset: 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1188, file: !780, line: 369, baseType: !915, size: 64, align: 64, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1188, file: !780, line: 377, baseType: !915, size: 64, align: 64, offset: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1188, file: !780, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1188, file: !780, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1188, file: !780, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1188, file: !780, line: 396, baseType: !914, size: 64, align: 64, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1188, file: !780, line: 403, baseType: !1209, size: 512, align: 64, offset: 1472)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 512, align: 64, elements: !1018)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1188, file: !780, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1188, file: !780, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1188, file: !780, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1188, file: !780, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1188, file: !780, line: 435, baseType: !915, size: 64, align: 64, offset: 2112)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1188, file: !780, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1188, file: !780, line: 445, baseType: !1058, size: 64, align: 64, offset: 2240)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1188, file: !780, line: 459, baseType: !1218, size: 512, align: 64, offset: 2304)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 512, align: 64, elements: !1018)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1188, file: !780, line: 473, baseType: !1220, size: 64, align: 64, offset: 2816)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1188, file: !780, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1188, file: !780, line: 479, baseType: !1223, size: 64, align: 64, offset: 2944)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1236}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1226, file: !780, line: 203, baseType: !910, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1226, file: !780, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1226, file: !780, line: 205, baseType: !1232, size: 64, align: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1234, line: 86, baseType: !1235)
!1234 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1234, line: 86, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1226, file: !780, line: 206, baseType: !1156, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1188, file: !780, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1188, file: !780, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1188, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1188, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1188, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1188, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1188, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1188, file: !780, line: 532, baseType: !915, size: 64, align: 64, offset: 3264)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1188, file: !780, line: 539, baseType: !915, size: 64, align: 64, offset: 3328)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1188, file: !780, line: 547, baseType: !915, size: 64, align: 64, offset: 3392)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1188, file: !780, line: 554, baseType: !1232, size: 64, align: 64, offset: 3456)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1188, file: !780, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1188, file: !780, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1188, file: !780, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1188, file: !780, line: 588, baseType: !1252, size: 64, align: 64, offset: 3648)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !912, line: 36, baseType: !1254)
!1254 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1188, file: !780, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1188, file: !780, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1188, file: !780, line: 599, baseType: !1156, size: 64, align: 64, offset: 3776)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1188, file: !780, line: 605, baseType: !1156, size: 64, align: 64, offset: 3840)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1188, file: !780, line: 616, baseType: !1156, size: 64, align: 64, offset: 3904)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1188, file: !780, line: 626, baseType: !1261, size: 64, align: 64, offset: 3968)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1262, line: 216, baseType: !1059)
!1262 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1188, file: !780, line: 627, baseType: !1261, size: 64, align: 64, offset: 4032)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1188, file: !780, line: 628, baseType: !1261, size: 64, align: 64, offset: 4096)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1188, file: !780, line: 629, baseType: !1261, size: 64, align: 64, offset: 4160)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1188, file: !780, line: 645, baseType: !1156, size: 64, align: 64, offset: 4224)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1036, file: !57, line: 3566, baseType: !1269, size: 64, align: 64, offset: 1408)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!939, !1026, !914, !1267, !1151}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1036, file: !57, line: 3567, baseType: !1075, size: 64, align: 64, offset: 1472)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1036, file: !57, line: 3576, baseType: !1274, size: 64, align: 64, offset: 1536)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!939, !1026, !1185}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1036, file: !57, line: 3577, baseType: !1278, size: 64, align: 64, offset: 1600)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!939, !1026, !1151}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1036, file: !57, line: 3584, baseType: !1282, size: 64, align: 64, offset: 1664)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!939, !1026, !1285}
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1036, file: !57, line: 3589, baseType: !1287, size: 64, align: 64, offset: 1728)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !1026}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1036, file: !57, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1036, file: !57, line: 3600, baseType: !924, size: 64, align: 64, offset: 1856)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1036, file: !57, line: 3609, baseType: !1293, size: 64, align: 64, offset: 1920)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1296)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1028, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1028, file: !57, line: 1581, baseType: !1113, size: 32, align: 32, offset: 224)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1028, file: !57, line: 1583, baseType: !914, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1028, file: !57, line: 1591, baseType: !1301, size: 64, align: 64, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1089, line: 129, size: 1664, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1326, !1327, !1333, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1302, file: !1089, line: 136, baseType: !939, size: 32, align: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1302, file: !1089, line: 151, baseType: !939, size: 32, align: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1302, file: !1089, line: 157, baseType: !939, size: 32, align: 32, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1302, file: !1089, line: 159, baseType: !1285, size: 64, align: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1302, file: !1089, line: 161, baseType: !1309, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1089, line: 117, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1089, line: 100, size: 832, align: 64, elements: !1312)
!1312 = !{!1313, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1311, file: !1089, line: 105, baseType: !1314, size: 256, align: 64)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1315, size: 256, align: 64, elements: !1137)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1158, line: 238, baseType: !1317)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1158, line: 238, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1311, file: !1089, line: 110, baseType: !939, size: 32, align: 32, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1311, file: !1089, line: 111, baseType: !939, size: 32, align: 32, offset: 288)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1311, file: !1089, line: 111, baseType: !939, size: 32, align: 32, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1311, file: !1089, line: 112, baseType: !1134, size: 256, align: 32, offset: 352)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1311, file: !1089, line: 113, baseType: !1140, size: 128, align: 32, offset: 608)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1311, file: !1089, line: 114, baseType: !939, size: 32, align: 32, offset: 736)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1311, file: !1089, line: 115, baseType: !939, size: 32, align: 32, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1311, file: !1089, line: 116, baseType: !939, size: 32, align: 32, offset: 800)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1302, file: !1089, line: 163, baseType: !914, size: 64, align: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1302, file: !1089, line: 165, baseType: !1328, size: 128, align: 64, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1089, line: 122, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1089, line: 119, size: 128, align: 64, elements: !1330)
!1330 = !{!1331, !1332}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1329, file: !1089, line: 120, baseType: !1151, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1329, file: !1089, line: 121, baseType: !1285, size: 64, align: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1302, file: !1089, line: 166, baseType: !1334, size: 128, align: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1089, line: 127, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1089, line: 124, size: 128, align: 64, elements: !1336)
!1336 = !{!1337, !1410}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1335, file: !1089, line: 125, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1368, !1372, !1373, !1407, !1408, !1409}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1341, file: !57, line: 5751, baseType: !918, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1341, file: !57, line: 5756, baseType: !1345, size: 64, align: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1348)
!1348 = !{!1349, !1350, !1353, !1354, !1355, !1359, !1363, !1367}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1347, file: !57, line: 5797, baseType: !924, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1347, file: !57, line: 5804, baseType: !1351, size: 64, align: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1347, file: !57, line: 5815, baseType: !918, size: 64, align: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1347, file: !57, line: 5825, baseType: !939, size: 32, align: 32, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1347, file: !57, line: 5826, baseType: !1356, size: 64, align: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!939, !1339}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1347, file: !57, line: 5827, baseType: !1360, size: 64, align: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!939, !1339, !1151}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1347, file: !57, line: 5828, baseType: !1364, size: 64, align: 64, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{null, !1339}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1347, file: !57, line: 5829, baseType: !1364, size: 64, align: 64, offset: 448)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1341, file: !57, line: 5762, baseType: !1369, size: 64, align: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1371)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1341, file: !57, line: 5768, baseType: !914, size: 64, align: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1341, file: !57, line: 5775, baseType: !1374, size: 64, align: 64, offset: 256)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1376, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1376, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1376, file: !57, line: 3948, baseType: !1112, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1376, file: !57, line: 3958, baseType: !910, size: 64, align: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1376, file: !57, line: 3962, baseType: !939, size: 32, align: 32, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1376, file: !57, line: 3968, baseType: !939, size: 32, align: 32, offset: 224)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1376, file: !57, line: 3973, baseType: !915, size: 64, align: 64, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1376, file: !57, line: 3986, baseType: !939, size: 32, align: 32, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1376, file: !57, line: 3999, baseType: !939, size: 32, align: 32, offset: 352)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1376, file: !57, line: 4004, baseType: !939, size: 32, align: 32, offset: 384)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1376, file: !57, line: 4005, baseType: !939, size: 32, align: 32, offset: 416)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1376, file: !57, line: 4010, baseType: !939, size: 32, align: 32, offset: 448)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1376, file: !57, line: 4011, baseType: !939, size: 32, align: 32, offset: 480)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1376, file: !57, line: 4020, baseType: !949, size: 64, align: 32, offset: 512)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1376, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1376, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1376, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1376, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1376, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1376, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1376, file: !57, line: 4039, baseType: !939, size: 32, align: 32, offset: 768)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1376, file: !57, line: 4046, baseType: !1058, size: 64, align: 64, offset: 832)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1376, file: !57, line: 4050, baseType: !939, size: 32, align: 32, offset: 896)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1376, file: !57, line: 4054, baseType: !939, size: 32, align: 32, offset: 928)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1376, file: !57, line: 4061, baseType: !939, size: 32, align: 32, offset: 960)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1376, file: !57, line: 4065, baseType: !939, size: 32, align: 32, offset: 992)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1376, file: !57, line: 4073, baseType: !939, size: 32, align: 32, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1376, file: !57, line: 4080, baseType: !939, size: 32, align: 32, offset: 1056)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1376, file: !57, line: 4084, baseType: !939, size: 32, align: 32, offset: 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1341, file: !57, line: 5781, baseType: !1374, size: 64, align: 64, offset: 320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1341, file: !57, line: 5787, baseType: !949, size: 64, align: 32, offset: 384)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1341, file: !57, line: 5793, baseType: !949, size: 64, align: 32, offset: 448)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1335, file: !1089, line: 126, baseType: !939, size: 32, align: 32, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1302, file: !1089, line: 172, baseType: !1151, size: 64, align: 64, offset: 576)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1302, file: !1089, line: 177, baseType: !910, size: 64, align: 64, offset: 640)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1302, file: !1089, line: 178, baseType: !1113, size: 32, align: 32, offset: 704)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1302, file: !1089, line: 180, baseType: !914, size: 64, align: 64, offset: 768)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1302, file: !1089, line: 185, baseType: !939, size: 32, align: 32, offset: 832)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1302, file: !1089, line: 190, baseType: !914, size: 64, align: 64, offset: 896)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1302, file: !1089, line: 195, baseType: !939, size: 32, align: 32, offset: 960)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1302, file: !1089, line: 200, baseType: !1151, size: 64, align: 64, offset: 1024)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1302, file: !1089, line: 201, baseType: !939, size: 32, align: 32, offset: 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1302, file: !1089, line: 202, baseType: !1285, size: 64, align: 64, offset: 1152)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1302, file: !1089, line: 203, baseType: !939, size: 32, align: 32, offset: 1216)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1302, file: !1089, line: 205, baseType: !939, size: 32, align: 32, offset: 1248)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1302, file: !1089, line: 206, baseType: !939, size: 32, align: 32, offset: 1280)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1302, file: !1089, line: 209, baseType: !1261, size: 64, align: 64, offset: 1344)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1302, file: !1089, line: 212, baseType: !1261, size: 64, align: 64, offset: 1408)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1302, file: !1089, line: 213, baseType: !1285, size: 64, align: 64, offset: 1472)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1302, file: !1089, line: 215, baseType: !939, size: 32, align: 32, offset: 1536)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1302, file: !1089, line: 217, baseType: !939, size: 32, align: 32, offset: 1568)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1302, file: !1089, line: 220, baseType: !939, size: 32, align: 32, offset: 1600)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1028, file: !57, line: 1598, baseType: !914, size: 64, align: 64, offset: 384)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1028, file: !57, line: 1606, baseType: !915, size: 64, align: 64, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1028, file: !57, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1028, file: !57, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1028, file: !57, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !57, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1028, file: !57, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1028, file: !57, line: 1657, baseType: !910, size: 64, align: 64, offset: 704)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1028, file: !57, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1028, file: !57, line: 1679, baseType: !949, size: 64, align: 32, offset: 800)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1028, file: !57, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1028, file: !57, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1028, file: !57, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1028, file: !57, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1028, file: !57, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1028, file: !57, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1028, file: !57, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1028, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1028, file: !57, line: 1791, baseType: !1449, size: 64, align: 64, offset: 1152)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{null, !1452, !1185, !1267, !939, !939, !939}
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1028, file: !57, line: 1808, baseType: !1454, size: 64, align: 64, offset: 1216)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!516, !1452, !1047}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1028, file: !57, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1028, file: !57, line: 1825, baseType: !1459, size: 32, align: 32, offset: 1312)
!1459 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1028, file: !57, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1028, file: !57, line: 1838, baseType: !1459, size: 32, align: 32, offset: 1376)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1028, file: !57, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1028, file: !57, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1028, file: !57, line: 1861, baseType: !1459, size: 32, align: 32, offset: 1472)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1028, file: !57, line: 1868, baseType: !1459, size: 32, align: 32, offset: 1504)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1028, file: !57, line: 1875, baseType: !1459, size: 32, align: 32, offset: 1536)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1028, file: !57, line: 1882, baseType: !1459, size: 32, align: 32, offset: 1568)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1028, file: !57, line: 1889, baseType: !1459, size: 32, align: 32, offset: 1600)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1028, file: !57, line: 1896, baseType: !1459, size: 32, align: 32, offset: 1632)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1028, file: !57, line: 1903, baseType: !1459, size: 32, align: 32, offset: 1664)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1028, file: !57, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1028, file: !57, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1028, file: !57, line: 1926, baseType: !1267, size: 64, align: 64, offset: 1792)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1028, file: !57, line: 1935, baseType: !949, size: 64, align: 32, offset: 1856)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1028, file: !57, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1028, file: !57, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1028, file: !57, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1028, file: !57, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1028, file: !57, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1028, file: !57, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1028, file: !57, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1028, file: !57, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1028, file: !57, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1028, file: !57, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1028, file: !57, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1028, file: !57, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1028, file: !57, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1028, file: !57, line: 2054, baseType: !1489, size: 64, align: 64, offset: 2368)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1028, file: !57, line: 2061, baseType: !1489, size: 64, align: 64, offset: 2432)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1028, file: !57, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1028, file: !57, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1028, file: !57, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1028, file: !57, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1028, file: !57, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1028, file: !57, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1028, file: !57, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1028, file: !57, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1028, file: !57, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1028, file: !57, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1028, file: !57, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1028, file: !57, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1028, file: !57, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1028, file: !57, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1028, file: !57, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1028, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1028, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1028, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1028, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1028, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1028, file: !57, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1028, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1028, file: !57, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1028, file: !57, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1028, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1028, file: !57, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1028, file: !57, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1028, file: !57, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1028, file: !57, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1028, file: !57, line: 2263, baseType: !1058, size: 64, align: 64, offset: 3456)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1028, file: !57, line: 2270, baseType: !1058, size: 64, align: 64, offset: 3520)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1028, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1028, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1028, file: !57, line: 2367, baseType: !1525, size: 64, align: 64, offset: 3648)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!939, !1452, !1285, !939}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1028, file: !57, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1028, file: !57, line: 2386, baseType: !1459, size: 32, align: 32, offset: 3744)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1028, file: !57, line: 2387, baseType: !1459, size: 32, align: 32, offset: 3776)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1028, file: !57, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1028, file: !57, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1028, file: !57, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1028, file: !57, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1028, file: !57, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1028, file: !57, line: 2423, baseType: !1537, size: 64, align: 64, offset: 3968)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1539)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1540)
!1540 = !{!1541, !1542, !1543, !1544}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1539, file: !57, line: 827, baseType: !939, size: 32, align: 32)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1539, file: !57, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1539, file: !57, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1539, file: !57, line: 830, baseType: !1459, size: 32, align: 32, offset: 96)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1028, file: !57, line: 2430, baseType: !915, size: 64, align: 64, offset: 4032)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1028, file: !57, line: 2437, baseType: !915, size: 64, align: 64, offset: 4096)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1028, file: !57, line: 2444, baseType: !1459, size: 32, align: 32, offset: 4160)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1028, file: !57, line: 2451, baseType: !1459, size: 32, align: 32, offset: 4192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1028, file: !57, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1028, file: !57, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1028, file: !57, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1028, file: !57, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1028, file: !57, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1028, file: !57, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1028, file: !57, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1028, file: !57, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1028, file: !57, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1028, file: !57, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1028, file: !57, line: 2514, baseType: !915, size: 64, align: 64, offset: 4544)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1028, file: !57, line: 2528, baseType: !1561, size: 64, align: 64, offset: 4608)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{null, !1452, !914, !939, !939}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1028, file: !57, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1028, file: !57, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1028, file: !57, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1028, file: !57, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1028, file: !57, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1028, file: !57, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1028, file: !57, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1028, file: !57, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1028, file: !57, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1028, file: !57, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1028, file: !57, line: 2571, baseType: !1143, size: 64, align: 64, offset: 4992)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1028, file: !57, line: 2579, baseType: !1143, size: 64, align: 64, offset: 5056)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1028, file: !57, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1028, file: !57, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1028, file: !57, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1028, file: !57, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1028, file: !57, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1028, file: !57, line: 2709, baseType: !915, size: 64, align: 64, offset: 5312)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1028, file: !57, line: 2716, baseType: !1583, size: 64, align: 64, offset: 5376)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1592, !1593, !1597, !1601, !1602, !1603, !1604, !1610, !1611, !1612, !1613, !1614}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1585, file: !57, line: 3642, baseType: !924, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1585, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1585, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1585, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1585, file: !57, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1585, file: !57, line: 3682, baseType: !1282, size: 64, align: 64, offset: 192)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1585, file: !57, line: 3698, baseType: !1594, size: 64, align: 64, offset: 256)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!939, !1026, !1092, !1112}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1585, file: !57, line: 3712, baseType: !1598, size: 64, align: 64, offset: 320)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!939, !1026, !939, !1092, !1112}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1585, file: !57, line: 3726, baseType: !1594, size: 64, align: 64, offset: 384)
