; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sbc_frame = type { i8, i8, i32, i8, i32, i8, i8, i16, i8, [11 x i8], [2 x [8 x i32]], [16 x [2 x [8 x i32]]], [16 x [2 x [8 x i32]]], i32*, [8 x i8] }

@sbc_offset4 = internal constant [4 x [4 x i32]] [[4 x i32] [i32 -1, i32 0, i32 0, i32 0], [4 x i32] [i32 -2, i32 0, i32 0, i32 1], [4 x i32] [i32 -2, i32 0, i32 0, i32 1], [4 x i32] [i32 -2, i32 0, i32 0, i32 1]], align 16
@sbc_offset8 = internal constant [4 x [8 x i32]] [[8 x i32] [i32 -2, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 1], [8 x i32] [i32 -3, i32 0, i32 0, i32 0, i32 0, i32 0, i32 1, i32 2], [8 x i32] [i32 -4, i32 0, i32 0, i32 0, i32 0, i32 0, i32 1, i32 2], [8 x i32] [i32 -4, i32 0, i32 0, i32 0, i32 0, i32 0, i32 1, i32 2]], align 16

; Function Attrs: nounwind uwtable
define zeroext i8 @ff_sbc_crc8(i32* %ctx, i8* %data, i64 %len) #0 !dbg !62 {
entry:
  %ctx.addr = alloca i32*, align 8
  %data.addr = alloca i8*, align 8
  %len.addr = alloca i64, align 8
  %byte_length = alloca i64, align 8
  %bit_length = alloca i32, align 4
  %crc = alloca i8, align 1
  %bits = alloca i8, align 1
  %mask = alloca i8, align 1
  store i32* %ctx, i32** %ctx.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !49)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbc.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 85, size: 32, align: 32, elements: !44)
!4 = !DIFile(filename: "libavcodec/sbc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sbc_frame", file: !4, line: 82, size: 17280, align: 128, elements: !6)
!6 = !{!7, !11, !12, !13, !14, !19, !20, !21, !24, !25, !32, !38, !39}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !5, file: !4, line: 83, baseType: !8, size: 8, align: 8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 48, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !5, file: !4, line: 84, baseType: !8, size: 8, align: 8, offset: 8)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !5, file: !4, line: 90, baseType: !3, size: 32, align: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !5, file: !4, line: 91, baseType: !8, size: 8, align: 8, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !5, file: !4, line: 95, baseType: !15, size: 32, align: 32, offset: 96)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 92, size: 32, align: 32, elements: !16)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "LOUDNESS", value: 0)
!18 = !DIEnumerator(name: "SNR", value: 1)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "subbands", scope: !5, file: !4, line: 96, baseType: !8, size: 8, align: 8, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "bitpool", scope: !5, file: !4, line: 97, baseType: !8, size: 8, align: 8, offset: 136)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "codesize", scope: !5, file: !4, line: 98, baseType: !22, size: 16, align: 16, offset: 144)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 49, baseType: !23)
!23 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "joint", scope: !5, file: !4, line: 101, baseType: !8, size: 8, align: 8, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "scale_factor", scope: !5, file: !4, line: 104, baseType: !26, size: 512, align: 32, offset: 256)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, align: 32, elements: !29)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 51, baseType: !28)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !{!30, !31}
!30 = !DISubrange(count: 2)
!31 = !DISubrange(count: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sb_sample_f", scope: !5, file: !4, line: 107, baseType: !33, size: 8192, align: 32, offset: 768)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8192, align: 32, elements: !36)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !9, line: 38, baseType: !35)
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !{!37, !30, !31}
!37 = !DISubrange(count: 16)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sb_sample", scope: !5, file: !4, line: 110, baseType: !33, size: 8192, align: 32, offset: 8960)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "crc_ctx", scope: !5, file: !4, line: 112, baseType: !40, size: 64, align: 64, offset: 17152)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCRC", file: !43, line: 47, baseType: !27)
!43 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "MONO", value: 0)
!46 = !DIEnumerator(name: "DUAL_CHANNEL", value: 1)
!47 = !DIEnumerator(name: "STEREO", value: 2)
!48 = !DIEnumerator(name: "JOINT_STEREO", value: 3)
!49 = !{!50, !56}
!50 = distinct !DIGlobalVariable(name: "sbc_offset4", scope: !0, file: !51, line: 37, type: !52, isLocal: true, isDefinition: true, variable: [4 x [4 x i32]]* @sbc_offset4)
!51 = !DIFile(filename: "libavcodec/sbc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, align: 32, elements: !54)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!54 = !{!55, !55}
!55 = !DISubrange(count: 4)
!56 = distinct !DIGlobalVariable(name: "sbc_offset8", scope: !0, file: !51, line: 45, type: !57, isLocal: true, isDefinition: true, variable: [4 x [8 x i32]]* @sbc_offset8)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1024, align: 32, elements: !58)
!58 = !{!55, !31}
!59 = !{i32 2, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!62 = distinct !DISubprogram(name: "ff_sbc_crc8", scope: !51, file: !51, line: 55, type: !63, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !70)
!63 = !DISubroutineType(types: !64)
!64 = !{!8, !40, !65, !67}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 216, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!69 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!70 = !{}
!71 = !DILocalVariable(name: "ctx", arg: 1, scope: !62, file: !51, line: 55, type: !40)
!72 = !DIExpression()
!73 = !DILocation(line: 55, column: 34, scope: !62)
!74 = !DILocalVariable(name: "data", arg: 2, scope: !62, file: !51, line: 55, type: !65)
!75 = !DILocation(line: 55, column: 54, scope: !62)
!76 = !DILocalVariable(name: "len", arg: 3, scope: !62, file: !51, line: 55, type: !67)
!77 = !DILocation(line: 55, column: 67, scope: !62)
!78 = !DILocalVariable(name: "byte_length", scope: !62, file: !51, line: 57, type: !67)
!79 = !DILocation(line: 57, column: 12, scope: !62)
!80 = !DILocation(line: 57, column: 26, scope: !62)
!81 = !DILocation(line: 57, column: 30, scope: !62)
!82 = !DILocalVariable(name: "bit_length", scope: !62, file: !51, line: 58, type: !35)
!83 = !DILocation(line: 58, column: 9, scope: !62)
!84 = !DILocation(line: 58, column: 22, scope: !62)
!85 = !DILocation(line: 58, column: 26, scope: !62)
!86 = !DILocalVariable(name: "crc", scope: !62, file: !51, line: 59, type: !8)
!87 = !DILocation(line: 59, column: 13, scope: !62)
!88 = !DILocation(line: 61, column: 18, scope: !62)
!89 = !DILocation(line: 61, column: 29, scope: !62)
!90 = !DILocation(line: 61, column: 35, scope: !62)
!91 = !DILocation(line: 61, column: 11, scope: !62)
!92 = !DILocation(line: 61, column: 9, scope: !62)
!93 = !DILocation(line: 63, column: 9, scope: !94)
!94 = distinct !DILexicalBlock(scope: !62, file: !51, line: 63, column: 9)
!95 = !DILocation(line: 63, column: 9, scope: !62)
