; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h263dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h263dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!920 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!921 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!922 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!923 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!924 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!925 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!926 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!927 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!928 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!929 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938}
!932 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!933 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!934 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!935 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!936 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!937 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!938 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!939 = !{!940, !949, !954, !955, !948, !956, !952, !961}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !943, line: 221, size: 32, align: 8, elements: !944)
!943 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !942, file: !943, line: 221, baseType: !946, size: 32, align: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !947, line: 51, baseType: !948)
!947 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!948 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !947, line: 48, baseType: !953)
!953 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!955 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !943, line: 220, size: 64, align: 8, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !943, line: 220, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !947, line: 55, baseType: !962)
!962 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!963 = !{!964, !970, !2630}
!964 = distinct !DIGlobalVariable(name: "ff_h263_hwaccel_pixfmt_list_420", scope: !0, file: !965, line: 729, type: !966, isLocal: false, isDefinition: true, variable: [2 x i32]* @ff_h263_hwaccel_pixfmt_list_420)
!965 = !DIFile(filename: "libavcodec/h263dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 64, align: 32, elements: !968)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!968 = !{!969}
!969 = !DISubrange(count: 2)
!970 = distinct !DIGlobalVariable(name: "ff_h263_decoder", scope: !0, file: !965, line: 746, type: !971, isLocal: false, isDefinition: true, variable: { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }* @ff_h263_decoder)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !57, line: 3610, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !973)
!973 = !{!974, !978, !979, !980, !981, !982, !991, !993, !996, !999, !1002, !1003, !1078, !1086, !1087, !1088, !1090, !2532, !2538, !2546, !2550, !2551, !2588, !2592, !2596, !2597, !2601, !2605, !2606, !2610, !2611, !2612}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !57, line: 3475, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !972, file: !57, line: 3480, baseType: !975, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !972, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !972, file: !57, line: 3487, baseType: !955, size: 32, align: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !972, file: !57, line: 3488, baseType: !983, size: 64, align: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !986, line: 61, baseType: !987)
!986 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !986, line: 58, size: 64, align: 32, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !987, file: !986, line: 59, baseType: !955, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !987, file: !986, line: 60, baseType: !955, size: 32, align: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !972, file: !57, line: 3489, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !972, file: !57, line: 3490, baseType: !994, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !972, file: !57, line: 3491, baseType: !997, size: 64, align: 64, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !972, file: !57, line: 3492, baseType: !1000, size: 64, align: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !972, file: !57, line: 3493, baseType: !952, size: 8, align: 8, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !972, file: !57, line: 3494, baseType: !1004, size: 64, align: 64, offset: 640)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1014, !1037, !1038, !1039, !1040, !1044, !1050, !1052, !1056}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1007, file: !26, line: 72, baseType: !975, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1007, file: !26, line: 78, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!975, !954}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1007, file: !26, line: 85, baseType: !1015, size: 64, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1033, !1034, !1035, !1036}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1017, file: !4, line: 247, baseType: !975, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1017, file: !4, line: 253, baseType: !975, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1017, file: !4, line: 259, baseType: !955, size: 32, align: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1017, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1017, file: !4, line: 271, baseType: !1024, size: 64, align: 64, offset: 192)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1017, file: !4, line: 265, size: 64, align: 64, elements: !1025)
!1025 = !{!1026, !1029, !1031, !1032}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1024, file: !4, line: 266, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !947, line: 40, baseType: !1028)
!1028 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1024, file: !4, line: 267, baseType: !1030, size: 64, align: 64)
!1030 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1024, file: !4, line: 268, baseType: !975, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1024, file: !4, line: 270, baseType: !985, size: 64, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1017, file: !4, line: 272, baseType: !1030, size: 64, align: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1017, file: !4, line: 273, baseType: !1030, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1017, file: !4, line: 275, baseType: !955, size: 32, align: 32, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1017, file: !4, line: 300, baseType: !975, size: 64, align: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1007, file: !26, line: 93, baseType: !955, size: 32, align: 32, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1007, file: !26, line: 99, baseType: !955, size: 32, align: 32, offset: 224)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1007, file: !26, line: 108, baseType: !955, size: 32, align: 32, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1007, file: !26, line: 113, baseType: !1041, size: 64, align: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!954, !954, !954}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1007, file: !26, line: 123, baseType: !1045, size: 64, align: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1048, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1007, file: !26, line: 130, baseType: !1051, size: 32, align: 32, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1007, file: !26, line: 136, baseType: !1053, size: 64, align: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1051, !954}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1007, file: !26, line: 142, baseType: !1057, size: 64, align: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!955, !1060, !954, !975, !955}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1063)
!1063 = !{!1064, !1076, !1077}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1062, file: !4, line: 360, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1068, file: !4, line: 307, baseType: !975, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1068, file: !4, line: 313, baseType: !1030, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1068, file: !4, line: 313, baseType: !1030, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1068, file: !4, line: 318, baseType: !1030, size: 64, align: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1068, file: !4, line: 318, baseType: !1030, size: 64, align: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1068, file: !4, line: 323, baseType: !955, size: 32, align: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1062, file: !4, line: 364, baseType: !955, size: 32, align: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1062, file: !4, line: 368, baseType: !955, size: 32, align: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !972, file: !57, line: 3495, baseType: !1079, size: 64, align: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1082, file: !57, line: 3402, baseType: !955, size: 32, align: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !57, line: 3403, baseType: !975, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !972, file: !57, line: 3507, baseType: !975, size: 64, align: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !972, file: !57, line: 3516, baseType: !955, size: 32, align: 32, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !972, file: !57, line: 3517, baseType: !1089, size: 64, align: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !972, file: !57, line: 3527, baseType: !1091, size: 64, align: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!955, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1104, !1105, !1106, !1107, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1387, !1391, !1392, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2470, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1096, file: !57, line: 1561, baseType: !1004, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1096, file: !57, line: 1562, baseType: !955, size: 32, align: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1096, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1096, file: !57, line: 1565, baseType: !1102, size: 64, align: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1096, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1096, file: !57, line: 1581, baseType: !948, size: 32, align: 32, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1096, file: !57, line: 1583, baseType: !954, size: 64, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1096, file: !57, line: 1591, baseType: !1108, size: 64, align: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1110, line: 129, size: 1664, align: 64, elements: !1111)
!1110 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1111 = !{!1112, !1113, !1114, !1115, !1213, !1234, !1235, !1264, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1109, file: !1110, line: 136, baseType: !955, size: 32, align: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1109, file: !1110, line: 151, baseType: !955, size: 32, align: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1109, file: !1110, line: 157, baseType: !955, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1109, file: !1110, line: 159, baseType: !1116, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1119)
!1119 = !{!1120, !1125, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1165, !1167, !1168, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1201, !1202, !1203, !1204, !1205, !1206, !1209, !1210, !1211, !1212}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !780, line: 282, baseType: !1121, size: 512, align: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 512, align: 64, elements: !1123)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1123 = !{!1124}
!1124 = !DISubrange(count: 8)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1118, file: !780, line: 299, baseType: !1126, size: 256, align: 32, offset: 512)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 256, align: 32, elements: !1123)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1118, file: !780, line: 315, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1118, file: !780, line: 326, baseType: !955, size: 32, align: 32, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1118, file: !780, line: 326, baseType: !955, size: 32, align: 32, offset: 864)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1118, file: !780, line: 334, baseType: !955, size: 32, align: 32, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1118, file: !780, line: 341, baseType: !955, size: 32, align: 32, offset: 928)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1118, file: !780, line: 346, baseType: !955, size: 32, align: 32, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1118, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1118, file: !780, line: 356, baseType: !985, size: 64, align: 32, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !780, line: 361, baseType: !1027, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1118, file: !780, line: 369, baseType: !1027, size: 64, align: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1118, file: !780, line: 377, baseType: !1027, size: 64, align: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1118, file: !780, line: 382, baseType: !955, size: 32, align: 32, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1118, file: !780, line: 386, baseType: !955, size: 32, align: 32, offset: 1312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1118, file: !780, line: 391, baseType: !955, size: 32, align: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1118, file: !780, line: 396, baseType: !954, size: 64, align: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1118, file: !780, line: 403, baseType: !1144, size: 512, align: 64, offset: 1472)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, align: 64, elements: !1123)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1118, file: !780, line: 410, baseType: !955, size: 32, align: 32, offset: 1984)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1118, file: !780, line: 415, baseType: !955, size: 32, align: 32, offset: 2016)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1118, file: !780, line: 420, baseType: !955, size: 32, align: 32, offset: 2048)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1118, file: !780, line: 425, baseType: !955, size: 32, align: 32, offset: 2080)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1118, file: !780, line: 435, baseType: !1027, size: 64, align: 64, offset: 2112)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1118, file: !780, line: 440, baseType: !955, size: 32, align: 32, offset: 2176)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1118, file: !780, line: 445, baseType: !961, size: 64, align: 64, offset: 2240)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !780, line: 459, baseType: !1153, size: 512, align: 64, offset: 2304)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 512, align: 64, elements: !1123)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1156, line: 94, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1156, line: 81, size: 192, align: 64, elements: !1158)
!1158 = !{!1159, !1163, !1164}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1157, file: !1156, line: 82, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1156, line: 73, baseType: !1162)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1156, line: 73, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1157, file: !1156, line: 89, baseType: !1122, size: 64, align: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !1156, line: 93, baseType: !955, size: 32, align: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1118, file: !780, line: 473, baseType: !1166, size: 64, align: 64, offset: 2816)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1118, file: !780, line: 477, baseType: !955, size: 32, align: 32, offset: 2880)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !780, line: 479, baseType: !1169, size: 64, align: 64, offset: 2944)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1182}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1172, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !780, line: 203, baseType: !1122, size: 64, align: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !780, line: 204, baseType: !955, size: 32, align: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1172, file: !780, line: 205, baseType: !1178, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1180, line: 86, baseType: !1181)
!1180 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1180, line: 86, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1172, file: !780, line: 206, baseType: !1154, size: 64, align: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1118, file: !780, line: 480, baseType: !955, size: 32, align: 32, offset: 3008)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !780, line: 505, baseType: !955, size: 32, align: 32, offset: 3040)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1118, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1118, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1118, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1118, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1118, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1118, file: !780, line: 532, baseType: !1027, size: 64, align: 64, offset: 3264)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1118, file: !780, line: 539, baseType: !1027, size: 64, align: 64, offset: 3328)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1118, file: !780, line: 547, baseType: !1027, size: 64, align: 64, offset: 3392)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1118, file: !780, line: 554, baseType: !1178, size: 64, align: 64, offset: 3456)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1118, file: !780, line: 563, baseType: !955, size: 32, align: 32, offset: 3520)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1118, file: !780, line: 572, baseType: !955, size: 32, align: 32, offset: 3552)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1118, file: !780, line: 581, baseType: !955, size: 32, align: 32, offset: 3584)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1118, file: !780, line: 588, baseType: !1198, size: 64, align: 64, offset: 3648)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !947, line: 36, baseType: !1200)
!1200 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1118, file: !780, line: 593, baseType: !955, size: 32, align: 32, offset: 3712)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1118, file: !780, line: 596, baseType: !955, size: 32, align: 32, offset: 3744)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1118, file: !780, line: 599, baseType: !1154, size: 64, align: 64, offset: 3776)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1118, file: !780, line: 605, baseType: !1154, size: 64, align: 64, offset: 3840)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1118, file: !780, line: 616, baseType: !1154, size: 64, align: 64, offset: 3904)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1118, file: !780, line: 626, baseType: !1207, size: 64, align: 64, offset: 3968)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1208, line: 216, baseType: !962)
!1208 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1118, file: !780, line: 627, baseType: !1207, size: 64, align: 64, offset: 4032)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1118, file: !780, line: 628, baseType: !1207, size: 64, align: 64, offset: 4096)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1118, file: !780, line: 629, baseType: !1207, size: 64, align: 64, offset: 4160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1118, file: !780, line: 645, baseType: !1154, size: 64, align: 64, offset: 4224)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1109, file: !1110, line: 161, baseType: !1214, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1110, line: 117, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1110, line: 100, size: 832, align: 64, elements: !1217)
!1217 = !{!1218, !1225, !1226, !1227, !1228, !1229, !1231, !1232, !1233}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1216, file: !1110, line: 105, baseType: !1219, size: 256, align: 64)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 256, align: 64, elements: !1223)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1156, line: 238, baseType: !1222)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1156, line: 238, flags: DIFlagFwdDecl)
!1223 = !{!1224}
!1224 = !DISubrange(count: 4)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1216, file: !1110, line: 110, baseType: !955, size: 32, align: 32, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1216, file: !1110, line: 111, baseType: !955, size: 32, align: 32, offset: 288)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1216, file: !1110, line: 111, baseType: !955, size: 32, align: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1216, file: !1110, line: 112, baseType: !1126, size: 256, align: 32, offset: 352)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1216, file: !1110, line: 113, baseType: !1230, size: 128, align: 32, offset: 608)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, align: 32, elements: !1223)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1216, file: !1110, line: 114, baseType: !955, size: 32, align: 32, offset: 736)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1216, file: !1110, line: 115, baseType: !955, size: 32, align: 32, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1216, file: !1110, line: 116, baseType: !955, size: 32, align: 32, offset: 800)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1109, file: !1110, line: 163, baseType: !954, size: 64, align: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1109, file: !1110, line: 165, baseType: !1236, size: 128, align: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1110, line: 122, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1110, line: 119, size: 128, align: 64, elements: !1238)
!1238 = !{!1239, !1263}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1237, file: !1110, line: 120, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1259, !1260, !1261, !1262}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1242, file: !57, line: 1451, baseType: !1154, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1242, file: !57, line: 1461, baseType: !1027, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1242, file: !57, line: 1467, baseType: !1027, size: 64, align: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1242, file: !57, line: 1468, baseType: !1122, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1242, file: !57, line: 1469, baseType: !955, size: 32, align: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1242, file: !57, line: 1470, baseType: !955, size: 32, align: 32, offset: 288)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1242, file: !57, line: 1474, baseType: !955, size: 32, align: 32, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1242, file: !57, line: 1479, baseType: !1252, size: 64, align: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !57, line: 1412, baseType: !1122, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !57, line: 1413, baseType: !955, size: 32, align: 32, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1242, file: !57, line: 1480, baseType: !955, size: 32, align: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1242, file: !57, line: 1486, baseType: !1027, size: 64, align: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1242, file: !57, line: 1488, baseType: !1027, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1242, file: !57, line: 1497, baseType: !1027, size: 64, align: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1237, file: !1110, line: 121, baseType: !1116, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1109, file: !1110, line: 166, baseType: !1265, size: 128, align: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1110, line: 127, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1110, line: 124, size: 128, align: 64, elements: !1267)
!1267 = !{!1268, !1341}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1266, file: !1110, line: 125, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1299, !1303, !1304, !1338, !1339, !1340}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1272, file: !57, line: 5751, baseType: !1004, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1272, file: !57, line: 5756, baseType: !1276, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1284, !1285, !1286, !1290, !1294, !1298}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !57, line: 5797, baseType: !975, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1278, file: !57, line: 5804, baseType: !1282, size: 64, align: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1278, file: !57, line: 5815, baseType: !1004, size: 64, align: 64, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1278, file: !57, line: 5825, baseType: !955, size: 32, align: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1278, file: !57, line: 5826, baseType: !1287, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!955, !1270}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1278, file: !57, line: 5827, baseType: !1291, size: 64, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!955, !1270, !1240}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1278, file: !57, line: 5828, baseType: !1295, size: 64, align: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !1270}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1278, file: !57, line: 5829, baseType: !1295, size: 64, align: 64, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1272, file: !57, line: 5762, baseType: !1300, size: 64, align: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1302)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1272, file: !57, line: 5768, baseType: !954, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1272, file: !57, line: 5775, baseType: !1305, size: 64, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1307, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1307, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1307, file: !57, line: 3948, baseType: !946, size: 32, align: 32, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1307, file: !57, line: 3958, baseType: !1122, size: 64, align: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1307, file: !57, line: 3962, baseType: !955, size: 32, align: 32, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1307, file: !57, line: 3968, baseType: !955, size: 32, align: 32, offset: 224)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1307, file: !57, line: 3973, baseType: !1027, size: 64, align: 64, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1307, file: !57, line: 3986, baseType: !955, size: 32, align: 32, offset: 320)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1307, file: !57, line: 3999, baseType: !955, size: 32, align: 32, offset: 352)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1307, file: !57, line: 4004, baseType: !955, size: 32, align: 32, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1307, file: !57, line: 4005, baseType: !955, size: 32, align: 32, offset: 416)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1307, file: !57, line: 4010, baseType: !955, size: 32, align: 32, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1307, file: !57, line: 4011, baseType: !955, size: 32, align: 32, offset: 480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1307, file: !57, line: 4020, baseType: !985, size: 64, align: 32, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1307, file: !57, line: 4025, baseType: !910, size: 32, align: 32, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1307, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1307, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1307, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1307, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1307, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1307, file: !57, line: 4039, baseType: !955, size: 32, align: 32, offset: 768)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1307, file: !57, line: 4046, baseType: !961, size: 64, align: 64, offset: 832)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1307, file: !57, line: 4050, baseType: !955, size: 32, align: 32, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1307, file: !57, line: 4054, baseType: !955, size: 32, align: 32, offset: 928)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1307, file: !57, line: 4061, baseType: !955, size: 32, align: 32, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1307, file: !57, line: 4065, baseType: !955, size: 32, align: 32, offset: 992)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1307, file: !57, line: 4073, baseType: !955, size: 32, align: 32, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1307, file: !57, line: 4080, baseType: !955, size: 32, align: 32, offset: 1056)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1307, file: !57, line: 4084, baseType: !955, size: 32, align: 32, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1272, file: !57, line: 5781, baseType: !1305, size: 64, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1272, file: !57, line: 5787, baseType: !985, size: 64, align: 32, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1272, file: !57, line: 5793, baseType: !985, size: 64, align: 32, offset: 448)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1266, file: !1110, line: 126, baseType: !955, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1109, file: !1110, line: 172, baseType: !1240, size: 64, align: 64, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1109, file: !1110, line: 177, baseType: !1122, size: 64, align: 64, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1109, file: !1110, line: 178, baseType: !948, size: 32, align: 32, offset: 704)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1109, file: !1110, line: 180, baseType: !954, size: 64, align: 64, offset: 768)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1109, file: !1110, line: 185, baseType: !955, size: 32, align: 32, offset: 832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1109, file: !1110, line: 190, baseType: !954, size: 64, align: 64, offset: 896)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1109, file: !1110, line: 195, baseType: !955, size: 32, align: 32, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1109, file: !1110, line: 200, baseType: !1240, size: 64, align: 64, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1109, file: !1110, line: 201, baseType: !955, size: 32, align: 32, offset: 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1109, file: !1110, line: 202, baseType: !1116, size: 64, align: 64, offset: 1152)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1109, file: !1110, line: 203, baseType: !955, size: 32, align: 32, offset: 1216)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1109, file: !1110, line: 205, baseType: !955, size: 32, align: 32, offset: 1248)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1109, file: !1110, line: 206, baseType: !955, size: 32, align: 32, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1109, file: !1110, line: 209, baseType: !1207, size: 64, align: 64, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1109, file: !1110, line: 212, baseType: !1207, size: 64, align: 64, offset: 1408)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1109, file: !1110, line: 213, baseType: !1116, size: 64, align: 64, offset: 1472)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1109, file: !1110, line: 215, baseType: !955, size: 32, align: 32, offset: 1536)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1109, file: !1110, line: 217, baseType: !955, size: 32, align: 32, offset: 1568)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1109, file: !1110, line: 220, baseType: !955, size: 32, align: 32, offset: 1600)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1096, file: !57, line: 1598, baseType: !954, size: 64, align: 64, offset: 384)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1096, file: !57, line: 1606, baseType: !1027, size: 64, align: 64, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1096, file: !57, line: 1614, baseType: !955, size: 32, align: 32, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1096, file: !57, line: 1622, baseType: !955, size: 32, align: 32, offset: 544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1096, file: !57, line: 1628, baseType: !955, size: 32, align: 32, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !57, line: 1636, baseType: !955, size: 32, align: 32, offset: 608)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1096, file: !57, line: 1643, baseType: !955, size: 32, align: 32, offset: 640)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1096, file: !57, line: 1657, baseType: !1122, size: 64, align: 64, offset: 704)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1096, file: !57, line: 1658, baseType: !955, size: 32, align: 32, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1096, file: !57, line: 1679, baseType: !985, size: 64, align: 32, offset: 800)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1096, file: !57, line: 1688, baseType: !955, size: 32, align: 32, offset: 864)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1096, file: !57, line: 1712, baseType: !955, size: 32, align: 32, offset: 896)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1096, file: !57, line: 1729, baseType: !955, size: 32, align: 32, offset: 928)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1096, file: !57, line: 1729, baseType: !955, size: 32, align: 32, offset: 960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1096, file: !57, line: 1744, baseType: !955, size: 32, align: 32, offset: 992)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1096, file: !57, line: 1744, baseType: !955, size: 32, align: 32, offset: 1024)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1096, file: !57, line: 1751, baseType: !955, size: 32, align: 32, offset: 1056)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1096, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1096, file: !57, line: 1791, baseType: !1380, size: 64, align: 64, offset: 1152)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{null, !1383, !1384, !1386, !955, !955, !955}
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1096, file: !57, line: 1808, baseType: !1388, size: 64, align: 64, offset: 1216)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!516, !1383, !992}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1096, file: !57, line: 1816, baseType: !955, size: 32, align: 32, offset: 1280)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1096, file: !57, line: 1825, baseType: !1393, size: 32, align: 32, offset: 1312)
!1393 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1096, file: !57, line: 1830, baseType: !955, size: 32, align: 32, offset: 1344)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1096, file: !57, line: 1838, baseType: !1393, size: 32, align: 32, offset: 1376)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1096, file: !57, line: 1846, baseType: !955, size: 32, align: 32, offset: 1408)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1096, file: !57, line: 1851, baseType: !955, size: 32, align: 32, offset: 1440)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1096, file: !57, line: 1861, baseType: !1393, size: 32, align: 32, offset: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1096, file: !57, line: 1868, baseType: !1393, size: 32, align: 32, offset: 1504)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1096, file: !57, line: 1875, baseType: !1393, size: 32, align: 32, offset: 1536)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1096, file: !57, line: 1882, baseType: !1393, size: 32, align: 32, offset: 1568)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1096, file: !57, line: 1889, baseType: !1393, size: 32, align: 32, offset: 1600)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1096, file: !57, line: 1896, baseType: !1393, size: 32, align: 32, offset: 1632)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1096, file: !57, line: 1903, baseType: !1393, size: 32, align: 32, offset: 1664)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1096, file: !57, line: 1910, baseType: !955, size: 32, align: 32, offset: 1696)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1096, file: !57, line: 1915, baseType: !955, size: 32, align: 32, offset: 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1096, file: !57, line: 1926, baseType: !1386, size: 64, align: 64, offset: 1792)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1096, file: !57, line: 1935, baseType: !985, size: 64, align: 32, offset: 1856)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1096, file: !57, line: 1942, baseType: !955, size: 32, align: 32, offset: 1920)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1096, file: !57, line: 1948, baseType: !955, size: 32, align: 32, offset: 1952)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1096, file: !57, line: 1954, baseType: !955, size: 32, align: 32, offset: 1984)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1096, file: !57, line: 1960, baseType: !955, size: 32, align: 32, offset: 2016)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1096, file: !57, line: 1984, baseType: !955, size: 32, align: 32, offset: 2048)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1096, file: !57, line: 1991, baseType: !955, size: 32, align: 32, offset: 2080)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1096, file: !57, line: 1996, baseType: !955, size: 32, align: 32, offset: 2112)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1096, file: !57, line: 2004, baseType: !955, size: 32, align: 32, offset: 2144)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1096, file: !57, line: 2011, baseType: !955, size: 32, align: 32, offset: 2176)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1096, file: !57, line: 2018, baseType: !955, size: 32, align: 32, offset: 2208)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1096, file: !57, line: 2027, baseType: !955, size: 32, align: 32, offset: 2240)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1096, file: !57, line: 2034, baseType: !955, size: 32, align: 32, offset: 2272)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1096, file: !57, line: 2044, baseType: !955, size: 32, align: 32, offset: 2304)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1096, file: !57, line: 2054, baseType: !1423, size: 64, align: 64, offset: 2368)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !947, line: 49, baseType: !1425)
!1425 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1096, file: !57, line: 2061, baseType: !1423, size: 64, align: 64, offset: 2432)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1096, file: !57, line: 2066, baseType: !955, size: 32, align: 32, offset: 2496)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1096, file: !57, line: 2070, baseType: !955, size: 32, align: 32, offset: 2528)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1096, file: !57, line: 2078, baseType: !955, size: 32, align: 32, offset: 2560)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1096, file: !57, line: 2085, baseType: !955, size: 32, align: 32, offset: 2592)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1096, file: !57, line: 2092, baseType: !955, size: 32, align: 32, offset: 2624)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1096, file: !57, line: 2099, baseType: !955, size: 32, align: 32, offset: 2656)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1096, file: !57, line: 2106, baseType: !955, size: 32, align: 32, offset: 2688)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1096, file: !57, line: 2113, baseType: !955, size: 32, align: 32, offset: 2720)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1096, file: !57, line: 2120, baseType: !955, size: 32, align: 32, offset: 2752)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1096, file: !57, line: 2125, baseType: !955, size: 32, align: 32, offset: 2784)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1096, file: !57, line: 2133, baseType: !955, size: 32, align: 32, offset: 2816)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1096, file: !57, line: 2140, baseType: !955, size: 32, align: 32, offset: 2848)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1096, file: !57, line: 2145, baseType: !955, size: 32, align: 32, offset: 2880)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1096, file: !57, line: 2153, baseType: !955, size: 32, align: 32, offset: 2912)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1096, file: !57, line: 2158, baseType: !955, size: 32, align: 32, offset: 2944)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1096, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1096, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1096, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1096, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1096, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1096, file: !57, line: 2203, baseType: !955, size: 32, align: 32, offset: 3136)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1096, file: !57, line: 2209, baseType: !910, size: 32, align: 32, offset: 3168)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1096, file: !57, line: 2212, baseType: !955, size: 32, align: 32, offset: 3200)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1096, file: !57, line: 2213, baseType: !955, size: 32, align: 32, offset: 3232)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1096, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1096, file: !57, line: 2232, baseType: !955, size: 32, align: 32, offset: 3296)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1096, file: !57, line: 2243, baseType: !955, size: 32, align: 32, offset: 3328)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1096, file: !57, line: 2249, baseType: !955, size: 32, align: 32, offset: 3360)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1096, file: !57, line: 2256, baseType: !955, size: 32, align: 32, offset: 3392)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1096, file: !57, line: 2263, baseType: !961, size: 64, align: 64, offset: 3456)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1096, file: !57, line: 2270, baseType: !961, size: 64, align: 64, offset: 3520)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1096, file: !57, line: 2277, baseType: !918, size: 32, align: 32, offset: 3584)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1096, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1096, file: !57, line: 2367, baseType: !1461, size: 64, align: 64, offset: 3648)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!955, !1383, !1116, !955}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1096, file: !57, line: 2383, baseType: !955, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1096, file: !57, line: 2386, baseType: !1393, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1096, file: !57, line: 2387, baseType: !1393, size: 32, align: 32, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1096, file: !57, line: 2394, baseType: !955, size: 32, align: 32, offset: 3808)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1096, file: !57, line: 2401, baseType: !955, size: 32, align: 32, offset: 3840)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1096, file: !57, line: 2408, baseType: !955, size: 32, align: 32, offset: 3872)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1096, file: !57, line: 2415, baseType: !955, size: 32, align: 32, offset: 3904)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1096, file: !57, line: 2422, baseType: !955, size: 32, align: 32, offset: 3936)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1096, file: !57, line: 2423, baseType: !1473, size: 64, align: 64, offset: 3968)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1475, file: !57, line: 827, baseType: !955, size: 32, align: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1475, file: !57, line: 828, baseType: !955, size: 32, align: 32, offset: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1475, file: !57, line: 829, baseType: !955, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1475, file: !57, line: 830, baseType: !1393, size: 32, align: 32, offset: 96)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1096, file: !57, line: 2430, baseType: !1027, size: 64, align: 64, offset: 4032)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1096, file: !57, line: 2437, baseType: !1027, size: 64, align: 64, offset: 4096)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1096, file: !57, line: 2444, baseType: !1393, size: 32, align: 32, offset: 4160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1096, file: !57, line: 2451, baseType: !1393, size: 32, align: 32, offset: 4192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1096, file: !57, line: 2458, baseType: !955, size: 32, align: 32, offset: 4224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1096, file: !57, line: 2469, baseType: !955, size: 32, align: 32, offset: 4256)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1096, file: !57, line: 2475, baseType: !955, size: 32, align: 32, offset: 4288)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1096, file: !57, line: 2481, baseType: !955, size: 32, align: 32, offset: 4320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1096, file: !57, line: 2485, baseType: !955, size: 32, align: 32, offset: 4352)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1096, file: !57, line: 2489, baseType: !955, size: 32, align: 32, offset: 4384)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1096, file: !57, line: 2493, baseType: !955, size: 32, align: 32, offset: 4416)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1096, file: !57, line: 2501, baseType: !955, size: 32, align: 32, offset: 4448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1096, file: !57, line: 2506, baseType: !955, size: 32, align: 32, offset: 4480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1096, file: !57, line: 2510, baseType: !955, size: 32, align: 32, offset: 4512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1096, file: !57, line: 2514, baseType: !1027, size: 64, align: 64, offset: 4544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1096, file: !57, line: 2528, baseType: !1497, size: 64, align: 64, offset: 4608)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1383, !954, !955, !955}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1096, file: !57, line: 2534, baseType: !955, size: 32, align: 32, offset: 4672)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1096, file: !57, line: 2545, baseType: !955, size: 32, align: 32, offset: 4704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1096, file: !57, line: 2547, baseType: !955, size: 32, align: 32, offset: 4736)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1096, file: !57, line: 2549, baseType: !955, size: 32, align: 32, offset: 4768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1096, file: !57, line: 2551, baseType: !955, size: 32, align: 32, offset: 4800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1096, file: !57, line: 2553, baseType: !955, size: 32, align: 32, offset: 4832)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1096, file: !57, line: 2555, baseType: !955, size: 32, align: 32, offset: 4864)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1096, file: !57, line: 2557, baseType: !955, size: 32, align: 32, offset: 4896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1096, file: !57, line: 2559, baseType: !955, size: 32, align: 32, offset: 4928)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1096, file: !57, line: 2563, baseType: !955, size: 32, align: 32, offset: 4960)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1096, file: !57, line: 2571, baseType: !1511, size: 64, align: 64, offset: 4992)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1096, file: !57, line: 2579, baseType: !1511, size: 64, align: 64, offset: 5056)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1096, file: !57, line: 2586, baseType: !955, size: 32, align: 32, offset: 5120)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1096, file: !57, line: 2615, baseType: !955, size: 32, align: 32, offset: 5152)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1096, file: !57, line: 2627, baseType: !955, size: 32, align: 32, offset: 5184)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1096, file: !57, line: 2637, baseType: !955, size: 32, align: 32, offset: 5216)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1096, file: !57, line: 2681, baseType: !955, size: 32, align: 32, offset: 5248)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1096, file: !57, line: 2709, baseType: !1027, size: 64, align: 64, offset: 5312)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1096, file: !57, line: 2716, baseType: !1520, size: 64, align: 64, offset: 5376)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1529, !1533, !1537, !1541, !1542, !1543, !1544, !2443, !2444, !2445, !2446, !2447}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1522, file: !57, line: 3642, baseType: !975, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1522, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1522, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1522, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1522, file: !57, line: 3669, baseType: !955, size: 32, align: 32, offset: 160)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1522, file: !57, line: 3682, baseType: !1530, size: 64, align: 64, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!955, !1094, !1116}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1522, file: !57, line: 3698, baseType: !1534, size: 64, align: 64, offset: 256)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!955, !1094, !950, !946}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1522, file: !57, line: 3712, baseType: !1538, size: 64, align: 64, offset: 320)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!955, !1094, !955, !950, !946}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1522, file: !57, line: 3726, baseType: !1534, size: 64, align: 64, offset: 384)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1522, file: !57, line: 3737, baseType: !1091, size: 64, align: 64, offset: 448)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1522, file: !57, line: 3746, baseType: !955, size: 32, align: 32, offset: 512)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1522, file: !57, line: 3757, baseType: !1545, size: 64, align: 64, offset: 576)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{null, !1548}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1550, line: 81, size: 86208, align: 64, elements: !1551)
!1550 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1551 = !{!1552, !1554, !1555, !1556, !1557, !1561, !1562, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1609, !1610, !1663, !1665, !1666, !1667, !1668, !1669, !1680, !1681, !1682, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1698, !1700, !1702, !1703, !1704, !1705, !1706, !1707, !1712, !1714, !1715, !1716, !1717, !1718, !1719, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1746, !1747, !1748, !1749, !1765, !1772, !1784, !1800, !1822, !1862, !1875, !1902, !1917, !1931, !1944, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1965, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1978, !1980, !1981, !1982, !1983, !1984, !1985, !1988, !1990, !1992, !1993, !1996, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2063, !2064, !2066, !2067, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2089, !2090, !2091, !2094, !2095, !2096, !2097, !2099, !2101, !2102, !2103, !2104, !2105, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2187, !2188, !2189, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2318, !2319, !2320, !2321, !2325, !2326, !2330, !2334, !2338, !2339, !2344, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2359, !2360, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2378, !2379, !2380, !2430, !2431, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1549, file: !1550, line: 82, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1549, file: !1550, line: 84, baseType: !955, size: 32, align: 32, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1549, file: !1550, line: 84, baseType: !955, size: 32, align: 32, offset: 96)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1549, file: !1550, line: 85, baseType: !955, size: 32, align: 32, offset: 128)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1549, file: !1550, line: 86, baseType: !1558, size: 384, align: 32, offset: 160)
!1558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 384, align: 32, elements: !1559)
!1559 = !{!1560}
!1560 = !DISubrange(count: 12)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1549, file: !1550, line: 87, baseType: !955, size: 32, align: 32, offset: 544)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1549, file: !1550, line: 90, baseType: !1563, size: 1088, align: 64, offset: 576)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1565)
!1565 = !{!1566, !1567, !1571}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1564, file: !902, line: 32, baseType: !950, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1564, file: !902, line: 33, baseType: !1568, size: 512, align: 8, offset: 64)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 512, align: 8, elements: !1569)
!1569 = !{!1570}
!1570 = !DISubrange(count: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1564, file: !902, line: 34, baseType: !1568, size: 512, align: 8, offset: 576)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1549, file: !1550, line: 91, baseType: !1563, size: 1088, align: 64, offset: 1664)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1549, file: !1550, line: 92, baseType: !1563, size: 1088, align: 64, offset: 2752)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1549, file: !1550, line: 93, baseType: !1563, size: 1088, align: 64, offset: 3840)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1549, file: !1550, line: 98, baseType: !1383, size: 64, align: 64, offset: 4928)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1549, file: !1550, line: 100, baseType: !955, size: 32, align: 32, offset: 4992)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1549, file: !1550, line: 100, baseType: !955, size: 32, align: 32, offset: 5024)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1549, file: !1550, line: 101, baseType: !955, size: 32, align: 32, offset: 5056)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1549, file: !1550, line: 102, baseType: !955, size: 32, align: 32, offset: 5088)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1549, file: !1550, line: 103, baseType: !1027, size: 64, align: 64, offset: 5120)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1549, file: !1550, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1549, file: !1550, line: 105, baseType: !955, size: 32, align: 32, offset: 5216)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1549, file: !1550, line: 106, baseType: !955, size: 32, align: 32, offset: 5248)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1549, file: !1550, line: 109, baseType: !955, size: 32, align: 32, offset: 5280)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1549, file: !1550, line: 110, baseType: !955, size: 32, align: 32, offset: 5312)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1549, file: !1550, line: 112, baseType: !56, size: 32, align: 32, offset: 5344)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1549, file: !1550, line: 113, baseType: !955, size: 32, align: 32, offset: 5376)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1549, file: !1550, line: 114, baseType: !955, size: 32, align: 32, offset: 5408)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1549, file: !1550, line: 115, baseType: !955, size: 32, align: 32, offset: 5440)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1549, file: !1550, line: 116, baseType: !955, size: 32, align: 32, offset: 5472)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1549, file: !1550, line: 117, baseType: !955, size: 32, align: 32, offset: 5504)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1549, file: !1550, line: 118, baseType: !955, size: 32, align: 32, offset: 5536)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1549, file: !1550, line: 119, baseType: !955, size: 32, align: 32, offset: 5568)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1549, file: !1550, line: 120, baseType: !955, size: 32, align: 32, offset: 5600)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1549, file: !1550, line: 124, baseType: !955, size: 32, align: 32, offset: 5632)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1549, file: !1550, line: 125, baseType: !955, size: 32, align: 32, offset: 5664)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1549, file: !1550, line: 126, baseType: !955, size: 32, align: 32, offset: 5696)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1549, file: !1550, line: 127, baseType: !955, size: 32, align: 32, offset: 5728)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1549, file: !1550, line: 128, baseType: !955, size: 32, align: 32, offset: 5760)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1549, file: !1550, line: 129, baseType: !955, size: 32, align: 32, offset: 5792)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1549, file: !1550, line: 129, baseType: !955, size: 32, align: 32, offset: 5824)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1549, file: !1550, line: 130, baseType: !955, size: 32, align: 32, offset: 5856)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1549, file: !1550, line: 131, baseType: !955, size: 32, align: 32, offset: 5888)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1549, file: !1550, line: 132, baseType: !955, size: 32, align: 32, offset: 5920)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1549, file: !1550, line: 132, baseType: !955, size: 32, align: 32, offset: 5952)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1549, file: !1550, line: 133, baseType: !955, size: 32, align: 32, offset: 5984)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1549, file: !1550, line: 134, baseType: !1608, size: 64, align: 64, offset: 6016)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1208, line: 149, baseType: !1028)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1549, file: !1550, line: 135, baseType: !1608, size: 64, align: 64, offset: 6080)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1549, file: !1550, line: 136, baseType: !1611, size: 64, align: 64, offset: 6144)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1613, line: 91, baseType: !1614)
!1613 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1613, line: 45, size: 2624, align: 64, elements: !1615)
!1615 = !{!1616, !1618, !1627, !1628, !1629, !1631, !1637, !1638, !1640, !1641, !1642, !1643, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1614, file: !1613, line: 46, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1614, file: !1613, line: 47, baseType: !1619, size: 256, align: 64, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1620, line: 40, baseType: !1621)
!1620 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1620, line: 34, size: 256, align: 64, elements: !1622)
!1622 = !{!1623, !1624, !1626}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1621, file: !1620, line: 35, baseType: !1116, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1621, file: !1620, line: 36, baseType: !1625, size: 128, align: 64, offset: 64)
!1625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 128, align: 64, elements: !968)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1621, file: !1620, line: 39, baseType: !1154, size: 64, align: 64, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1614, file: !1613, line: 49, baseType: !1154, size: 64, align: 64, offset: 320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1614, file: !1613, line: 50, baseType: !1198, size: 64, align: 64, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1614, file: !1613, line: 52, baseType: !1630, size: 128, align: 64, offset: 448)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 128, align: 64, elements: !968)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1614, file: !1613, line: 53, baseType: !1632, size: 128, align: 64, offset: 576)
!1632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1633, size: 128, align: 64, elements: !968)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1635, size: 32, align: 16, elements: !968)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !947, line: 37, baseType: !1636)
!1636 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1614, file: !1613, line: 55, baseType: !1154, size: 64, align: 64, offset: 704)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1614, file: !1613, line: 56, baseType: !1639, size: 64, align: 64, offset: 768)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1614, file: !1613, line: 58, baseType: !1154, size: 64, align: 64, offset: 832)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1614, file: !1613, line: 59, baseType: !1122, size: 64, align: 64, offset: 896)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1614, file: !1613, line: 61, baseType: !1630, size: 128, align: 64, offset: 960)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1614, file: !1613, line: 62, baseType: !1644, size: 128, align: 64, offset: 1088)
!1644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 128, align: 64, elements: !968)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1614, file: !1613, line: 64, baseType: !1154, size: 64, align: 64, offset: 1216)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1614, file: !1613, line: 65, baseType: !1423, size: 64, align: 64, offset: 1280)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1614, file: !1613, line: 67, baseType: !1154, size: 64, align: 64, offset: 1344)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1614, file: !1613, line: 68, baseType: !1423, size: 64, align: 64, offset: 1408)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1614, file: !1613, line: 70, baseType: !955, size: 32, align: 32, offset: 1472)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1614, file: !1613, line: 71, baseType: !955, size: 32, align: 32, offset: 1504)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1614, file: !1613, line: 73, baseType: !1154, size: 64, align: 64, offset: 1536)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1614, file: !1613, line: 74, baseType: !1122, size: 64, align: 64, offset: 1600)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1614, file: !1613, line: 76, baseType: !1154, size: 64, align: 64, offset: 1664)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1614, file: !1613, line: 77, baseType: !954, size: 64, align: 64, offset: 1728)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1614, file: !1613, line: 79, baseType: !955, size: 32, align: 32, offset: 1792)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1614, file: !1613, line: 81, baseType: !1027, size: 64, align: 64, offset: 1856)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1614, file: !1613, line: 82, baseType: !1027, size: 64, align: 64, offset: 1920)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1614, file: !1613, line: 84, baseType: !955, size: 32, align: 32, offset: 1984)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1614, file: !1613, line: 85, baseType: !955, size: 32, align: 32, offset: 2016)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1614, file: !1613, line: 87, baseType: !955, size: 32, align: 32, offset: 2048)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1614, file: !1613, line: 88, baseType: !955, size: 32, align: 32, offset: 2080)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1614, file: !1613, line: 90, baseType: !1144, size: 512, align: 64, offset: 2112)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1549, file: !1550, line: 137, baseType: !1664, size: 64, align: 64, offset: 6208)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_input_picture", scope: !1549, file: !1550, line: 138, baseType: !1664, size: 64, align: 64, offset: 6272)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "user_specified_pts", scope: !1549, file: !1550, line: 140, baseType: !1027, size: 64, align: 64, offset: 6336)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "dts_delta", scope: !1549, file: !1550, line: 144, baseType: !1027, size: 64, align: 64, offset: 6400)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_pts", scope: !1549, file: !1550, line: 148, baseType: !1027, size: 64, align: 64, offset: 6464)
