; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MVTable = type { i32, i16*, i8*, i8*, i8*, i16*, %struct.VLC }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }
%union.unaligned_32 = type { i32 }

!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !929, line: 221, size: 32, align: 8, elements: !930)
!929 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !928, file: !929, line: 221, baseType: !932, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !933, line: 51, baseType: !934)
!933 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!934 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!935 = !{!936, !2599}
!936 = distinct !DIGlobalVariable(name: "init_done", scope: !937, file: !938, line: 123, type: !941, isLocal: true, isDefinition: true, variable: i32* @ff_msmpeg4_encode_init.init_done)
!937 = distinct !DISubprogram(name: "ff_msmpeg4_encode_init", scope: !938, file: !938, line: 121, type: !939, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2598)
!938 = !DIFile(filename: "libavcodec/msmpeg4enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!939 = !DISubroutineType(types: !940)
!940 = !{!941, !942}
!941 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !944, line: 582, baseType: !945)
!944 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !944, line: 81, size: 86208, align: 64, elements: !946)
!946 = !{!947, !1030, !1031, !1032, !1033, !1037, !1038, !1052, !1053, !1054, !1055, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1762, !1763, !1818, !1820, !1821, !1822, !1823, !1824, !1835, !1836, !1837, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1853, !1855, !1857, !1858, !1859, !1860, !1861, !1862, !1867, !1869, !1870, !1871, !1872, !1873, !1874, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1901, !1902, !1903, !1904, !1920, !1927, !1939, !1955, !1977, !2017, !2030, !2057, !2072, !2086, !2099, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2120, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2133, !2135, !2136, !2137, !2138, !2139, !2140, !2143, !2145, !2147, !2148, !2151, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2218, !2219, !2221, !2222, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2244, !2245, !2246, !2249, !2250, !2251, !2252, !2254, !2256, !2257, !2258, !2259, !2260, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2342, !2343, !2344, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2473, !2474, !2475, !2476, !2480, !2481, !2485, !2489, !2493, !2494, !2499, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2514, !2515, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2533, !2534, !2535, !2585, !2586, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !945, file: !944, line: 82, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !951)
!951 = !{!952, !956, !960, !989, !990, !991, !992, !996, !1002, !1004, !1008}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !950, file: !26, line: 72, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !950, file: !26, line: 78, baseType: !957, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!953, !926}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !950, file: !26, line: 85, baseType: !961, size: 64, align: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !985, !986, !987, !988}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !4, line: 247, baseType: !953, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !963, file: !4, line: 253, baseType: !953, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !963, file: !4, line: 259, baseType: !941, size: 32, align: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !963, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !963, file: !4, line: 271, baseType: !970, size: 64, align: 64, offset: 192)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !963, file: !4, line: 265, size: 64, align: 64, elements: !971)
!971 = !{!972, !975, !977, !978}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !970, file: !4, line: 266, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !933, line: 40, baseType: !974)
!974 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !970, file: !4, line: 267, baseType: !976, size: 64, align: 64)
!976 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !970, file: !4, line: 268, baseType: !953, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !970, file: !4, line: 270, baseType: !979, size: 64, align: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !980, line: 61, baseType: !981)
!980 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !980, line: 58, size: 64, align: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !981, file: !980, line: 59, baseType: !941, size: 32, align: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !981, file: !980, line: 60, baseType: !941, size: 32, align: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !963, file: !4, line: 272, baseType: !976, size: 64, align: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !963, file: !4, line: 273, baseType: !976, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !963, file: !4, line: 275, baseType: !941, size: 32, align: 32, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !963, file: !4, line: 300, baseType: !953, size: 64, align: 64, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !950, file: !26, line: 93, baseType: !941, size: 32, align: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !950, file: !26, line: 99, baseType: !941, size: 32, align: 32, offset: 224)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !950, file: !26, line: 108, baseType: !941, size: 32, align: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !950, file: !26, line: 113, baseType: !993, size: 64, align: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!926, !926, !926}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !950, file: !26, line: 123, baseType: !997, size: 64, align: 64, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!1000, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !950, file: !26, line: 130, baseType: !1003, size: 32, align: 32, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !950, file: !26, line: 136, baseType: !1005, size: 64, align: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1003, !926}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !950, file: !26, line: 142, baseType: !1009, size: 64, align: 64, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!941, !1012, !926, !953, !941}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1015)
!1015 = !{!1016, !1028, !1029}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1014, file: !4, line: 360, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1020, file: !4, line: 307, baseType: !953, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1020, file: !4, line: 313, baseType: !976, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1020, file: !4, line: 313, baseType: !976, size: 64, align: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1020, file: !4, line: 318, baseType: !976, size: 64, align: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1020, file: !4, line: 318, baseType: !976, size: 64, align: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1020, file: !4, line: 323, baseType: !941, size: 32, align: 32, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1014, file: !4, line: 364, baseType: !941, size: 32, align: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1014, file: !4, line: 368, baseType: !941, size: 32, align: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !945, file: !944, line: 84, baseType: !941, size: 32, align: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !945, file: !944, line: 84, baseType: !941, size: 32, align: 32, offset: 96)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !945, file: !944, line: 85, baseType: !941, size: 32, align: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !945, file: !944, line: 86, baseType: !1034, size: 384, align: 32, offset: 160)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 384, align: 32, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 12)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !945, file: !944, line: 87, baseType: !941, size: 32, align: 32, offset: 544)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !945, file: !944, line: 90, baseType: !1039, size: 1088, align: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1041)
!1041 = !{!1042, !1047, !1051}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1040, file: !917, line: 32, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !933, line: 48, baseType: !1046)
!1046 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1040, file: !917, line: 33, baseType: !1048, size: 512, align: 8, offset: 64)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 512, align: 8, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1040, file: !917, line: 34, baseType: !1048, size: 512, align: 8, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !945, file: !944, line: 91, baseType: !1039, size: 1088, align: 64, offset: 1664)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !945, file: !944, line: 92, baseType: !1039, size: 1088, align: 64, offset: 2752)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !945, file: !944, line: 93, baseType: !1039, size: 1088, align: 64, offset: 3840)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !945, file: !944, line: 98, baseType: !1056, size: 64, align: 64, offset: 4928)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1058)
!1058 = !{!1059, !1062, !1063, !1064, !1329, !1330, !1331, !1332, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1484, !1488, !1489, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1667, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1057, file: !57, line: 1561, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1057, file: !57, line: 1562, baseType: !941, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1057, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1057, file: !57, line: 1565, baseType: !1065, size: 64, align: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1077, !1080, !1083, !1086, !1091, !1092, !1093, !1101, !1102, !1103, !1105, !1111, !1117, !1126, !1130, !1131, !1179, !1300, !1304, !1305, !1309, !1313, !1318, !1322, !1323, !1324}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !57, line: 3475, baseType: !953, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1067, file: !57, line: 3480, baseType: !953, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1067, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1067, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1067, file: !57, line: 3487, baseType: !941, size: 32, align: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1067, file: !57, line: 3488, baseType: !1075, size: 64, align: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1067, file: !57, line: 3489, baseType: !1078, size: 64, align: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1067, file: !57, line: 3490, baseType: !1081, size: 64, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1067, file: !57, line: 3491, baseType: !1084, size: 64, align: 64, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1067, file: !57, line: 3492, baseType: !1087, size: 64, align: 64, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !933, line: 55, baseType: !1090)
!1090 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1067, file: !57, line: 3493, baseType: !1045, size: 8, align: 8, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1067, file: !57, line: 3494, baseType: !1060, size: 64, align: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1067, file: !57, line: 3495, baseType: !1094, size: 64, align: 64, offset: 704)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1097, file: !57, line: 3402, baseType: !941, size: 32, align: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1097, file: !57, line: 3403, baseType: !953, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1067, file: !57, line: 3507, baseType: !953, size: 64, align: 64, offset: 768)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1067, file: !57, line: 3516, baseType: !941, size: 32, align: 32, offset: 832)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !57, line: 3517, baseType: !1104, size: 64, align: 64, offset: 896)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1067, file: !57, line: 3527, baseType: !1106, size: 64, align: 64, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!941, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1057)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1067, file: !57, line: 3535, baseType: !1112, size: 64, align: 64, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!941, !1109, !1115}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1067, file: !57, line: 3541, baseType: !1118, size: 64, align: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1122, line: 223, size: 128, align: 64, elements: !1123)
!1122 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1121, file: !1122, line: 224, baseType: !1043, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1121, file: !1122, line: 225, baseType: !1043, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1067, file: !57, line: 3549, baseType: !1127, size: 64, align: 64, offset: 1152)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1104}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1067, file: !57, line: 3551, baseType: !1106, size: 64, align: 64, offset: 1216)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1067, file: !57, line: 3552, baseType: !1132, size: 64, align: 64, offset: 1280)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!941, !1109, !1135, !941, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1139)
!1139 = !{!1140, !1143, !1144, !1145, !1146, !1178}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1138, file: !57, line: 3921, baseType: !1141, size: 16, align: 16)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !933, line: 49, baseType: !1142)
!1142 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1138, file: !57, line: 3922, baseType: !932, size: 32, align: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1138, file: !57, line: 3923, baseType: !932, size: 32, align: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1138, file: !57, line: 3924, baseType: !934, size: 32, align: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1138, file: !57, line: 3925, baseType: !1147, size: 64, align: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1167, !1171, !1173, !1174, !1176, !1177}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1150, file: !57, line: 3886, baseType: !941, size: 32, align: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1150, file: !57, line: 3887, baseType: !941, size: 32, align: 32, offset: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1150, file: !57, line: 3888, baseType: !941, size: 32, align: 32, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1150, file: !57, line: 3889, baseType: !941, size: 32, align: 32, offset: 96)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1150, file: !57, line: 3890, baseType: !941, size: 32, align: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1150, file: !57, line: 3897, baseType: !1158, size: 768, align: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1160)
!1160 = !{!1161, !1165}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !57, line: 3855, baseType: !1162, size: 512, align: 64)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 512, align: 64, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 8)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1159, file: !57, line: 3857, baseType: !1166, size: 256, align: 32, offset: 512)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 256, align: 32, elements: !1163)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1150, file: !57, line: 3903, baseType: !1168, size: 256, align: 64, offset: 960)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 256, align: 64, elements: !1169)
!1169 = !{!1170}
!1170 = !DISubrange(count: 4)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1150, file: !57, line: 3904, baseType: !1172, size: 128, align: 32, offset: 1216)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, align: 32, elements: !1169)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1150, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1150, file: !57, line: 3908, baseType: !1175, size: 64, align: 64, offset: 1408)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1150, file: !57, line: 3915, baseType: !1175, size: 64, align: 64, offset: 1472)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1150, file: !57, line: 3917, baseType: !941, size: 32, align: 32, offset: 1536)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1138, file: !57, line: 3926, baseType: !973, size: 64, align: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1067, file: !57, line: 3564, baseType: !1180, size: 64, align: 64, offset: 1344)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!941, !1109, !1183, !1217, !1299}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1186)
!1186 = !{!1187, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1213, !1214, !1215, !1216}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !57, line: 1451, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1190, line: 94, baseType: !1191)
!1190 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1190, line: 81, size: 192, align: 64, elements: !1192)
!1192 = !{!1193, !1197, !1198}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1191, file: !1190, line: 82, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1190, line: 73, baseType: !1196)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1190, line: 73, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !1190, line: 89, baseType: !1135, size: 64, align: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !1190, line: 93, baseType: !941, size: 32, align: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1185, file: !57, line: 1461, baseType: !973, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1185, file: !57, line: 1467, baseType: !973, size: 64, align: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !57, line: 1468, baseType: !1135, size: 64, align: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !57, line: 1469, baseType: !941, size: 32, align: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1185, file: !57, line: 1470, baseType: !941, size: 32, align: 32, offset: 288)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !57, line: 1474, baseType: !941, size: 32, align: 32, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1185, file: !57, line: 1479, baseType: !1206, size: 64, align: 64, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !57, line: 1412, baseType: !1135, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !57, line: 1413, baseType: !941, size: 32, align: 32, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1185, file: !57, line: 1480, baseType: !941, size: 32, align: 32, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1185, file: !57, line: 1486, baseType: !973, size: 64, align: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1185, file: !57, line: 1488, baseType: !973, size: 64, align: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1185, file: !57, line: 1497, baseType: !973, size: 64, align: 64, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1251, !1253, !1254, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1289, !1290, !1291, !1292, !1295, !1296, !1297, !1298}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !780, line: 282, baseType: !1162, size: 512, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1220, file: !780, line: 299, baseType: !1166, size: 256, align: 32, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1220, file: !780, line: 315, baseType: !1225, size: 64, align: 64, offset: 768)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1220, file: !780, line: 326, baseType: !941, size: 32, align: 32, offset: 832)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1220, file: !780, line: 326, baseType: !941, size: 32, align: 32, offset: 864)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1220, file: !780, line: 334, baseType: !941, size: 32, align: 32, offset: 896)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1220, file: !780, line: 341, baseType: !941, size: 32, align: 32, offset: 928)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1220, file: !780, line: 346, baseType: !941, size: 32, align: 32, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1220, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1220, file: !780, line: 356, baseType: !979, size: 64, align: 32, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1220, file: !780, line: 361, baseType: !973, size: 64, align: 64, offset: 1088)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1220, file: !780, line: 369, baseType: !973, size: 64, align: 64, offset: 1152)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1220, file: !780, line: 377, baseType: !973, size: 64, align: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1220, file: !780, line: 382, baseType: !941, size: 32, align: 32, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1220, file: !780, line: 386, baseType: !941, size: 32, align: 32, offset: 1312)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1220, file: !780, line: 391, baseType: !941, size: 32, align: 32, offset: 1344)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1220, file: !780, line: 396, baseType: !926, size: 64, align: 64, offset: 1408)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1220, file: !780, line: 403, baseType: !1241, size: 512, align: 64, offset: 1472)
!1241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1163)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1220, file: !780, line: 410, baseType: !941, size: 32, align: 32, offset: 1984)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1220, file: !780, line: 415, baseType: !941, size: 32, align: 32, offset: 2016)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1220, file: !780, line: 420, baseType: !941, size: 32, align: 32, offset: 2048)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1220, file: !780, line: 425, baseType: !941, size: 32, align: 32, offset: 2080)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1220, file: !780, line: 435, baseType: !973, size: 64, align: 64, offset: 2112)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1220, file: !780, line: 440, baseType: !941, size: 32, align: 32, offset: 2176)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1220, file: !780, line: 445, baseType: !1089, size: 64, align: 64, offset: 2240)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1220, file: !780, line: 459, baseType: !1250, size: 512, align: 64, offset: 2304)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 512, align: 64, elements: !1163)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1220, file: !780, line: 473, baseType: !1252, size: 64, align: 64, offset: 2816)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1220, file: !780, line: 477, baseType: !941, size: 32, align: 32, offset: 2880)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1220, file: !780, line: 479, baseType: !1255, size: 64, align: 64, offset: 2944)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1268}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1258, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1258, file: !780, line: 203, baseType: !1135, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1258, file: !780, line: 204, baseType: !941, size: 32, align: 32, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1258, file: !780, line: 205, baseType: !1264, size: 64, align: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1266, line: 86, baseType: !1267)
!1266 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1266, line: 86, flags: DIFlagFwdDecl)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1258, file: !780, line: 206, baseType: !1188, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1220, file: !780, line: 480, baseType: !941, size: 32, align: 32, offset: 3008)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1220, file: !780, line: 505, baseType: !941, size: 32, align: 32, offset: 3040)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1220, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1220, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1220, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1220, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1220, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1220, file: !780, line: 532, baseType: !973, size: 64, align: 64, offset: 3264)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1220, file: !780, line: 539, baseType: !973, size: 64, align: 64, offset: 3328)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1220, file: !780, line: 547, baseType: !973, size: 64, align: 64, offset: 3392)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1220, file: !780, line: 554, baseType: !1264, size: 64, align: 64, offset: 3456)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1220, file: !780, line: 563, baseType: !941, size: 32, align: 32, offset: 3520)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1220, file: !780, line: 572, baseType: !941, size: 32, align: 32, offset: 3552)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1220, file: !780, line: 581, baseType: !941, size: 32, align: 32, offset: 3584)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1220, file: !780, line: 588, baseType: !1284, size: 64, align: 64, offset: 3648)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !933, line: 36, baseType: !1286)
!1286 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1220, file: !780, line: 593, baseType: !941, size: 32, align: 32, offset: 3712)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1220, file: !780, line: 596, baseType: !941, size: 32, align: 32, offset: 3744)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1220, file: !780, line: 599, baseType: !1188, size: 64, align: 64, offset: 3776)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1220, file: !780, line: 605, baseType: !1188, size: 64, align: 64, offset: 3840)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1220, file: !780, line: 616, baseType: !1188, size: 64, align: 64, offset: 3904)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1220, file: !780, line: 626, baseType: !1293, size: 64, align: 64, offset: 3968)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1294, line: 216, baseType: !1090)
!1294 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1220, file: !780, line: 627, baseType: !1293, size: 64, align: 64, offset: 4032)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1220, file: !780, line: 628, baseType: !1293, size: 64, align: 64, offset: 4096)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1220, file: !780, line: 629, baseType: !1293, size: 64, align: 64, offset: 4160)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1220, file: !780, line: 645, baseType: !1188, size: 64, align: 64, offset: 4224)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1067, file: !57, line: 3566, baseType: !1301, size: 64, align: 64, offset: 1408)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!941, !1109, !926, !1299, !1183}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1067, file: !57, line: 3567, baseType: !1106, size: 64, align: 64, offset: 1472)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1067, file: !57, line: 3576, baseType: !1306, size: 64, align: 64, offset: 1536)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!941, !1109, !1217}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1067, file: !57, line: 3577, baseType: !1310, size: 64, align: 64, offset: 1600)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!941, !1109, !1183}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1067, file: !57, line: 3584, baseType: !1314, size: 64, align: 64, offset: 1664)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!941, !1109, !1317}
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1067, file: !57, line: 3589, baseType: !1319, size: 64, align: 64, offset: 1728)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{null, !1109}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1067, file: !57, line: 3594, baseType: !941, size: 32, align: 32, offset: 1792)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1067, file: !57, line: 3600, baseType: !953, size: 64, align: 64, offset: 1856)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1067, file: !57, line: 3609, baseType: !1325, size: 64, align: 64, offset: 1920)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1057, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1057, file: !57, line: 1581, baseType: !934, size: 32, align: 32, offset: 224)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1057, file: !57, line: 1583, baseType: !926, size: 64, align: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1057, file: !57, line: 1591, baseType: !1333, size: 64, align: 64, offset: 320)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1122, line: 129, size: 1664, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340, !1358, !1359, !1365, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1334, file: !1122, line: 136, baseType: !941, size: 32, align: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1334, file: !1122, line: 151, baseType: !941, size: 32, align: 32, offset: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1334, file: !1122, line: 157, baseType: !941, size: 32, align: 32, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1334, file: !1122, line: 159, baseType: !1317, size: 64, align: 64, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1334, file: !1122, line: 161, baseType: !1341, size: 64, align: 64, offset: 192)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1122, line: 117, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1122, line: 100, size: 832, align: 64, elements: !1344)
!1344 = !{!1345, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1343, file: !1122, line: 105, baseType: !1346, size: 256, align: 64)
!1346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1347, size: 256, align: 64, elements: !1169)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1190, line: 238, baseType: !1349)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1190, line: 238, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1343, file: !1122, line: 110, baseType: !941, size: 32, align: 32, offset: 256)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1343, file: !1122, line: 111, baseType: !941, size: 32, align: 32, offset: 288)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1343, file: !1122, line: 111, baseType: !941, size: 32, align: 32, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1343, file: !1122, line: 112, baseType: !1166, size: 256, align: 32, offset: 352)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1343, file: !1122, line: 113, baseType: !1172, size: 128, align: 32, offset: 608)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1343, file: !1122, line: 114, baseType: !941, size: 32, align: 32, offset: 736)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1343, file: !1122, line: 115, baseType: !941, size: 32, align: 32, offset: 768)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1343, file: !1122, line: 116, baseType: !941, size: 32, align: 32, offset: 800)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1334, file: !1122, line: 163, baseType: !926, size: 64, align: 64, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1334, file: !1122, line: 165, baseType: !1360, size: 128, align: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1122, line: 122, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1122, line: 119, size: 128, align: 64, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1361, file: !1122, line: 120, baseType: !1183, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1361, file: !1122, line: 121, baseType: !1317, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1334, file: !1122, line: 166, baseType: !1366, size: 128, align: 64, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1122, line: 127, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1122, line: 124, size: 128, align: 64, elements: !1368)
!1368 = !{!1369, !1442}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1367, file: !1122, line: 125, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1400, !1404, !1405, !1439, !1440, !1441}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1373, file: !57, line: 5751, baseType: !1060, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1373, file: !57, line: 5756, baseType: !1377, size: 64, align: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1380)
!1380 = !{!1381, !1382, !1385, !1386, !1387, !1391, !1395, !1399}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1379, file: !57, line: 5797, baseType: !953, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1379, file: !57, line: 5804, baseType: !1383, size: 64, align: 64, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1379, file: !57, line: 5815, baseType: !1060, size: 64, align: 64, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1379, file: !57, line: 5825, baseType: !941, size: 32, align: 32, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1379, file: !57, line: 5826, baseType: !1388, size: 64, align: 64, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!941, !1371}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1379, file: !57, line: 5827, baseType: !1392, size: 64, align: 64, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!941, !1371, !1183}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1379, file: !57, line: 5828, baseType: !1396, size: 64, align: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{null, !1371}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1379, file: !57, line: 5829, baseType: !1396, size: 64, align: 64, offset: 448)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1373, file: !57, line: 5762, baseType: !1401, size: 64, align: 64, offset: 128)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1403)
!1403 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1373, file: !57, line: 5768, baseType: !926, size: 64, align: 64, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1373, file: !57, line: 5775, baseType: !1406, size: 64, align: 64, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1408, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1408, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1408, file: !57, line: 3948, baseType: !932, size: 32, align: 32, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1408, file: !57, line: 3958, baseType: !1135, size: 64, align: 64, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1408, file: !57, line: 3962, baseType: !941, size: 32, align: 32, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1408, file: !57, line: 3968, baseType: !941, size: 32, align: 32, offset: 224)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1408, file: !57, line: 3973, baseType: !973, size: 64, align: 64, offset: 256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1408, file: !57, line: 3986, baseType: !941, size: 32, align: 32, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1408, file: !57, line: 3999, baseType: !941, size: 32, align: 32, offset: 352)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1408, file: !57, line: 4004, baseType: !941, size: 32, align: 32, offset: 384)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1408, file: !57, line: 4005, baseType: !941, size: 32, align: 32, offset: 416)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1408, file: !57, line: 4010, baseType: !941, size: 32, align: 32, offset: 448)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1408, file: !57, line: 4011, baseType: !941, size: 32, align: 32, offset: 480)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1408, file: !57, line: 4020, baseType: !979, size: 64, align: 32, offset: 512)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1408, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1408, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1408, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1408, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1408, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1408, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1408, file: !57, line: 4039, baseType: !941, size: 32, align: 32, offset: 768)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1408, file: !57, line: 4046, baseType: !1089, size: 64, align: 64, offset: 832)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1408, file: !57, line: 4050, baseType: !941, size: 32, align: 32, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1408, file: !57, line: 4054, baseType: !941, size: 32, align: 32, offset: 928)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1408, file: !57, line: 4061, baseType: !941, size: 32, align: 32, offset: 960)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1408, file: !57, line: 4065, baseType: !941, size: 32, align: 32, offset: 992)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1408, file: !57, line: 4073, baseType: !941, size: 32, align: 32, offset: 1024)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1408, file: !57, line: 4080, baseType: !941, size: 32, align: 32, offset: 1056)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1408, file: !57, line: 4084, baseType: !941, size: 32, align: 32, offset: 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1373, file: !57, line: 5781, baseType: !1406, size: 64, align: 64, offset: 320)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1373, file: !57, line: 5787, baseType: !979, size: 64, align: 32, offset: 384)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1373, file: !57, line: 5793, baseType: !979, size: 64, align: 32, offset: 448)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1367, file: !1122, line: 126, baseType: !941, size: 32, align: 32, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1334, file: !1122, line: 172, baseType: !1183, size: 64, align: 64, offset: 576)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1334, file: !1122, line: 177, baseType: !1135, size: 64, align: 64, offset: 640)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1334, file: !1122, line: 178, baseType: !934, size: 32, align: 32, offset: 704)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1334, file: !1122, line: 180, baseType: !926, size: 64, align: 64, offset: 768)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1334, file: !1122, line: 185, baseType: !941, size: 32, align: 32, offset: 832)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1334, file: !1122, line: 190, baseType: !926, size: 64, align: 64, offset: 896)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1334, file: !1122, line: 195, baseType: !941, size: 32, align: 32, offset: 960)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1334, file: !1122, line: 200, baseType: !1183, size: 64, align: 64, offset: 1024)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1334, file: !1122, line: 201, baseType: !941, size: 32, align: 32, offset: 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1334, file: !1122, line: 202, baseType: !1317, size: 64, align: 64, offset: 1152)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1334, file: !1122, line: 203, baseType: !941, size: 32, align: 32, offset: 1216)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1334, file: !1122, line: 205, baseType: !941, size: 32, align: 32, offset: 1248)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1334, file: !1122, line: 206, baseType: !941, size: 32, align: 32, offset: 1280)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1334, file: !1122, line: 209, baseType: !1293, size: 64, align: 64, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1334, file: !1122, line: 212, baseType: !1293, size: 64, align: 64, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1334, file: !1122, line: 213, baseType: !1317, size: 64, align: 64, offset: 1472)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1334, file: !1122, line: 215, baseType: !941, size: 32, align: 32, offset: 1536)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1334, file: !1122, line: 217, baseType: !941, size: 32, align: 32, offset: 1568)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1334, file: !1122, line: 220, baseType: !941, size: 32, align: 32, offset: 1600)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1057, file: !57, line: 1598, baseType: !926, size: 64, align: 64, offset: 384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1057, file: !57, line: 1606, baseType: !973, size: 64, align: 64, offset: 448)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1057, file: !57, line: 1614, baseType: !941, size: 32, align: 32, offset: 512)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1057, file: !57, line: 1622, baseType: !941, size: 32, align: 32, offset: 544)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1057, file: !57, line: 1628, baseType: !941, size: 32, align: 32, offset: 576)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !57, line: 1636, baseType: !941, size: 32, align: 32, offset: 608)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1057, file: !57, line: 1643, baseType: !941, size: 32, align: 32, offset: 640)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1057, file: !57, line: 1657, baseType: !1135, size: 64, align: 64, offset: 704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1057, file: !57, line: 1658, baseType: !941, size: 32, align: 32, offset: 768)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1057, file: !57, line: 1679, baseType: !979, size: 64, align: 32, offset: 800)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1057, file: !57, line: 1688, baseType: !941, size: 32, align: 32, offset: 864)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1057, file: !57, line: 1712, baseType: !941, size: 32, align: 32, offset: 896)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1057, file: !57, line: 1729, baseType: !941, size: 32, align: 32, offset: 928)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1057, file: !57, line: 1729, baseType: !941, size: 32, align: 32, offset: 960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1057, file: !57, line: 1744, baseType: !941, size: 32, align: 32, offset: 992)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1057, file: !57, line: 1744, baseType: !941, size: 32, align: 32, offset: 1024)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1057, file: !57, line: 1751, baseType: !941, size: 32, align: 32, offset: 1056)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1057, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1057, file: !57, line: 1791, baseType: !1481, size: 64, align: 64, offset: 1152)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1056, !1217, !1299, !941, !941, !941}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1057, file: !57, line: 1808, baseType: !1485, size: 64, align: 64, offset: 1216)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!516, !1056, !1078}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1057, file: !57, line: 1816, baseType: !941, size: 32, align: 32, offset: 1280)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1057, file: !57, line: 1825, baseType: !1490, size: 32, align: 32, offset: 1312)
!1490 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1057, file: !57, line: 1830, baseType: !941, size: 32, align: 32, offset: 1344)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1057, file: !57, line: 1838, baseType: !1490, size: 32, align: 32, offset: 1376)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1057, file: !57, line: 1846, baseType: !941, size: 32, align: 32, offset: 1408)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1057, file: !57, line: 1851, baseType: !941, size: 32, align: 32, offset: 1440)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1057, file: !57, line: 1861, baseType: !1490, size: 32, align: 32, offset: 1472)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1057, file: !57, line: 1868, baseType: !1490, size: 32, align: 32, offset: 1504)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1057, file: !57, line: 1875, baseType: !1490, size: 32, align: 32, offset: 1536)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1057, file: !57, line: 1882, baseType: !1490, size: 32, align: 32, offset: 1568)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1057, file: !57, line: 1889, baseType: !1490, size: 32, align: 32, offset: 1600)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1057, file: !57, line: 1896, baseType: !1490, size: 32, align: 32, offset: 1632)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1057, file: !57, line: 1903, baseType: !1490, size: 32, align: 32, offset: 1664)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1057, file: !57, line: 1910, baseType: !941, size: 32, align: 32, offset: 1696)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1057, file: !57, line: 1915, baseType: !941, size: 32, align: 32, offset: 1728)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1057, file: !57, line: 1926, baseType: !1299, size: 64, align: 64, offset: 1792)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1057, file: !57, line: 1935, baseType: !979, size: 64, align: 32, offset: 1856)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1057, file: !57, line: 1942, baseType: !941, size: 32, align: 32, offset: 1920)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1057, file: !57, line: 1948, baseType: !941, size: 32, align: 32, offset: 1952)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1057, file: !57, line: 1954, baseType: !941, size: 32, align: 32, offset: 1984)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1057, file: !57, line: 1960, baseType: !941, size: 32, align: 32, offset: 2016)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1057, file: !57, line: 1984, baseType: !941, size: 32, align: 32, offset: 2048)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1057, file: !57, line: 1991, baseType: !941, size: 32, align: 32, offset: 2080)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1057, file: !57, line: 1996, baseType: !941, size: 32, align: 32, offset: 2112)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1057, file: !57, line: 2004, baseType: !941, size: 32, align: 32, offset: 2144)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1057, file: !57, line: 2011, baseType: !941, size: 32, align: 32, offset: 2176)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1057, file: !57, line: 2018, baseType: !941, size: 32, align: 32, offset: 2208)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1057, file: !57, line: 2027, baseType: !941, size: 32, align: 32, offset: 2240)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1057, file: !57, line: 2034, baseType: !941, size: 32, align: 32, offset: 2272)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1057, file: !57, line: 2044, baseType: !941, size: 32, align: 32, offset: 2304)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1057, file: !57, line: 2054, baseType: !1520, size: 64, align: 64, offset: 2368)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1057, file: !57, line: 2061, baseType: !1520, size: 64, align: 64, offset: 2432)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1057, file: !57, line: 2066, baseType: !941, size: 32, align: 32, offset: 2496)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1057, file: !57, line: 2070, baseType: !941, size: 32, align: 32, offset: 2528)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1057, file: !57, line: 2078, baseType: !941, size: 32, align: 32, offset: 2560)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1057, file: !57, line: 2085, baseType: !941, size: 32, align: 32, offset: 2592)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1057, file: !57, line: 2092, baseType: !941, size: 32, align: 32, offset: 2624)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1057, file: !57, line: 2099, baseType: !941, size: 32, align: 32, offset: 2656)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1057, file: !57, line: 2106, baseType: !941, size: 32, align: 32, offset: 2688)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1057, file: !57, line: 2113, baseType: !941, size: 32, align: 32, offset: 2720)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1057, file: !57, line: 2120, baseType: !941, size: 32, align: 32, offset: 2752)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1057, file: !57, line: 2125, baseType: !941, size: 32, align: 32, offset: 2784)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1057, file: !57, line: 2133, baseType: !941, size: 32, align: 32, offset: 2816)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1057, file: !57, line: 2140, baseType: !941, size: 32, align: 32, offset: 2848)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1057, file: !57, line: 2145, baseType: !941, size: 32, align: 32, offset: 2880)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1057, file: !57, line: 2153, baseType: !941, size: 32, align: 32, offset: 2912)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1057, file: !57, line: 2158, baseType: !941, size: 32, align: 32, offset: 2944)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1057, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1057, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1057, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1057, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1057, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1057, file: !57, line: 2203, baseType: !941, size: 32, align: 32, offset: 3136)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1057, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1057, file: !57, line: 2212, baseType: !941, size: 32, align: 32, offset: 3200)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1057, file: !57, line: 2213, baseType: !941, size: 32, align: 32, offset: 3232)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1057, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1057, file: !57, line: 2232, baseType: !941, size: 32, align: 32, offset: 3296)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1057, file: !57, line: 2243, baseType: !941, size: 32, align: 32, offset: 3328)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1057, file: !57, line: 2249, baseType: !941, size: 32, align: 32, offset: 3360)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1057, file: !57, line: 2256, baseType: !941, size: 32, align: 32, offset: 3392)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1057, file: !57, line: 2263, baseType: !1089, size: 64, align: 64, offset: 3456)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1057, file: !57, line: 2270, baseType: !1089, size: 64, align: 64, offset: 3520)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1057, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1057, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1057, file: !57, line: 2367, baseType: !1556, size: 64, align: 64, offset: 3648)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{!941, !1056, !1317, !941}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1057, file: !57, line: 2383, baseType: !941, size: 32, align: 32, offset: 3712)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1057, file: !57, line: 2386, baseType: !1490, size: 32, align: 32, offset: 3744)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1057, file: !57, line: 2387, baseType: !1490, size: 32, align: 32, offset: 3776)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1057, file: !57, line: 2394, baseType: !941, size: 32, align: 32, offset: 3808)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1057, file: !57, line: 2401, baseType: !941, size: 32, align: 32, offset: 3840)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1057, file: !57, line: 2408, baseType: !941, size: 32, align: 32, offset: 3872)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1057, file: !57, line: 2415, baseType: !941, size: 32, align: 32, offset: 3904)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1057, file: !57, line: 2422, baseType: !941, size: 32, align: 32, offset: 3936)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1057, file: !57, line: 2423, baseType: !1568, size: 64, align: 64, offset: 3968)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1571)
!1571 = !{!1572, !1573, !1574, !1575}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1570, file: !57, line: 827, baseType: !941, size: 32, align: 32)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1570, file: !57, line: 828, baseType: !941, size: 32, align: 32, offset: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1570, file: !57, line: 829, baseType: !941, size: 32, align: 32, offset: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1570, file: !57, line: 830, baseType: !1490, size: 32, align: 32, offset: 96)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1057, file: !57, line: 2430, baseType: !973, size: 64, align: 64, offset: 4032)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1057, file: !57, line: 2437, baseType: !973, size: 64, align: 64, offset: 4096)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1057, file: !57, line: 2444, baseType: !1490, size: 32, align: 32, offset: 4160)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1057, file: !57, line: 2451, baseType: !1490, size: 32, align: 32, offset: 4192)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1057, file: !57, line: 2458, baseType: !941, size: 32, align: 32, offset: 4224)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1057, file: !57, line: 2469, baseType: !941, size: 32, align: 32, offset: 4256)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1057, file: !57, line: 2475, baseType: !941, size: 32, align: 32, offset: 4288)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1057, file: !57, line: 2481, baseType: !941, size: 32, align: 32, offset: 4320)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1057, file: !57, line: 2485, baseType: !941, size: 32, align: 32, offset: 4352)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1057, file: !57, line: 2489, baseType: !941, size: 32, align: 32, offset: 4384)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1057, file: !57, line: 2493, baseType: !941, size: 32, align: 32, offset: 4416)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1057, file: !57, line: 2501, baseType: !941, size: 32, align: 32, offset: 4448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1057, file: !57, line: 2506, baseType: !941, size: 32, align: 32, offset: 4480)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1057, file: !57, line: 2510, baseType: !941, size: 32, align: 32, offset: 4512)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1057, file: !57, line: 2514, baseType: !973, size: 64, align: 64, offset: 4544)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1057, file: !57, line: 2528, baseType: !1592, size: 64, align: 64, offset: 4608)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{null, !1056, !926, !941, !941}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1057, file: !57, line: 2534, baseType: !941, size: 32, align: 32, offset: 4672)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1057, file: !57, line: 2545, baseType: !941, size: 32, align: 32, offset: 4704)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1057, file: !57, line: 2547, baseType: !941, size: 32, align: 32, offset: 4736)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1057, file: !57, line: 2549, baseType: !941, size: 32, align: 32, offset: 4768)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1057, file: !57, line: 2551, baseType: !941, size: 32, align: 32, offset: 4800)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1057, file: !57, line: 2553, baseType: !941, size: 32, align: 32, offset: 4832)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1057, file: !57, line: 2555, baseType: !941, size: 32, align: 32, offset: 4864)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1057, file: !57, line: 2557, baseType: !941, size: 32, align: 32, offset: 4896)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1057, file: !57, line: 2559, baseType: !941, size: 32, align: 32, offset: 4928)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1057, file: !57, line: 2563, baseType: !941, size: 32, align: 32, offset: 4960)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1057, file: !57, line: 2571, baseType: !1175, size: 64, align: 64, offset: 4992)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1057, file: !57, line: 2579, baseType: !1175, size: 64, align: 64, offset: 5056)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1057, file: !57, line: 2586, baseType: !941, size: 32, align: 32, offset: 5120)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1057, file: !57, line: 2615, baseType: !941, size: 32, align: 32, offset: 5152)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1057, file: !57, line: 2627, baseType: !941, size: 32, align: 32, offset: 5184)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1057, file: !57, line: 2637, baseType: !941, size: 32, align: 32, offset: 5216)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1057, file: !57, line: 2681, baseType: !941, size: 32, align: 32, offset: 5248)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1057, file: !57, line: 2709, baseType: !973, size: 64, align: 64, offset: 5312)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1057, file: !57, line: 2716, baseType: !1614, size: 64, align: 64, offset: 5376)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1616)
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1617)
!1617 = !{!1618, !1619, !1620, !1621, !1622, !1623, !1624, !1628, !1632, !1633, !1634, !1635, !1640, !1641, !1642, !1643, !1644}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1616, file: !57, line: 3642, baseType: !953, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1616, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1616, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1616, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1616, file: !57, line: 3669, baseType: !941, size: 32, align: 32, offset: 160)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1616, file: !57, line: 3682, baseType: !1314, size: 64, align: 64, offset: 192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1616, file: !57, line: 3698, baseType: !1625, size: 64, align: 64, offset: 256)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!941, !1109, !1043, !932}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1616, file: !57, line: 3712, baseType: !1629, size: 64, align: 64, offset: 320)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!941, !1109, !941, !1043, !932}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1616, file: !57, line: 3726, baseType: !1625, size: 64, align: 64, offset: 384)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1616, file: !57, line: 3737, baseType: !1106, size: 64, align: 64, offset: 448)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1616, file: !57, line: 3746, baseType: !941, size: 32, align: 32, offset: 512)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1616, file: !57, line: 3757, baseType: !1636, size: 64, align: 64, offset: 576)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1639}
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1616, file: !57, line: 3766, baseType: !1106, size: 64, align: 64, offset: 640)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1616, file: !57, line: 3774, baseType: !1106, size: 64, align: 64, offset: 704)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1616, file: !57, line: 3780, baseType: !941, size: 32, align: 32, offset: 768)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1616, file: !57, line: 3785, baseType: !941, size: 32, align: 32, offset: 800)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1616, file: !57, line: 3795, baseType: !1645, size: 64, align: 64, offset: 832)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!941, !1109, !1188}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1057, file: !57, line: 2728, baseType: !926, size: 64, align: 64, offset: 5440)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1057, file: !57, line: 2735, baseType: !1241, size: 512, align: 64, offset: 5504)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1057, file: !57, line: 2742, baseType: !941, size: 32, align: 32, offset: 6016)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1057, file: !57, line: 2755, baseType: !941, size: 32, align: 32, offset: 6048)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1057, file: !57, line: 2776, baseType: !941, size: 32, align: 32, offset: 6080)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1057, file: !57, line: 2783, baseType: !941, size: 32, align: 32, offset: 6112)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1057, file: !57, line: 2791, baseType: !941, size: 32, align: 32, offset: 6144)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1057, file: !57, line: 2802, baseType: !1317, size: 64, align: 64, offset: 6208)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1057, file: !57, line: 2811, baseType: !941, size: 32, align: 32, offset: 6272)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1057, file: !57, line: 2821, baseType: !941, size: 32, align: 32, offset: 6304)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1057, file: !57, line: 2830, baseType: !941, size: 32, align: 32, offset: 6336)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1057, file: !57, line: 2840, baseType: !941, size: 32, align: 32, offset: 6368)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1057, file: !57, line: 2851, baseType: !1661, size: 64, align: 64, offset: 6400)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!941, !1056, !1664, !926, !1299, !941, !941}
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!941, !1056, !926}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1057, file: !57, line: 2871, baseType: !1668, size: 64, align: 64, offset: 6464)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!941, !1056, !1671, !926, !1299, !941}
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!941, !1056, !926, !941, !941}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1057, file: !57, line: 2878, baseType: !941, size: 32, align: 32, offset: 6528)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1057, file: !57, line: 2885, baseType: !941, size: 32, align: 32, offset: 6560)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1057, file: !57, line: 3005, baseType: !941, size: 32, align: 32, offset: 6592)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1057, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1057, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1057, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1057, file: !57, line: 3037, baseType: !1135, size: 64, align: 64, offset: 6720)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1057, file: !57, line: 3038, baseType: !941, size: 32, align: 32, offset: 6784)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1057, file: !57, line: 3050, baseType: !1089, size: 64, align: 64, offset: 6848)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1057, file: !57, line: 3065, baseType: !941, size: 32, align: 32, offset: 6912)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1057, file: !57, line: 3083, baseType: !941, size: 32, align: 32, offset: 6944)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1057, file: !57, line: 3092, baseType: !979, size: 64, align: 32, offset: 6976)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1057, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1057, file: !57, line: 3106, baseType: !979, size: 64, align: 32, offset: 7072)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1057, file: !57, line: 3113, baseType: !1689, size: 64, align: 64, offset: 7168)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1691)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1692)
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1693)
!1693 = !{!1694, !1695, !1696, !1697, !1698, !1699, !1702}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1692, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1692, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1692, file: !57, line: 720, baseType: !953, size: 64, align: 64, offset: 64)
