; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vp9_superframe_split_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vp9_superframe_split_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }

!567 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !614, !615, !619, !620, !621, !617}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !612, line: 40, baseType: !613)
!612 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!613 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !612, line: 48, baseType: !618)
!618 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!619 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!620 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !624, line: 221, size: 32, align: 8, elements: !625)
!624 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !623, file: !624, line: 221, baseType: !627, size: 32, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !612, line: 51, baseType: !620)
!628 = !{!629}
!629 = distinct !DIGlobalVariable(name: "ff_vp9_superframe_split_bsf", scope: !0, file: !630, line: 158, type: !631, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_vp9_superframe_split_bsf)
!630 = !DIFile(filename: "libavcodec/vp9_superframe_split_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !634)
!634 = !{!635, !639, !642, !683, !684, !747, !785, !789}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !4, line: 5797, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !633, file: !4, line: 5804, baseType: !640, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !633, file: !4, line: 5815, baseType: !643, size: 64, align: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !647)
!647 = !{!648, !649, !653, !657, !658, !659, !660, !664, !670, !672, !676}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !646, file: !464, line: 72, baseType: !636, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !646, file: !464, line: 78, baseType: !650, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!636, !614}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !646, file: !464, line: 85, baseType: !654, size: 64, align: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !646, file: !464, line: 93, baseType: !619, size: 32, align: 32, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !646, file: !464, line: 99, baseType: !619, size: 32, align: 32, offset: 224)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !646, file: !464, line: 108, baseType: !619, size: 32, align: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !646, file: !464, line: 113, baseType: !661, size: 64, align: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!614, !614, !614}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !646, file: !464, line: 123, baseType: !665, size: 64, align: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !646, file: !464, line: 130, baseType: !671, size: 32, align: 32, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !646, file: !464, line: 136, baseType: !673, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!671, !614}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !646, file: !464, line: 142, baseType: !677, size: 64, align: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!619, !680, !614, !636, !619}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !633, file: !4, line: 5825, baseType: !619, size: 32, align: 32, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !633, file: !4, line: 5826, baseType: !685, size: 64, align: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!619, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !691)
!691 = !{!692, !693, !696, !700, !701, !744, !745, !746}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !690, file: !4, line: 5751, baseType: !643, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !690, file: !4, line: 5756, baseType: !694, size: 64, align: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !690, file: !4, line: 5762, baseType: !697, size: 64, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !699)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !690, file: !4, line: 5768, baseType: !614, size: 64, align: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !690, file: !4, line: 5775, baseType: !702, size: 64, align: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !705)
!705 = !{!706, !707, !708, !709, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !727, !728, !729, !730, !731, !732, !733, !734, !737, !738, !739, !740, !741, !742, !743}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !704, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !704, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !704, file: !4, line: 3948, baseType: !627, size: 32, align: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !704, file: !4, line: 3958, baseType: !710, size: 64, align: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !704, file: !4, line: 3962, baseType: !619, size: 32, align: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !704, file: !4, line: 3968, baseType: !619, size: 32, align: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !704, file: !4, line: 3973, baseType: !611, size: 64, align: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !704, file: !4, line: 3986, baseType: !619, size: 32, align: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !704, file: !4, line: 3999, baseType: !619, size: 32, align: 32, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !704, file: !4, line: 4004, baseType: !619, size: 32, align: 32, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !704, file: !4, line: 4005, baseType: !619, size: 32, align: 32, offset: 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !704, file: !4, line: 4010, baseType: !619, size: 32, align: 32, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !704, file: !4, line: 4011, baseType: !619, size: 32, align: 32, offset: 480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !704, file: !4, line: 4020, baseType: !721, size: 64, align: 32, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !722, line: 61, baseType: !723)
!722 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !722, line: 58, size: 64, align: 32, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !723, file: !722, line: 59, baseType: !619, size: 32, align: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !723, file: !722, line: 60, baseType: !619, size: 32, align: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !704, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !704, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !704, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !704, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !704, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !704, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !704, file: !4, line: 4039, baseType: !619, size: 32, align: 32, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !704, file: !4, line: 4046, baseType: !735, size: 64, align: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !612, line: 55, baseType: !736)
!736 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !704, file: !4, line: 4050, baseType: !619, size: 32, align: 32, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !704, file: !4, line: 4054, baseType: !619, size: 32, align: 32, offset: 928)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !704, file: !4, line: 4061, baseType: !619, size: 32, align: 32, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !704, file: !4, line: 4065, baseType: !619, size: 32, align: 32, offset: 992)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !704, file: !4, line: 4073, baseType: !619, size: 32, align: 32, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !704, file: !4, line: 4080, baseType: !619, size: 32, align: 32, offset: 1056)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !704, file: !4, line: 4084, baseType: !619, size: 32, align: 32, offset: 1088)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !690, file: !4, line: 5781, baseType: !702, size: 64, align: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !690, file: !4, line: 5787, baseType: !721, size: 64, align: 32, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !690, file: !4, line: 5793, baseType: !721, size: 64, align: 32, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !633, file: !4, line: 5827, baseType: !748, size: 64, align: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!619, !688, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !754)
!754 = !{!755, !767, !768, !769, !770, !771, !772, !773, !781, !782, !783, !784}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !753, file: !4, line: 1451, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !758, line: 94, baseType: !759)
!758 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !758, line: 81, size: 192, align: 64, elements: !760)
!760 = !{!761, !765, !766}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !759, file: !758, line: 82, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !758, line: 73, baseType: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !758, line: 73, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !758, line: 89, baseType: !710, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !758, line: 93, baseType: !619, size: 32, align: 32, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !753, file: !4, line: 1461, baseType: !611, size: 64, align: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !753, file: !4, line: 1467, baseType: !611, size: 64, align: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !4, line: 1468, baseType: !710, size: 64, align: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !4, line: 1469, baseType: !619, size: 32, align: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !753, file: !4, line: 1470, baseType: !619, size: 32, align: 32, offset: 288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !4, line: 1474, baseType: !619, size: 32, align: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !753, file: !4, line: 1479, baseType: !774, size: 64, align: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !776, file: !4, line: 1412, baseType: !710, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !776, file: !4, line: 1413, baseType: !619, size: 32, align: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !753, file: !4, line: 1480, baseType: !619, size: 32, align: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !753, file: !4, line: 1486, baseType: !611, size: 64, align: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !753, file: !4, line: 1488, baseType: !611, size: 64, align: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !753, file: !4, line: 1497, baseType: !611, size: 64, align: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !633, file: !4, line: 5828, baseType: !786, size: 64, align: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !688}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !633, file: !4, line: 5829, baseType: !786, size: 64, align: 64, offset: 448)
!790 = !{i32 2, !"Dwarf Version", i32 4}
!791 = !{i32 2, !"Debug Info Version", i32 3}
!792 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!793 = distinct !DISubprogram(name: "vp9_superframe_split_init", scope: !630, file: !630, line: 135, type: !686, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !794)
!794 = !{}
!795 = !DILocalVariable(name: "ctx", arg: 1, scope: !793, file: !630, line: 135, type: !688)
!796 = !DIExpression()
!797 = !DILocation(line: 135, column: 52, scope: !793)
!798 = !DILocalVariable(name: "s", scope: !793, file: !630, line: 137, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9SFSplitContext", file: !630, line: 39, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9SFSplitContext", file: !630, line: 32, size: 448, align: 64, elements: !802)
!802 = !{!803, !804, !805, !806, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !801, file: !630, line: 33, baseType: !751, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !801, file: !630, line: 35, baseType: !619, size: 32, align: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !801, file: !630, line: 36, baseType: !619, size: 32, align: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !801, file: !630, line: 37, baseType: !807, size: 64, align: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !808, line: 216, baseType: !736)
!808 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !801, file: !630, line: 38, baseType: !810, size: 256, align: 32, offset: 192)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 256, align: 32, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 8)
!813 = !DILocation(line: 137, column: 24, scope: !793)
!814 = !DILocation(line: 137, column: 28, scope: !793)
!815 = !DILocation(line: 137, column: 33, scope: !793)
!816 = !DILocation(line: 139, column: 21, scope: !793)
!817 = !DILocation(line: 139, column: 5, scope: !793)
!818 = !DILocation(line: 139, column: 8, scope: !793)
!819 = !DILocation(line: 139, column: 19, scope: !793)
!820 = !DILocation(line: 140, column: 10, scope: !821)
!821 = distinct !DILexicalBlock(scope: !793, file: !630, line: 140, column: 9)
!822 = !DILocation(line: 140, column: 13, scope: !821)
!823 = !DILocation(line: 140, column: 9, scope: !793)
!824 = !DILocation(line: 141, column: 9, scope: !821)
!825 = !DILocation(line: 143, column: 5, scope: !793)
!826 = !DILocation(line: 144, column: 1, scope: !793)
!827 = distinct !DISubprogram(name: "vp9_superframe_split_filter", scope: !630, file: !630, line: 41, type: !749, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !794)
!828 = !DILocalVariable(name: "b", arg: 1, scope: !829, file: !830, line: 95, type: !833)
!829 = distinct !DISubprogram(name: "bytestream_get_byte", scope: !830, file: !830, line: 95, type: !831, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !794)
!830 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!831 = !DISubroutineType(types: !832)
!832 = !{!620, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!834 = !DILocation(line: 95, column: 95, scope: !829, inlinedAt: !835)
!835 = distinct !DILocation(line: 95, column: 855, scope: !836, inlinedAt: !846)
!836 = distinct !DISubprogram(name: "bytestream2_get_byteu", scope: !830, file: !830, line: 95, type: !837, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !794)
!837 = !DISubroutineType(types: !838)
!838 = !{!620, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !830, line: 35, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !830, line: 33, size: 192, align: 64, elements: !842)
!842 = !{!843, !844, !845}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !841, file: !830, line: 34, baseType: !615, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !841, file: !830, line: 34, baseType: !615, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !841, file: !830, line: 34, baseType: !615, size: 64, align: 64, offset: 128)
!846 = distinct !DILocation(line: 95, column: 1073, scope: !847, inlinedAt: !849)
!847 = !DILexicalBlockFile(scope: !848, file: !830, discriminator: 2)
!848 = distinct !DISubprogram(name: "bytestream2_get_byte", scope: !830, file: !830, line: 95, type: !837, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !794)
!849 = distinct !DILocation(line: 70, column: 39, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !630, line: 69, column: 21)
!851 = distinct !DILexicalBlock(scope: !852, file: !630, line: 69, column: 21)
!852 = distinct !DILexicalBlock(scope: !853, file: !630, line: 67, column: 49)
!853 = distinct !DILexicalBlock(scope: !854, file: !630, line: 67, column: 17)
!854 = distinct !DILexicalBlock(scope: !855, file: !630, line: 67, column: 17)
!855 = distinct !DILexicalBlock(scope: !856, file: !630, line: 60, column: 82)
!856 = distinct !DILexicalBlock(scope: !857, file: !630, line: 60, column: 17)
!857 = distinct !DILexicalBlock(scope: !858, file: !630, line: 55, column: 38)
!858 = distinct !DILexicalBlock(scope: !859, file: !630, line: 55, column: 13)
!859 = distinct !DILexicalBlock(scope: !860, file: !630, line: 48, column: 31)
!860 = distinct !DILexicalBlock(scope: !827, file: !630, line: 48, column: 9)
!861 = !DILocalVariable(name: "g", arg: 1, scope: !836, file: !830, line: 95, type: !839)
!862 = !DILocation(line: 95, column: 843, scope: !836, inlinedAt: !846)
!863 = !DILocalVariable(name: "g", arg: 1, scope: !848, file: !830, line: 95, type: !839)
!864 = !DILocation(line: 95, column: 985, scope: !848, inlinedAt: !849)
!865 = !DILocalVariable(name: "g", arg: 1, scope: !866, file: !830, line: 133, type: !839)
!866 = distinct !DISubprogram(name: "bytestream2_init", scope: !830, file: !830, line: 133, type: !867, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !794)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !839, !615, !619}
!869 = !DILocation(line: 133, column: 84, scope: !866, inlinedAt: !870)
!870 = distinct !DILocation(line: 64, column: 17, scope: !855)
!871 = !DILocalVariable(name: "buf", arg: 2, scope: !866, file: !830, line: 134, type: !615)
!872 = !DILocation(line: 134, column: 62, scope: !866, inlinedAt: !870)
!873 = !DILocalVariable(name: "buf_size", arg: 3, scope: !866, file: !830, line: 135, type: !619)
!874 = !DILocation(line: 135, column: 51, scope: !866, inlinedAt: !870)
!875 = !DILocalVariable(name: "ctx", arg: 1, scope: !827, file: !630, line: 41, type: !688)
!876 = !DILocation(line: 41, column: 54, scope: !827)
!877 = !DILocalVariable(name: "out", arg: 2, scope: !827, file: !630, line: 41, type: !751)
!878 = !DILocation(line: 41, column: 69, scope: !827)
!879 = !DILocalVariable(name: "s", scope: !827, file: !630, line: 43, type: !799)
!880 = !DILocation(line: 43, column: 24, scope: !827)
!881 = !DILocation(line: 43, column: 28, scope: !827)
!882 = !DILocation(line: 43, column: 33, scope: !827)
!883 = !DILocalVariable(name: "in", scope: !827, file: !630, line: 44, type: !751)
!884 = !DILocation(line: 44, column: 15, scope: !827)
!885 = !DILocalVariable(name: "i", scope: !827, file: !630, line: 45, type: !619)
!886 = !DILocation(line: 45, column: 9, scope: !827)
!887 = !DILocalVariable(name: "j", scope: !827, file: !630, line: 45, type: !619)
!888 = !DILocation(line: 45, column: 12, scope: !827)
!889 = !DILocalVariable(name: "ret", scope: !827, file: !630, line: 45, type: !619)
!890 = !DILocation(line: 45, column: 15, scope: !827)
!891 = !DILocalVariable(name: "marker", scope: !827, file: !630, line: 45, type: !619)
!892 = !DILocation(line: 45, column: 20, scope: !827)
!893 = !DILocalVariable(name: "is_superframe", scope: !827, file: !630, line: 46, type: !619)
!894 = !DILocation(line: 46, column: 9, scope: !827)
!895 = !DILocation(line: 46, column: 27, scope: !827)
!896 = !DILocation(line: 46, column: 30, scope: !827)
!897 = !DILocation(line: 46, column: 42, scope: !827)
!898 = !DILocation(line: 46, column: 26, scope: !827)
!899 = !DILocation(line: 46, column: 25, scope: !827)
!900 = !DILocation(line: 48, column: 10, scope: !860)
!901 = !DILocation(line: 48, column: 13, scope: !860)
!902 = !DILocation(line: 48, column: 25, scope: !860)
!903 = !DILocation(line: 48, column: 9, scope: !827)
!904 = !DILocation(line: 49, column: 37, scope: !859)
!905 = !DILocation(line: 49, column: 42, scope: !859)
!906 = !DILocation(line: 49, column: 45, scope: !859)
!907 = !DILocation(line: 49, column: 15, scope: !859)
!908 = !DILocation(line: 49, column: 13, scope: !859)
!909 = !DILocation(line: 50, column: 13, scope: !910)
!910 = distinct !DILexicalBlock(scope: !859, file: !630, line: 50, column: 13)
!911 = !DILocation(line: 50, column: 17, scope: !910)
!912 = !DILocation(line: 50, column: 13, scope: !859)
!913 = !DILocation(line: 51, column: 20, scope: !910)
!914 = !DILocation(line: 51, column: 13, scope: !910)
!915 = !DILocation(line: 52, column: 14, scope: !859)
!916 = !DILocation(line: 52, column: 17, scope: !859)
!917 = !DILocation(line: 52, column: 12, scope: !859)
!918 = !DILocation(line: 54, column: 27, scope: !859)
!919 = !DILocation(line: 54, column: 31, scope: !859)
!920 = !DILocation(line: 54, column: 36, scope: !859)
!921 = !DILocation(line: 54, column: 18, scope: !859)
!922 = !DILocation(line: 54, column: 22, scope: !859)
!923 = !DILocation(line: 54, column: 16, scope: !859)
!924 = !DILocation(line: 55, column: 14, scope: !858)
!925 = !DILocation(line: 55, column: 21, scope: !858)
!926 = !DILocation(line: 55, column: 29, scope: !858)
!927 = !DILocation(line: 55, column: 13, scope: !859)
!928 = !DILocalVariable(name: "length_size", scope: !857, file: !630, line: 56, type: !619)
!929 = !DILocation(line: 56, column: 17, scope: !857)
!930 = !DILocation(line: 56, column: 37, scope: !857)
!931 = !DILocation(line: 56, column: 44, scope: !857)
!932 = !DILocation(line: 56, column: 50, scope: !857)
!933 = !DILocation(line: 56, column: 33, scope: !857)
!934 = !DILocalVariable(name: "nb_frames", scope: !857, file: !630, line: 57, type: !619)
!935 = !DILocation(line: 57, column: 17, scope: !857)
!936 = !DILocation(line: 57, column: 34, scope: !857)
!937 = !DILocation(line: 57, column: 41, scope: !857)
!938 = !DILocation(line: 57, column: 31, scope: !857)
!939 = !DILocalVariable(name: "idx_size", scope: !857, file: !630, line: 58, type: !619)
!940 = !DILocation(line: 58, column: 17, scope: !857)
!941 = !DILocation(line: 58, column: 32, scope: !857)
!942 = !DILocation(line: 58, column: 44, scope: !857)
!943 = !DILocation(line: 58, column: 42, scope: !857)
!944 = !DILocation(line: 58, column: 30, scope: !857)
!945 = !DILocation(line: 60, column: 17, scope: !856)
!946 = !DILocation(line: 60, column: 21, scope: !856)
!947 = !DILocation(line: 60, column: 29, scope: !856)
!948 = !DILocation(line: 60, column: 26, scope: !856)
!949 = !DILocation(line: 60, column: 38, scope: !856)
!950 = !DILocation(line: 60, column: 50, scope: !951)
!951 = !DILexicalBlockFile(scope: !856, file: !630, discriminator: 1)
!952 = !DILocation(line: 60, column: 54, scope: !951)
!953 = !DILocation(line: 60, column: 61, scope: !951)
!954 = !DILocation(line: 60, column: 59, scope: !951)
!955 = !DILocation(line: 60, column: 41, scope: !951)
!956 = !DILocation(line: 60, column: 45, scope: !951)
!957 = !DILocation(line: 60, column: 74, scope: !951)
!958 = !DILocation(line: 60, column: 71, scope: !951)
!959 = !DILocation(line: 60, column: 17, scope: !951)
!960 = !DILocalVariable(name: "bc", scope: !855, file: !630, line: 61, type: !840)
!961 = !DILocation(line: 61, column: 32, scope: !855)
!962 = !DILocalVariable(name: "total_size", scope: !855, file: !630, line: 62, type: !611)
!963 = !DILocation(line: 62, column: 25, scope: !855)
!964 = !DILocation(line: 64, column: 39, scope: !855)
!965 = !DILocation(line: 64, column: 43, scope: !855)
!966 = !DILocation(line: 64, column: 50, scope: !855)
!967 = !DILocation(line: 64, column: 54, scope: !855)
!968 = !DILocation(line: 64, column: 48, scope: !855)
!969 = !DILocation(line: 64, column: 59, scope: !855)
!970 = !DILocation(line: 64, column: 65, scope: !855)
!971 = !DILocation(line: 64, column: 63, scope: !855)
!972 = !DILocation(line: 65, column: 34, scope: !855)
!973 = !DILocation(line: 65, column: 46, scope: !855)
!974 = !DILocation(line: 65, column: 44, scope: !855)
!975 = !DILocation(line: 64, column: 17, scope: !855)
!976 = !DILocation(line: 137, column: 16, scope: !977, inlinedAt: !870)
!977 = !DILexicalBlockFile(scope: !978, file: !830, discriminator: 1)
!978 = distinct !DILexicalBlock(scope: !979, file: !830, line: 137, column: 14)
!979 = distinct !DILexicalBlock(scope: !866, file: !830, line: 137, column: 8)
!980 = !DILocation(line: 137, column: 25, scope: !977, inlinedAt: !870)
!981 = !DILocation(line: 137, column: 14, scope: !977, inlinedAt: !870)
!982 = !DILocation(line: 137, column: 34, scope: !983, inlinedAt: !870)
!983 = !DILexicalBlockFile(scope: !984, file: !830, discriminator: 2)
!984 = distinct !DILexicalBlock(scope: !978, file: !830, line: 137, column: 32)
!985 = !DILocation(line: 137, column: 93, scope: !986, inlinedAt: !870)
!986 = !DILexicalBlockFile(scope: !983, file: !830, discriminator: 4)
!987 = !DILocation(line: 137, column: 93, scope: !983, inlinedAt: !870)
!988 = !DILocation(line: 138, column: 17, scope: !866, inlinedAt: !870)
!989 = !DILocation(line: 138, column: 5, scope: !866, inlinedAt: !870)
!990 = !DILocation(line: 138, column: 8, scope: !866, inlinedAt: !870)
!991 = !DILocation(line: 138, column: 15, scope: !866, inlinedAt: !870)
!992 = !DILocation(line: 139, column: 23, scope: !866, inlinedAt: !870)
!993 = !DILocation(line: 139, column: 5, scope: !866, inlinedAt: !870)
!994 = !DILocation(line: 139, column: 8, scope: !866, inlinedAt: !870)
!995 = !DILocation(line: 139, column: 21, scope: !866, inlinedAt: !870)
!996 = !DILocation(line: 140, column: 21, scope: !866, inlinedAt: !870)
!997 = !DILocation(line: 140, column: 27, scope: !866, inlinedAt: !870)
!998 = !DILocation(line: 140, column: 25, scope: !866, inlinedAt: !870)
!999 = !DILocation(line: 140, column: 5, scope: !866, inlinedAt: !870)
!1000 = !DILocation(line: 140, column: 8, scope: !866, inlinedAt: !870)
!1001 = !DILocation(line: 140, column: 19, scope: !866, inlinedAt: !870)
!1002 = !DILocation(line: 67, column: 24, scope: !854)
!1003 = !DILocation(line: 67, column: 22, scope: !854)
!1004 = !DILocation(line: 67, column: 29, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !853, file: !630, discriminator: 1)
!1006 = !DILocation(line: 67, column: 33, scope: !1005)
!1007 = !DILocation(line: 67, column: 31, scope: !1005)
!1008 = !DILocation(line: 67, column: 17, scope: !1005)
!1009 = !DILocalVariable(name: "frame_size", scope: !852, file: !630, line: 68, type: !619)
!1010 = !DILocation(line: 68, column: 25, scope: !852)
!1011 = !DILocation(line: 69, column: 28, scope: !851)
!1012 = !DILocation(line: 69, column: 26, scope: !851)
!1013 = !DILocation(line: 69, column: 33, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !850, file: !630, discriminator: 1)
!1015 = !DILocation(line: 69, column: 37, scope: !1014)
!1016 = !DILocation(line: 69, column: 35, scope: !1014)
!1017 = !DILocation(line: 69, column: 21, scope: !1014)
!1018 = !DILocation(line: 70, column: 39, scope: !850)
!1019 = !DILocation(line: 95, column: 994, scope: !1020, inlinedAt: !849)
!1020 = distinct !DILexicalBlock(scope: !848, file: !830, line: 95, column: 994)
!1021 = !DILocation(line: 95, column: 997, scope: !1020, inlinedAt: !849)
!1022 = !DILocation(line: 95, column: 1010, scope: !1020, inlinedAt: !849)
!1023 = !DILocation(line: 95, column: 1013, scope: !1020, inlinedAt: !849)
!1024 = !DILocation(line: 95, column: 1008, scope: !1020, inlinedAt: !849)
!1025 = !DILocation(line: 95, column: 1020, scope: !1020, inlinedAt: !849)
!1026 = !DILocation(line: 95, column: 994, scope: !848, inlinedAt: !849)
!1027 = !DILocation(line: 95, column: 1039, scope: !1028, inlinedAt: !849)
!1028 = !DILexicalBlockFile(scope: !1029, file: !830, discriminator: 1)
!1029 = distinct !DILexicalBlock(scope: !1020, file: !830, line: 95, column: 1025)
!1030 = !DILocation(line: 95, column: 1042, scope: !1028, inlinedAt: !849)
!1031 = !DILocation(line: 95, column: 1027, scope: !1028, inlinedAt: !849)
!1032 = !DILocation(line: 95, column: 1030, scope: !1028, inlinedAt: !849)
!1033 = !DILocation(line: 95, column: 1037, scope: !1028, inlinedAt: !849)
!1034 = !DILocation(line: 95, column: 1054, scope: !1028, inlinedAt: !849)
!1035 = !DILocation(line: 95, column: 1095, scope: !847, inlinedAt: !849)
!1036 = !DILocation(line: 95, column: 1073, scope: !847, inlinedAt: !849)
!1037 = !DILocation(line: 95, column: 876, scope: !836, inlinedAt: !846)
!1038 = !DILocation(line: 95, column: 879, scope: !836, inlinedAt: !846)
!1039 = !DILocation(line: 95, column: 855, scope: !836, inlinedAt: !846)
!1040 = !DILocation(line: 95, column: 102, scope: !829, inlinedAt: !835)
!1041 = !DILocation(line: 95, column: 105, scope: !829, inlinedAt: !835)
!1042 = !DILocation(line: 95, column: 138, scope: !829, inlinedAt: !835)
!1043 = !DILocation(line: 95, column: 137, scope: !829, inlinedAt: !835)
!1044 = !DILocation(line: 95, column: 140, scope: !829, inlinedAt: !835)
!1045 = !DILocation(line: 95, column: 119, scope: !829, inlinedAt: !835)
!1046 = !DILocation(line: 95, column: 118, scope: !829, inlinedAt: !835)
!1047 = !DILocation(line: 95, column: 1066, scope: !847, inlinedAt: !849)
!1048 = !DILocation(line: 95, column: 1099, scope: !1049, inlinedAt: !849)
!1049 = !DILexicalBlockFile(scope: !848, file: !830, discriminator: 3)
!1050 = !DILocation(line: 70, column: 69, scope: !850)
!1051 = !DILocation(line: 70, column: 71, scope: !850)
!1052 = !DILocation(line: 70, column: 65, scope: !850)
!1053 = !DILocation(line: 70, column: 36, scope: !850)
!1054 = !DILocation(line: 70, column: 25, scope: !850)
!1055 = !DILocation(line: 69, column: 51, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !850, file: !630, discriminator: 2)
!1057 = !DILocation(line: 69, column: 21, scope: !1056)
!1058 = distinct !{!1058, !1059}
!1059 = !DILocation(line: 69, column: 21, scope: !852)
!1060 = !DILocation(line: 72, column: 35, scope: !852)
!1061 = !DILocation(line: 72, column: 32, scope: !852)
!1062 = !DILocation(line: 73, column: 25, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !852, file: !630, line: 73, column: 25)
!1064 = !DILocation(line: 73, column: 36, scope: !1063)
!1065 = !DILocation(line: 73, column: 40, scope: !1063)
!1066 = !DILocation(line: 73, column: 43, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1063, file: !630, discriminator: 1)
!1068 = !DILocation(line: 73, column: 56, scope: !1067)
!1069 = !DILocation(line: 73, column: 60, scope: !1067)
!1070 = !DILocation(line: 73, column: 67, scope: !1067)
!1071 = !DILocation(line: 73, column: 65, scope: !1067)
!1072 = !DILocation(line: 73, column: 54, scope: !1067)
!1073 = !DILocation(line: 73, column: 25, scope: !1067)
!1074 = !DILocation(line: 74, column: 32, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1063, file: !630, line: 73, column: 77)
!1076 = !DILocation(line: 75, column: 76, scope: !1075)
!1077 = !DILocation(line: 74, column: 25, scope: !1075)
!1078 = !DILocation(line: 76, column: 29, scope: !1075)
!1079 = !DILocation(line: 77, column: 25, scope: !1075)
!1080 = !DILocation(line: 79, column: 35, scope: !852)
!1081 = !DILocation(line: 79, column: 30, scope: !852)
!1082 = !DILocation(line: 79, column: 21, scope: !852)
!1083 = !DILocation(line: 79, column: 24, scope: !852)
!1084 = !DILocation(line: 79, column: 33, scope: !852)
!1085 = !DILocation(line: 80, column: 17, scope: !852)
!1086 = !DILocation(line: 67, column: 45, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !853, file: !630, discriminator: 2)
!1088 = !DILocation(line: 67, column: 17, scope: !1087)
!1089 = distinct !{!1089, !1090}
!1090 = !DILocation(line: 67, column: 17, scope: !855)
!1091 = !DILocation(line: 81, column: 32, scope: !855)
!1092 = !DILocation(line: 81, column: 17, scope: !855)
!1093 = !DILocation(line: 81, column: 20, scope: !855)
!1094 = !DILocation(line: 81, column: 30, scope: !855)
!1095 = !DILocation(line: 82, column: 17, scope: !855)
!1096 = !DILocation(line: 82, column: 20, scope: !855)
!1097 = !DILocation(line: 82, column: 31, scope: !855)
!1098 = !DILocation(line: 83, column: 17, scope: !855)
!1099 = !DILocation(line: 83, column: 20, scope: !855)
!1100 = !DILocation(line: 83, column: 38, scope: !855)
!1101 = !DILocation(line: 84, column: 31, scope: !855)
!1102 = !DILocation(line: 85, column: 13, scope: !855)
!1103 = !DILocation(line: 86, column: 9, scope: !857)
!1104 = !DILocation(line: 87, column: 5, scope: !859)
!1105 = !DILocation(line: 89, column: 9, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !827, file: !630, line: 89, column: 9)
!1107 = !DILocation(line: 89, column: 9, scope: !827)
!1108 = !DILocalVariable(name: "gb", scope: !1109, file: !630, line: 90, type: !1110)
!1109 = distinct !DILexicalBlock(scope: !1106, file: !630, line: 89, column: 24)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1111, line: 70, baseType: !1112)
!1111 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1111, line: 61, size: 256, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1112, file: !1111, line: 62, baseType: !615, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1112, file: !1111, line: 62, baseType: !615, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1112, file: !1111, line: 67, baseType: !619, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1112, file: !1111, line: 68, baseType: !619, size: 32, align: 32, offset: 160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1112, file: !1111, line: 69, baseType: !619, size: 32, align: 32, offset: 192)
!1119 = !DILocation(line: 90, column: 23, scope: !1109)
!1120 = !DILocalVariable(name: "profile", scope: !1109, file: !630, line: 91, type: !619)
!1121 = !DILocation(line: 91, column: 13, scope: !1109)
!1122 = !DILocalVariable(name: "invisible", scope: !1109, file: !630, line: 91, type: !619)
!1123 = !DILocation(line: 91, column: 22, scope: !1109)
!1124 = !DILocation(line: 93, column: 29, scope: !1109)
!1125 = !DILocation(line: 93, column: 34, scope: !1109)
!1126 = !DILocation(line: 93, column: 37, scope: !1109)
!1127 = !DILocation(line: 93, column: 15, scope: !1109)
!1128 = !DILocation(line: 93, column: 13, scope: !1109)
!1129 = !DILocation(line: 94, column: 13, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1109, file: !630, line: 94, column: 13)
!1131 = !DILocation(line: 94, column: 17, scope: !1130)
!1132 = !DILocation(line: 94, column: 13, scope: !1109)
!1133 = !DILocation(line: 95, column: 13, scope: !1130)
!1134 = !DILocation(line: 97, column: 22, scope: !1109)
!1135 = !DILocation(line: 97, column: 25, scope: !1109)
!1136 = !DILocation(line: 97, column: 9, scope: !1109)
!1137 = !DILocation(line: 97, column: 14, scope: !1109)
!1138 = !DILocation(line: 97, column: 19, scope: !1109)
!1139 = !DILocation(line: 98, column: 30, scope: !1109)
!1140 = !DILocation(line: 98, column: 33, scope: !1109)
!1141 = !DILocation(line: 98, column: 21, scope: !1109)
!1142 = !DILocation(line: 98, column: 24, scope: !1109)
!1143 = !DILocation(line: 98, column: 9, scope: !1109)
!1144 = !DILocation(line: 98, column: 14, scope: !1109)
!1145 = !DILocation(line: 98, column: 19, scope: !1109)
!1146 = !DILocation(line: 100, column: 33, scope: !1109)
!1147 = !DILocation(line: 100, column: 38, scope: !1109)
!1148 = !DILocation(line: 100, column: 9, scope: !1109)
!1149 = !DILocation(line: 100, column: 12, scope: !1109)
!1150 = !DILocation(line: 100, column: 30, scope: !1109)
!1151 = !DILocation(line: 101, column: 9, scope: !1109)
!1152 = !DILocation(line: 101, column: 12, scope: !1109)
!1153 = !DILocation(line: 101, column: 22, scope: !1109)
!1154 = !DILocation(line: 103, column: 13, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1109, file: !630, line: 103, column: 13)
!1156 = !DILocation(line: 103, column: 16, scope: !1155)
!1157 = !DILocation(line: 103, column: 30, scope: !1155)
!1158 = !DILocation(line: 103, column: 33, scope: !1155)
!1159 = !DILocation(line: 103, column: 27, scope: !1155)
!1160 = !DILocation(line: 103, column: 13, scope: !1109)
!1161 = !DILocation(line: 104, column: 29, scope: !1155)
!1162 = !DILocation(line: 104, column: 32, scope: !1155)
!1163 = !DILocation(line: 104, column: 13, scope: !1155)
!1164 = !DILocation(line: 106, column: 35, scope: !1109)
!1165 = !DILocation(line: 106, column: 40, scope: !1109)
!1166 = !DILocation(line: 106, column: 46, scope: !1109)
!1167 = !DILocation(line: 106, column: 51, scope: !1109)
!1168 = !DILocation(line: 106, column: 15, scope: !1109)
!1169 = !DILocation(line: 106, column: 13, scope: !1109)
!1170 = !DILocation(line: 107, column: 13, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1109, file: !630, line: 107, column: 13)
!1172 = !DILocation(line: 107, column: 17, scope: !1171)
!1173 = !DILocation(line: 107, column: 13, scope: !1109)
!1174 = !DILocation(line: 108, column: 13, scope: !1171)
!1175 = !DILocation(line: 110, column: 9, scope: !1109)
!1176 = !DILocation(line: 111, column: 19, scope: !1109)
!1177 = !DILocation(line: 111, column: 17, scope: !1109)
!1178 = !DILocation(line: 112, column: 20, scope: !1109)
!1179 = !DILocation(line: 112, column: 35, scope: !1109)
!1180 = !DILocation(line: 112, column: 17, scope: !1109)
!1181 = !DILocation(line: 113, column: 13, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1109, file: !630, line: 113, column: 13)
!1183 = !DILocation(line: 113, column: 21, scope: !1182)
