; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ffv1dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ffv1dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }

!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 49, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920}
!912 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!913 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!914 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!915 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!916 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!917 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!918 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!919 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!920 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!921 = !{!922, !923, !924, !925, !933, !937, !940, !942, !943, !944, !947, !935, !931, !948, !950}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!923 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !928, line: 221, size: 32, align: 8, elements: !929)
!928 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !927, file: !928, line: 221, baseType: !931, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !932, line: 51, baseType: !924)
!932 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !932, line: 48, baseType: !936)
!936 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !938, line: 197, baseType: !939)
!938 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!939 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !932, line: 55, baseType: !941)
!941 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!942 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !932, line: 49, baseType: !946)
!946 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !938, line: 194, baseType: !949)
!949 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!951 = !{!952}
!952 = distinct !DIGlobalVariable(name: "ff_ffv1_decoder", scope: !0, file: !953, line: 1087, type: !954, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_ffv1_decoder)
!953 = !DIFile(filename: "libavcodec/ffv1dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !956)
!956 = !{!957, !961, !962, !963, !964, !965, !974, !977, !980, !983, !986, !987, !1059, !1067, !1068, !1069, !1071, !1615, !1621, !1629, !1633, !1634, !1671, !1675, !1679, !1680, !1684, !1688, !1689, !1693, !1694, !1695}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !14, line: 3475, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !955, file: !14, line: 3480, baseType: !958, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !955, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !955, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !955, file: !14, line: 3487, baseType: !923, size: 32, align: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !955, file: !14, line: 3488, baseType: !966, size: 64, align: 64, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !969, line: 61, baseType: !970)
!969 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !969, line: 58, size: 64, align: 32, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !970, file: !969, line: 59, baseType: !923, size: 32, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !970, file: !969, line: 60, baseType: !923, size: 32, align: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !955, file: !14, line: 3489, baseType: !975, size: 64, align: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !955, file: !14, line: 3490, baseType: !978, size: 64, align: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !955, file: !14, line: 3491, baseType: !981, size: 64, align: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !955, file: !14, line: 3492, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !955, file: !14, line: 3493, baseType: !935, size: 8, align: 8, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !955, file: !14, line: 3494, baseType: !988, size: 64, align: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !992)
!992 = !{!993, !994, !998, !1018, !1019, !1020, !1021, !1025, !1031, !1033, !1037}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !991, file: !713, line: 72, baseType: !958, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !991, file: !713, line: 78, baseType: !995, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!958, !922}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !991, file: !713, line: 85, baseType: !999, size: 64, align: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1014, !1015, !1016, !1017}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !691, line: 247, baseType: !958, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1001, file: !691, line: 253, baseType: !958, size: 64, align: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1001, file: !691, line: 259, baseType: !923, size: 32, align: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1001, file: !691, line: 271, baseType: !1008, size: 64, align: 64, offset: 192)
!1008 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1001, file: !691, line: 265, size: 64, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1008, file: !691, line: 266, baseType: !937, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1008, file: !691, line: 267, baseType: !942, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1008, file: !691, line: 268, baseType: !958, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1008, file: !691, line: 270, baseType: !968, size: 64, align: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1001, file: !691, line: 272, baseType: !942, size: 64, align: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1001, file: !691, line: 273, baseType: !942, size: 64, align: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !691, line: 275, baseType: !923, size: 32, align: 32, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1001, file: !691, line: 300, baseType: !958, size: 64, align: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !991, file: !713, line: 93, baseType: !923, size: 32, align: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !991, file: !713, line: 99, baseType: !923, size: 32, align: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !991, file: !713, line: 108, baseType: !923, size: 32, align: 32, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !991, file: !713, line: 113, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!922, !922, !922}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !991, file: !713, line: 123, baseType: !1026, size: 64, align: 64, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!1029, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !991, file: !713, line: 130, baseType: !1032, size: 32, align: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !991, file: !713, line: 136, baseType: !1034, size: 64, align: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1032, !922}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !991, file: !713, line: 142, baseType: !1038, size: 64, align: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!923, !1041, !922, !958, !923}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1044)
!1044 = !{!1045, !1057, !1058}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1043, file: !691, line: 360, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1049, file: !691, line: 307, baseType: !958, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1049, file: !691, line: 313, baseType: !942, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1049, file: !691, line: 313, baseType: !942, size: 64, align: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1049, file: !691, line: 318, baseType: !942, size: 64, align: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1049, file: !691, line: 318, baseType: !942, size: 64, align: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1049, file: !691, line: 323, baseType: !923, size: 32, align: 32, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1043, file: !691, line: 364, baseType: !923, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1043, file: !691, line: 368, baseType: !923, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !955, file: !14, line: 3495, baseType: !1060, size: 64, align: 64, offset: 704)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1063, file: !14, line: 3402, baseType: !923, size: 32, align: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !14, line: 3403, baseType: !958, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !955, file: !14, line: 3507, baseType: !958, size: 64, align: 64, offset: 768)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !955, file: !14, line: 3516, baseType: !923, size: 32, align: 32, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !14, line: 3517, baseType: !1070, size: 64, align: 64, offset: 896)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !955, file: !14, line: 3527, baseType: !1072, size: 64, align: 64, offset: 960)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!923, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1085, !1086, !1087, !1088, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1366, !1370, !1371, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1553, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1077, file: !14, line: 1561, baseType: !988, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1077, file: !14, line: 1562, baseType: !923, size: 32, align: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1077, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1077, file: !14, line: 1565, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1077, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1077, file: !14, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1077, file: !14, line: 1583, baseType: !922, size: 64, align: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1077, file: !14, line: 1591, baseType: !1089, size: 64, align: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1091, line: 129, size: 1664, align: 64, elements: !1092)
!1091 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1092 = !{!1093, !1094, !1095, !1096, !1192, !1213, !1214, !1243, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1090, file: !1091, line: 136, baseType: !923, size: 32, align: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1090, file: !1091, line: 151, baseType: !923, size: 32, align: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1090, file: !1091, line: 157, baseType: !923, size: 32, align: 32, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1090, file: !1091, line: 159, baseType: !1097, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1100)
!1100 = !{!1101, !1106, !1108, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1146, !1148, !1149, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1191}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !744, line: 282, baseType: !1102, size: 512, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 512, align: 64, elements: !1104)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1104 = !{!1105}
!1105 = !DISubrange(count: 8)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1099, file: !744, line: 299, baseType: !1107, size: 256, align: 32, offset: 512)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, align: 32, elements: !1104)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1099, file: !744, line: 315, baseType: !1109, size: 64, align: 64, offset: 768)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1099, file: !744, line: 326, baseType: !923, size: 32, align: 32, offset: 832)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1099, file: !744, line: 326, baseType: !923, size: 32, align: 32, offset: 864)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1099, file: !744, line: 334, baseType: !923, size: 32, align: 32, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1099, file: !744, line: 341, baseType: !923, size: 32, align: 32, offset: 928)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1099, file: !744, line: 346, baseType: !923, size: 32, align: 32, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1099, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1099, file: !744, line: 356, baseType: !968, size: 64, align: 32, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1099, file: !744, line: 361, baseType: !937, size: 64, align: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1099, file: !744, line: 369, baseType: !937, size: 64, align: 64, offset: 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1099, file: !744, line: 377, baseType: !937, size: 64, align: 64, offset: 1216)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1099, file: !744, line: 382, baseType: !923, size: 32, align: 32, offset: 1280)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1099, file: !744, line: 386, baseType: !923, size: 32, align: 32, offset: 1312)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1099, file: !744, line: 391, baseType: !923, size: 32, align: 32, offset: 1344)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1099, file: !744, line: 396, baseType: !922, size: 64, align: 64, offset: 1408)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1099, file: !744, line: 403, baseType: !1125, size: 512, align: 64, offset: 1472)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 512, align: 64, elements: !1104)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1099, file: !744, line: 410, baseType: !923, size: 32, align: 32, offset: 1984)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1099, file: !744, line: 415, baseType: !923, size: 32, align: 32, offset: 2016)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1099, file: !744, line: 420, baseType: !923, size: 32, align: 32, offset: 2048)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1099, file: !744, line: 425, baseType: !923, size: 32, align: 32, offset: 2080)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1099, file: !744, line: 435, baseType: !937, size: 64, align: 64, offset: 2112)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1099, file: !744, line: 440, baseType: !923, size: 32, align: 32, offset: 2176)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1099, file: !744, line: 445, baseType: !940, size: 64, align: 64, offset: 2240)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !744, line: 459, baseType: !1134, size: 512, align: 64, offset: 2304)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 512, align: 64, elements: !1104)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1137, line: 94, baseType: !1138)
!1137 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1137, line: 81, size: 192, align: 64, elements: !1139)
!1139 = !{!1140, !1144, !1145}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1138, file: !1137, line: 82, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1137, line: 73, baseType: !1143)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1137, line: 73, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1138, file: !1137, line: 89, baseType: !1103, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !1137, line: 93, baseType: !923, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1099, file: !744, line: 473, baseType: !1147, size: 64, align: 64, offset: 2816)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1099, file: !744, line: 477, baseType: !923, size: 32, align: 32, offset: 2880)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1099, file: !744, line: 479, baseType: !1150, size: 64, align: 64, offset: 2944)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1153, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !744, line: 203, baseType: !1103, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !744, line: 204, baseType: !923, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1153, file: !744, line: 205, baseType: !1159, size: 64, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1161, line: 86, baseType: !1162)
!1161 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1161, line: 86, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !744, line: 206, baseType: !1135, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1099, file: !744, line: 480, baseType: !923, size: 32, align: 32, offset: 3008)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !744, line: 505, baseType: !923, size: 32, align: 32, offset: 3040)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1099, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1099, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1099, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1099, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1099, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1099, file: !744, line: 532, baseType: !937, size: 64, align: 64, offset: 3264)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1099, file: !744, line: 539, baseType: !937, size: 64, align: 64, offset: 3328)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1099, file: !744, line: 547, baseType: !937, size: 64, align: 64, offset: 3392)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1099, file: !744, line: 554, baseType: !1159, size: 64, align: 64, offset: 3456)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1099, file: !744, line: 563, baseType: !923, size: 32, align: 32, offset: 3520)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1099, file: !744, line: 572, baseType: !923, size: 32, align: 32, offset: 3552)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1099, file: !744, line: 581, baseType: !923, size: 32, align: 32, offset: 3584)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1099, file: !744, line: 588, baseType: !1179, size: 64, align: 64, offset: 3648)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1099, file: !744, line: 593, baseType: !923, size: 32, align: 32, offset: 3712)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1099, file: !744, line: 596, baseType: !923, size: 32, align: 32, offset: 3744)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1099, file: !744, line: 599, baseType: !1135, size: 64, align: 64, offset: 3776)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1099, file: !744, line: 605, baseType: !1135, size: 64, align: 64, offset: 3840)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1099, file: !744, line: 616, baseType: !1135, size: 64, align: 64, offset: 3904)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1099, file: !744, line: 626, baseType: !1186, size: 64, align: 64, offset: 3968)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1187, line: 216, baseType: !941)
!1187 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1099, file: !744, line: 627, baseType: !1186, size: 64, align: 64, offset: 4032)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1099, file: !744, line: 628, baseType: !1186, size: 64, align: 64, offset: 4096)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1099, file: !744, line: 629, baseType: !1186, size: 64, align: 64, offset: 4160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1099, file: !744, line: 645, baseType: !1135, size: 64, align: 64, offset: 4224)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1090, file: !1091, line: 161, baseType: !1193, size: 64, align: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1091, line: 117, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1091, line: 100, size: 832, align: 64, elements: !1196)
!1196 = !{!1197, !1204, !1205, !1206, !1207, !1208, !1210, !1211, !1212}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1195, file: !1091, line: 105, baseType: !1198, size: 256, align: 64)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 256, align: 64, elements: !1202)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1137, line: 238, baseType: !1201)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1137, line: 238, flags: DIFlagFwdDecl)
!1202 = !{!1203}
!1203 = !DISubrange(count: 4)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1195, file: !1091, line: 110, baseType: !923, size: 32, align: 32, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1195, file: !1091, line: 111, baseType: !923, size: 32, align: 32, offset: 288)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1195, file: !1091, line: 111, baseType: !923, size: 32, align: 32, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1195, file: !1091, line: 112, baseType: !1107, size: 256, align: 32, offset: 352)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1195, file: !1091, line: 113, baseType: !1209, size: 128, align: 32, offset: 608)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, align: 32, elements: !1202)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1195, file: !1091, line: 114, baseType: !923, size: 32, align: 32, offset: 736)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1195, file: !1091, line: 115, baseType: !923, size: 32, align: 32, offset: 768)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1195, file: !1091, line: 116, baseType: !923, size: 32, align: 32, offset: 800)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1090, file: !1091, line: 163, baseType: !922, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1090, file: !1091, line: 165, baseType: !1215, size: 128, align: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1091, line: 122, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1091, line: 119, size: 128, align: 64, elements: !1217)
!1217 = !{!1218, !1242}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1216, file: !1091, line: 120, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1238, !1239, !1240, !1241}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1221, file: !14, line: 1451, baseType: !1135, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1221, file: !14, line: 1461, baseType: !937, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1221, file: !14, line: 1467, baseType: !937, size: 64, align: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !14, line: 1468, baseType: !1103, size: 64, align: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !14, line: 1469, baseType: !923, size: 32, align: 32, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1221, file: !14, line: 1470, baseType: !923, size: 32, align: 32, offset: 288)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1221, file: !14, line: 1474, baseType: !923, size: 32, align: 32, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1221, file: !14, line: 1479, baseType: !1231, size: 64, align: 64, offset: 384)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1233, file: !14, line: 1412, baseType: !1103, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1233, file: !14, line: 1413, baseType: !923, size: 32, align: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1233, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1221, file: !14, line: 1480, baseType: !923, size: 32, align: 32, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1221, file: !14, line: 1486, baseType: !937, size: 64, align: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1221, file: !14, line: 1488, baseType: !937, size: 64, align: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1221, file: !14, line: 1497, baseType: !937, size: 64, align: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1216, file: !1091, line: 121, baseType: !1097, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1090, file: !1091, line: 166, baseType: !1244, size: 128, align: 64, offset: 448)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1091, line: 127, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1091, line: 124, size: 128, align: 64, elements: !1246)
!1246 = !{!1247, !1320}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1245, file: !1091, line: 125, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1278, !1282, !1283, !1317, !1318, !1319}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1251, file: !14, line: 5751, baseType: !988, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1251, file: !14, line: 5756, baseType: !1255, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1263, !1264, !1265, !1269, !1273, !1277}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1257, file: !14, line: 5797, baseType: !958, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1257, file: !14, line: 5804, baseType: !1261, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1257, file: !14, line: 5815, baseType: !988, size: 64, align: 64, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1257, file: !14, line: 5825, baseType: !923, size: 32, align: 32, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1257, file: !14, line: 5826, baseType: !1266, size: 64, align: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!923, !1249}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1257, file: !14, line: 5827, baseType: !1270, size: 64, align: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!923, !1249, !1219}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1257, file: !14, line: 5828, baseType: !1274, size: 64, align: 64, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{null, !1249}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1257, file: !14, line: 5829, baseType: !1274, size: 64, align: 64, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1251, file: !14, line: 5762, baseType: !1279, size: 64, align: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1281)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1251, file: !14, line: 5768, baseType: !922, size: 64, align: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1251, file: !14, line: 5775, baseType: !1284, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1286, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1286, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1286, file: !14, line: 3948, baseType: !931, size: 32, align: 32, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1286, file: !14, line: 3958, baseType: !1103, size: 64, align: 64, offset: 128)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1286, file: !14, line: 3962, baseType: !923, size: 32, align: 32, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1286, file: !14, line: 3968, baseType: !923, size: 32, align: 32, offset: 224)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1286, file: !14, line: 3973, baseType: !937, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1286, file: !14, line: 3986, baseType: !923, size: 32, align: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1286, file: !14, line: 3999, baseType: !923, size: 32, align: 32, offset: 352)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1286, file: !14, line: 4004, baseType: !923, size: 32, align: 32, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1286, file: !14, line: 4005, baseType: !923, size: 32, align: 32, offset: 416)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1286, file: !14, line: 4010, baseType: !923, size: 32, align: 32, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1286, file: !14, line: 4011, baseType: !923, size: 32, align: 32, offset: 480)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1286, file: !14, line: 4020, baseType: !968, size: 64, align: 32, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1286, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1286, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1286, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1286, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1286, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1286, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1286, file: !14, line: 4039, baseType: !923, size: 32, align: 32, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1286, file: !14, line: 4046, baseType: !940, size: 64, align: 64, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1286, file: !14, line: 4050, baseType: !923, size: 32, align: 32, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1286, file: !14, line: 4054, baseType: !923, size: 32, align: 32, offset: 928)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1286, file: !14, line: 4061, baseType: !923, size: 32, align: 32, offset: 960)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1286, file: !14, line: 4065, baseType: !923, size: 32, align: 32, offset: 992)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1286, file: !14, line: 4073, baseType: !923, size: 32, align: 32, offset: 1024)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1286, file: !14, line: 4080, baseType: !923, size: 32, align: 32, offset: 1056)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1286, file: !14, line: 4084, baseType: !923, size: 32, align: 32, offset: 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1251, file: !14, line: 5781, baseType: !1284, size: 64, align: 64, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1251, file: !14, line: 5787, baseType: !968, size: 64, align: 32, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1251, file: !14, line: 5793, baseType: !968, size: 64, align: 32, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1245, file: !1091, line: 126, baseType: !923, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1090, file: !1091, line: 172, baseType: !1219, size: 64, align: 64, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1090, file: !1091, line: 177, baseType: !1103, size: 64, align: 64, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1090, file: !1091, line: 178, baseType: !924, size: 32, align: 32, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1090, file: !1091, line: 180, baseType: !922, size: 64, align: 64, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1090, file: !1091, line: 185, baseType: !923, size: 32, align: 32, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1090, file: !1091, line: 190, baseType: !922, size: 64, align: 64, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1090, file: !1091, line: 195, baseType: !923, size: 32, align: 32, offset: 960)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1090, file: !1091, line: 200, baseType: !1219, size: 64, align: 64, offset: 1024)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1090, file: !1091, line: 201, baseType: !923, size: 32, align: 32, offset: 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1090, file: !1091, line: 202, baseType: !1097, size: 64, align: 64, offset: 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1090, file: !1091, line: 203, baseType: !923, size: 32, align: 32, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1090, file: !1091, line: 205, baseType: !923, size: 32, align: 32, offset: 1248)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1090, file: !1091, line: 206, baseType: !923, size: 32, align: 32, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1090, file: !1091, line: 209, baseType: !1186, size: 64, align: 64, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1090, file: !1091, line: 212, baseType: !1186, size: 64, align: 64, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1090, file: !1091, line: 213, baseType: !1097, size: 64, align: 64, offset: 1472)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1090, file: !1091, line: 215, baseType: !923, size: 32, align: 32, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1090, file: !1091, line: 217, baseType: !923, size: 32, align: 32, offset: 1568)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1090, file: !1091, line: 220, baseType: !923, size: 32, align: 32, offset: 1600)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1077, file: !14, line: 1598, baseType: !922, size: 64, align: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1077, file: !14, line: 1606, baseType: !937, size: 64, align: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1077, file: !14, line: 1614, baseType: !923, size: 32, align: 32, offset: 512)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1077, file: !14, line: 1622, baseType: !923, size: 32, align: 32, offset: 544)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1077, file: !14, line: 1628, baseType: !923, size: 32, align: 32, offset: 576)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !14, line: 1636, baseType: !923, size: 32, align: 32, offset: 608)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1077, file: !14, line: 1643, baseType: !923, size: 32, align: 32, offset: 640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1077, file: !14, line: 1657, baseType: !1103, size: 64, align: 64, offset: 704)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1077, file: !14, line: 1658, baseType: !923, size: 32, align: 32, offset: 768)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1077, file: !14, line: 1679, baseType: !968, size: 64, align: 32, offset: 800)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1077, file: !14, line: 1688, baseType: !923, size: 32, align: 32, offset: 864)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1077, file: !14, line: 1712, baseType: !923, size: 32, align: 32, offset: 896)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1077, file: !14, line: 1729, baseType: !923, size: 32, align: 32, offset: 928)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1077, file: !14, line: 1729, baseType: !923, size: 32, align: 32, offset: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1077, file: !14, line: 1744, baseType: !923, size: 32, align: 32, offset: 992)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1077, file: !14, line: 1744, baseType: !923, size: 32, align: 32, offset: 1024)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1077, file: !14, line: 1751, baseType: !923, size: 32, align: 32, offset: 1056)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1077, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1077, file: !14, line: 1791, baseType: !1359, size: 64, align: 64, offset: 1152)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{null, !1362, !1363, !1365, !923, !923, !923}
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1077, file: !14, line: 1808, baseType: !1367, size: 64, align: 64, offset: 1216)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!473, !1362, !975}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1077, file: !14, line: 1816, baseType: !923, size: 32, align: 32, offset: 1280)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1077, file: !14, line: 1825, baseType: !1372, size: 32, align: 32, offset: 1312)
!1372 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1077, file: !14, line: 1830, baseType: !923, size: 32, align: 32, offset: 1344)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1077, file: !14, line: 1838, baseType: !1372, size: 32, align: 32, offset: 1376)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1077, file: !14, line: 1846, baseType: !923, size: 32, align: 32, offset: 1408)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1077, file: !14, line: 1851, baseType: !923, size: 32, align: 32, offset: 1440)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1077, file: !14, line: 1861, baseType: !1372, size: 32, align: 32, offset: 1472)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1077, file: !14, line: 1868, baseType: !1372, size: 32, align: 32, offset: 1504)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1077, file: !14, line: 1875, baseType: !1372, size: 32, align: 32, offset: 1536)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1077, file: !14, line: 1882, baseType: !1372, size: 32, align: 32, offset: 1568)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1077, file: !14, line: 1889, baseType: !1372, size: 32, align: 32, offset: 1600)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1077, file: !14, line: 1896, baseType: !1372, size: 32, align: 32, offset: 1632)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1077, file: !14, line: 1903, baseType: !1372, size: 32, align: 32, offset: 1664)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1077, file: !14, line: 1910, baseType: !923, size: 32, align: 32, offset: 1696)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1077, file: !14, line: 1915, baseType: !923, size: 32, align: 32, offset: 1728)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1077, file: !14, line: 1926, baseType: !1365, size: 64, align: 64, offset: 1792)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1077, file: !14, line: 1935, baseType: !968, size: 64, align: 32, offset: 1856)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1077, file: !14, line: 1942, baseType: !923, size: 32, align: 32, offset: 1920)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1077, file: !14, line: 1948, baseType: !923, size: 32, align: 32, offset: 1952)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1077, file: !14, line: 1954, baseType: !923, size: 32, align: 32, offset: 1984)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1077, file: !14, line: 1960, baseType: !923, size: 32, align: 32, offset: 2016)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1077, file: !14, line: 1984, baseType: !923, size: 32, align: 32, offset: 2048)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1077, file: !14, line: 1991, baseType: !923, size: 32, align: 32, offset: 2080)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1077, file: !14, line: 1996, baseType: !923, size: 32, align: 32, offset: 2112)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1077, file: !14, line: 2004, baseType: !923, size: 32, align: 32, offset: 2144)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1077, file: !14, line: 2011, baseType: !923, size: 32, align: 32, offset: 2176)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1077, file: !14, line: 2018, baseType: !923, size: 32, align: 32, offset: 2208)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1077, file: !14, line: 2027, baseType: !923, size: 32, align: 32, offset: 2240)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1077, file: !14, line: 2034, baseType: !923, size: 32, align: 32, offset: 2272)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1077, file: !14, line: 2044, baseType: !923, size: 32, align: 32, offset: 2304)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1077, file: !14, line: 2054, baseType: !944, size: 64, align: 64, offset: 2368)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1077, file: !14, line: 2061, baseType: !944, size: 64, align: 64, offset: 2432)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1077, file: !14, line: 2066, baseType: !923, size: 32, align: 32, offset: 2496)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1077, file: !14, line: 2070, baseType: !923, size: 32, align: 32, offset: 2528)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1077, file: !14, line: 2078, baseType: !923, size: 32, align: 32, offset: 2560)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1077, file: !14, line: 2085, baseType: !923, size: 32, align: 32, offset: 2592)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1077, file: !14, line: 2092, baseType: !923, size: 32, align: 32, offset: 2624)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1077, file: !14, line: 2099, baseType: !923, size: 32, align: 32, offset: 2656)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1077, file: !14, line: 2106, baseType: !923, size: 32, align: 32, offset: 2688)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1077, file: !14, line: 2113, baseType: !923, size: 32, align: 32, offset: 2720)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1077, file: !14, line: 2120, baseType: !923, size: 32, align: 32, offset: 2752)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1077, file: !14, line: 2125, baseType: !923, size: 32, align: 32, offset: 2784)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1077, file: !14, line: 2133, baseType: !923, size: 32, align: 32, offset: 2816)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1077, file: !14, line: 2140, baseType: !923, size: 32, align: 32, offset: 2848)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1077, file: !14, line: 2145, baseType: !923, size: 32, align: 32, offset: 2880)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1077, file: !14, line: 2153, baseType: !923, size: 32, align: 32, offset: 2912)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1077, file: !14, line: 2158, baseType: !923, size: 32, align: 32, offset: 2944)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1077, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1077, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1077, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1077, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1077, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1077, file: !14, line: 2203, baseType: !923, size: 32, align: 32, offset: 3136)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1077, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1077, file: !14, line: 2212, baseType: !923, size: 32, align: 32, offset: 3200)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1077, file: !14, line: 2213, baseType: !923, size: 32, align: 32, offset: 3232)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1077, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1077, file: !14, line: 2232, baseType: !923, size: 32, align: 32, offset: 3296)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1077, file: !14, line: 2243, baseType: !923, size: 32, align: 32, offset: 3328)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1077, file: !14, line: 2249, baseType: !923, size: 32, align: 32, offset: 3360)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1077, file: !14, line: 2256, baseType: !923, size: 32, align: 32, offset: 3392)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1077, file: !14, line: 2263, baseType: !940, size: 64, align: 64, offset: 3456)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1077, file: !14, line: 2270, baseType: !940, size: 64, align: 64, offset: 3520)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1077, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1077, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1077, file: !14, line: 2367, baseType: !1437, size: 64, align: 64, offset: 3648)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!923, !1362, !1097, !923}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1077, file: !14, line: 2383, baseType: !923, size: 32, align: 32, offset: 3712)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1077, file: !14, line: 2386, baseType: !1372, size: 32, align: 32, offset: 3744)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1077, file: !14, line: 2387, baseType: !1372, size: 32, align: 32, offset: 3776)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1077, file: !14, line: 2394, baseType: !923, size: 32, align: 32, offset: 3808)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1077, file: !14, line: 2401, baseType: !923, size: 32, align: 32, offset: 3840)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1077, file: !14, line: 2408, baseType: !923, size: 32, align: 32, offset: 3872)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1077, file: !14, line: 2415, baseType: !923, size: 32, align: 32, offset: 3904)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1077, file: !14, line: 2422, baseType: !923, size: 32, align: 32, offset: 3936)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1077, file: !14, line: 2423, baseType: !1449, size: 64, align: 64, offset: 3968)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1451, file: !14, line: 827, baseType: !923, size: 32, align: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1451, file: !14, line: 828, baseType: !923, size: 32, align: 32, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1451, file: !14, line: 829, baseType: !923, size: 32, align: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1451, file: !14, line: 830, baseType: !1372, size: 32, align: 32, offset: 96)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1077, file: !14, line: 2430, baseType: !937, size: 64, align: 64, offset: 4032)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1077, file: !14, line: 2437, baseType: !937, size: 64, align: 64, offset: 4096)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1077, file: !14, line: 2444, baseType: !1372, size: 32, align: 32, offset: 4160)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1077, file: !14, line: 2451, baseType: !1372, size: 32, align: 32, offset: 4192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1077, file: !14, line: 2458, baseType: !923, size: 32, align: 32, offset: 4224)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1077, file: !14, line: 2469, baseType: !923, size: 32, align: 32, offset: 4256)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1077, file: !14, line: 2475, baseType: !923, size: 32, align: 32, offset: 4288)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1077, file: !14, line: 2481, baseType: !923, size: 32, align: 32, offset: 4320)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1077, file: !14, line: 2485, baseType: !923, size: 32, align: 32, offset: 4352)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1077, file: !14, line: 2489, baseType: !923, size: 32, align: 32, offset: 4384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1077, file: !14, line: 2493, baseType: !923, size: 32, align: 32, offset: 4416)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1077, file: !14, line: 2501, baseType: !923, size: 32, align: 32, offset: 4448)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1077, file: !14, line: 2506, baseType: !923, size: 32, align: 32, offset: 4480)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1077, file: !14, line: 2510, baseType: !923, size: 32, align: 32, offset: 4512)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1077, file: !14, line: 2514, baseType: !937, size: 64, align: 64, offset: 4544)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1077, file: !14, line: 2528, baseType: !1473, size: 64, align: 64, offset: 4608)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{null, !1362, !922, !923, !923}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1077, file: !14, line: 2534, baseType: !923, size: 32, align: 32, offset: 4672)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1077, file: !14, line: 2545, baseType: !923, size: 32, align: 32, offset: 4704)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1077, file: !14, line: 2547, baseType: !923, size: 32, align: 32, offset: 4736)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1077, file: !14, line: 2549, baseType: !923, size: 32, align: 32, offset: 4768)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1077, file: !14, line: 2551, baseType: !923, size: 32, align: 32, offset: 4800)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1077, file: !14, line: 2553, baseType: !923, size: 32, align: 32, offset: 4832)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1077, file: !14, line: 2555, baseType: !923, size: 32, align: 32, offset: 4864)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1077, file: !14, line: 2557, baseType: !923, size: 32, align: 32, offset: 4896)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1077, file: !14, line: 2559, baseType: !923, size: 32, align: 32, offset: 4928)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1077, file: !14, line: 2563, baseType: !923, size: 32, align: 32, offset: 4960)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1077, file: !14, line: 2571, baseType: !1487, size: 64, align: 64, offset: 4992)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1077, file: !14, line: 2579, baseType: !1487, size: 64, align: 64, offset: 5056)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1077, file: !14, line: 2586, baseType: !923, size: 32, align: 32, offset: 5120)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1077, file: !14, line: 2615, baseType: !923, size: 32, align: 32, offset: 5152)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1077, file: !14, line: 2627, baseType: !923, size: 32, align: 32, offset: 5184)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1077, file: !14, line: 2637, baseType: !923, size: 32, align: 32, offset: 5216)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1077, file: !14, line: 2681, baseType: !923, size: 32, align: 32, offset: 5248)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1077, file: !14, line: 2709, baseType: !937, size: 64, align: 64, offset: 5312)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1077, file: !14, line: 2716, baseType: !1496, size: 64, align: 64, offset: 5376)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1499)
!1499 = !{!1500, !1501, !1502, !1503, !1504, !1505, !1509, !1513, !1517, !1518, !1519, !1520, !1526, !1527, !1528, !1529, !1530}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1498, file: !14, line: 3642, baseType: !958, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1498, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1498, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1498, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1498, file: !14, line: 3669, baseType: !923, size: 32, align: 32, offset: 160)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1498, file: !14, line: 3682, baseType: !1506, size: 64, align: 64, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!923, !1075, !1097}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1498, file: !14, line: 3698, baseType: !1510, size: 64, align: 64, offset: 256)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!923, !1075, !933, !931}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1498, file: !14, line: 3712, baseType: !1514, size: 64, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!923, !1075, !923, !933, !931}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1498, file: !14, line: 3726, baseType: !1510, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1498, file: !14, line: 3737, baseType: !1072, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1498, file: !14, line: 3746, baseType: !923, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1498, file: !14, line: 3757, baseType: !1521, size: 64, align: 64, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{null, !1524}
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1498, file: !14, line: 3766, baseType: !1072, size: 64, align: 64, offset: 640)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1498, file: !14, line: 3774, baseType: !1072, size: 64, align: 64, offset: 704)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1498, file: !14, line: 3780, baseType: !923, size: 32, align: 32, offset: 768)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1498, file: !14, line: 3785, baseType: !923, size: 32, align: 32, offset: 800)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1498, file: !14, line: 3795, baseType: !1531, size: 64, align: 64, offset: 832)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!923, !1075, !1135}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1077, file: !14, line: 2728, baseType: !922, size: 64, align: 64, offset: 5440)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1077, file: !14, line: 2735, baseType: !1125, size: 512, align: 64, offset: 5504)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1077, file: !14, line: 2742, baseType: !923, size: 32, align: 32, offset: 6016)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1077, file: !14, line: 2755, baseType: !923, size: 32, align: 32, offset: 6048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1077, file: !14, line: 2776, baseType: !923, size: 32, align: 32, offset: 6080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1077, file: !14, line: 2783, baseType: !923, size: 32, align: 32, offset: 6112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1077, file: !14, line: 2791, baseType: !923, size: 32, align: 32, offset: 6144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1077, file: !14, line: 2802, baseType: !1097, size: 64, align: 64, offset: 6208)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1077, file: !14, line: 2811, baseType: !923, size: 32, align: 32, offset: 6272)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1077, file: !14, line: 2821, baseType: !923, size: 32, align: 32, offset: 6304)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1077, file: !14, line: 2830, baseType: !923, size: 32, align: 32, offset: 6336)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1077, file: !14, line: 2840, baseType: !923, size: 32, align: 32, offset: 6368)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1077, file: !14, line: 2851, baseType: !1547, size: 64, align: 64, offset: 6400)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!923, !1362, !1550, !922, !1365, !923, !923}
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!923, !1362, !922}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1077, file: !14, line: 2871, baseType: !1554, size: 64, align: 64, offset: 6464)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!923, !1362, !1557, !922, !1365, !923}
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!923, !1362, !922, !923, !923}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1077, file: !14, line: 2878, baseType: !923, size: 32, align: 32, offset: 6528)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1077, file: !14, line: 2885, baseType: !923, size: 32, align: 32, offset: 6560)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1077, file: !14, line: 3005, baseType: !923, size: 32, align: 32, offset: 6592)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1077, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1077, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1077, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1077, file: !14, line: 3037, baseType: !1103, size: 64, align: 64, offset: 6720)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1077, file: !14, line: 3038, baseType: !923, size: 32, align: 32, offset: 6784)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1077, file: !14, line: 3050, baseType: !940, size: 64, align: 64, offset: 6848)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1077, file: !14, line: 3065, baseType: !923, size: 32, align: 32, offset: 6912)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1077, file: !14, line: 3083, baseType: !923, size: 32, align: 32, offset: 6944)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1077, file: !14, line: 3092, baseType: !968, size: 64, align: 32, offset: 6976)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1077, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1077, file: !14, line: 3106, baseType: !968, size: 64, align: 32, offset: 7072)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1077, file: !14, line: 3113, baseType: !1575, size: 64, align: 64, offset: 7168)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1577)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1579)
!1579 = !{!1580, !1581, !1582, !1583, !1584, !1585, !1588}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1578, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1578, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1578, file: !14, line: 720, baseType: !958, size: 64, align: 64, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1578, file: !14, line: 724, baseType: !958, size: 64, align: 64, offset: 128)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1578, file: !14, line: 728, baseType: !923, size: 32, align: 32, offset: 192)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1578, file: !14, line: 734, baseType: !1586, size: 64, align: 64, offset: 256)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1578, file: !14, line: 739, baseType: !1589, size: 64, align: 64, offset: 320)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1077, file: !14, line: 3129, baseType: !937, size: 64, align: 64, offset: 7232)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1077, file: !14, line: 3130, baseType: !937, size: 64, align: 64, offset: 7296)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1077, file: !14, line: 3131, baseType: !937, size: 64, align: 64, offset: 7360)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1077, file: !14, line: 3132, baseType: !937, size: 64, align: 64, offset: 7424)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1077, file: !14, line: 3139, baseType: !1487, size: 64, align: 64, offset: 7488)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1077, file: !14, line: 3147, baseType: !923, size: 32, align: 32, offset: 7552)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1077, file: !14, line: 3165, baseType: !923, size: 32, align: 32, offset: 7584)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1077, file: !14, line: 3172, baseType: !923, size: 32, align: 32, offset: 7616)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1077, file: !14, line: 3180, baseType: !923, size: 32, align: 32, offset: 7648)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1077, file: !14, line: 3191, baseType: !944, size: 64, align: 64, offset: 7680)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1077, file: !14, line: 3199, baseType: !1103, size: 64, align: 64, offset: 7744)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1077, file: !14, line: 3207, baseType: !1487, size: 64, align: 64, offset: 7808)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1077, file: !14, line: 3214, baseType: !924, size: 32, align: 32, offset: 7872)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1077, file: !14, line: 3224, baseType: !1231, size: 64, align: 64, offset: 7936)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1077, file: !14, line: 3225, baseType: !923, size: 32, align: 32, offset: 8000)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1077, file: !14, line: 3249, baseType: !1135, size: 64, align: 64, offset: 8064)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1077, file: !14, line: 3256, baseType: !923, size: 32, align: 32, offset: 8128)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1077, file: !14, line: 3271, baseType: !923, size: 32, align: 32, offset: 8160)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1077, file: !14, line: 3279, baseType: !937, size: 64, align: 64, offset: 8192)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1077, file: !14, line: 3301, baseType: !1135, size: 64, align: 64, offset: 8256)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1077, file: !14, line: 3310, baseType: !923, size: 32, align: 32, offset: 8320)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1077, file: !14, line: 3337, baseType: !923, size: 32, align: 32, offset: 8352)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1077, file: !14, line: 3351, baseType: !923, size: 32, align: 32, offset: 8384)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1077, file: !14, line: 3359, baseType: !923, size: 32, align: 32, offset: 8416)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !955, file: !14, line: 3535, baseType: !1616, size: 64, align: 64, offset: 1024)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!923, !1075, !1619}
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !955, file: !14, line: 3541, baseType: !1622, size: 64, align: 64, offset: 1088)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1624)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1091, line: 223, size: 128, align: 64, elements: !1626)
!1626 = !{!1627, !1628}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1625, file: !1091, line: 224, baseType: !933, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1625, file: !1091, line: 225, baseType: !933, size: 64, align: 64, offset: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !955, file: !14, line: 3549, baseType: !1630, size: 64, align: 64, offset: 1152)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{null, !1070}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !955, file: !14, line: 3551, baseType: !1072, size: 64, align: 64, offset: 1216)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !955, file: !14, line: 3552, baseType: !1635, size: 64, align: 64, offset: 1280)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!923, !1075, !1103, !923, !1638}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1646, !1670}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1640, file: !14, line: 3921, baseType: !945, size: 16, align: 16)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1640, file: !14, line: 3922, baseType: !931, size: 32, align: 32, offset: 32)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1640, file: !14, line: 3923, baseType: !931, size: 32, align: 32, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1640, file: !14, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1640, file: !14, line: 3925, baseType: !1647, size: 64, align: 64, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1663, !1665, !1666, !1667, !1668, !1669}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1650, file: !14, line: 3886, baseType: !923, size: 32, align: 32)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1650, file: !14, line: 3887, baseType: !923, size: 32, align: 32, offset: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1650, file: !14, line: 3888, baseType: !923, size: 32, align: 32, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1650, file: !14, line: 3889, baseType: !923, size: 32, align: 32, offset: 96)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1650, file: !14, line: 3890, baseType: !923, size: 32, align: 32, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1650, file: !14, line: 3897, baseType: !1658, size: 768, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1660)
!1660 = !{!1661, !1662}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1659, file: !14, line: 3855, baseType: !1102, size: 512, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1659, file: !14, line: 3857, baseType: !1107, size: 256, align: 32, offset: 512)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1650, file: !14, line: 3903, baseType: !1664, size: 256, align: 64, offset: 960)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 256, align: 64, elements: !1202)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1650, file: !14, line: 3904, baseType: !1209, size: 128, align: 32, offset: 1216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1650, file: !14, line: 3908, baseType: !1487, size: 64, align: 64, offset: 1408)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1650, file: !14, line: 3915, baseType: !1487, size: 64, align: 64, offset: 1472)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1650, file: !14, line: 3917, baseType: !923, size: 32, align: 32, offset: 1536)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1640, file: !14, line: 3926, baseType: !937, size: 64, align: 64, offset: 192)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !955, file: !14, line: 3564, baseType: !1672, size: 64, align: 64, offset: 1344)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!923, !1075, !1219, !1363, !1365}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !955, file: !14, line: 3566, baseType: !1676, size: 64, align: 64, offset: 1408)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!923, !1075, !922, !1365, !1219}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !955, file: !14, line: 3567, baseType: !1072, size: 64, align: 64, offset: 1472)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !955, file: !14, line: 3576, baseType: !1681, size: 64, align: 64, offset: 1536)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!923, !1075, !1363}
