; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--xsubenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--xsubenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!845 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!846 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!847 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!848 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!849 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!850 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889, !892, !899, !902, !906}
!888 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !891, line: 51, baseType: !888)
!891 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !894, line: 222, size: 16, align: 8, elements: !895)
!894 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !893, file: !894, line: 222, baseType: !897, size: 16, align: 16)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !891, line: 49, baseType: !898)
!898 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !891, line: 48, baseType: !901)
!901 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !894, line: 221, size: 32, align: 8, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !903, file: !894, line: 221, baseType: !890, size: 32, align: 32)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!907 = !{!908, !1503}
!908 = distinct !DIGlobalVariable(name: "ff_xsub_encoder", scope: !0, file: !909, line: 227, type: !910, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_xsub_encoder)
!909 = !DIFile(filename: "libavcodec/xsubenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !912)
!912 = !{!913, !917, !918, !919, !920, !922, !931, !934, !937, !940, !945, !946, !987, !995, !996, !997, !999, !1402, !1408, !1413, !1417, !1418, !1458, !1478, !1482, !1483, !1487, !1491, !1492, !1496, !1497, !1498}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !911, file: !14, line: 3475, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !911, file: !14, line: 3480, baseType: !914, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !911, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !911, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !911, file: !14, line: 3487, baseType: !921, size: 32, align: 32, offset: 192)
!921 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !911, file: !14, line: 3488, baseType: !923, size: 64, align: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !926, line: 61, baseType: !927)
!926 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !926, line: 58, size: 64, align: 32, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !927, file: !926, line: 59, baseType: !921, size: 32, align: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !927, file: !926, line: 60, baseType: !921, size: 32, align: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !911, file: !14, line: 3489, baseType: !932, size: 64, align: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !911, file: !14, line: 3490, baseType: !935, size: 64, align: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !911, file: !14, line: 3491, baseType: !938, size: 64, align: 64, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !911, file: !14, line: 3492, baseType: !941, size: 64, align: 64, offset: 512)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !891, line: 55, baseType: !944)
!944 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !911, file: !14, line: 3493, baseType: !900, size: 8, align: 8, offset: 576)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !911, file: !14, line: 3494, baseType: !947, size: 64, align: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !951)
!951 = !{!952, !953, !957, !961, !962, !963, !964, !968, !974, !976, !980}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !950, file: !691, line: 72, baseType: !914, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !950, file: !691, line: 78, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!914, !906}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !950, file: !691, line: 85, baseType: !958, size: 64, align: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !950, file: !691, line: 93, baseType: !921, size: 32, align: 32, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !950, file: !691, line: 99, baseType: !921, size: 32, align: 32, offset: 224)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !950, file: !691, line: 108, baseType: !921, size: 32, align: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !950, file: !691, line: 113, baseType: !965, size: 64, align: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!906, !906, !906}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !950, file: !691, line: 123, baseType: !969, size: 64, align: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!972, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !950, file: !691, line: 130, baseType: !975, size: 32, align: 32, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !950, file: !691, line: 136, baseType: !977, size: 64, align: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!975, !906}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !950, file: !691, line: 142, baseType: !981, size: 64, align: 64, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!921, !984, !906, !914, !921}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !911, file: !14, line: 3495, baseType: !988, size: 64, align: 64, offset: 704)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !991, file: !14, line: 3402, baseType: !921, size: 32, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !14, line: 3403, baseType: !914, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !911, file: !14, line: 3507, baseType: !914, size: 64, align: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !911, file: !14, line: 3516, baseType: !921, size: 32, align: 32, offset: 832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !14, line: 3517, baseType: !998, size: 64, align: 64, offset: 896)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !911, file: !14, line: 3527, baseType: !1000, size: 64, align: 64, offset: 960)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!921, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1013, !1014, !1015, !1016, !1019, !1020, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1142, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1333, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1005, file: !14, line: 1561, baseType: !947, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1005, file: !14, line: 1562, baseType: !921, size: 32, align: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1005, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1005, file: !14, line: 1565, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1005, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1005, file: !14, line: 1581, baseType: !888, size: 32, align: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1005, file: !14, line: 1583, baseType: !906, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1005, file: !14, line: 1591, baseType: !1017, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1005, file: !14, line: 1598, baseType: !906, size: 64, align: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1005, file: !14, line: 1606, baseType: !1021, size: 64, align: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !891, line: 40, baseType: !1022)
!1022 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1005, file: !14, line: 1614, baseType: !921, size: 32, align: 32, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1005, file: !14, line: 1622, baseType: !921, size: 32, align: 32, offset: 544)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1005, file: !14, line: 1628, baseType: !921, size: 32, align: 32, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1005, file: !14, line: 1636, baseType: !921, size: 32, align: 32, offset: 608)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1005, file: !14, line: 1643, baseType: !921, size: 32, align: 32, offset: 640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1005, file: !14, line: 1657, baseType: !899, size: 64, align: 64, offset: 704)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1005, file: !14, line: 1658, baseType: !921, size: 32, align: 32, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1005, file: !14, line: 1679, baseType: !925, size: 64, align: 32, offset: 800)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1005, file: !14, line: 1688, baseType: !921, size: 32, align: 32, offset: 864)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1005, file: !14, line: 1712, baseType: !921, size: 32, align: 32, offset: 896)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1005, file: !14, line: 1729, baseType: !921, size: 32, align: 32, offset: 928)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1005, file: !14, line: 1729, baseType: !921, size: 32, align: 32, offset: 960)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1005, file: !14, line: 1744, baseType: !921, size: 32, align: 32, offset: 992)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1005, file: !14, line: 1744, baseType: !921, size: 32, align: 32, offset: 1024)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1005, file: !14, line: 1751, baseType: !921, size: 32, align: 32, offset: 1056)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1005, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1005, file: !14, line: 1791, baseType: !1040, size: 64, align: 64, offset: 1152)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !1043, !1044, !1141, !921, !921, !921}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1048)
!1048 = !{!1049, !1053, !1055, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1093, !1095, !1096, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1129, !1130, !1131, !1132, !1133, !1134, !1137, !1138, !1139, !1140}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1047, file: !722, line: 282, baseType: !1050, size: 512, align: 64)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 512, align: 64, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 8)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1047, file: !722, line: 299, baseType: !1054, size: 256, align: 32, offset: 512)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 256, align: 32, elements: !1051)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1047, file: !722, line: 315, baseType: !1056, size: 64, align: 64, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1047, file: !722, line: 326, baseType: !921, size: 32, align: 32, offset: 832)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1047, file: !722, line: 326, baseType: !921, size: 32, align: 32, offset: 864)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1047, file: !722, line: 334, baseType: !921, size: 32, align: 32, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1047, file: !722, line: 341, baseType: !921, size: 32, align: 32, offset: 928)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1047, file: !722, line: 346, baseType: !921, size: 32, align: 32, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1047, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1047, file: !722, line: 356, baseType: !925, size: 64, align: 32, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1047, file: !722, line: 361, baseType: !1021, size: 64, align: 64, offset: 1088)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1047, file: !722, line: 369, baseType: !1021, size: 64, align: 64, offset: 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1047, file: !722, line: 377, baseType: !1021, size: 64, align: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1047, file: !722, line: 382, baseType: !921, size: 32, align: 32, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1047, file: !722, line: 386, baseType: !921, size: 32, align: 32, offset: 1312)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1047, file: !722, line: 391, baseType: !921, size: 32, align: 32, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1047, file: !722, line: 396, baseType: !906, size: 64, align: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1047, file: !722, line: 403, baseType: !1072, size: 512, align: 64, offset: 1472)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 512, align: 64, elements: !1051)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1047, file: !722, line: 410, baseType: !921, size: 32, align: 32, offset: 1984)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1047, file: !722, line: 415, baseType: !921, size: 32, align: 32, offset: 2016)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1047, file: !722, line: 420, baseType: !921, size: 32, align: 32, offset: 2048)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1047, file: !722, line: 425, baseType: !921, size: 32, align: 32, offset: 2080)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1047, file: !722, line: 435, baseType: !1021, size: 64, align: 64, offset: 2112)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1047, file: !722, line: 440, baseType: !921, size: 32, align: 32, offset: 2176)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1047, file: !722, line: 445, baseType: !943, size: 64, align: 64, offset: 2240)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1047, file: !722, line: 459, baseType: !1081, size: 512, align: 64, offset: 2304)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 512, align: 64, elements: !1051)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1084, line: 94, baseType: !1085)
!1084 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1084, line: 81, size: 192, align: 64, elements: !1086)
!1086 = !{!1087, !1091, !1092}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1085, file: !1084, line: 82, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1084, line: 73, baseType: !1090)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1084, line: 73, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !1084, line: 89, baseType: !899, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1085, file: !1084, line: 93, baseType: !921, size: 32, align: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1047, file: !722, line: 473, baseType: !1094, size: 64, align: 64, offset: 2816)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1047, file: !722, line: 477, baseType: !921, size: 32, align: 32, offset: 2880)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1047, file: !722, line: 479, baseType: !1097, size: 64, align: 64, offset: 2944)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1110}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1100, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !722, line: 203, baseType: !899, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !722, line: 204, baseType: !921, size: 32, align: 32, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1100, file: !722, line: 205, baseType: !1106, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1108, line: 86, baseType: !1109)
!1108 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1108, line: 86, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1100, file: !722, line: 206, baseType: !1082, size: 64, align: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1047, file: !722, line: 480, baseType: !921, size: 32, align: 32, offset: 3008)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1047, file: !722, line: 505, baseType: !921, size: 32, align: 32, offset: 3040)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1047, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1047, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1047, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1047, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1047, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1047, file: !722, line: 532, baseType: !1021, size: 64, align: 64, offset: 3264)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1047, file: !722, line: 539, baseType: !1021, size: 64, align: 64, offset: 3328)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1047, file: !722, line: 547, baseType: !1021, size: 64, align: 64, offset: 3392)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1047, file: !722, line: 554, baseType: !1106, size: 64, align: 64, offset: 3456)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1047, file: !722, line: 563, baseType: !921, size: 32, align: 32, offset: 3520)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1047, file: !722, line: 572, baseType: !921, size: 32, align: 32, offset: 3552)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1047, file: !722, line: 581, baseType: !921, size: 32, align: 32, offset: 3584)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1047, file: !722, line: 588, baseType: !1126, size: 64, align: 64, offset: 3648)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !891, line: 36, baseType: !1128)
!1128 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1047, file: !722, line: 593, baseType: !921, size: 32, align: 32, offset: 3712)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1047, file: !722, line: 596, baseType: !921, size: 32, align: 32, offset: 3744)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1047, file: !722, line: 599, baseType: !1082, size: 64, align: 64, offset: 3776)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1047, file: !722, line: 605, baseType: !1082, size: 64, align: 64, offset: 3840)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1047, file: !722, line: 616, baseType: !1082, size: 64, align: 64, offset: 3904)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1047, file: !722, line: 626, baseType: !1135, size: 64, align: 64, offset: 3968)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1136, line: 216, baseType: !944)
!1136 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1047, file: !722, line: 627, baseType: !1135, size: 64, align: 64, offset: 4032)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1047, file: !722, line: 628, baseType: !1135, size: 64, align: 64, offset: 4096)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1047, file: !722, line: 629, baseType: !1135, size: 64, align: 64, offset: 4160)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1047, file: !722, line: 645, baseType: !1082, size: 64, align: 64, offset: 4224)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1005, file: !14, line: 1808, baseType: !1143, size: 64, align: 64, offset: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!473, !1043, !932}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1005, file: !14, line: 1816, baseType: !921, size: 32, align: 32, offset: 1280)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1005, file: !14, line: 1825, baseType: !1148, size: 32, align: 32, offset: 1312)
!1148 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1005, file: !14, line: 1830, baseType: !921, size: 32, align: 32, offset: 1344)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1005, file: !14, line: 1838, baseType: !1148, size: 32, align: 32, offset: 1376)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1005, file: !14, line: 1846, baseType: !921, size: 32, align: 32, offset: 1408)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1005, file: !14, line: 1851, baseType: !921, size: 32, align: 32, offset: 1440)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1005, file: !14, line: 1861, baseType: !1148, size: 32, align: 32, offset: 1472)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1005, file: !14, line: 1868, baseType: !1148, size: 32, align: 32, offset: 1504)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1005, file: !14, line: 1875, baseType: !1148, size: 32, align: 32, offset: 1536)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1005, file: !14, line: 1882, baseType: !1148, size: 32, align: 32, offset: 1568)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1005, file: !14, line: 1889, baseType: !1148, size: 32, align: 32, offset: 1600)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1005, file: !14, line: 1896, baseType: !1148, size: 32, align: 32, offset: 1632)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1005, file: !14, line: 1903, baseType: !1148, size: 32, align: 32, offset: 1664)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1005, file: !14, line: 1910, baseType: !921, size: 32, align: 32, offset: 1696)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1005, file: !14, line: 1915, baseType: !921, size: 32, align: 32, offset: 1728)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1005, file: !14, line: 1926, baseType: !1141, size: 64, align: 64, offset: 1792)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1005, file: !14, line: 1935, baseType: !925, size: 64, align: 32, offset: 1856)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1005, file: !14, line: 1942, baseType: !921, size: 32, align: 32, offset: 1920)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1005, file: !14, line: 1948, baseType: !921, size: 32, align: 32, offset: 1952)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1005, file: !14, line: 1954, baseType: !921, size: 32, align: 32, offset: 1984)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1005, file: !14, line: 1960, baseType: !921, size: 32, align: 32, offset: 2016)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1005, file: !14, line: 1984, baseType: !921, size: 32, align: 32, offset: 2048)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1005, file: !14, line: 1991, baseType: !921, size: 32, align: 32, offset: 2080)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1005, file: !14, line: 1996, baseType: !921, size: 32, align: 32, offset: 2112)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1005, file: !14, line: 2004, baseType: !921, size: 32, align: 32, offset: 2144)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1005, file: !14, line: 2011, baseType: !921, size: 32, align: 32, offset: 2176)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1005, file: !14, line: 2018, baseType: !921, size: 32, align: 32, offset: 2208)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1005, file: !14, line: 2027, baseType: !921, size: 32, align: 32, offset: 2240)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1005, file: !14, line: 2034, baseType: !921, size: 32, align: 32, offset: 2272)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1005, file: !14, line: 2044, baseType: !921, size: 32, align: 32, offset: 2304)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1005, file: !14, line: 2054, baseType: !1178, size: 64, align: 64, offset: 2368)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1005, file: !14, line: 2061, baseType: !1178, size: 64, align: 64, offset: 2432)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1005, file: !14, line: 2066, baseType: !921, size: 32, align: 32, offset: 2496)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1005, file: !14, line: 2070, baseType: !921, size: 32, align: 32, offset: 2528)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1005, file: !14, line: 2078, baseType: !921, size: 32, align: 32, offset: 2560)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1005, file: !14, line: 2085, baseType: !921, size: 32, align: 32, offset: 2592)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1005, file: !14, line: 2092, baseType: !921, size: 32, align: 32, offset: 2624)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1005, file: !14, line: 2099, baseType: !921, size: 32, align: 32, offset: 2656)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1005, file: !14, line: 2106, baseType: !921, size: 32, align: 32, offset: 2688)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1005, file: !14, line: 2113, baseType: !921, size: 32, align: 32, offset: 2720)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1005, file: !14, line: 2120, baseType: !921, size: 32, align: 32, offset: 2752)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1005, file: !14, line: 2125, baseType: !921, size: 32, align: 32, offset: 2784)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1005, file: !14, line: 2133, baseType: !921, size: 32, align: 32, offset: 2816)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1005, file: !14, line: 2140, baseType: !921, size: 32, align: 32, offset: 2848)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1005, file: !14, line: 2145, baseType: !921, size: 32, align: 32, offset: 2880)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1005, file: !14, line: 2153, baseType: !921, size: 32, align: 32, offset: 2912)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1005, file: !14, line: 2158, baseType: !921, size: 32, align: 32, offset: 2944)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1005, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1005, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1005, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1005, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1005, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1005, file: !14, line: 2203, baseType: !921, size: 32, align: 32, offset: 3136)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1005, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1005, file: !14, line: 2212, baseType: !921, size: 32, align: 32, offset: 3200)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1005, file: !14, line: 2213, baseType: !921, size: 32, align: 32, offset: 3232)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1005, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1005, file: !14, line: 2232, baseType: !921, size: 32, align: 32, offset: 3296)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1005, file: !14, line: 2243, baseType: !921, size: 32, align: 32, offset: 3328)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1005, file: !14, line: 2249, baseType: !921, size: 32, align: 32, offset: 3360)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1005, file: !14, line: 2256, baseType: !921, size: 32, align: 32, offset: 3392)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1005, file: !14, line: 2263, baseType: !943, size: 64, align: 64, offset: 3456)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1005, file: !14, line: 2270, baseType: !943, size: 64, align: 64, offset: 3520)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1005, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1005, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1005, file: !14, line: 2367, baseType: !1214, size: 64, align: 64, offset: 3648)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!921, !1043, !1217, !921}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1005, file: !14, line: 2383, baseType: !921, size: 32, align: 32, offset: 3712)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1005, file: !14, line: 2386, baseType: !1148, size: 32, align: 32, offset: 3744)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1005, file: !14, line: 2387, baseType: !1148, size: 32, align: 32, offset: 3776)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1005, file: !14, line: 2394, baseType: !921, size: 32, align: 32, offset: 3808)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1005, file: !14, line: 2401, baseType: !921, size: 32, align: 32, offset: 3840)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1005, file: !14, line: 2408, baseType: !921, size: 32, align: 32, offset: 3872)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1005, file: !14, line: 2415, baseType: !921, size: 32, align: 32, offset: 3904)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1005, file: !14, line: 2422, baseType: !921, size: 32, align: 32, offset: 3936)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1005, file: !14, line: 2423, baseType: !1227, size: 64, align: 64, offset: 3968)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1229, file: !14, line: 827, baseType: !921, size: 32, align: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1229, file: !14, line: 828, baseType: !921, size: 32, align: 32, offset: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1229, file: !14, line: 829, baseType: !921, size: 32, align: 32, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1229, file: !14, line: 830, baseType: !1148, size: 32, align: 32, offset: 96)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1005, file: !14, line: 2430, baseType: !1021, size: 64, align: 64, offset: 4032)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1005, file: !14, line: 2437, baseType: !1021, size: 64, align: 64, offset: 4096)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1005, file: !14, line: 2444, baseType: !1148, size: 32, align: 32, offset: 4160)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1005, file: !14, line: 2451, baseType: !1148, size: 32, align: 32, offset: 4192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1005, file: !14, line: 2458, baseType: !921, size: 32, align: 32, offset: 4224)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1005, file: !14, line: 2469, baseType: !921, size: 32, align: 32, offset: 4256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1005, file: !14, line: 2475, baseType: !921, size: 32, align: 32, offset: 4288)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1005, file: !14, line: 2481, baseType: !921, size: 32, align: 32, offset: 4320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1005, file: !14, line: 2485, baseType: !921, size: 32, align: 32, offset: 4352)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1005, file: !14, line: 2489, baseType: !921, size: 32, align: 32, offset: 4384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1005, file: !14, line: 2493, baseType: !921, size: 32, align: 32, offset: 4416)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1005, file: !14, line: 2501, baseType: !921, size: 32, align: 32, offset: 4448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1005, file: !14, line: 2506, baseType: !921, size: 32, align: 32, offset: 4480)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1005, file: !14, line: 2510, baseType: !921, size: 32, align: 32, offset: 4512)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1005, file: !14, line: 2514, baseType: !1021, size: 64, align: 64, offset: 4544)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1005, file: !14, line: 2528, baseType: !1251, size: 64, align: 64, offset: 4608)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{null, !1043, !906, !921, !921}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1005, file: !14, line: 2534, baseType: !921, size: 32, align: 32, offset: 4672)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1005, file: !14, line: 2545, baseType: !921, size: 32, align: 32, offset: 4704)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1005, file: !14, line: 2547, baseType: !921, size: 32, align: 32, offset: 4736)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1005, file: !14, line: 2549, baseType: !921, size: 32, align: 32, offset: 4768)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1005, file: !14, line: 2551, baseType: !921, size: 32, align: 32, offset: 4800)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1005, file: !14, line: 2553, baseType: !921, size: 32, align: 32, offset: 4832)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1005, file: !14, line: 2555, baseType: !921, size: 32, align: 32, offset: 4864)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1005, file: !14, line: 2557, baseType: !921, size: 32, align: 32, offset: 4896)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1005, file: !14, line: 2559, baseType: !921, size: 32, align: 32, offset: 4928)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1005, file: !14, line: 2563, baseType: !921, size: 32, align: 32, offset: 4960)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1005, file: !14, line: 2571, baseType: !1265, size: 64, align: 64, offset: 4992)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1005, file: !14, line: 2579, baseType: !1265, size: 64, align: 64, offset: 5056)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1005, file: !14, line: 2586, baseType: !921, size: 32, align: 32, offset: 5120)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1005, file: !14, line: 2615, baseType: !921, size: 32, align: 32, offset: 5152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1005, file: !14, line: 2627, baseType: !921, size: 32, align: 32, offset: 5184)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1005, file: !14, line: 2637, baseType: !921, size: 32, align: 32, offset: 5216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1005, file: !14, line: 2681, baseType: !921, size: 32, align: 32, offset: 5248)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1005, file: !14, line: 2709, baseType: !1021, size: 64, align: 64, offset: 5312)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1005, file: !14, line: 2716, baseType: !1274, size: 64, align: 64, offset: 5376)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283, !1287, !1293, !1297, !1298, !1299, !1300, !1306, !1307, !1308, !1309, !1310}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !14, line: 3642, baseType: !914, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1276, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1276, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1276, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1276, file: !14, line: 3669, baseType: !921, size: 32, align: 32, offset: 160)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1276, file: !14, line: 3682, baseType: !1284, size: 64, align: 64, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!921, !1003, !1217}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1276, file: !14, line: 3698, baseType: !1288, size: 64, align: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!921, !1003, !1291, !890}
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1276, file: !14, line: 3712, baseType: !1294, size: 64, align: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!921, !1003, !921, !1291, !890}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1276, file: !14, line: 3726, baseType: !1288, size: 64, align: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1276, file: !14, line: 3737, baseType: !1000, size: 64, align: 64, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1276, file: !14, line: 3746, baseType: !921, size: 32, align: 32, offset: 512)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1276, file: !14, line: 3757, baseType: !1301, size: 64, align: 64, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{null, !1304}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1276, file: !14, line: 3766, baseType: !1000, size: 64, align: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1276, file: !14, line: 3774, baseType: !1000, size: 64, align: 64, offset: 704)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1276, file: !14, line: 3780, baseType: !921, size: 32, align: 32, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1276, file: !14, line: 3785, baseType: !921, size: 32, align: 32, offset: 800)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1276, file: !14, line: 3795, baseType: !1311, size: 64, align: 64, offset: 832)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!921, !1003, !1082}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1005, file: !14, line: 2728, baseType: !906, size: 64, align: 64, offset: 5440)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1005, file: !14, line: 2735, baseType: !1072, size: 512, align: 64, offset: 5504)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1005, file: !14, line: 2742, baseType: !921, size: 32, align: 32, offset: 6016)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1005, file: !14, line: 2755, baseType: !921, size: 32, align: 32, offset: 6048)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1005, file: !14, line: 2776, baseType: !921, size: 32, align: 32, offset: 6080)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1005, file: !14, line: 2783, baseType: !921, size: 32, align: 32, offset: 6112)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1005, file: !14, line: 2791, baseType: !921, size: 32, align: 32, offset: 6144)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1005, file: !14, line: 2802, baseType: !1217, size: 64, align: 64, offset: 6208)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1005, file: !14, line: 2811, baseType: !921, size: 32, align: 32, offset: 6272)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1005, file: !14, line: 2821, baseType: !921, size: 32, align: 32, offset: 6304)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1005, file: !14, line: 2830, baseType: !921, size: 32, align: 32, offset: 6336)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1005, file: !14, line: 2840, baseType: !921, size: 32, align: 32, offset: 6368)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1005, file: !14, line: 2851, baseType: !1327, size: 64, align: 64, offset: 6400)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!921, !1043, !1330, !906, !1141, !921, !921}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!921, !1043, !906}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1005, file: !14, line: 2871, baseType: !1334, size: 64, align: 64, offset: 6464)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!921, !1043, !1337, !906, !1141, !921}
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!921, !1043, !906, !921, !921}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1005, file: !14, line: 2878, baseType: !921, size: 32, align: 32, offset: 6528)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1005, file: !14, line: 2885, baseType: !921, size: 32, align: 32, offset: 6560)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1005, file: !14, line: 3005, baseType: !921, size: 32, align: 32, offset: 6592)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1005, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1005, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1005, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1005, file: !14, line: 3037, baseType: !899, size: 64, align: 64, offset: 6720)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1005, file: !14, line: 3038, baseType: !921, size: 32, align: 32, offset: 6784)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1005, file: !14, line: 3050, baseType: !943, size: 64, align: 64, offset: 6848)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1005, file: !14, line: 3065, baseType: !921, size: 32, align: 32, offset: 6912)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1005, file: !14, line: 3083, baseType: !921, size: 32, align: 32, offset: 6944)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1005, file: !14, line: 3092, baseType: !925, size: 64, align: 32, offset: 6976)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1005, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1005, file: !14, line: 3106, baseType: !925, size: 64, align: 32, offset: 7072)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1005, file: !14, line: 3113, baseType: !1355, size: 64, align: 64, offset: 7168)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1368}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1358, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1358, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !14, line: 720, baseType: !914, size: 64, align: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1358, file: !14, line: 724, baseType: !914, size: 64, align: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1358, file: !14, line: 728, baseType: !921, size: 32, align: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1358, file: !14, line: 734, baseType: !1366, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1358, file: !14, line: 739, baseType: !1369, size: 64, align: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1005, file: !14, line: 3129, baseType: !1021, size: 64, align: 64, offset: 7232)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1005, file: !14, line: 3130, baseType: !1021, size: 64, align: 64, offset: 7296)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1005, file: !14, line: 3131, baseType: !1021, size: 64, align: 64, offset: 7360)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1005, file: !14, line: 3132, baseType: !1021, size: 64, align: 64, offset: 7424)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1005, file: !14, line: 3139, baseType: !1265, size: 64, align: 64, offset: 7488)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1005, file: !14, line: 3147, baseType: !921, size: 32, align: 32, offset: 7552)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1005, file: !14, line: 3165, baseType: !921, size: 32, align: 32, offset: 7584)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1005, file: !14, line: 3172, baseType: !921, size: 32, align: 32, offset: 7616)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1005, file: !14, line: 3180, baseType: !921, size: 32, align: 32, offset: 7648)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1005, file: !14, line: 3191, baseType: !1178, size: 64, align: 64, offset: 7680)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1005, file: !14, line: 3199, baseType: !899, size: 64, align: 64, offset: 7744)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1005, file: !14, line: 3207, baseType: !1265, size: 64, align: 64, offset: 7808)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1005, file: !14, line: 3214, baseType: !888, size: 32, align: 32, offset: 7872)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1005, file: !14, line: 3224, baseType: !1385, size: 64, align: 64, offset: 7936)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1388)
!1388 = !{!1389, !1390, !1391}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1387, file: !14, line: 1412, baseType: !899, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1387, file: !14, line: 1413, baseType: !921, size: 32, align: 32, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1387, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1005, file: !14, line: 3225, baseType: !921, size: 32, align: 32, offset: 8000)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1005, file: !14, line: 3249, baseType: !1082, size: 64, align: 64, offset: 8064)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1005, file: !14, line: 3256, baseType: !921, size: 32, align: 32, offset: 8128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1005, file: !14, line: 3271, baseType: !921, size: 32, align: 32, offset: 8160)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1005, file: !14, line: 3279, baseType: !1021, size: 64, align: 64, offset: 8192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1005, file: !14, line: 3301, baseType: !1082, size: 64, align: 64, offset: 8256)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1005, file: !14, line: 3310, baseType: !921, size: 32, align: 32, offset: 8320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1005, file: !14, line: 3337, baseType: !921, size: 32, align: 32, offset: 8352)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1005, file: !14, line: 3351, baseType: !921, size: 32, align: 32, offset: 8384)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1005, file: !14, line: 3359, baseType: !921, size: 32, align: 32, offset: 8416)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !911, file: !14, line: 3535, baseType: !1403, size: 64, align: 64, offset: 1024)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!921, !1003, !1406}
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !911, file: !14, line: 3541, baseType: !1409, size: 64, align: 64, offset: 1088)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1412)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !911, file: !14, line: 3549, baseType: !1414, size: 64, align: 64, offset: 1152)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !998}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !911, file: !14, line: 3551, baseType: !1000, size: 64, align: 64, offset: 1216)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !911, file: !14, line: 3552, baseType: !1419, size: 64, align: 64, offset: 1280)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!921, !1003, !899, !921, !1422}
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1457}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1424, file: !14, line: 3921, baseType: !897, size: 16, align: 16)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1424, file: !14, line: 3922, baseType: !890, size: 32, align: 32, offset: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1424, file: !14, line: 3923, baseType: !890, size: 32, align: 32, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1424, file: !14, line: 3924, baseType: !888, size: 32, align: 32, offset: 96)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1424, file: !14, line: 3925, baseType: !1431, size: 64, align: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440, !1441, !1447, !1451, !1453, !1454, !1455, !1456}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1434, file: !14, line: 3886, baseType: !921, size: 32, align: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1434, file: !14, line: 3887, baseType: !921, size: 32, align: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1434, file: !14, line: 3888, baseType: !921, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1434, file: !14, line: 3889, baseType: !921, size: 32, align: 32, offset: 96)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1434, file: !14, line: 3890, baseType: !921, size: 32, align: 32, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1434, file: !14, line: 3897, baseType: !1442, size: 768, align: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1444)
!1444 = !{!1445, !1446}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1443, file: !14, line: 3855, baseType: !1050, size: 512, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1443, file: !14, line: 3857, baseType: !1054, size: 256, align: 32, offset: 512)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1434, file: !14, line: 3903, baseType: !1448, size: 256, align: 64, offset: 960)
!1448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 256, align: 64, elements: !1449)
!1449 = !{!1450}
!1450 = !DISubrange(count: 4)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1434, file: !14, line: 3904, baseType: !1452, size: 128, align: 32, offset: 1216)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 128, align: 32, elements: !1449)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1434, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1434, file: !14, line: 3908, baseType: !1265, size: 64, align: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1434, file: !14, line: 3915, baseType: !1265, size: 64, align: 64, offset: 1472)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1434, file: !14, line: 3917, baseType: !921, size: 32, align: 32, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1424, file: !14, line: 3926, baseType: !1021, size: 64, align: 64, offset: 192)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !911, file: !14, line: 3564, baseType: !1459, size: 64, align: 64, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!921, !1003, !1462, !1044, !1141}
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1465)
!1465 = !{!1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1464, file: !14, line: 1451, baseType: !1082, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1464, file: !14, line: 1461, baseType: !1021, size: 64, align: 64, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1464, file: !14, line: 1467, baseType: !1021, size: 64, align: 64, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1464, file: !14, line: 1468, baseType: !899, size: 64, align: 64, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1464, file: !14, line: 1469, baseType: !921, size: 32, align: 32, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1464, file: !14, line: 1470, baseType: !921, size: 32, align: 32, offset: 288)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1464, file: !14, line: 1474, baseType: !921, size: 32, align: 32, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1464, file: !14, line: 1479, baseType: !1385, size: 64, align: 64, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1464, file: !14, line: 1480, baseType: !921, size: 32, align: 32, offset: 448)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1464, file: !14, line: 1486, baseType: !1021, size: 64, align: 64, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1464, file: !14, line: 1488, baseType: !1021, size: 64, align: 64, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1464, file: !14, line: 1497, baseType: !1021, size: 64, align: 64, offset: 640)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !911, file: !14, line: 3566, baseType: !1479, size: 64, align: 64, offset: 1408)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!921, !1003, !906, !1141, !1462}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !911, file: !14, line: 3567, baseType: !1000, size: 64, align: 64, offset: 1472)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !911, file: !14, line: 3576, baseType: !1484, size: 64, align: 64, offset: 1536)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!921, !1003, !1044}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !911, file: !14, line: 3577, baseType: !1488, size: 64, align: 64, offset: 1600)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!921, !1003, !1462}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !911, file: !14, line: 3584, baseType: !1284, size: 64, align: 64, offset: 1664)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !911, file: !14, line: 3589, baseType: !1493, size: 64, align: 64, offset: 1728)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1003}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !911, file: !14, line: 3594, baseType: !921, size: 32, align: 32, offset: 1792)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !911, file: !14, line: 3600, baseType: !914, size: 64, align: 64, offset: 1856)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !911, file: !14, line: 3609, baseType: !1499, size: 64, align: 64, offset: 1920)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1502)
!1502 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1503 = distinct !DIGlobalVariable(name: "tc_divs", scope: !1504, file: !909, line: 103, type: !1508, isLocal: true, isDefinition: true, variable: [3 x i32]* @make_tc.tc_divs)
!1504 = distinct !DISubprogram(name: "make_tc", scope: !909, file: !909, line: 101, type: !1505, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!921, !943, !1141}
!1507 = !{}
!1508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 96, align: 32, elements: !1509)
!1509 = !{!1510}
!1510 = !DISubrange(count: 3)
!1511 = !{i32 2, !"Dwarf Version", i32 4}
!1512 = !{i32 2, !"Debug Info Version", i32 3}
!1513 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1514 = distinct !DISubprogram(name: "xsub_encoder_init", scope: !909, file: !909, line: 217, type: !1001, isLocal: true, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1515 = !DILocalVariable(name: "avctx", arg: 1, scope: !1514, file: !909, line: 217, type: !1003)
!1516 = !DIExpression()
!1517 = !DILocation(line: 217, column: 68, scope: !1514)
!1518 = !DILocation(line: 219, column: 10, scope: !1519)
!1519 = distinct !DILexicalBlock(scope: !1514, file: !909, line: 219, column: 9)
!1520 = !DILocation(line: 219, column: 17, scope: !1519)
!1521 = !DILocation(line: 219, column: 9, scope: !1514)
!1522 = !DILocation(line: 220, column: 9, scope: !1519)
!1523 = !DILocation(line: 220, column: 16, scope: !1519)
!1524 = !DILocation(line: 220, column: 26, scope: !1519)
!1525 = !DILocation(line: 222, column: 5, scope: !1514)
!1526 = !DILocation(line: 222, column: 12, scope: !1514)
!1527 = !DILocation(line: 222, column: 34, scope: !1514)
!1528 = !DILocation(line: 224, column: 5, scope: !1514)
!1529 = distinct !DISubprogram(name: "xsub_encode", scope: !909, file: !909, line: 113, type: !1530, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!921, !1003, !1532, !921, !1533}
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1535)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1424)
!1536 = !DILocalVariable(name: "b", arg: 1, scope: !1537, file: !1538, line: 93, type: !1056)
!1537 = distinct !DISubprogram(name: "bytestream_put_be24", scope: !1538, file: !1538, line: 93, type: !1539, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1538 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1539 = !DISubroutineType(types: !1540)
!1540 = !{null, !1056, !1541}
!1541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!1542 = !DILocation(line: 93, column: 312, scope: !1537, inlinedAt: !1543)
!1543 = distinct !DILocation(line: 190, column: 9, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1545, file: !909, line: 189, column: 5)
!1545 = distinct !DILexicalBlock(scope: !1529, file: !909, line: 189, column: 5)
!1546 = !DILocalVariable(name: "value", arg: 2, scope: !1537, file: !1538, line: 93, type: !1541)
!1547 = !DILocation(line: 93, column: 334, scope: !1537, inlinedAt: !1543)
!1548 = !DILocalVariable(name: "b", arg: 1, scope: !1549, file: !1538, line: 90, type: !1056)
!1549 = distinct !DISubprogram(name: "bytestream_put_le16", scope: !1538, file: !1538, line: 90, type: !1539, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1507)
!1550 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1551)
!1551 = distinct !DILocation(line: 183, column: 5, scope: !1529)
!1552 = !DILocalVariable(name: "value", arg: 2, scope: !1549, file: !1538, line: 90, type: !1541)
!1553 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1551)
!1554 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1555)
!1555 = distinct !DILocation(line: 199, column: 5, scope: !1556)
!1556 = !DILexicalBlockFile(scope: !1529, file: !909, discriminator: 1)
!1557 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1555)
!1558 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1559)
!1559 = distinct !DILocation(line: 182, column: 5, scope: !1529)
!1560 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1559)
!1561 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1562)
!1562 = distinct !DILocation(line: 181, column: 5, scope: !1529)
!1563 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1562)
!1564 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1565)
!1565 = distinct !DILocation(line: 180, column: 5, scope: !1529)
!1566 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1565)
!1567 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1568)
!1568 = distinct !DILocation(line: 179, column: 5, scope: !1529)
!1569 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1568)
!1570 = !DILocation(line: 90, column: 246, scope: !1549, inlinedAt: !1571)
!1571 = distinct !DILocation(line: 178, column: 5, scope: !1529)
!1572 = !DILocation(line: 90, column: 268, scope: !1549, inlinedAt: !1571)
!1573 = !DILocalVariable(name: "avctx", arg: 1, scope: !1529, file: !909, line: 113, type: !1003)
!1574 = !DILocation(line: 113, column: 40, scope: !1529)
!1575 = !DILocalVariable(name: "buf", arg: 2, scope: !1529, file: !909, line: 113, type: !1532)
!1576 = !DILocation(line: 113, column: 62, scope: !1529)
!1577 = !DILocalVariable(name: "bufsize", arg: 3, scope: !1529, file: !909, line: 114, type: !921)
!1578 = !DILocation(line: 114, column: 28, scope: !1529)
!1579 = !DILocalVariable(name: "h", arg: 4, scope: !1529, file: !909, line: 114, type: !1533)
!1580 = !DILocation(line: 114, column: 55, scope: !1529)
!1581 = !DILocalVariable(name: "startTime", scope: !1529, file: !909, line: 116, type: !943)
!1582 = !DILocation(line: 116, column: 14, scope: !1529)
!1583 = !DILocation(line: 116, column: 26, scope: !1529)
!1584 = !DILocation(line: 116, column: 29, scope: !1529)
!1585 = !DILocation(line: 116, column: 33, scope: !1529)
!1586 = !DILocalVariable(name: "endTime", scope: !1529, file: !909, line: 117, type: !943)
!1587 = !DILocation(line: 117, column: 14, scope: !1529)
!1588 = !DILocation(line: 117, column: 24, scope: !1529)
!1589 = !DILocation(line: 117, column: 36, scope: !1529)
!1590 = !DILocation(line: 117, column: 39, scope: !1529)
!1591 = !DILocation(line: 117, column: 34, scope: !1529)
!1592 = !DILocation(line: 117, column: 58, scope: !1529)
!1593 = !DILocation(line: 117, column: 61, scope: !1529)
!1594 = !DILocation(line: 117, column: 56, scope: !1529)
!1595 = !DILocalVariable(name: "start_tc", scope: !1529, file: !909, line: 118, type: !1452)
!1596 = !DILocation(line: 118, column: 9, scope: !1529)
!1597 = !DILocalVariable(name: "end_tc", scope: !1529, file: !909, line: 118, type: !1452)
!1598 = !DILocation(line: 118, column: 22, scope: !1529)
!1599 = !DILocalVariable(name: "hdr", scope: !1529, file: !909, line: 119, type: !899)
!1600 = !DILocation(line: 119, column: 14, scope: !1529)
!1601 = !DILocation(line: 119, column: 20, scope: !1529)
!1602 = !DILocation(line: 119, column: 24, scope: !1529)
!1603 = !DILocalVariable(name: "rlelenptr", scope: !1529, file: !909, line: 120, type: !899)
!1604 = !DILocation(line: 120, column: 14, scope: !1529)
!1605 = !DILocalVariable(name: "width", scope: !1529, file: !909, line: 121, type: !897)
!1606 = !DILocation(line: 121, column: 14, scope: !1529)
!1607 = !DILocalVariable(name: "height", scope: !1529, file: !909, line: 121, type: !897)
!1608 = !DILocation(line: 121, column: 21, scope: !1529)
!1609 = !DILocalVariable(name: "i", scope: !1529, file: !909, line: 122, type: !921)
!1610 = !DILocation(line: 122, column: 9, scope: !1529)
!1611 = !DILocalVariable(name: "pb", scope: !1529, file: !909, line: 123, type: !1612)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1613, line: 40, baseType: !1614)
!1613 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1613, line: 35, size: 320, align: 64, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619, !1620, !1621}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1614, file: !1613, line: 36, baseType: !890, size: 32, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1614, file: !1613, line: 37, baseType: !921, size: 32, align: 32, offset: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1614, file: !1613, line: 38, baseType: !899, size: 64, align: 64, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1614, file: !1613, line: 38, baseType: !899, size: 64, align: 64, offset: 128)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1614, file: !1613, line: 38, baseType: !899, size: 64, align: 64, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1614, file: !1613, line: 39, baseType: !921, size: 32, align: 32, offset: 256)
!1622 = !DILocation(line: 123, column: 19, scope: !1529)
!1623 = !DILocation(line: 125, column: 9, scope: !1624)
!1624 = distinct !DILexicalBlock(scope: !1529, file: !909, line: 125, column: 9)
!1625 = !DILocation(line: 125, column: 17, scope: !1624)
!1626 = !DILocation(line: 125, column: 9, scope: !1529)
!1627 = !DILocation(line: 126, column: 16, scope: !1628)
!1628 = distinct !DILexicalBlock(scope: !1624, file: !909, line: 125, column: 35)
!1629 = !DILocation(line: 126, column: 9, scope: !1628)
!1630 = !DILocation(line: 127, column: 9, scope: !1628)
!1631 = !DILocation(line: 131, column: 9, scope: !1632)
!1632 = distinct !DILexicalBlock(scope: !1529, file: !909, line: 131, column: 9)
!1633 = !DILocation(line: 131, column: 12, scope: !1632)
!1634 = !DILocation(line: 131, column: 22, scope: !1632)
!1635 = !DILocation(line: 131, column: 9, scope: !1529)
!1636 = !DILocation(line: 132, column: 16, scope: !1632)
!1637 = !DILocation(line: 132, column: 78, scope: !1632)
!1638 = !DILocation(line: 132, column: 81, scope: !1632)
!1639 = !DILocation(line: 132, column: 9, scope: !1632)
!1640 = !DILocation(line: 136, column: 10, scope: !1641)
!1641 = distinct !DILexicalBlock(scope: !1529, file: !909, line: 136, column: 9)
!1642 = !DILocation(line: 136, column: 13, scope: !1641)
!1643 = !DILocation(line: 136, column: 23, scope: !1641)
!1644 = !DILocation(line: 136, column: 9, scope: !1529)
!1645 = !DILocalVariable(name: "rect", scope: !1646, file: !909, line: 137, type: !1432)
!1646 = distinct !DILexicalBlock(scope: !1641, file: !909, line: 136, column: 32)
!1647 = !DILocation(line: 137, column: 25, scope: !1646)
!1648 = !DILocation(line: 137, column: 32, scope: !1646)
!1649 = !DILocation(line: 137, column: 35, scope: !1646)
!1650 = !DILocalVariable(name: "j", scope: !1646, file: !909, line: 138, type: !921)
!1651 = !DILocation(line: 138, column: 13, scope: !1646)
!1652 = !DILocation(line: 139, column: 16, scope: !1653)
!1653 = distinct !DILexicalBlock(scope: !1646, file: !909, line: 139, column: 9)
!1654 = !DILocation(line: 139, column: 14, scope: !1653)
!1655 = !DILocation(line: 139, column: 21, scope: !1656)
!1656 = !DILexicalBlockFile(scope: !1657, file: !909, discriminator: 1)
!1657 = distinct !DILexicalBlock(scope: !1653, file: !909, line: 139, column: 9)
!1658 = !DILocation(line: 139, column: 23, scope: !1656)
!1659 = !DILocation(line: 139, column: 9, scope: !1656)
!1660 = !DILocation(line: 140, column: 45, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1657, file: !909, line: 139, column: 33)
!1662 = !DILocation(line: 140, column: 29, scope: !1661)
!1663 = !DILocation(line: 140, column: 35, scope: !1661)
!1664 = !DILocation(line: 140, column: 40, scope: !1661)
!1665 = !DILocation(line: 140, column: 24, scope: !1661)
!1666 = !DILocation(line: 140, column: 13, scope: !1661)
!1667 = !DILocation(line: 140, column: 19, scope: !1661)
!1668 = !DILocation(line: 140, column: 27, scope: !1661)
!1669 = !DILocation(line: 141, column: 53, scope: !1661)
!1670 = !DILocation(line: 141, column: 33, scope: !1661)
!1671 = !DILocation(line: 141, column: 39, scope: !1661)
!1672 = !DILocation(line: 141, column: 44, scope: !1661)
!1673 = !DILocation(line: 141, column: 28, scope: !1661)
!1674 = !DILocation(line: 141, column: 13, scope: !1661)
!1675 = !DILocation(line: 141, column: 19, scope: !1661)
!1676 = !DILocation(line: 141, column: 31, scope: !1661)
!1677 = !DILocation(line: 142, column: 9, scope: !1661)
!1678 = !DILocation(line: 139, column: 29, scope: !1679)
!1679 = !DILexicalBlockFile(scope: !1657, file: !909, discriminator: 2)
!1680 = !DILocation(line: 139, column: 9, scope: !1679)
!1681 = distinct !{!1681, !1682}
!1682 = !DILocation(line: 139, column: 9, scope: !1646)
!1683 = !DILocation(line: 143, column: 5, scope: !1646)
!1684 = !DILocation(line: 148, column: 10, scope: !1685)
