; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_sei.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_sei.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.H264SEIContext = type { %struct.H264SEIPictureTiming, %struct.H264SEIAFD, %struct.H264SEIA53Caption, %struct.H264SEIUnregistered, %struct.H264SEIRecoveryPoint, %struct.H264SEIBufferingPeriod, %struct.H264SEIFramePacking, %struct.H264SEIDisplayOrientation, %struct.H264SEIGreenMetaData, %struct.H264SEIAlternativeTransfer }
%struct.H264SEIPictureTiming = type { i32, i32, i32, i32, i32, [3 x %struct.H264SEITimeCode], i32 }
%struct.H264SEITimeCode = type { i32, i32, i32, i32, i32, i32 }
%struct.H264SEIAFD = type { i32, i8 }
%struct.H264SEIA53Caption = type { %struct.AVBufferRef* }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.H264SEIUnregistered = type { i32 }
%struct.H264SEIRecoveryPoint = type { i32 }
%struct.H264SEIBufferingPeriod = type { i32, [32 x i32] }
%struct.H264SEIFramePacking = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.H264SEIDisplayOrientation = type { i32, i32, i32, i32 }
%struct.H264SEIGreenMetaData = type { i8, i8, i16, i16, i8, i8, i8, i8, i8, i16 }
%struct.H264SEIAlternativeTransfer = type { i32, i32 }

!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!27 = !DIEnumerator(name: "AVCOL_PRI_RESERVED0", value: 0)
!28 = !DIEnumerator(name: "AVCOL_PRI_BT709", value: 1)
!29 = !DIEnumerator(name: "AVCOL_PRI_UNSPECIFIED", value: 2)
!30 = !DIEnumerator(name: "AVCOL_PRI_RESERVED", value: 3)
!31 = !DIEnumerator(name: "AVCOL_PRI_BT470M", value: 4)
!32 = !DIEnumerator(name: "AVCOL_PRI_BT470BG", value: 5)
!33 = !DIEnumerator(name: "AVCOL_PRI_SMPTE170M", value: 6)
!34 = !DIEnumerator(name: "AVCOL_PRI_SMPTE240M", value: 7)
!35 = !DIEnumerator(name: "AVCOL_PRI_FILM", value: 8)
!36 = !DIEnumerator(name: "AVCOL_PRI_BT2020", value: 9)
!37 = !DIEnumerator(name: "AVCOL_PRI_SMPTE428", value: 10)
!38 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!39 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!40 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!41 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!42 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !25, line: 464, size: 32, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!45 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!46 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!47 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!48 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!49 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!50 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!51 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!52 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!53 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!54 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!55 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!56 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!57 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!58 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!59 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!60 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!61 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!62 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!63 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!64 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!65 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!66 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !25, line: 493, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!69 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!70 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!71 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!72 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!73 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!74 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!75 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!76 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!77 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!78 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!79 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!80 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!81 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!82 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!83 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!84 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!85 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!86 = !{!87, !88, !89, !97, !99, !95}
!87 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!88 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !92, line: 221, size: 32, align: 8, elements: !93)
!92 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !91, file: !92, line: 221, baseType: !95, size: 32, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 51, baseType: !88)
!96 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !96, line: 48, baseType: !98)
!98 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPS", file: !102, line: 104, baseType: !103)
!102 = !DIFile(filename: "libavcodec/h264_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SPS", file: !102, line: 44, size: 42432, align: 64, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !152, !153, !154, !155, !160, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !180}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !103, file: !102, line: 45, baseType: !88, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !103, file: !102, line: 46, baseType: !87, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !103, file: !102, line: 47, baseType: !87, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !103, file: !102, line: 48, baseType: !87, size: 32, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "transform_bypass", scope: !103, file: !102, line: 49, baseType: !87, size: 32, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num", scope: !103, file: !102, line: 50, baseType: !87, size: 32, align: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "poc_type", scope: !103, file: !102, line: 51, baseType: !87, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !103, file: !102, line: 52, baseType: !87, size: 32, align: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !103, file: !102, line: 53, baseType: !87, size: 32, align: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !103, file: !102, line: 54, baseType: !87, size: 32, align: 32, offset: 288)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !103, file: !102, line: 55, baseType: !87, size: 32, align: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "poc_cycle_length", scope: !103, file: !102, line: 56, baseType: !87, size: 32, align: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_count", scope: !103, file: !102, line: 57, baseType: !87, size: 32, align: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_allowed_flag", scope: !103, file: !102, line: 58, baseType: !87, size: 32, align: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !103, file: !102, line: 59, baseType: !87, size: 32, align: 32, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !103, file: !102, line: 61, baseType: !87, size: 32, align: 32, offset: 480)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !103, file: !102, line: 62, baseType: !87, size: 32, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff", scope: !103, file: !102, line: 63, baseType: !87, size: 32, align: 32, offset: 544)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !103, file: !102, line: 64, baseType: !87, size: 32, align: 32, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !103, file: !102, line: 65, baseType: !87, size: 32, align: 32, offset: 608)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !103, file: !102, line: 68, baseType: !88, size: 32, align: 32, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !103, file: !102, line: 69, baseType: !88, size: 32, align: 32, offset: 672)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !103, file: !102, line: 70, baseType: !88, size: 32, align: 32, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !103, file: !102, line: 71, baseType: !88, size: 32, align: 32, offset: 736)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !103, file: !102, line: 72, baseType: !87, size: 32, align: 32, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !103, file: !102, line: 73, baseType: !131, size: 64, align: 32, offset: 800)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !132, line: 61, baseType: !133)
!132 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !132, line: 58, size: 64, align: 32, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !133, file: !132, line: 59, baseType: !87, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !133, file: !132, line: 60, baseType: !87, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !103, file: !102, line: 74, baseType: !87, size: 32, align: 32, offset: 864)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "full_range", scope: !103, file: !102, line: 75, baseType: !87, size: 32, align: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !103, file: !102, line: 76, baseType: !87, size: 32, align: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !103, file: !102, line: 77, baseType: !24, size: 32, align: 32, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !103, file: !102, line: 78, baseType: !43, size: 32, align: 32, offset: 992)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !103, file: !102, line: 79, baseType: !67, size: 32, align: 32, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !103, file: !102, line: 80, baseType: !87, size: 32, align: 32, offset: 1056)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !103, file: !102, line: 81, baseType: !95, size: 32, align: 32, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !103, file: !102, line: 82, baseType: !95, size: 32, align: 32, offset: 1120)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !103, file: !102, line: 83, baseType: !87, size: 32, align: 32, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !103, file: !102, line: 84, baseType: !148, size: 4096, align: 16, offset: 1184)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 4096, align: 16, elements: !150)
!149 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!150 = !{!151}
!151 = !DISubrange(count: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !103, file: !102, line: 85, baseType: !87, size: 32, align: 32, offset: 5280)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !103, file: !102, line: 86, baseType: !87, size: 32, align: 32, offset: 5312)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix_present", scope: !103, file: !102, line: 87, baseType: !87, size: 32, align: 32, offset: 5344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !103, file: !102, line: 88, baseType: !156, size: 768, align: 8, offset: 5376)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 768, align: 8, elements: !157)
!157 = !{!158, !159}
!158 = !DISubrange(count: 6)
!159 = !DISubrange(count: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !103, file: !102, line: 89, baseType: !161, size: 3072, align: 8, offset: 6144)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 3072, align: 8, elements: !162)
!162 = !{!158, !163}
!163 = !DISubrange(count: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !103, file: !102, line: 90, baseType: !87, size: 32, align: 32, offset: 9216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !103, file: !102, line: 91, baseType: !87, size: 32, align: 32, offset: 9248)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !103, file: !102, line: 92, baseType: !87, size: 32, align: 32, offset: 9280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !103, file: !102, line: 93, baseType: !87, size: 32, align: 32, offset: 9312)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !103, file: !102, line: 94, baseType: !87, size: 32, align: 32, offset: 9344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length", scope: !103, file: !102, line: 95, baseType: !87, size: 32, align: 32, offset: 9376)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length", scope: !103, file: !102, line: 96, baseType: !87, size: 32, align: 32, offset: 9408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length", scope: !103, file: !102, line: 97, baseType: !87, size: 32, align: 32, offset: 9440)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma", scope: !103, file: !102, line: 98, baseType: !87, size: 32, align: 32, offset: 9472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !103, file: !102, line: 99, baseType: !87, size: 32, align: 32, offset: 9504)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "residual_color_transform_flag", scope: !103, file: !102, line: 100, baseType: !87, size: 32, align: 32, offset: 9536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set_flags", scope: !103, file: !102, line: 101, baseType: !87, size: 32, align: 32, offset: 9568)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !102, line: 102, baseType: !177, size: 32768, align: 8, offset: 9600)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32768, align: 8, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 4096)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !103, file: !102, line: 103, baseType: !181, size: 64, align: 64, offset: 42368)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !182, line: 216, baseType: !183)
!182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!183 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!184 = !{!185}
!185 = distinct !DIGlobalVariable(name: "sei_num_clock_ts_table", scope: !0, file: !186, line: 37, type: !187, isLocal: true, isDefinition: true, variable: [9 x i8]* @sei_num_clock_ts_table)
!186 = !DIFile(filename: "libavcodec/h264_sei.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 72, align: 8, elements: !189)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!189 = !{!190}
!190 = !DISubrange(count: 9)
!191 = !{i32 2, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!194 = distinct !DISubprogram(name: "ff_h264_sei_uninit", scope: !186, file: !186, line: 41, type: !195, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !310)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIContext", file: !4, line: 188, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIContext", file: !4, line: 177, size: 2624, align: 64, elements: !200)
!200 = !{!201, !225, !231, !248, !253, !258, !267, !280, !288, !304}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "picture_timing", scope: !199, file: !4, line: 178, baseType: !202, size: 768, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIPictureTiming", file: !4, line: 111, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIPictureTiming", file: !4, line: 81, size: 768, align: 32, elements: !204)
!204 = !{!205, !206, !208, !209, !210, !211, !224}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !203, file: !4, line: 82, baseType: !87, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct", scope: !203, file: !4, line: 83, baseType: !207, size: 32, align: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264_SEI_PicStructType", file: !4, line: 55, baseType: !3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ct_type", scope: !203, file: !4, line: 90, baseType: !87, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay", scope: !203, file: !4, line: 95, baseType: !87, size: 32, align: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay", scope: !203, file: !4, line: 100, baseType: !87, size: 32, align: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "timecode", scope: !203, file: !4, line: 105, baseType: !212, size: 576, align: 32, offset: 160)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 576, align: 32, elements: !222)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEITimeCode", file: !4, line: 79, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEITimeCode", file: !4, line: 70, size: 192, align: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !214, file: !4, line: 73, baseType: !87, size: 32, align: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !214, file: !4, line: 74, baseType: !87, size: 32, align: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !214, file: !4, line: 75, baseType: !87, size: 32, align: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !214, file: !4, line: 76, baseType: !87, size: 32, align: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "hours", scope: !214, file: !4, line: 77, baseType: !87, size: 32, align: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dropframe", scope: !214, file: !4, line: 78, baseType: !87, size: 32, align: 32, offset: 160)
!222 = !{!223}
!223 = !DISubrange(count: 3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_cnt", scope: !203, file: !4, line: 110, baseType: !87, size: 32, align: 32, offset: 736)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "afd", scope: !199, file: !4, line: 179, baseType: !226, size: 64, align: 32, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIAFD", file: !4, line: 116, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIAFD", file: !4, line: 113, size: 64, align: 32, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !227, file: !4, line: 114, baseType: !87, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "active_format_description", scope: !227, file: !4, line: 115, baseType: !97, size: 8, align: 8, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption", scope: !199, file: !4, line: 180, baseType: !232, size: 64, align: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIA53Caption", file: !4, line: 120, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIA53Caption", file: !4, line: 118, size: 64, align: 64, elements: !234)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ref", scope: !233, file: !4, line: 119, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !238, line: 94, baseType: !239)
!238 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !238, line: 81, size: 192, align: 64, elements: !240)
!240 = !{!241, !245, !247}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !238, line: 82, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !238, line: 73, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !238, line: 73, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !238, line: 89, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !239, file: !238, line: 93, baseType: !87, size: 32, align: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "unregistered", scope: !199, file: !4, line: 181, baseType: !249, size: 32, align: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIUnregistered", file: !4, line: 124, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIUnregistered", file: !4, line: 122, size: 32, align: 32, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "x264_build", scope: !250, file: !4, line: 123, baseType: !87, size: 32, align: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !199, file: !4, line: 182, baseType: !254, size: 32, align: 32, offset: 928)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIRecoveryPoint", file: !4, line: 135, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIRecoveryPoint", file: !4, line: 126, size: 32, align: 32, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !255, file: !4, line: 134, baseType: !87, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "buffering_period", scope: !199, file: !4, line: 183, baseType: !259, size: 1056, align: 32, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIBufferingPeriod", file: !4, line: 140, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIBufferingPeriod", file: !4, line: 137, size: 1056, align: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !260, file: !4, line: 138, baseType: !87, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !260, file: !4, line: 139, baseType: !264, size: 1024, align: 32, offset: 32)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1024, align: 32, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "frame_packing", scope: !199, file: !4, line: 184, baseType: !268, size: 256, align: 32, offset: 2016)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIFramePacking", file: !4, line: 151, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIFramePacking", file: !4, line: 142, size: 256, align: 32, elements: !270)
!270 = !{!271, !272, !273, !274, !276, !277, !278, !279}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !269, file: !4, line: 143, baseType: !87, size: 32, align: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arrangement_id", scope: !269, file: !4, line: 144, baseType: !87, size: 32, align: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arrangement_cancel_flag", scope: !269, file: !4, line: 145, baseType: !87, size: 32, align: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "arrangement_type", scope: !269, file: !4, line: 146, baseType: !275, size: 32, align: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264_SEI_FpaType", file: !4, line: 68, baseType: !15)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "arrangement_repetition_period", scope: !269, file: !4, line: 147, baseType: !87, size: 32, align: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "content_interpretation_type", scope: !269, file: !4, line: 148, baseType: !87, size: 32, align: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "quincunx_sampling_flag", scope: !269, file: !4, line: 149, baseType: !87, size: 32, align: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame_is_frame0_flag", scope: !269, file: !4, line: 150, baseType: !87, size: 32, align: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "display_orientation", scope: !199, file: !4, line: 185, baseType: !281, size: 128, align: 32, offset: 2272)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIDisplayOrientation", file: !4, line: 157, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIDisplayOrientation", file: !4, line: 153, size: 128, align: 32, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !282, file: !4, line: 154, baseType: !87, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "anticlockwise_rotation", scope: !282, file: !4, line: 155, baseType: !87, size: 32, align: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "hflip", scope: !282, file: !4, line: 156, baseType: !87, size: 32, align: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vflip", scope: !282, file: !4, line: 156, baseType: !87, size: 32, align: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "green_metadata", scope: !199, file: !4, line: 186, baseType: !289, size: 112, align: 16, offset: 2400)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIGreenMetaData", file: !4, line: 170, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIGreenMetaData", file: !4, line: 159, size: 112, align: 16, elements: !291)
!291 = !{!292, !293, !294, !297, !298, !299, !300, !301, !302, !303}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "green_metadata_type", scope: !290, file: !4, line: 160, baseType: !97, size: 8, align: 8)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "period_type", scope: !290, file: !4, line: 161, baseType: !97, size: 8, align: 8, offset: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "num_seconds", scope: !290, file: !4, line: 162, baseType: !295, size: 16, align: 16, offset: 16)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !96, line: 49, baseType: !296)
!296 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "num_pictures", scope: !290, file: !4, line: 163, baseType: !295, size: 16, align: 16, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "percent_non_zero_macroblocks", scope: !290, file: !4, line: 164, baseType: !97, size: 8, align: 8, offset: 48)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "percent_intra_coded_macroblocks", scope: !290, file: !4, line: 165, baseType: !97, size: 8, align: 8, offset: 56)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "percent_six_tap_filtering", scope: !290, file: !4, line: 166, baseType: !97, size: 8, align: 8, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "percent_alpha_point_deblocking_instance", scope: !290, file: !4, line: 167, baseType: !97, size: 8, align: 8, offset: 72)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "xsd_metric_type", scope: !290, file: !4, line: 168, baseType: !97, size: 8, align: 8, offset: 80)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "xsd_metric_value", scope: !290, file: !4, line: 169, baseType: !295, size: 16, align: 16, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "alternative_transfer", scope: !199, file: !4, line: 187, baseType: !305, size: 64, align: 32, offset: 2528)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264SEIAlternativeTransfer", file: !4, line: 175, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264SEIAlternativeTransfer", file: !4, line: 172, size: 64, align: 32, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !306, file: !4, line: 173, baseType: !87, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_transfer_characteristics", scope: !306, file: !4, line: 174, baseType: !87, size: 32, align: 32, offset: 32)
!310 = !{}
!311 = !DILocalVariable(name: "h", arg: 1, scope: !194, file: !186, line: 41, type: !197)
!312 = !DIExpression()
!313 = !DILocation(line: 41, column: 41, scope: !194)
!314 = !DILocation(line: 43, column: 5, scope: !194)
!315 = !DILocation(line: 43, column: 8, scope: !194)
!316 = !DILocation(line: 43, column: 23, scope: !194)
!317 = !DILocation(line: 43, column: 42, scope: !194)
!318 = !DILocation(line: 45, column: 5, scope: !194)
!319 = !DILocation(line: 45, column: 8, scope: !194)
!320 = !DILocation(line: 45, column: 23, scope: !194)
!321 = !DILocation(line: 45, column: 40, scope: !194)
!322 = !DILocation(line: 46, column: 5, scope: !194)
!323 = !DILocation(line: 46, column: 8, scope: !194)
!324 = !DILocation(line: 46, column: 23, scope: !194)
!325 = !DILocation(line: 46, column: 41, scope: !194)
!326 = !DILocation(line: 48, column: 5, scope: !194)
!327 = !DILocation(line: 48, column: 8, scope: !194)
!328 = !DILocation(line: 48, column: 23, scope: !194)
!329 = !DILocation(line: 48, column: 31, scope: !194)
!330 = !DILocation(line: 49, column: 5, scope: !194)
!331 = !DILocation(line: 49, column: 8, scope: !194)
!332 = !DILocation(line: 49, column: 25, scope: !194)
!333 = !DILocation(line: 49, column: 33, scope: !194)
!334 = !DILocation(line: 50, column: 5, scope: !194)
!335 = !DILocation(line: 50, column: 8, scope: !194)
!336 = !DILocation(line: 50, column: 22, scope: !194)
!337 = !DILocation(line: 50, column: 30, scope: !194)
!338 = !DILocation(line: 51, column: 5, scope: !194)
!339 = !DILocation(line: 51, column: 8, scope: !194)
!340 = !DILocation(line: 51, column: 28, scope: !194)
!341 = !DILocation(line: 51, column: 36, scope: !194)
!342 = !DILocation(line: 52, column: 5, scope: !194)
!343 = !DILocation(line: 52, column: 8, scope: !194)
!344 = !DILocation(line: 52, column: 12, scope: !194)
!345 = !DILocation(line: 52, column: 20, scope: !194)
!346 = !DILocation(line: 54, column: 22, scope: !194)
!347 = !DILocation(line: 54, column: 25, scope: !194)
!348 = !DILocation(line: 54, column: 37, scope: !194)
!349 = !DILocation(line: 54, column: 5, scope: !194)
!350 = !DILocation(line: 55, column: 1, scope: !194)
!351 = distinct !DISubprogram(name: "ff_h264_sei_decode", scope: !186, file: !186, line: 404, type: !352, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !310)
!352 = !DISubroutineType(types: !353)
!353 = !{!87, !197, !354, !365, !428}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !356, line: 70, baseType: !357)
!356 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !356, line: 61, size: 256, align: 64, elements: !358)
!358 = !{!359, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !357, file: !356, line: 62, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !357, file: !356, line: 62, baseType: !360, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !357, file: !356, line: 67, baseType: !87, size: 32, align: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !357, file: !356, line: 68, baseType: !87, size: 32, align: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !357, file: !356, line: 69, baseType: !87, size: 32, align: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264ParamSets", file: !102, line: 147, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264ParamSets", file: !102, line: 138, size: 18688, align: 64, elements: !369)
!369 = !{!370, !372, !374, !375, !376, !427}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sps_list", scope: !368, file: !102, line: 139, baseType: !371, size: 2048, align: 64)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 2048, align: 64, elements: !265)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pps_list", scope: !368, file: !102, line: 140, baseType: !373, size: 16384, align: 64, offset: 2048)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 16384, align: 64, elements: !150)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pps_ref", scope: !368, file: !102, line: 142, baseType: !236, size: 64, align: 64, offset: 18432)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sps_ref", scope: !368, file: !102, line: 143, baseType: !236, size: 64, align: 64, offset: 18496)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !368, file: !102, line: 145, baseType: !377, size: 64, align: 64, offset: 18560)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPS", file: !102, line: 136, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PPS", file: !102, line: 109, size: 1391104, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !391, !392, !393, !394, !395, !397, !398, !399, !400, !401, !402, !403, !407, !408, !409, !410, !413, !416, !422}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !380, file: !102, line: 110, baseType: !88, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !380, file: !102, line: 111, baseType: !87, size: 32, align: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present", scope: !380, file: !102, line: 112, baseType: !87, size: 32, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_count", scope: !380, file: !102, line: 113, baseType: !87, size: 32, align: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mb_slice_group_map_type", scope: !380, file: !102, line: 114, baseType: !87, size: 32, align: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !380, file: !102, line: 115, baseType: !388, size: 64, align: 32, offset: 160)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 64, align: 32, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 2)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred", scope: !380, file: !102, line: 116, baseType: !87, size: 32, align: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !380, file: !102, line: 117, baseType: !87, size: 32, align: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "init_qp", scope: !380, file: !102, line: 118, baseType: !87, size: 32, align: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "init_qs", scope: !380, file: !102, line: 119, baseType: !87, size: 32, align: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !380, file: !102, line: 120, baseType: !396, size: 64, align: 32, offset: 352)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, align: 32, elements: !389)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_parameters_present", scope: !380, file: !102, line: 121, baseType: !87, size: 32, align: 32, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred", scope: !380, file: !102, line: 122, baseType: !87, size: 32, align: 32, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present", scope: !380, file: !102, line: 123, baseType: !87, size: 32, align: 32, offset: 480)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode", scope: !380, file: !102, line: 124, baseType: !87, size: 32, align: 32, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !380, file: !102, line: 125, baseType: !156, size: 768, align: 8, offset: 544)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !380, file: !102, line: 126, baseType: !161, size: 3072, align: 8, offset: 1312)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !380, file: !102, line: 127, baseType: !404, size: 1408, align: 8, offset: 4384)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 1408, align: 8, elements: !405)
!405 = !{!390, !406}
!406 = !DISubrange(count: 88)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_diff", scope: !380, file: !102, line: 128, baseType: !87, size: 32, align: 32, offset: 5792)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !380, file: !102, line: 129, baseType: !177, size: 32768, align: 8, offset: 5824)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !380, file: !102, line: 130, baseType: !181, size: 64, align: 64, offset: 38592)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_buffer", scope: !380, file: !102, line: 132, baseType: !411, size: 270336, align: 32, offset: 38656)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 270336, align: 32, elements: !412)
!412 = !{!158, !406, !159}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_buffer", scope: !380, file: !102, line: 133, baseType: !414, size: 1081344, align: 32, offset: 308992)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 1081344, align: 32, elements: !415)
!415 = !{!158, !406, !163}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_coeff", scope: !380, file: !102, line: 134, baseType: !417, size: 384, align: 64, offset: 1390336)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 384, align: 64, elements: !421)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 512, align: 32, elements: !420)
!420 = !{!159}
!421 = !{!158}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_coeff", scope: !380, file: !102, line: 135, baseType: !423, size: 384, align: 64, offset: 1390720)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 384, align: 64, elements: !421)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, align: 32, elements: !426)
!426 = !{!163}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !368, file: !102, line: 146, baseType: !99, size: 64, align: 64, offset: 18624)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!429 = !DILocalVariable(name: "h", arg: 1, scope: !351, file: !186, line: 404, type: !197)
!430 = !DILocation(line: 404, column: 40, scope: !351)
!431 = !DILocalVariable(name: "gb", arg: 2, scope: !351, file: !186, line: 404, type: !354)
!432 = !DILocation(line: 404, column: 58, scope: !351)
!433 = !DILocalVariable(name: "ps", arg: 3, scope: !351, file: !186, line: 405, type: !365)
!434 = !DILocation(line: 405, column: 45, scope: !351)
!435 = !DILocalVariable(name: "logctx", arg: 4, scope: !351, file: !186, line: 405, type: !428)
!436 = !DILocation(line: 405, column: 55, scope: !351)
!437 = !DILocalVariable(name: "master_ret", scope: !351, file: !186, line: 407, type: !87)
!438 = !DILocation(line: 407, column: 9, scope: !351)
!439 = !DILocation(line: 409, column: 5, scope: !351)
!440 = !DILocation(line: 409, column: 26, scope: !441)
!441 = !DILexicalBlockFile(scope: !351, file: !186, discriminator: 1)
!442 = !DILocation(line: 409, column: 12, scope: !441)
!443 = !DILocation(line: 409, column: 30, scope: !441)
!444 = !DILocation(line: 409, column: 35, scope: !441)
!445 = !DILocation(line: 409, column: 48, scope: !446)
!446 = !DILexicalBlockFile(scope: !351, file: !186, discriminator: 2)
!447 = !DILocation(line: 409, column: 38, scope: !446)
!448 = !DILocation(line: 409, column: 35, scope: !446)
!449 = !DILocation(line: 409, column: 5, scope: !450)
!450 = !DILexicalBlockFile(scope: !351, file: !186, discriminator: 3)
!451 = !DILocalVariable(name: "type", scope: !452, file: !186, line: 410, type: !87)
!452 = distinct !DILexicalBlock(scope: !351, file: !186, line: 409, column: 57)
!453 = !DILocation(line: 410, column: 13, scope: !452)
!454 = !DILocalVariable(name: "size", scope: !452, file: !186, line: 411, type: !88)
!455 = !DILocation(line: 411, column: 18, scope: !452)
!456 = !DILocalVariable(name: "next", scope: !452, file: !186, line: 412, type: !88)
!457 = !DILocation(line: 412, column: 18, scope: !452)
!458 = !DILocalVariable(name: "ret", scope: !452, file: !186, line: 413, type: !87)
!459 = !DILocation(line: 413, column: 13, scope: !452)
!460 = !DILocation(line: 415, column: 9, scope: !452)
!461 = distinct !{!461, !460}
!462 = !DILocation(line: 416, column: 31, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !186, line: 416, column: 17)
!464 = distinct !DILexicalBlock(scope: !452, file: !186, line: 415, column: 12)
!465 = !DILocation(line: 416, column: 17, scope: !463)
!466 = !DILocation(line: 416, column: 35, scope: !463)
!467 = !DILocation(line: 416, column: 17, scope: !464)
!468 = !DILocation(line: 417, column: 17, scope: !463)
!469 = !DILocation(line: 418, column: 31, scope: !464)
!470 = !DILocation(line: 418, column: 21, scope: !464)
!471 = !DILocation(line: 418, column: 18, scope: !464)
!472 = !DILocation(line: 419, column: 9, scope: !464)
!473 = !DILocation(line: 419, column: 27, scope: !474)
!474 = !DILexicalBlockFile(scope: !452, file: !186, discriminator: 1)
!475 = !DILocation(line: 419, column: 18, scope: !474)
!476 = !DILocation(line: 419, column: 34, scope: !474)
!477 = !DILocation(line: 419, column: 9, scope: !474)
!478 = !DILocation(line: 421, column: 9, scope: !452)
!479 = distinct !{!479, !478}
!480 = !DILocation(line: 422, column: 31, scope: !481)
!481 = distinct !DILexicalBlock(scope: !482, file: !186, line: 422, column: 17)
!482 = distinct !DILexicalBlock(scope: !452, file: !186, line: 421, column: 12)
!483 = !DILocation(line: 422, column: 17, scope: !481)
!484 = !DILocation(line: 422, column: 35, scope: !481)
!485 = !DILocation(line: 422, column: 17, scope: !482)
!486 = !DILocation(line: 423, column: 17, scope: !481)
!487 = !DILocation(line: 424, column: 31, scope: !482)
!488 = !DILocation(line: 424, column: 21, scope: !482)
!489 = !DILocation(line: 424, column: 18, scope: !482)
