; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--imgconvert.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--imgconvert.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVPixFmtDescriptor = type { i8*, i8, i8, i8, i64, [4 x %struct.AVComponentDescriptor], i8* }
%struct.AVComponentDescriptor = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVPicture = type { [8 x i8*], [8 x i32] }

@.str = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"desc\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"libavcodec/imgconvert.c\00", align 1

; Function Attrs: nounwind uwtable
define void @avcodec_get_chroma_sub_sample(i32 %pix_fmt, i32* %h_shift, i32* %v_shift) #0 !dbg !208 {
entry:
  %pix_fmt.addr = alloca i32, align 4
  %h_shift.addr = alloca i32*, align 8
  %v_shift.addr = alloca i32*, align 8
  %desc = alloca %struct.AVPixFmtDescriptor*, align 8
  store i32 %pix_fmt, i32* %pix_fmt.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %pix_fmt.addr, metadata !215, metadata !216), !dbg !217
  store i32* %h_shift, i32** %h_shift.addr, align 8
  call void @llvm.dbg.declare(metadata i32** %h_shift.addr, metadata !218, metadata !216), !dbg !219

!146 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!147 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!148 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!149 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!150 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!151 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!152 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!153 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!154 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!155 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!156 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!157 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!158 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!159 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!160 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!161 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!162 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!163 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!164 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!165 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!166 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!167 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!168 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!169 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!170 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!171 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!172 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!173 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!174 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!175 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!176 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!177 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!178 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!179 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!180 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!181 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!182 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!183 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!184 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!185 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!186 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!187 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!188 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!189 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!190 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!191 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!192 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!193 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!194 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!195 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!196 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!197 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!198 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!199 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!200 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!201 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!202 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!205 = !{i32 2, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!208 = distinct !DISubprogram(name: "avcodec_get_chroma_sub_sample", scope: !209, file: !209, line: 38, type: !210, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !214)
!209 = !DIFile(filename: "libavcodec/imgconvert.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!210 = !DISubroutineType(types: !211)
!211 = !{null, !3, !212, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!214 = !{}
!215 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !208, file: !209, line: 38, type: !3)
!216 = !DIExpression()
!217 = !DILocation(line: 38, column: 55, scope: !208)
!218 = !DILocalVariable(name: "h_shift", arg: 2, scope: !208, file: !209, line: 38, type: !212)
!219 = !DILocation(line: 38, column: 69, scope: !208)
!220 = !DILocalVariable(name: "v_shift", arg: 3, scope: !208, file: !209, line: 38, type: !212)
!221 = !DILocation(line: 38, column: 83, scope: !208)
!222 = !DILocalVariable(name: "desc", scope: !208, file: !209, line: 40, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !226, line: 123, baseType: !227)
!226 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !226, line: 81, size: 1280, align: 64, elements: !228)
!228 = !{!229, !233, !237, !238, !239, !242, !257}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !226, line: 82, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !227, file: !226, line: 83, baseType: !234, size: 8, align: 8, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !235, line: 48, baseType: !236)
!235 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!236 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !227, file: !226, line: 92, baseType: !234, size: 8, align: 8, offset: 72)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !227, file: !226, line: 101, baseType: !234, size: 8, align: 8, offset: 80)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !227, file: !226, line: 106, baseType: !240, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !235, line: 55, baseType: !241)
!241 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !227, file: !226, line: 117, baseType: !243, size: 1024, align: 32, offset: 192)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 1024, align: 32, elements: !255)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !226, line: 70, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !226, line: 31, size: 256, align: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !245, file: !226, line: 35, baseType: !213, size: 32, align: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !245, file: !226, line: 41, baseType: !213, size: 32, align: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !245, file: !226, line: 47, baseType: !213, size: 32, align: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !245, file: !226, line: 53, baseType: !213, size: 32, align: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !245, file: !226, line: 58, baseType: !213, size: 32, align: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !245, file: !226, line: 62, baseType: !213, size: 32, align: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !245, file: !226, line: 65, baseType: !213, size: 32, align: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !245, file: !226, line: 68, baseType: !213, size: 32, align: 32, offset: 224)
!255 = !{!256}
!256 = !DISubrange(count: 4)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !227, file: !226, line: 122, baseType: !230, size: 64, align: 64, offset: 1216)
!258 = !DILocation(line: 40, column: 31, scope: !208)
!259 = !DILocation(line: 40, column: 58, scope: !208)
!260 = !DILocation(line: 40, column: 38, scope: !208)
!261 = !DILocation(line: 41, column: 5, scope: !208)
!262 = distinct !{!262, !261}
!263 = !DILocation(line: 41, column: 16, scope: !264)
!264 = !DILexicalBlockFile(scope: !265, file: !209, discriminator: 1)
!265 = distinct !DILexicalBlock(scope: !266, file: !209, line: 41, column: 14)
!266 = distinct !DILexicalBlock(scope: !208, file: !209, line: 41, column: 8)
!267 = !DILocation(line: 41, column: 15, scope: !264)
!268 = !DILocation(line: 41, column: 14, scope: !264)
!269 = !DILocation(line: 41, column: 25, scope: !270)
!270 = !DILexicalBlockFile(scope: !271, file: !209, discriminator: 2)
!271 = distinct !DILexicalBlock(scope: !265, file: !209, line: 41, column: 23)
!272 = !DILocation(line: 41, column: 83, scope: !273)
!273 = !DILexicalBlockFile(scope: !270, file: !209, discriminator: 4)
!274 = !DILocation(line: 41, column: 83, scope: !270)
!275 = !DILocation(line: 41, column: 94, scope: !276)
!276 = !DILexicalBlockFile(scope: !266, file: !209, discriminator: 3)
!277 = !DILocation(line: 42, column: 16, scope: !208)
!278 = !DILocation(line: 42, column: 22, scope: !208)
!279 = !DILocation(line: 42, column: 6, scope: !208)
!280 = !DILocation(line: 42, column: 14, scope: !208)
!281 = !DILocation(line: 43, column: 16, scope: !208)
!282 = !DILocation(line: 43, column: 22, scope: !208)
!283 = !DILocation(line: 43, column: 6, scope: !208)
!284 = !DILocation(line: 43, column: 14, scope: !208)
!285 = !DILocation(line: 44, column: 1, scope: !208)
!286 = distinct !DISubprogram(name: "avcodec_get_pix_fmt_loss", scope: !209, file: !209, line: 47, type: !287, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !214)
!287 = !DISubroutineType(types: !288)
!288 = !{!213, !3, !3, !213}
!289 = !DILocalVariable(name: "dst_pix_fmt", arg: 1, scope: !286, file: !209, line: 47, type: !3)
!290 = !DILocation(line: 47, column: 49, scope: !286)
!291 = !DILocalVariable(name: "src_pix_fmt", arg: 2, scope: !286, file: !209, line: 48, type: !3)
!292 = !DILocation(line: 48, column: 49, scope: !286)
!293 = !DILocalVariable(name: "has_alpha", arg: 3, scope: !286, file: !209, line: 49, type: !213)
!294 = !DILocation(line: 49, column: 34, scope: !286)
!295 = !DILocation(line: 51, column: 32, scope: !286)
!296 = !DILocation(line: 51, column: 45, scope: !286)
!297 = !DILocation(line: 51, column: 58, scope: !286)
!298 = !DILocation(line: 51, column: 12, scope: !286)
!299 = !DILocation(line: 51, column: 5, scope: !286)
!300 = distinct !DISubprogram(name: "avcodec_find_best_pix_fmt_of_2", scope: !209, file: !209, line: 54, type: !301, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !214)
!301 = !DISubroutineType(types: !302)
!302 = !{!3, !3, !3, !3, !213, !212}
!303 = !DILocalVariable(name: "dst_pix_fmt1", arg: 1, scope: !300, file: !209, line: 54, type: !3)
!304 = !DILocation(line: 54, column: 70, scope: !300)
!305 = !DILocalVariable(name: "dst_pix_fmt2", arg: 2, scope: !300, file: !209, line: 54, type: !3)
!306 = !DILocation(line: 54, column: 103, scope: !300)
!307 = !DILocalVariable(name: "src_pix_fmt", arg: 3, scope: !300, file: !209, line: 55, type: !3)
!308 = !DILocation(line: 55, column: 64, scope: !300)
!309 = !DILocalVariable(name: "has_alpha", arg: 4, scope: !300, file: !209, line: 55, type: !213)
!310 = !DILocation(line: 55, column: 81, scope: !300)
!311 = !DILocalVariable(name: "loss_ptr", arg: 5, scope: !300, file: !209, line: 55, type: !212)
!312 = !DILocation(line: 55, column: 97, scope: !300)
!313 = !DILocation(line: 57, column: 38, scope: !300)
!314 = !DILocation(line: 57, column: 52, scope: !300)
!315 = !DILocation(line: 57, column: 66, scope: !300)
!316 = !DILocation(line: 57, column: 79, scope: !300)
!317 = !DILocation(line: 57, column: 90, scope: !300)
!318 = !DILocation(line: 57, column: 12, scope: !300)
!319 = !DILocation(line: 57, column: 5, scope: !300)
!320 = distinct !DISubprogram(name: "avcodec_find_best_pix_fmt2", scope: !209, file: !209, line: 60, type: !301, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !214)
!321 = !DILocalVariable(name: "dst_pix_fmt1", arg: 1, scope: !320, file: !209, line: 60, type: !3)
!322 = !DILocation(line: 60, column: 66, scope: !320)
!323 = !DILocalVariable(name: "dst_pix_fmt2", arg: 2, scope: !320, file: !209, line: 60, type: !3)
!324 = !DILocation(line: 60, column: 99, scope: !320)
!325 = !DILocalVariable(name: "src_pix_fmt", arg: 3, scope: !320, file: !209, line: 61, type: !3)
!326 = !DILocation(line: 61, column: 64, scope: !320)
!327 = !DILocalVariable(name: "has_alpha", arg: 4, scope: !320, file: !209, line: 61, type: !213)
!328 = !DILocation(line: 61, column: 81, scope: !320)
!329 = !DILocalVariable(name: "loss_ptr", arg: 5, scope: !320, file: !209, line: 61, type: !212)
!330 = !DILocation(line: 61, column: 97, scope: !320)
!331 = !DILocation(line: 63, column: 43, scope: !320)
!332 = !DILocation(line: 63, column: 57, scope: !320)
!333 = !DILocation(line: 63, column: 71, scope: !320)
!334 = !DILocation(line: 63, column: 84, scope: !320)
!335 = !DILocation(line: 63, column: 95, scope: !320)
!336 = !DILocation(line: 63, column: 12, scope: !320)
!337 = !DILocation(line: 63, column: 5, scope: !320)
!338 = distinct !DISubprogram(name: "avcodec_find_best_pix_fmt_of_list", scope: !209, file: !209, line: 66, type: !339, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !214)
!339 = !DISubroutineType(types: !340)
!340 = !{!3, !341, !3, !213, !212}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!343 = !DILocalVariable(name: "pix_fmt_list", arg: 1, scope: !338, file: !209, line: 66, type: !341)
!344 = !DILocation(line: 66, column: 80, scope: !338)
!345 = !DILocalVariable(name: "src_pix_fmt", arg: 2, scope: !338, file: !209, line: 67, type: !3)
!346 = !DILocation(line: 67, column: 64, scope: !338)
!347 = !DILocalVariable(name: "has_alpha", arg: 3, scope: !338, file: !209, line: 68, type: !213)
!348 = !DILocation(line: 68, column: 49, scope: !338)
!349 = !DILocalVariable(name: "loss_ptr", arg: 4, scope: !338, file: !209, line: 68, type: !212)
!350 = !DILocation(line: 68, column: 65, scope: !338)
!351 = !DILocalVariable(name: "i", scope: !338, file: !209, line: 69, type: !213)
!352 = !DILocation(line: 69, column: 9, scope: !338)
!353 = !DILocalVariable(name: "best", scope: !338, file: !209, line: 71, type: !3)
!354 = !DILocation(line: 71, column: 24, scope: !338)
!355 = !DILocalVariable(name: "loss", scope: !338, file: !209, line: 72, type: !213)
!356 = !DILocation(line: 72, column: 9, scope: !338)
!357 = !DILocation(line: 74, column: 11, scope: !358)
!358 = distinct !DILexicalBlock(scope: !338, file: !209, line: 74, column: 5)
!359 = !DILocation(line: 74, column: 10, scope: !358)
!360 = !DILocation(line: 74, column: 28, scope: !361)
!361 = !DILexicalBlockFile(scope: !362, file: !209, discriminator: 1)
!362 = distinct !DILexicalBlock(scope: !358, file: !209, line: 74, column: 5)
!363 = !DILocation(line: 74, column: 15, scope: !361)
!364 = !DILocation(line: 74, column: 31, scope: !361)
!365 = !DILocation(line: 74, column: 5, scope: !361)
!366 = !DILocation(line: 75, column: 16, scope: !367)
!367 = distinct !DILexicalBlock(scope: !362, file: !209, line: 74, column: 56)
!368 = !DILocation(line: 75, column: 28, scope: !369)
!369 = !DILexicalBlockFile(scope: !367, file: !209, discriminator: 1)
!370 = !DILocation(line: 75, column: 27, scope: !369)
!371 = !DILocation(line: 75, column: 16, scope: !369)
!372 = !DILocation(line: 75, column: 16, scope: !373)
!373 = !DILexicalBlockFile(scope: !367, file: !209, discriminator: 2)
!374 = !DILocation(line: 75, column: 16, scope: !375)
!375 = !DILexicalBlockFile(scope: !367, file: !209, discriminator: 3)
!376 = !DILocation(line: 75, column: 14, scope: !375)
!377 = !DILocation(line: 76, column: 47, scope: !367)
!378 = !DILocation(line: 76, column: 66, scope: !367)
!379 = !DILocation(line: 76, column: 53, scope: !367)
!380 = !DILocation(line: 76, column: 70, scope: !367)
!381 = !DILocation(line: 76, column: 83, scope: !367)
!382 = !DILocation(line: 76, column: 16, scope: !367)
!383 = !DILocation(line: 76, column: 14, scope: !367)
!384 = !DILocation(line: 77, column: 5, scope: !367)
!385 = !DILocation(line: 74, column: 52, scope: !386)
!386 = !DILexicalBlockFile(scope: !362, file: !209, discriminator: 2)
!387 = !DILocation(line: 74, column: 5, scope: !386)
!388 = distinct !{!388, !389}
!389 = !DILocation(line: 74, column: 5, scope: !338)
!390 = !DILocation(line: 79, column: 9, scope: !391)
!391 = distinct !DILexicalBlock(scope: !338, file: !209, line: 79, column: 9)
!392 = !DILocation(line: 79, column: 9, scope: !338)
!393 = !DILocation(line: 80, column: 21, scope: !391)
!394 = !DILocation(line: 80, column: 10, scope: !391)
!395 = !DILocation(line: 80, column: 19, scope: !391)
!396 = !DILocation(line: 80, column: 9, scope: !391)
!397 = !DILocation(line: 81, column: 12, scope: !338)
!398 = !DILocation(line: 81, column: 5, scope: !338)
!399 = distinct !DISubprogram(name: "av_picture_crop", scope: !209, file: !209, line: 107, type: !400, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !214)
!400 = !DISubroutineType(types: !401)
!401 = !{!213, !402, !414, !3, !213, !213}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !404, line: 3858, baseType: !405)
!404 = !DIFile(filename: "libavcodec/avcodec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !404, line: 3853, size: 768, align: 64, elements: !406)
!406 = !{!407, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !404, line: 3855, baseType: !408, size: 512, align: 64)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 512, align: 64, elements: !410)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!410 = !{!411}
!411 = !DISubrange(count: 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !405, file: !404, line: 3857, baseType: !413, size: 256, align: 32, offset: 512)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 256, align: 32, elements: !410)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!416 = !DILocalVariable(name: "dst", arg: 1, scope: !399, file: !209, line: 107, type: !402)
!417 = !DILocation(line: 107, column: 32, scope: !399)
!418 = !DILocalVariable(name: "src", arg: 2, scope: !399, file: !209, line: 107, type: !414)
!419 = !DILocation(line: 107, column: 54, scope: !399)
!420 = !DILocalVariable(name: "pix_fmt", arg: 3, scope: !399, file: !209, line: 108, type: !3)
!421 = !DILocation(line: 108, column: 40, scope: !399)
!422 = !DILocalVariable(name: "top_band", arg: 4, scope: !399, file: !209, line: 108, type: !213)
!423 = !DILocation(line: 108, column: 53, scope: !399)
!424 = !DILocalVariable(name: "left_band", arg: 5, scope: !399, file: !209, line: 108, type: !213)
!425 = !DILocation(line: 108, column: 67, scope: !399)
!426 = !DILocalVariable(name: "desc", scope: !399, file: !209, line: 110, type: !223)
!427 = !DILocation(line: 110, column: 31, scope: !399)
!428 = !DILocation(line: 110, column: 58, scope: !399)
!429 = !DILocation(line: 110, column: 38, scope: !399)
!430 = !DILocalVariable(name: "y_shift", scope: !399, file: !209, line: 111, type: !213)
!431 = !DILocation(line: 111, column: 9, scope: !399)
!432 = !DILocalVariable(name: "x_shift", scope: !399, file: !209, line: 112, type: !213)
!433 = !DILocation(line: 112, column: 9, scope: !399)
!434 = !DILocalVariable(name: "max_step", scope: !399, file: !209, line: 113, type: !435)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, align: 32, elements: !255)
!436 = !DILocation(line: 113, column: 9, scope: !399)
!437 = !DILocation(line: 115, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !399, file: !209, line: 115, column: 9)
!439 = !DILocation(line: 115, column: 17, scope: !438)
!440 = !DILocation(line: 115, column: 21, scope: !438)
!441 = !DILocation(line: 115, column: 24, scope: !442)
!442 = !DILexicalBlockFile(scope: !438, file: !209, discriminator: 1)
!443 = !DILocation(line: 115, column: 32, scope: !442)
!444 = !DILocation(line: 115, column: 9, scope: !442)
!445 = !DILocation(line: 116, column: 9, scope: !438)
!446 = !DILocation(line: 118, column: 15, scope: !399)
!447 = !DILocation(line: 118, column: 21, scope: !399)
!448 = !DILocation(line: 118, column: 13, scope: !399)
!449 = !DILocation(line: 119, column: 15, scope: !399)
!450 = !DILocation(line: 119, column: 21, scope: !399)
!451 = !DILocation(line: 119, column: 13, scope: !399)
!452 = !DILocation(line: 120, column: 32, scope: !399)
!453 = !DILocation(line: 120, column: 47, scope: !399)
!454 = !DILocation(line: 120, column: 5, scope: !399)
!455 = !DILocation(line: 122, column: 23, scope: !456)
!456 = distinct !DILexicalBlock(scope: !399, file: !209, line: 122, column: 9)
!457 = !DILocation(line: 122, column: 9, scope: !456)
!458 = !DILocation(line: 122, column: 9, scope: !399)
!459 = !DILocation(line: 123, column: 20, scope: !460)
!460 = distinct !DILexicalBlock(scope: !456, file: !209, line: 122, column: 30)
!461 = !DILocation(line: 123, column: 25, scope: !460)
!462 = !DILocation(line: 123, column: 36, scope: !460)
!463 = !DILocation(line: 123, column: 47, scope: !460)
!464 = !DILocation(line: 123, column: 52, scope: !460)
!465 = !DILocation(line: 123, column: 45, scope: !460)
!466 = !DILocation(line: 123, column: 33, scope: !460)
!467 = !DILocation(line: 123, column: 67, scope: !460)
!468 = !DILocation(line: 123, column: 65, scope: !460)
!469 = !DILocation(line: 123, column: 5, scope: !460)
!470 = !DILocation(line: 123, column: 10, scope: !460)
!471 = !DILocation(line: 123, column: 18, scope: !460)
!472 = !DILocation(line: 124, column: 20, scope: !460)
