; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegaudiodecheader.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegaudiodecheader.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MPADecodeHeader = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@avpriv_mpa_freq_tab = external constant [3 x i16], align 2
@avpriv_mpa_bitrate_tab = external constant [2 x [3 x [15 x i16]]], align 16

; Function Attrs: nounwind uwtable
define i32 @avpriv_mpegaudio_decode_header(%struct.MPADecodeHeader* %s, i32 %header) #0 !dbg !466 {
entry:
  %retval = alloca i32, align 4
  %s.addr = alloca %struct.MPADecodeHeader*, align 8
  %header.addr = alloca i32, align 4
  %sample_rate = alloca i32, align 4
  %frame_size = alloca i32, align 4
  %mpeg25 = alloca i32, align 4
  %padding = alloca i32, align 4
  %sample_rate_index = alloca i32, align 4
  %bitrate_index = alloca i32, align 4
  %ret = alloca i32, align 4
  store %struct.MPADecodeHeader* %s, %struct.MPADecodeHeader** %s.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.MPADecodeHeader** %s.addr, metadata !490, metadata !491), !dbg !492
  store i32 %header, i32* %header.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %header.addr, metadata !493, metadata !491), !dbg !494

!391 = !DIEnumerator(name: "AV_CODEC_ID_COMFORT_NOISE", value: 86077)
!392 = !DIEnumerator(name: "AV_CODEC_ID_TAK", value: 86078)
!393 = !DIEnumerator(name: "AV_CODEC_ID_METASOUND", value: 86079)
!394 = !DIEnumerator(name: "AV_CODEC_ID_PAF_AUDIO", value: 86080)
!395 = !DIEnumerator(name: "AV_CODEC_ID_ON2AVC", value: 86081)
!396 = !DIEnumerator(name: "AV_CODEC_ID_DSS_SP", value: 86082)
!397 = !DIEnumerator(name: "AV_CODEC_ID_CODEC2", value: 86083)
!398 = !DIEnumerator(name: "AV_CODEC_ID_FFWAVESYNTH", value: 88064)
!399 = !DIEnumerator(name: "AV_CODEC_ID_SONIC", value: 88065)
!400 = !DIEnumerator(name: "AV_CODEC_ID_SONIC_LS", value: 88066)
!401 = !DIEnumerator(name: "AV_CODEC_ID_EVRC", value: 88067)
!402 = !DIEnumerator(name: "AV_CODEC_ID_SMV", value: 88068)
!403 = !DIEnumerator(name: "AV_CODEC_ID_DSD_LSBF", value: 88069)
!404 = !DIEnumerator(name: "AV_CODEC_ID_DSD_MSBF", value: 88070)
!405 = !DIEnumerator(name: "AV_CODEC_ID_DSD_LSBF_PLANAR", value: 88071)
!406 = !DIEnumerator(name: "AV_CODEC_ID_DSD_MSBF_PLANAR", value: 88072)
!407 = !DIEnumerator(name: "AV_CODEC_ID_4GV", value: 88073)
!408 = !DIEnumerator(name: "AV_CODEC_ID_INTERPLAY_ACM", value: 88074)
!409 = !DIEnumerator(name: "AV_CODEC_ID_XMA1", value: 88075)
!410 = !DIEnumerator(name: "AV_CODEC_ID_XMA2", value: 88076)
!411 = !DIEnumerator(name: "AV_CODEC_ID_DST", value: 88077)
!412 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC3AL", value: 88078)
!413 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC3PAL", value: 88079)
!414 = !DIEnumerator(name: "AV_CODEC_ID_DOLBY_E", value: 88080)
!415 = !DIEnumerator(name: "AV_CODEC_ID_APTX", value: 88081)
!416 = !DIEnumerator(name: "AV_CODEC_ID_APTX_HD", value: 88082)
!417 = !DIEnumerator(name: "AV_CODEC_ID_SBC", value: 88083)
!418 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC9", value: 88084)
!419 = !DIEnumerator(name: "AV_CODEC_ID_HCOM", value: 88085)
!420 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_SUBTITLE", value: 94208)
!421 = !DIEnumerator(name: "AV_CODEC_ID_DVD_SUBTITLE", value: 94208)
!422 = !DIEnumerator(name: "AV_CODEC_ID_DVB_SUBTITLE", value: 94209)
!423 = !DIEnumerator(name: "AV_CODEC_ID_TEXT", value: 94210)
!424 = !DIEnumerator(name: "AV_CODEC_ID_XSUB", value: 94211)
!425 = !DIEnumerator(name: "AV_CODEC_ID_SSA", value: 94212)
!426 = !DIEnumerator(name: "AV_CODEC_ID_MOV_TEXT", value: 94213)
!427 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_PGS_SUBTITLE", value: 94214)
!428 = !DIEnumerator(name: "AV_CODEC_ID_DVB_TELETEXT", value: 94215)
!429 = !DIEnumerator(name: "AV_CODEC_ID_SRT", value: 94216)
!430 = !DIEnumerator(name: "AV_CODEC_ID_MICRODVD", value: 96256)
!431 = !DIEnumerator(name: "AV_CODEC_ID_EIA_608", value: 96257)
!432 = !DIEnumerator(name: "AV_CODEC_ID_JACOSUB", value: 96258)
!433 = !DIEnumerator(name: "AV_CODEC_ID_SAMI", value: 96259)
!434 = !DIEnumerator(name: "AV_CODEC_ID_REALTEXT", value: 96260)
!435 = !DIEnumerator(name: "AV_CODEC_ID_STL", value: 96261)
!436 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER1", value: 96262)
!437 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER", value: 96263)
!438 = !DIEnumerator(name: "AV_CODEC_ID_SUBRIP", value: 96264)
!439 = !DIEnumerator(name: "AV_CODEC_ID_WEBVTT", value: 96265)
!440 = !DIEnumerator(name: "AV_CODEC_ID_MPL2", value: 96266)
!441 = !DIEnumerator(name: "AV_CODEC_ID_VPLAYER", value: 96267)
!442 = !DIEnumerator(name: "AV_CODEC_ID_PJS", value: 96268)
!443 = !DIEnumerator(name: "AV_CODEC_ID_ASS", value: 96269)
!444 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_TEXT_SUBTITLE", value: 96270)
!445 = !DIEnumerator(name: "AV_CODEC_ID_TTML", value: 96271)
!446 = !DIEnumerator(name: "AV_CODEC_ID_ARIB_CAPTION", value: 96272)
!447 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_UNKNOWN", value: 98304)
!448 = !DIEnumerator(name: "AV_CODEC_ID_TTF", value: 98304)
!449 = !DIEnumerator(name: "AV_CODEC_ID_SCTE_35", value: 98305)
!450 = !DIEnumerator(name: "AV_CODEC_ID_BINTEXT", value: 100352)
!451 = !DIEnumerator(name: "AV_CODEC_ID_XBIN", value: 100353)
!452 = !DIEnumerator(name: "AV_CODEC_ID_IDF", value: 100354)
!453 = !DIEnumerator(name: "AV_CODEC_ID_OTF", value: 100355)
!454 = !DIEnumerator(name: "AV_CODEC_ID_SMPTE_KLV", value: 100356)
!455 = !DIEnumerator(name: "AV_CODEC_ID_DVD_NAV", value: 100357)
!456 = !DIEnumerator(name: "AV_CODEC_ID_TIMED_ID3", value: 100358)
!457 = !DIEnumerator(name: "AV_CODEC_ID_BIN_DATA", value: 100359)
!458 = !DIEnumerator(name: "AV_CODEC_ID_PROBE", value: 102400)
!459 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2TS", value: 131072)
!460 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4SYSTEMS", value: 131073)
!461 = !DIEnumerator(name: "AV_CODEC_ID_FFMETADATA", value: 135168)
!462 = !DIEnumerator(name: "AV_CODEC_ID_WRAPPED_AVFRAME", value: 135169)
!463 = !{i32 2, !"Dwarf Version", i32 4}
!464 = !{i32 2, !"Debug Info Version", i32 3}
!465 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!466 = distinct !DISubprogram(name: "avpriv_mpegaudio_decode_header", scope: !467, file: !467, line: 36, type: !468, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !489)
!467 = !DIFile(filename: "libavcodec/mpegaudiodecheader.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !471, !486}
!470 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPADecodeHeader", file: !473, line: 48, baseType: !474)
!473 = !DIFile(filename: "libavcodec/mpegaudiodecheader.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPADecodeHeader", file: !473, line: 46, size: 320, align: 32, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "error_protection", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate_index", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channels", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mode_ext", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !474, file: !473, line: 47, baseType: !470, size: 32, align: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !487, line: 51, baseType: !488)
!487 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!488 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!489 = !{}
!490 = !DILocalVariable(name: "s", arg: 1, scope: !466, file: !467, line: 36, type: !471)
!491 = !DIExpression()
!492 = !DILocation(line: 36, column: 53, scope: !466)
!493 = !DILocalVariable(name: "header", arg: 2, scope: !466, file: !467, line: 36, type: !486)
!494 = !DILocation(line: 36, column: 65, scope: !466)
!495 = !DILocalVariable(name: "sample_rate", scope: !466, file: !467, line: 38, type: !470)
!496 = !DILocation(line: 38, column: 9, scope: !466)
!497 = !DILocalVariable(name: "frame_size", scope: !466, file: !467, line: 38, type: !470)
!498 = !DILocation(line: 38, column: 22, scope: !466)
!499 = !DILocalVariable(name: "mpeg25", scope: !466, file: !467, line: 38, type: !470)
!500 = !DILocation(line: 38, column: 34, scope: !466)
!501 = !DILocalVariable(name: "padding", scope: !466, file: !467, line: 38, type: !470)
!502 = !DILocation(line: 38, column: 42, scope: !466)
!503 = !DILocalVariable(name: "sample_rate_index", scope: !466, file: !467, line: 39, type: !470)
!504 = !DILocation(line: 39, column: 9, scope: !466)
!505 = !DILocalVariable(name: "bitrate_index", scope: !466, file: !467, line: 39, type: !470)
!506 = !DILocation(line: 39, column: 28, scope: !466)
!507 = !DILocalVariable(name: "ret", scope: !466, file: !467, line: 40, type: !470)
!508 = !DILocation(line: 40, column: 9, scope: !466)
!509 = !DILocation(line: 42, column: 31, scope: !466)
!510 = !DILocation(line: 42, column: 11, scope: !466)
!511 = !DILocation(line: 42, column: 9, scope: !466)
!512 = !DILocation(line: 43, column: 9, scope: !513)
!513 = distinct !DILexicalBlock(scope: !466, file: !467, line: 43, column: 9)
!514 = !DILocation(line: 43, column: 13, scope: !513)
!515 = !DILocation(line: 43, column: 9, scope: !466)
!516 = !DILocation(line: 44, column: 16, scope: !513)
!517 = !DILocation(line: 44, column: 9, scope: !513)
!518 = !DILocation(line: 46, column: 9, scope: !519)
!519 = distinct !DILexicalBlock(scope: !466, file: !467, line: 46, column: 9)
!520 = !DILocation(line: 46, column: 16, scope: !519)
!521 = !DILocation(line: 46, column: 9, scope: !466)
!522 = !DILocation(line: 47, column: 19, scope: !523)
!523 = distinct !DILexicalBlock(scope: !519, file: !467, line: 46, column: 27)
!524 = !DILocation(line: 47, column: 26, scope: !523)
!525 = !DILocation(line: 47, column: 18, scope: !523)
!526 = !DILocation(line: 47, column: 9, scope: !523)
!527 = !DILocation(line: 47, column: 12, scope: !523)
!528 = !DILocation(line: 47, column: 16, scope: !523)
!529 = !DILocation(line: 48, column: 16, scope: !523)
!530 = !DILocation(line: 49, column: 5, scope: !523)
!531 = !DILocation(line: 50, column: 9, scope: !532)
!532 = distinct !DILexicalBlock(scope: !519, file: !467, line: 49, column: 12)
!533 = !DILocation(line: 50, column: 12, scope: !532)
!534 = !DILocation(line: 50, column: 16, scope: !532)
!535 = !DILocation(line: 51, column: 16, scope: !532)
!536 = !DILocation(line: 54, column: 22, scope: !466)
!537 = !DILocation(line: 54, column: 29, scope: !466)
!538 = !DILocation(line: 54, column: 36, scope: !466)
!539 = !DILocation(line: 54, column: 18, scope: !466)
!540 = !DILocation(line: 54, column: 5, scope: !466)
!541 = !DILocation(line: 54, column: 8, scope: !466)
!542 = !DILocation(line: 54, column: 14, scope: !466)
!543 = !DILocation(line: 56, column: 26, scope: !466)
!544 = !DILocation(line: 56, column: 33, scope: !466)
!545 = !DILocation(line: 56, column: 40, scope: !466)
!546 = !DILocation(line: 56, column: 23, scope: !466)
!547 = !DILocation(line: 57, column: 9, scope: !548)
