; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--extract_extradata_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--extract_extradata_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!694 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL47", value: 47)
!695 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!696 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!697 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!698 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!699 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!700 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!701 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!702 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!703 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!704 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!705 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!706 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!707 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!708 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!709 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!710 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 33, size: 32, align: 32, elements: !713)
!712 = !DIFile(filename: "libavcodec/h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!714 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED", value: 0)
!715 = !DIEnumerator(name: "H264_NAL_SLICE", value: 1)
!716 = !DIEnumerator(name: "H264_NAL_DPA", value: 2)
!717 = !DIEnumerator(name: "H264_NAL_DPB", value: 3)
!718 = !DIEnumerator(name: "H264_NAL_DPC", value: 4)
!719 = !DIEnumerator(name: "H264_NAL_IDR_SLICE", value: 5)
!720 = !DIEnumerator(name: "H264_NAL_SEI", value: 6)
!721 = !DIEnumerator(name: "H264_NAL_SPS", value: 7)
!722 = !DIEnumerator(name: "H264_NAL_PPS", value: 8)
!723 = !DIEnumerator(name: "H264_NAL_AUD", value: 9)
!724 = !DIEnumerator(name: "H264_NAL_END_SEQUENCE", value: 10)
!725 = !DIEnumerator(name: "H264_NAL_END_STREAM", value: 11)
!726 = !DIEnumerator(name: "H264_NAL_FILLER_DATA", value: 12)
!727 = !DIEnumerator(name: "H264_NAL_SPS_EXT", value: 13)
!728 = !DIEnumerator(name: "H264_NAL_PREFIX", value: 14)
!729 = !DIEnumerator(name: "H264_NAL_SUB_SPS", value: 15)
!730 = !DIEnumerator(name: "H264_NAL_DPS", value: 16)
!731 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!732 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!733 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!734 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!735 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!736 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!737 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!738 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!739 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!740 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!741 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!742 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!743 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!744 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!745 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VC1Code", file: !747, line: 33, size: 32, align: 32, elements: !748)
!747 = !DIFile(filename: "libavcodec/vc1_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!748 = !{!749, !750, !751, !752, !753, !754, !755}
!749 = !DIEnumerator(name: "VC1_CODE_RES0", value: 256)
!750 = !DIEnumerator(name: "VC1_CODE_ENDOFSEQ", value: 266)
!751 = !DIEnumerator(name: "VC1_CODE_SLICE", value: 267)
!752 = !DIEnumerator(name: "VC1_CODE_FIELD", value: 268)
!753 = !DIEnumerator(name: "VC1_CODE_FRAME", value: 269)
!754 = !DIEnumerator(name: "VC1_CODE_ENTRYPOINT", value: 270)
!755 = !DIEnumerator(name: "VC1_CODE_SEQHDR", value: 271)
!756 = !{!757, !758, !759}
!757 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!758 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !761, line: 48, baseType: !762)
!761 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!762 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!763 = !{!764, !960, !964, !965, !971, !985, !990, !995}
!764 = distinct !DIGlobalVariable(name: "ff_extract_extradata_bsf", scope: !0, file: !765, line: 427, type: !766, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_extract_extradata_bsf)
!765 = !DIFile(filename: "libavcodec/extract_extradata_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !769)
!769 = !{!770, !774, !777, !859, !860, !917, !955, !959}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !4, line: 5797, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !768, file: !4, line: 5804, baseType: !775, size: 64, align: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !768, file: !4, line: 5815, baseType: !778, size: 64, align: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !782)
!782 = !{!783, !784, !789, !818, !819, !820, !821, !825, !831, !833, !837}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !781, file: !486, line: 72, baseType: !771, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !781, file: !486, line: 78, baseType: !785, size: 64, align: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!771, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !781, file: !486, line: 85, baseType: !790, size: 64, align: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !814, !815, !816, !817}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !464, line: 247, baseType: !771, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !792, file: !464, line: 253, baseType: !771, size: 64, align: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !792, file: !464, line: 259, baseType: !757, size: 32, align: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !792, file: !464, line: 271, baseType: !799, size: 64, align: 64, offset: 192)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !464, line: 265, size: 64, align: 64, elements: !800)
!800 = !{!801, !804, !806, !807}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !799, file: !464, line: 266, baseType: !802, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !761, line: 40, baseType: !803)
!803 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !799, file: !464, line: 267, baseType: !805, size: 64, align: 64)
!805 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !799, file: !464, line: 268, baseType: !771, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !799, file: !464, line: 270, baseType: !808, size: 64, align: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !809, line: 61, baseType: !810)
!809 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !809, line: 58, size: 64, align: 32, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !810, file: !809, line: 59, baseType: !757, size: 32, align: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !810, file: !809, line: 60, baseType: !757, size: 32, align: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !792, file: !464, line: 272, baseType: !805, size: 64, align: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !792, file: !464, line: 273, baseType: !805, size: 64, align: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !792, file: !464, line: 275, baseType: !757, size: 32, align: 32, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !792, file: !464, line: 300, baseType: !771, size: 64, align: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !781, file: !486, line: 93, baseType: !757, size: 32, align: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !781, file: !486, line: 99, baseType: !757, size: 32, align: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !781, file: !486, line: 108, baseType: !757, size: 32, align: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !781, file: !486, line: 113, baseType: !822, size: 64, align: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!788, !788, !788}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !781, file: !486, line: 123, baseType: !826, size: 64, align: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!829, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !781, file: !486, line: 130, baseType: !832, size: 32, align: 32, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !781, file: !486, line: 136, baseType: !834, size: 64, align: 64, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!832, !788}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !781, file: !486, line: 142, baseType: !838, size: 64, align: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, align: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!757, !841, !788, !771, !757}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !844)
!844 = !{!845, !857, !858}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !843, file: !464, line: 360, baseType: !846, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !849, file: !464, line: 307, baseType: !771, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !849, file: !464, line: 313, baseType: !805, size: 64, align: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !849, file: !464, line: 313, baseType: !805, size: 64, align: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !849, file: !464, line: 318, baseType: !805, size: 64, align: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !849, file: !464, line: 318, baseType: !805, size: 64, align: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !849, file: !464, line: 323, baseType: !757, size: 32, align: 32, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !843, file: !464, line: 364, baseType: !757, size: 32, align: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !843, file: !464, line: 368, baseType: !757, size: 32, align: 32, offset: 96)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !768, file: !4, line: 5825, baseType: !757, size: 32, align: 32, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !768, file: !4, line: 5826, baseType: !861, size: 64, align: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!757, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !867)
!867 = !{!868, !869, !872, !876, !877, !914, !915, !916}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !866, file: !4, line: 5751, baseType: !778, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !866, file: !4, line: 5756, baseType: !870, size: 64, align: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !866, file: !4, line: 5762, baseType: !873, size: 64, align: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !875)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !866, file: !4, line: 5768, baseType: !788, size: 64, align: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !866, file: !4, line: 5775, baseType: !878, size: 64, align: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !881)
!881 = !{!882, !883, !884, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !907, !908, !909, !910, !911, !912, !913}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !880, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !880, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !880, file: !4, line: 3948, baseType: !885, size: 32, align: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !761, line: 51, baseType: !758)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !880, file: !4, line: 3958, baseType: !759, size: 64, align: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !880, file: !4, line: 3962, baseType: !757, size: 32, align: 32, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !880, file: !4, line: 3968, baseType: !757, size: 32, align: 32, offset: 224)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !880, file: !4, line: 3973, baseType: !802, size: 64, align: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !880, file: !4, line: 3986, baseType: !757, size: 32, align: 32, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !880, file: !4, line: 3999, baseType: !757, size: 32, align: 32, offset: 352)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !880, file: !4, line: 4004, baseType: !757, size: 32, align: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !880, file: !4, line: 4005, baseType: !757, size: 32, align: 32, offset: 416)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !880, file: !4, line: 4010, baseType: !757, size: 32, align: 32, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !880, file: !4, line: 4011, baseType: !757, size: 32, align: 32, offset: 480)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !880, file: !4, line: 4020, baseType: !808, size: 64, align: 32, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !880, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !880, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !880, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !880, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !880, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !880, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !880, file: !4, line: 4039, baseType: !757, size: 32, align: 32, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !880, file: !4, line: 4046, baseType: !905, size: 64, align: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !761, line: 55, baseType: !906)
!906 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !880, file: !4, line: 4050, baseType: !757, size: 32, align: 32, offset: 896)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !880, file: !4, line: 4054, baseType: !757, size: 32, align: 32, offset: 928)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !880, file: !4, line: 4061, baseType: !757, size: 32, align: 32, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !880, file: !4, line: 4065, baseType: !757, size: 32, align: 32, offset: 992)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !880, file: !4, line: 4073, baseType: !757, size: 32, align: 32, offset: 1024)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !880, file: !4, line: 4080, baseType: !757, size: 32, align: 32, offset: 1056)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !880, file: !4, line: 4084, baseType: !757, size: 32, align: 32, offset: 1088)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !866, file: !4, line: 5781, baseType: !878, size: 64, align: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !866, file: !4, line: 5787, baseType: !808, size: 64, align: 32, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !866, file: !4, line: 5793, baseType: !808, size: 64, align: 32, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !768, file: !4, line: 5827, baseType: !918, size: 64, align: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!757, !864, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !924)
!924 = !{!925, !937, !938, !939, !940, !941, !942, !943, !951, !952, !953, !954}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !923, file: !4, line: 1451, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !928, line: 94, baseType: !929)
!928 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !928, line: 81, size: 192, align: 64, elements: !930)
!930 = !{!931, !935, !936}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !929, file: !928, line: 82, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !928, line: 73, baseType: !934)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !928, line: 73, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !929, file: !928, line: 89, baseType: !759, size: 64, align: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !929, file: !928, line: 93, baseType: !757, size: 32, align: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !923, file: !4, line: 1461, baseType: !802, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !923, file: !4, line: 1467, baseType: !802, size: 64, align: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !923, file: !4, line: 1468, baseType: !759, size: 64, align: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !923, file: !4, line: 1469, baseType: !757, size: 32, align: 32, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !923, file: !4, line: 1470, baseType: !757, size: 32, align: 32, offset: 288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !923, file: !4, line: 1474, baseType: !757, size: 32, align: 32, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !923, file: !4, line: 1479, baseType: !944, size: 64, align: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !947)
!947 = !{!948, !949, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !946, file: !4, line: 1412, baseType: !759, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !946, file: !4, line: 1413, baseType: !757, size: 32, align: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !946, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !923, file: !4, line: 1480, baseType: !757, size: 32, align: 32, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !923, file: !4, line: 1486, baseType: !802, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !923, file: !4, line: 1488, baseType: !802, size: 64, align: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !923, file: !4, line: 1497, baseType: !802, size: 64, align: 64, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !768, file: !4, line: 5828, baseType: !956, size: 64, align: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !864}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !768, file: !4, line: 5829, baseType: !956, size: 64, align: 64, offset: 448)
!960 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !765, line: 399, type: !961, isLocal: true, isDefinition: true, variable: [10 x i32]* @codec_ids)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 320, align: 32, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 10)
!964 = distinct !DIGlobalVariable(name: "extract_extradata_class", scope: !0, file: !765, line: 420, type: !779, isLocal: true, isDefinition: true, variable: %struct.AVClass* @extract_extradata_class)
!965 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !765, line: 414, type: !966, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @options)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 1024, align: 64, elements: !969)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !792)
!969 = !{!970}
!970 = !DISubrange(count: 2)
!971 = distinct !DIGlobalVariable(name: "extract_tab", scope: !0, file: !765, line: 332, type: !972, isLocal: true, isDefinition: true, variable: [9 x %struct.anon]* @extract_tab)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 1152, align: 64, elements: !983)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 328, size: 128, align: 64, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !974, file: !765, line: 329, baseType: !3, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !974, file: !765, line: 330, baseType: !978, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!757, !864, !921, !981, !982}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!983 = !{!984}
!984 = !DISubrange(count: 9)
!985 = distinct !DIGlobalVariable(name: "extradata_obu_types", scope: !986, file: !765, line: 63, type: !988, isLocal: true, isDefinition: true, variable: [2 x i32]* @extract_extradata_av1.extradata_obu_types)
!986 = distinct !DISubprogram(name: "extract_extradata_av1", scope: !765, file: !765, line: 60, type: !979, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !987)
!987 = !{}
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 64, align: 32, elements: !969)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!990 = distinct !DIGlobalVariable(name: "extradata_nal_types_hevc", scope: !991, file: !765, line: 137, type: !992, isLocal: true, isDefinition: true, variable: [3 x i32]* @extract_extradata_h2645.extradata_nal_types_hevc)
!991 = distinct !DISubprogram(name: "extract_extradata_h2645", scope: !765, file: !765, line: 134, type: !979, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !987)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 96, align: 32, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 3)
!995 = distinct !DIGlobalVariable(name: "extradata_nal_types_h264", scope: !991, file: !765, line: 140, type: !988, isLocal: true, isDefinition: true, variable: [2 x i32]* @extract_extradata_h2645.extradata_nal_types_h264)
!996 = !{i32 2, !"Dwarf Version", i32 4}
!997 = !{i32 2, !"Debug Info Version", i32 3}
!998 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!999 = distinct !DISubprogram(name: "extract_extradata_init", scope: !765, file: !765, line: 344, type: !862, isLocal: true, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !987)
!1000 = !DILocalVariable(name: "ctx", arg: 1, scope: !999, file: !765, line: 344, type: !864)
!1001 = !DIExpression()
!1002 = !DILocation(line: 344, column: 49, scope: !999)
!1003 = !DILocalVariable(name: "s", scope: !999, file: !765, line: 346, type: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtractExtradataContext", file: !765, line: 49, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtractExtradataContext", file: !765, line: 35, size: 640, align: 64, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1042, !1075}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1006, file: !765, line: 36, baseType: !778, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1006, file: !765, line: 38, baseType: !978, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "av1_pkt", scope: !1006, file: !765, line: 42, baseType: !1011, size: 128, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1Packet", file: !1012, line: 59, baseType: !1013)
!1012 = !DIFile(filename: "libavcodec/av1_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1Packet", file: !1012, line: 55, size: 128, align: 64, elements: !1014)
!1014 = !{!1015, !1040, !1041}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "obus", scope: !1013, file: !1012, line: 56, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1OBU", file: !1012, line: 52, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1OBU", file: !1012, line: 30, size: 640, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1024, !1025, !1026, !1027, !1037, !1038, !1039}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1018, file: !1012, line: 32, baseType: !757, size: 32, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1018, file: !1012, line: 33, baseType: !1022, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "size_bits", scope: !1018, file: !1012, line: 39, baseType: !757, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "raw_size", scope: !1018, file: !1012, line: 42, baseType: !757, size: 32, align: 32, offset: 160)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !1018, file: !1012, line: 43, baseType: !1022, size: 64, align: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1018, file: !1012, line: 46, baseType: !1028, size: 256, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1029, line: 70, baseType: !1030)
!1029 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1029, line: 61, size: 256, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1030, file: !1029, line: 62, baseType: !1022, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1030, file: !1029, line: 62, baseType: !1022, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1030, file: !1029, line: 67, baseType: !757, size: 32, align: 32, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1030, file: !1029, line: 68, baseType: !757, size: 32, align: 32, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1030, file: !1029, line: 69, baseType: !757, size: 32, align: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1018, file: !1012, line: 48, baseType: !757, size: 32, align: 32, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !1018, file: !1012, line: 50, baseType: !757, size: 32, align: 32, offset: 544)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_id", scope: !1018, file: !1012, line: 51, baseType: !757, size: 32, align: 32, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_obus", scope: !1013, file: !1012, line: 57, baseType: !757, size: 32, align: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "obus_allocated", scope: !1013, file: !1012, line: 58, baseType: !757, size: 32, align: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "h2645_pkt", scope: !1006, file: !765, line: 45, baseType: !1043, size: 320, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645Packet", file: !1044, line: 81, baseType: !1045)
!1044 = !DIFile(filename: "libavcodec/h2645_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645Packet", file: !1044, line: 76, size: 320, align: 64, elements: !1046)
!1046 = !{!1047, !1065, !1073, !1074}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nals", scope: !1045, file: !1044, line: 77, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645NAL", file: !1044, line: 66, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645NAL", file: !1044, line: 32, size: 832, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer", scope: !1050, file: !1044, line: 33, baseType: !759, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1050, file: !1044, line: 35, baseType: !757, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !1044, line: 36, baseType: !1022, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size_bits", scope: !1050, file: !1044, line: 42, baseType: !757, size: 32, align: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "raw_size", scope: !1050, file: !1044, line: 44, baseType: !757, size: 32, align: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !1050, file: !1044, line: 45, baseType: !1022, size: 64, align: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1050, file: !1044, line: 47, baseType: !1028, size: 256, align: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1050, file: !1044, line: 52, baseType: !757, size: 32, align: 32, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !1050, file: !1044, line: 57, baseType: !757, size: 32, align: 32, offset: 608)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes", scope: !1050, file: !1044, line: 59, baseType: !757, size: 32, align: 32, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes_pos_size", scope: !1050, file: !1044, line: 60, baseType: !757, size: 32, align: 32, offset: 672)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes_pos", scope: !1050, file: !1044, line: 61, baseType: !982, size: 64, align: 64, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idc", scope: !1050, file: !1044, line: 65, baseType: !757, size: 32, align: 32, offset: 768)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp", scope: !1045, file: !1044, line: 78, baseType: !1066, size: 192, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645RBSP", file: !1044, line: 73, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645RBSP", file: !1044, line: 68, size: 192, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer", scope: !1067, file: !1044, line: 69, baseType: !759, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_ref", scope: !1067, file: !1044, line: 70, baseType: !926, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_alloc_size", scope: !1067, file: !1044, line: 71, baseType: !757, size: 32, align: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_size", scope: !1067, file: !1044, line: 72, baseType: !757, size: 32, align: 32, offset: 160)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nb_nals", scope: !1045, file: !1044, line: 79, baseType: !757, size: 32, align: 32, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "nals_allocated", scope: !1045, file: !1044, line: 80, baseType: !757, size: 32, align: 32, offset: 288)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1006, file: !765, line: 48, baseType: !757, size: 32, align: 32, offset: 576)
!1076 = !DILocation(line: 346, column: 30, scope: !999)
!1077 = !DILocation(line: 346, column: 34, scope: !999)
!1078 = !DILocation(line: 346, column: 39, scope: !999)
!1079 = !DILocalVariable(name: "i", scope: !999, file: !765, line: 347, type: !757)
!1080 = !DILocation(line: 347, column: 9, scope: !999)
!1081 = !DILocation(line: 349, column: 12, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !999, file: !765, line: 349, column: 5)
!1083 = !DILocation(line: 349, column: 10, scope: !1082)
!1084 = !DILocation(line: 349, column: 17, scope: !1085)
!1085 = !DILexicalBlockFile(scope: !1086, file: !765, discriminator: 1)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !765, line: 349, column: 5)
!1087 = !DILocation(line: 349, column: 19, scope: !1085)
!1088 = !DILocation(line: 349, column: 5, scope: !1085)
!1089 = !DILocation(line: 350, column: 25, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !765, line: 350, column: 13)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !765, line: 349, column: 76)
!1092 = !DILocation(line: 350, column: 13, scope: !1090)
!1093 = !DILocation(line: 350, column: 28, scope: !1090)
!1094 = !DILocation(line: 350, column: 34, scope: !1090)
!1095 = !DILocation(line: 350, column: 39, scope: !1090)
!1096 = !DILocation(line: 350, column: 47, scope: !1090)
!1097 = !DILocation(line: 350, column: 31, scope: !1090)
!1098 = !DILocation(line: 350, column: 13, scope: !1091)
!1099 = !DILocation(line: 351, column: 38, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1090, file: !765, line: 350, column: 57)
!1101 = !DILocation(line: 351, column: 26, scope: !1100)
!1102 = !DILocation(line: 351, column: 41, scope: !1100)
!1103 = !DILocation(line: 351, column: 13, scope: !1100)
!1104 = !DILocation(line: 351, column: 16, scope: !1100)
!1105 = !DILocation(line: 351, column: 24, scope: !1100)
!1106 = !DILocation(line: 352, column: 13, scope: !1100)
!1107 = !DILocation(line: 354, column: 5, scope: !1091)
!1108 = !DILocation(line: 349, column: 72, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1086, file: !765, discriminator: 2)
!1110 = !DILocation(line: 349, column: 5, scope: !1109)
!1111 = distinct !{!1111, !1112}
!1112 = !DILocation(line: 349, column: 5, scope: !999)
!1113 = !DILocation(line: 355, column: 10, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !999, file: !765, line: 355, column: 9)
!1115 = !DILocation(line: 355, column: 13, scope: !1114)
!1116 = !DILocation(line: 355, column: 9, scope: !999)
!1117 = !DILocation(line: 356, column: 9, scope: !1114)
!1118 = !DILocation(line: 358, column: 5, scope: !999)
!1119 = !DILocation(line: 359, column: 1, scope: !999)
!1120 = distinct !DISubprogram(name: "extract_extradata_filter", scope: !765, file: !765, line: 361, type: !919, isLocal: true, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !987)
!1121 = !DILocalVariable(name: "ctx", arg: 1, scope: !1120, file: !765, line: 361, type: !864)
!1122 = !DILocation(line: 361, column: 51, scope: !1120)
!1123 = !DILocalVariable(name: "pkt", arg: 2, scope: !1120, file: !765, line: 361, type: !921)
!1124 = !DILocation(line: 361, column: 66, scope: !1120)
!1125 = !DILocalVariable(name: "s", scope: !1120, file: !765, line: 363, type: !1004)
!1126 = !DILocation(line: 363, column: 30, scope: !1120)
!1127 = !DILocation(line: 363, column: 34, scope: !1120)
!1128 = !DILocation(line: 363, column: 39, scope: !1120)
!1129 = !DILocalVariable(name: "extradata", scope: !1120, file: !765, line: 364, type: !759)
!1130 = !DILocation(line: 364, column: 14, scope: !1120)
!1131 = !DILocalVariable(name: "extradata_size", scope: !1120, file: !765, line: 365, type: !757)
!1132 = !DILocation(line: 365, column: 9, scope: !1120)
!1133 = !DILocalVariable(name: "ret", scope: !1120, file: !765, line: 366, type: !757)
