; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--xvididct.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--xvididct.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.IDCTDSPContext = type { void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i16*)*, [64 x i8], i32, i32 }

!1988 = !DILocation(line: 277, column: 15, scope: !1902)
!1989 = !DILocation(line: 278, column: 14, scope: !1902)
!1990 = !DILocation(line: 278, column: 22, scope: !1902)
!1991 = !DILocation(line: 278, column: 19, scope: !1902)
!1992 = !DILocation(line: 278, column: 11, scope: !1902)
!1993 = !DILocation(line: 278, column: 37, scope: !1902)
!1994 = !DILocation(line: 278, column: 45, scope: !1902)
!1995 = !DILocation(line: 278, column: 42, scope: !1902)
!1996 = !DILocation(line: 278, column: 34, scope: !1902)
!1997 = !DILocation(line: 278, column: 60, scope: !1902)
!1998 = !DILocation(line: 278, column: 57, scope: !1902)
!1999 = !DILocation(line: 279, column: 28, scope: !1902)
!2000 = !DILocation(line: 279, column: 32, scope: !1902)
!2001 = !DILocation(line: 279, column: 17, scope: !1902)
!2002 = !DILocation(line: 279, column: 5, scope: !1902)
!2003 = !DILocation(line: 279, column: 15, scope: !1902)
!2004 = !DILocation(line: 280, column: 28, scope: !1902)
!2005 = !DILocation(line: 280, column: 32, scope: !1902)
!2006 = !DILocation(line: 280, column: 17, scope: !1902)
!2007 = !DILocation(line: 280, column: 5, scope: !1902)
!2008 = !DILocation(line: 280, column: 15, scope: !1902)
!2009 = !DILocation(line: 282, column: 14, scope: !1902)
!2010 = !DILocation(line: 282, column: 22, scope: !1902)
!2011 = !DILocation(line: 282, column: 19, scope: !1902)
!2012 = !DILocation(line: 282, column: 11, scope: !1902)
!2013 = !DILocation(line: 282, column: 37, scope: !1902)
!2014 = !DILocation(line: 282, column: 45, scope: !1902)
!2015 = !DILocation(line: 282, column: 42, scope: !1902)
!2016 = !DILocation(line: 282, column: 34, scope: !1902)
!2017 = !DILocation(line: 282, column: 60, scope: !1902)
!2018 = !DILocation(line: 282, column: 57, scope: !1902)
!2019 = !DILocation(line: 283, column: 14, scope: !1902)
!2020 = !DILocation(line: 283, column: 22, scope: !1902)
!2021 = !DILocation(line: 283, column: 19, scope: !1902)
!2022 = !DILocation(line: 283, column: 11, scope: !1902)
!2023 = !DILocation(line: 283, column: 37, scope: !1902)
!2024 = !DILocation(line: 283, column: 45, scope: !1902)
!2025 = !DILocation(line: 283, column: 42, scope: !1902)
!2026 = !DILocation(line: 283, column: 34, scope: !1902)
!2027 = !DILocation(line: 283, column: 60, scope: !1902)
!2028 = !DILocation(line: 283, column: 57, scope: !1902)
!2029 = !DILocation(line: 284, column: 28, scope: !1902)
!2030 = !DILocation(line: 284, column: 32, scope: !1902)
!2031 = !DILocation(line: 284, column: 17, scope: !1902)
!2032 = !DILocation(line: 284, column: 5, scope: !1902)
!2033 = !DILocation(line: 284, column: 15, scope: !1902)
!2034 = !DILocation(line: 285, column: 28, scope: !1902)
!2035 = !DILocation(line: 285, column: 32, scope: !1902)
!2036 = !DILocation(line: 285, column: 17, scope: !1902)
!2037 = !DILocation(line: 285, column: 5, scope: !1902)
!2038 = !DILocation(line: 285, column: 15, scope: !1902)
!2039 = !DILocation(line: 286, column: 14, scope: !1902)
!2040 = !DILocation(line: 286, column: 22, scope: !1902)
!2041 = !DILocation(line: 286, column: 19, scope: !1902)
!2042 = !DILocation(line: 286, column: 11, scope: !1902)
!2043 = !DILocation(line: 286, column: 37, scope: !1902)
!2044 = !DILocation(line: 286, column: 45, scope: !1902)
!2045 = !DILocation(line: 286, column: 42, scope: !1902)
!2046 = !DILocation(line: 286, column: 34, scope: !1902)
!2047 = !DILocation(line: 286, column: 60, scope: !1902)
!2048 = !DILocation(line: 286, column: 57, scope: !1902)
!2049 = !DILocation(line: 287, column: 28, scope: !1902)
!2050 = !DILocation(line: 287, column: 32, scope: !1902)
!2051 = !DILocation(line: 287, column: 17, scope: !1902)
!2052 = !DILocation(line: 287, column: 5, scope: !1902)
!2053 = !DILocation(line: 287, column: 15, scope: !1902)
!2054 = !DILocation(line: 288, column: 28, scope: !1902)
!2055 = !DILocation(line: 288, column: 32, scope: !1902)
!2056 = !DILocation(line: 288, column: 17, scope: !1902)
!2057 = !DILocation(line: 288, column: 5, scope: !1902)
!2058 = !DILocation(line: 288, column: 15, scope: !1902)
!2059 = !DILocation(line: 289, column: 1, scope: !1902)
!2060 = distinct !DISubprogram(name: "ff_xvid_idct_init", scope: !903, file: !903, line: 333, type: !2061, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !919)
!2061 = !DISubroutineType(types: !2062)
!2062 = !{null, !2063, !2097}
!2063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2064, size: 64, align: 64)
!2064 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !4, line: 100, baseType: !2065)
!2065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !4, line: 53, size: 960, align: 64, elements: !2066)
!2066 = !{!2067, !2080, !2081, !2082, !2086, !2090, !2091, !2095, !2096}
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !2065, file: !4, line: 55, baseType: !2068, size: 64, align: 64)
!2068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2069, size: 64, align: 64)
!2069 = !DISubroutineType(types: !2070)
!2070 = !{null, !2071, !2073, !2077}
!2071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2072, size: 64, align: 64)
!2072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!2073 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !2074)
!2074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2075, size: 64, align: 64)
!2075 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !899, line: 48, baseType: !2076)
!2076 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!2077 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !2078, line: 149, baseType: !2079)
!2078 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2079 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !2065, file: !4, line: 58, baseType: !2068, size: 64, align: 64, offset: 64)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !2065, file: !4, line: 61, baseType: !2068, size: 64, align: 64, offset: 128)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !2065, file: !4, line: 65, baseType: !2083, size: 64, align: 64, offset: 192)
!2083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2084, size: 64, align: 64)
!2084 = !DISubroutineType(types: !2085)
!2085 = !{null, !918}
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !2065, file: !4, line: 72, baseType: !2087, size: 64, align: 64, offset: 256)
!2087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2088, size: 64, align: 64)
!2088 = !DISubroutineType(types: !2089)
!2089 = !{null, !2074, !2077, !918}
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !2065, file: !4, line: 79, baseType: !2087, size: 64, align: 64, offset: 320)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !2065, file: !4, line: 96, baseType: !2092, size: 512, align: 8, offset: 384)
!2092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2075, size: 512, align: 8, elements: !2093)
!2093 = !{!2094}
!2094 = !DISubrange(count: 64)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !2065, file: !4, line: 97, baseType: !3, size: 32, align: 32, offset: 896)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !2065, file: !4, line: 99, baseType: !897, size: 32, align: 32, offset: 928)
!2097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2098, size: 64, align: 64)
!2098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !44, line: 3360, baseType: !2099)
!2099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !44, line: 1556, size: 8448, align: 64, elements: !2100)
!2100 = !{!2101, !2146, !2147, !2148, !2412, !2413, !2414, !2415, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2441, !2445, !2446, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2552, !2553, !2554, !2555, !2556, !2557, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2627, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688}
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !2099, file: !44, line: 1561, baseType: !2102, size: 64, align: 64)
!2102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2103, size: 64, align: 64)
!2103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2104)
!2104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !13, line: 143, baseType: !2105)
!2105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !13, line: 67, size: 640, align: 64, elements: !2106)
!2106 = !{!2107, !2111, !2116, !2120, !2121, !2122, !2123, !2127, !2133, !2135, !2139}
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !2105, file: !13, line: 72, baseType: !2108, size: 64, align: 64)
!2108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2109, size: 64, align: 64)
!2109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2110)
!2110 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !2105, file: !13, line: 78, baseType: !2112, size: 64, align: 64, offset: 64)
!2112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2113, size: 64, align: 64)
!2113 = !DISubroutineType(types: !2114)
!2114 = !{!2108, !2115}
!2115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !2105, file: !13, line: 85, baseType: !2117, size: 64, align: 64, offset: 128)
!2117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2118, size: 64, align: 64)
!2118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2119)
!2119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !13, line: 85, flags: DIFlagFwdDecl)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !2105, file: !13, line: 93, baseType: !897, size: 32, align: 32, offset: 192)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !2105, file: !13, line: 99, baseType: !897, size: 32, align: 32, offset: 224)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !2105, file: !13, line: 108, baseType: !897, size: 32, align: 32, offset: 256)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !2105, file: !13, line: 113, baseType: !2124, size: 64, align: 64, offset: 320)
!2124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2125, size: 64, align: 64)
!2125 = !DISubroutineType(types: !2126)
!2126 = !{!2115, !2115, !2115}
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !2105, file: !13, line: 123, baseType: !2128, size: 64, align: 64, offset: 384)
!2128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2129, size: 64, align: 64)
!2129 = !DISubroutineType(types: !2130)
!2130 = !{!2131, !2131}
!2131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2132, size: 64, align: 64)
!2132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2105)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !2105, file: !13, line: 130, baseType: !2134, size: 32, align: 32, offset: 448)
!2134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !13, line: 48, baseType: !12)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !2105, file: !13, line: 136, baseType: !2136, size: 64, align: 64, offset: 512)
!2136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2137, size: 64, align: 64)
!2137 = !DISubroutineType(types: !2138)
!2138 = !{!2134, !2115}
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !2105, file: !13, line: 142, baseType: !2140, size: 64, align: 64, offset: 576)
!2140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2141, size: 64, align: 64)
!2141 = !DISubroutineType(types: !2142)
!2142 = !{!897, !2143, !2115, !2108, !897}
!2143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2144, size: 64, align: 64)
!2144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2145, size: 64, align: 64)
!2145 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !13, line: 60, flags: DIFlagFwdDecl)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !2099, file: !44, line: 1562, baseType: !897, size: 32, align: 32, offset: 64)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !2099, file: !44, line: 1564, baseType: !33, size: 32, align: 32, offset: 96)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !2099, file: !44, line: 1565, baseType: !2149, size: 64, align: 64, offset: 128)
!2149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2150, size: 64, align: 64)
!2150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2151)
!2151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !44, line: 3468, size: 1984, align: 64, elements: !2152)
!2152 = !{!2153, !2154, !2155, !2156, !2157, !2158, !2167, !2170, !2171, !2174, !2179, !2180, !2181, !2189, !2190, !2191, !2193, !2197, !2203, !2208, !2212, !2213, !2263, !2383, !2387, !2388, !2392, !2396, !2401, !2405, !2406, !2407}
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2151, file: !44, line: 3475, baseType: !2108, size: 64, align: 64)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !2151, file: !44, line: 3480, baseType: !2108, size: 64, align: 64, offset: 64)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2151, file: !44, line: 3481, baseType: !33, size: 32, align: 32, offset: 128)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2151, file: !44, line: 3482, baseType: !43, size: 32, align: 32, offset: 160)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !2151, file: !44, line: 3487, baseType: !897, size: 32, align: 32, offset: 192)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !2151, file: !44, line: 3488, baseType: !2159, size: 64, align: 64, offset: 256)
!2159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2160, size: 64, align: 64)
!2160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2161)
!2161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !2162, line: 61, baseType: !2163)
!2162 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !2162, line: 58, size: 64, align: 32, elements: !2164)
!2164 = !{!2165, !2166}
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2163, file: !2162, line: 59, baseType: !897, size: 32, align: 32)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !2163, file: !2162, line: 60, baseType: !897, size: 32, align: 32, offset: 32)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !2151, file: !44, line: 3489, baseType: !2168, size: 64, align: 64, offset: 320)
!2168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2169, size: 64, align: 64)
!2169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !2151, file: !44, line: 3490, baseType: !1041, size: 64, align: 64, offset: 384)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !2151, file: !44, line: 3491, baseType: !2172, size: 64, align: 64, offset: 448)
!2172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2173, size: 64, align: 64)
!2173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !2151, file: !44, line: 3492, baseType: !2175, size: 64, align: 64, offset: 512)
!2175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2176, size: 64, align: 64)
!2176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2177)
!2177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !899, line: 55, baseType: !2178)
!2178 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !2151, file: !44, line: 3493, baseType: !2075, size: 8, align: 8, offset: 576)
!2180 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !2151, file: !44, line: 3494, baseType: !2102, size: 64, align: 64, offset: 640)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !2151, file: !44, line: 3495, baseType: !2182, size: 64, align: 64, offset: 704)
!2182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2183, size: 64, align: 64)
!2183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2184)
!2184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !44, line: 3404, baseType: !2185)
!2185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !44, line: 3401, size: 128, align: 64, elements: !2186)
!2186 = !{!2187, !2188}
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !2185, file: !44, line: 3402, baseType: !897, size: 32, align: 32)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2185, file: !44, line: 3403, baseType: !2108, size: 64, align: 64, offset: 64)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !2151, file: !44, line: 3507, baseType: !2108, size: 64, align: 64, offset: 768)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !2151, file: !44, line: 3516, baseType: !897, size: 32, align: 32, offset: 832)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2151, file: !44, line: 3517, baseType: !2192, size: 64, align: 64, offset: 896)
!2192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2151, size: 64, align: 64)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !2151, file: !44, line: 3527, baseType: !2194, size: 64, align: 64, offset: 960)
!2194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2195, size: 64, align: 64)
!2195 = !DISubroutineType(types: !2196)
!2196 = !{!897, !2097}
!2197 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !2151, file: !44, line: 3535, baseType: !2198, size: 64, align: 64, offset: 1024)
!2198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2199, size: 64, align: 64)
!2199 = !DISubroutineType(types: !2200)
!2200 = !{!897, !2097, !2201}
!2201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2202, size: 64, align: 64)
!2202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2098)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !2151, file: !44, line: 3541, baseType: !2204, size: 64, align: 64, offset: 1088)
!2204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2205, size: 64, align: 64)
!2205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2206)
!2206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !44, line: 3461, baseType: !2207)
!2207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !44, line: 3461, flags: DIFlagFwdDecl)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !2151, file: !44, line: 3549, baseType: !2209, size: 64, align: 64, offset: 1152)
!2209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2210, size: 64, align: 64)
!2210 = !DISubroutineType(types: !2211)
!2211 = !{null, !2192}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !2151, file: !44, line: 3551, baseType: !2194, size: 64, align: 64, offset: 1216)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !2151, file: !44, line: 3552, baseType: !2214, size: 64, align: 64, offset: 1280)
!2214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2215, size: 64, align: 64)
!2215 = !DISubroutineType(types: !2216)
!2216 = !{!897, !2097, !2074, !897, !2217}
!2217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2218, size: 64, align: 64)
!2218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2219)
!2219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !44, line: 3920, size: 256, align: 64, elements: !2220)
!2220 = !{!2221, !2224, !2227, !2228, !2229, !2261}
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !2219, file: !44, line: 3921, baseType: !2222, size: 16, align: 16)
!2222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !899, line: 49, baseType: !2223)
!2223 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !2219, file: !44, line: 3922, baseType: !2225, size: 32, align: 32, offset: 32)
!2225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !899, line: 51, baseType: !2226)
!2226 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !2219, file: !44, line: 3923, baseType: !2225, size: 32, align: 32, offset: 64)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !2219, file: !44, line: 3924, baseType: !2226, size: 32, align: 32, offset: 96)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !2219, file: !44, line: 3925, baseType: !2230, size: 64, align: 64, offset: 128)
!2230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2231, size: 64, align: 64)
!2231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2232, size: 64, align: 64)
!2232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !44, line: 3918, baseType: !2233)
!2233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !44, line: 3885, size: 1600, align: 64, elements: !2234)
!2234 = !{!2235, !2236, !2237, !2238, !2239, !2240, !2250, !2254, !2256, !2257, !2259, !2260}
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !2233, file: !44, line: 3886, baseType: !897, size: 32, align: 32)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !2233, file: !44, line: 3887, baseType: !897, size: 32, align: 32, offset: 32)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !2233, file: !44, line: 3888, baseType: !897, size: 32, align: 32, offset: 64)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !2233, file: !44, line: 3889, baseType: !897, size: 32, align: 32, offset: 96)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !2233, file: !44, line: 3890, baseType: !897, size: 32, align: 32, offset: 128)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !2233, file: !44, line: 3897, baseType: !2241, size: 768, align: 64, offset: 192)
!2241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !44, line: 3858, baseType: !2242)
!2242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !44, line: 3853, size: 768, align: 64, elements: !2243)
!2243 = !{!2244, !2248}
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2242, file: !44, line: 3855, baseType: !2245, size: 512, align: 64)
!2245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2074, size: 512, align: 64, elements: !2246)
!2246 = !{!2247}
!2247 = !DISubrange(count: 8)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !2242, file: !44, line: 3857, baseType: !2249, size: 256, align: 32, offset: 512)
!2249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 256, align: 32, elements: !2246)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2233, file: !44, line: 3903, baseType: !2251, size: 256, align: 64, offset: 960)
!2251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2074, size: 256, align: 64, elements: !2252)
!2252 = !{!2253}
!2253 = !DISubrange(count: 4)
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !2233, file: !44, line: 3904, baseType: !2255, size: 128, align: 32, offset: 1216)
!2255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, align: 32, elements: !2252)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2233, file: !44, line: 3906, baseType: !720, size: 32, align: 32, offset: 1344)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !2233, file: !44, line: 3908, baseType: !2258, size: 64, align: 64, offset: 1408)
!2258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2110, size: 64, align: 64)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !2233, file: !44, line: 3915, baseType: !2258, size: 64, align: 64, offset: 1472)
!2260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2233, file: !44, line: 3917, baseType: !897, size: 32, align: 32, offset: 1536)
!2261 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !2219, file: !44, line: 3926, baseType: !2262, size: 64, align: 64, offset: 192)
!2262 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !899, line: 40, baseType: !2079)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !2151, file: !44, line: 3564, baseType: !2264, size: 64, align: 64, offset: 1344)
!2264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2265, size: 64, align: 64)
!2265 = !DISubroutineType(types: !2266)
!2266 = !{!897, !2097, !2267, !2301, !2382}
!2267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2268, size: 64, align: 64)
!2268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !44, line: 1499, baseType: !2269)
!2269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !44, line: 1445, size: 704, align: 64, elements: !2270)
!2270 = !{!2271, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2297, !2298, !2299, !2300}
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !2269, file: !44, line: 1451, baseType: !2272, size: 64, align: 64)
!2272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2273, size: 64, align: 64)
!2273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !2274, line: 94, baseType: !2275)
!2274 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !2274, line: 81, size: 192, align: 64, elements: !2276)
!2276 = !{!2277, !2281, !2282}
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !2275, file: !2274, line: 82, baseType: !2278, size: 64, align: 64)
!2278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2279, size: 64, align: 64)
!2279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !2274, line: 73, baseType: !2280)
!2280 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !2274, line: 73, flags: DIFlagFwdDecl)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2275, file: !2274, line: 89, baseType: !2074, size: 64, align: 64, offset: 64)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2275, file: !2274, line: 93, baseType: !897, size: 32, align: 32, offset: 128)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !2269, file: !44, line: 1461, baseType: !2262, size: 64, align: 64, offset: 64)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !2269, file: !44, line: 1467, baseType: !2262, size: 64, align: 64, offset: 128)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2269, file: !44, line: 1468, baseType: !2074, size: 64, align: 64, offset: 192)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2269, file: !44, line: 1469, baseType: !897, size: 32, align: 32, offset: 256)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !2269, file: !44, line: 1470, baseType: !897, size: 32, align: 32, offset: 288)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2269, file: !44, line: 1474, baseType: !897, size: 32, align: 32, offset: 320)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !2269, file: !44, line: 1479, baseType: !2290, size: 64, align: 64, offset: 384)
!2290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2291, size: 64, align: 64)
!2291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !44, line: 1415, baseType: !2292)
!2292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !44, line: 1411, size: 128, align: 64, elements: !2293)
!2293 = !{!2294, !2295, !2296}
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2292, file: !44, line: 1412, baseType: !2074, size: 64, align: 64)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2292, file: !44, line: 1413, baseType: !897, size: 32, align: 32, offset: 64)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2292, file: !44, line: 1414, baseType: !726, size: 32, align: 32, offset: 96)
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !2269, file: !44, line: 1480, baseType: !897, size: 32, align: 32, offset: 448)
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !2269, file: !44, line: 1486, baseType: !2262, size: 64, align: 64, offset: 512)
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !2269, file: !44, line: 1488, baseType: !2262, size: 64, align: 64, offset: 576)
!2300 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !2269, file: !44, line: 1497, baseType: !2262, size: 64, align: 64, offset: 640)
!2301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2302, size: 64, align: 64)
!2302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2303)
!2303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !2304)
!2304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !2305)
!2305 = !{!2306, !2307, !2308, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2335, !2337, !2338, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2371, !2372, !2373, !2374, !2375, !2376, !2378, !2379, !2380, !2381}
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2304, file: !767, line: 282, baseType: !2245, size: 512, align: 64)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !2304, file: !767, line: 299, baseType: !2249, size: 256, align: 32, offset: 512)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !2304, file: !767, line: 315, baseType: !2309, size: 64, align: 64, offset: 768)
!2309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2074, size: 64, align: 64)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !2304, file: !767, line: 326, baseType: !897, size: 32, align: 32, offset: 832)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !2304, file: !767, line: 326, baseType: !897, size: 32, align: 32, offset: 864)
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !2304, file: !767, line: 334, baseType: !897, size: 32, align: 32, offset: 896)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !2304, file: !767, line: 341, baseType: !897, size: 32, align: 32, offset: 928)
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !2304, file: !767, line: 346, baseType: !897, size: 32, align: 32, offset: 960)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !2304, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !2304, file: !767, line: 356, baseType: !2161, size: 64, align: 32, offset: 1024)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !2304, file: !767, line: 361, baseType: !2262, size: 64, align: 64, offset: 1088)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !2304, file: !767, line: 369, baseType: !2262, size: 64, align: 64, offset: 1152)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !2304, file: !767, line: 377, baseType: !2262, size: 64, align: 64, offset: 1216)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !2304, file: !767, line: 382, baseType: !897, size: 32, align: 32, offset: 1280)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !2304, file: !767, line: 386, baseType: !897, size: 32, align: 32, offset: 1312)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !2304, file: !767, line: 391, baseType: !897, size: 32, align: 32, offset: 1344)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !2304, file: !767, line: 396, baseType: !2115, size: 64, align: 64, offset: 1408)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2304, file: !767, line: 403, baseType: !2325, size: 512, align: 64, offset: 1472)
!2325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2177, size: 512, align: 64, elements: !2246)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !2304, file: !767, line: 410, baseType: !897, size: 32, align: 32, offset: 1984)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !2304, file: !767, line: 415, baseType: !897, size: 32, align: 32, offset: 2016)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !2304, file: !767, line: 420, baseType: !897, size: 32, align: 32, offset: 2048)
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !2304, file: !767, line: 425, baseType: !897, size: 32, align: 32, offset: 2080)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !2304, file: !767, line: 435, baseType: !2262, size: 64, align: 64, offset: 2112)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !2304, file: !767, line: 440, baseType: !897, size: 32, align: 32, offset: 2176)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !2304, file: !767, line: 445, baseType: !2177, size: 64, align: 64, offset: 2240)
!2333 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !2304, file: !767, line: 459, baseType: !2334, size: 512, align: 64, offset: 2304)
!2334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2272, size: 512, align: 64, elements: !2246)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !2304, file: !767, line: 473, baseType: !2336, size: 64, align: 64, offset: 2816)
!2336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2272, size: 64, align: 64)
!2337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !2304, file: !767, line: 477, baseType: !897, size: 32, align: 32, offset: 2880)
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !2304, file: !767, line: 479, baseType: !2339, size: 64, align: 64, offset: 2944)
!2339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2340, size: 64, align: 64)
!2340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2341, size: 64, align: 64)
!2341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !2342)
!2342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !2343)
!2343 = !{!2344, !2345, !2346, !2347, !2352}
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2342, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2342, file: !767, line: 203, baseType: !2074, size: 64, align: 64, offset: 64)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2342, file: !767, line: 204, baseType: !897, size: 32, align: 32, offset: 128)
!2347 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !2342, file: !767, line: 205, baseType: !2348, size: 64, align: 64, offset: 192)
!2348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2349, size: 64, align: 64)
!2349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !2350, line: 86, baseType: !2351)
!2350 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2351 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !2350, line: 86, flags: DIFlagFwdDecl)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !2342, file: !767, line: 206, baseType: !2272, size: 64, align: 64, offset: 256)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !2304, file: !767, line: 480, baseType: !897, size: 32, align: 32, offset: 3008)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2304, file: !767, line: 505, baseType: !897, size: 32, align: 32, offset: 3040)
!2355 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !2304, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!2356 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !2304, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !2304, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !2304, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!2359 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !2304, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !2304, file: !767, line: 532, baseType: !2262, size: 64, align: 64, offset: 3264)
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !2304, file: !767, line: 539, baseType: !2262, size: 64, align: 64, offset: 3328)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !2304, file: !767, line: 547, baseType: !2262, size: 64, align: 64, offset: 3392)
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !2304, file: !767, line: 554, baseType: !2348, size: 64, align: 64, offset: 3456)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !2304, file: !767, line: 563, baseType: !897, size: 32, align: 32, offset: 3520)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !2304, file: !767, line: 572, baseType: !897, size: 32, align: 32, offset: 3552)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !2304, file: !767, line: 581, baseType: !897, size: 32, align: 32, offset: 3584)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !2304, file: !767, line: 588, baseType: !2368, size: 64, align: 64, offset: 3648)
!2368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2369, size: 64, align: 64)
!2369 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !899, line: 36, baseType: !2370)
!2370 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !2304, file: !767, line: 593, baseType: !897, size: 32, align: 32, offset: 3712)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !2304, file: !767, line: 596, baseType: !897, size: 32, align: 32, offset: 3744)
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !2304, file: !767, line: 599, baseType: !2272, size: 64, align: 64, offset: 3776)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !2304, file: !767, line: 605, baseType: !2272, size: 64, align: 64, offset: 3840)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !2304, file: !767, line: 616, baseType: !2272, size: 64, align: 64, offset: 3904)
!2376 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !2304, file: !767, line: 626, baseType: !2377, size: 64, align: 64, offset: 3968)
!2377 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2078, line: 216, baseType: !2178)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !2304, file: !767, line: 627, baseType: !2377, size: 64, align: 64, offset: 4032)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !2304, file: !767, line: 628, baseType: !2377, size: 64, align: 64, offset: 4096)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !2304, file: !767, line: 629, baseType: !2377, size: 64, align: 64, offset: 4160)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !2304, file: !767, line: 645, baseType: !2272, size: 64, align: 64, offset: 4224)
!2382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !2151, file: !44, line: 3566, baseType: !2384, size: 64, align: 64, offset: 1408)
!2384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2385, size: 64, align: 64)
!2385 = !DISubroutineType(types: !2386)
!2386 = !{!897, !2097, !2115, !2382, !2267}
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !2151, file: !44, line: 3567, baseType: !2194, size: 64, align: 64, offset: 1472)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !2151, file: !44, line: 3576, baseType: !2389, size: 64, align: 64, offset: 1536)
!2389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2390, size: 64, align: 64)
!2390 = !DISubroutineType(types: !2391)
!2391 = !{!897, !2097, !2301}
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !2151, file: !44, line: 3577, baseType: !2393, size: 64, align: 64, offset: 1600)
!2393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2394, size: 64, align: 64)
!2394 = !DISubroutineType(types: !2395)
!2395 = !{!897, !2097, !2267}
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !2151, file: !44, line: 3584, baseType: !2397, size: 64, align: 64, offset: 1664)
!2397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2398, size: 64, align: 64)
!2398 = !DISubroutineType(types: !2399)
!2399 = !{!897, !2097, !2400}
!2400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2303, size: 64, align: 64)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !2151, file: !44, line: 3589, baseType: !2402, size: 64, align: 64, offset: 1728)
!2402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2403, size: 64, align: 64)
!2403 = !DISubroutineType(types: !2404)
!2404 = !{null, !2097}
!2405 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !2151, file: !44, line: 3594, baseType: !897, size: 32, align: 32, offset: 1792)
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !2151, file: !44, line: 3600, baseType: !2108, size: 64, align: 64, offset: 1856)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !2151, file: !44, line: 3609, baseType: !2408, size: 64, align: 64, offset: 1920)
!2408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2409, size: 64, align: 64)
!2409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2410, size: 64, align: 64)
!2410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2411)
!2411 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !44, line: 3609, flags: DIFlagFwdDecl)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !2099, file: !44, line: 1566, baseType: !43, size: 32, align: 32, offset: 192)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !2099, file: !44, line: 1581, baseType: !2226, size: 32, align: 32, offset: 224)
!2414 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !2099, file: !44, line: 1583, baseType: !2115, size: 64, align: 64, offset: 256)
!2415 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !2099, file: !44, line: 1591, baseType: !2416, size: 64, align: 64, offset: 320)
!2416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2417, size: 64, align: 64)
!2417 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !44, line: 1532, flags: DIFlagFwdDecl)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !2099, file: !44, line: 1598, baseType: !2115, size: 64, align: 64, offset: 384)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !2099, file: !44, line: 1606, baseType: !2262, size: 64, align: 64, offset: 448)
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !2099, file: !44, line: 1614, baseType: !897, size: 32, align: 32, offset: 512)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !2099, file: !44, line: 1622, baseType: !897, size: 32, align: 32, offset: 544)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !2099, file: !44, line: 1628, baseType: !897, size: 32, align: 32, offset: 576)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2099, file: !44, line: 1636, baseType: !897, size: 32, align: 32, offset: 608)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !2099, file: !44, line: 1643, baseType: !897, size: 32, align: 32, offset: 640)
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !2099, file: !44, line: 1657, baseType: !2074, size: 64, align: 64, offset: 704)
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !2099, file: !44, line: 1658, baseType: !897, size: 32, align: 32, offset: 768)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !2099, file: !44, line: 1679, baseType: !2161, size: 64, align: 32, offset: 800)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !2099, file: !44, line: 1688, baseType: !897, size: 32, align: 32, offset: 864)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !2099, file: !44, line: 1712, baseType: !897, size: 32, align: 32, offset: 896)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !2099, file: !44, line: 1729, baseType: !897, size: 32, align: 32, offset: 928)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !2099, file: !44, line: 1729, baseType: !897, size: 32, align: 32, offset: 960)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !2099, file: !44, line: 1744, baseType: !897, size: 32, align: 32, offset: 992)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !2099, file: !44, line: 1744, baseType: !897, size: 32, align: 32, offset: 1024)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !2099, file: !44, line: 1751, baseType: !897, size: 32, align: 32, offset: 1056)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !2099, file: !44, line: 1766, baseType: !503, size: 32, align: 32, offset: 1088)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !2099, file: !44, line: 1791, baseType: !2437, size: 64, align: 64, offset: 1152)
!2437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2438, size: 64, align: 64)
!2438 = !DISubroutineType(types: !2439)
!2439 = !{null, !2440, !2301, !2382, !897, !897, !897}
!2440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2099, size: 64, align: 64)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !2099, file: !44, line: 1808, baseType: !2442, size: 64, align: 64, offset: 1216)
!2442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2443, size: 64, align: 64)
!2443 = !DISubroutineType(types: !2444)
!2444 = !{!503, !2440, !2168}
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !2099, file: !44, line: 1816, baseType: !897, size: 32, align: 32, offset: 1280)
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !2099, file: !44, line: 1825, baseType: !2447, size: 32, align: 32, offset: 1312)
!2447 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !2099, file: !44, line: 1830, baseType: !897, size: 32, align: 32, offset: 1344)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !2099, file: !44, line: 1838, baseType: !2447, size: 32, align: 32, offset: 1376)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !2099, file: !44, line: 1846, baseType: !897, size: 32, align: 32, offset: 1408)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !2099, file: !44, line: 1851, baseType: !897, size: 32, align: 32, offset: 1440)
!2452 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !2099, file: !44, line: 1861, baseType: !2447, size: 32, align: 32, offset: 1472)
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !2099, file: !44, line: 1868, baseType: !2447, size: 32, align: 32, offset: 1504)
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !2099, file: !44, line: 1875, baseType: !2447, size: 32, align: 32, offset: 1536)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !2099, file: !44, line: 1882, baseType: !2447, size: 32, align: 32, offset: 1568)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !2099, file: !44, line: 1889, baseType: !2447, size: 32, align: 32, offset: 1600)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !2099, file: !44, line: 1896, baseType: !2447, size: 32, align: 32, offset: 1632)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !2099, file: !44, line: 1903, baseType: !2447, size: 32, align: 32, offset: 1664)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !2099, file: !44, line: 1910, baseType: !897, size: 32, align: 32, offset: 1696)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !2099, file: !44, line: 1915, baseType: !897, size: 32, align: 32, offset: 1728)
!2461 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !2099, file: !44, line: 1926, baseType: !2382, size: 64, align: 64, offset: 1792)
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !2099, file: !44, line: 1935, baseType: !2161, size: 64, align: 32, offset: 1856)
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !2099, file: !44, line: 1942, baseType: !897, size: 32, align: 32, offset: 1920)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !2099, file: !44, line: 1948, baseType: !897, size: 32, align: 32, offset: 1952)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !2099, file: !44, line: 1954, baseType: !897, size: 32, align: 32, offset: 1984)
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !2099, file: !44, line: 1960, baseType: !897, size: 32, align: 32, offset: 2016)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !2099, file: !44, line: 1984, baseType: !897, size: 32, align: 32, offset: 2048)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !2099, file: !44, line: 1991, baseType: !897, size: 32, align: 32, offset: 2080)
!2469 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !2099, file: !44, line: 1996, baseType: !897, size: 32, align: 32, offset: 2112)
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !2099, file: !44, line: 2004, baseType: !897, size: 32, align: 32, offset: 2144)
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !2099, file: !44, line: 2011, baseType: !897, size: 32, align: 32, offset: 2176)
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !2099, file: !44, line: 2018, baseType: !897, size: 32, align: 32, offset: 2208)
!2473 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !2099, file: !44, line: 2027, baseType: !897, size: 32, align: 32, offset: 2240)
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !2099, file: !44, line: 2034, baseType: !897, size: 32, align: 32, offset: 2272)
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !2099, file: !44, line: 2044, baseType: !897, size: 32, align: 32, offset: 2304)
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !2099, file: !44, line: 2054, baseType: !2477, size: 64, align: 64, offset: 2368)
!2477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2222, size: 64, align: 64)
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !2099, file: !44, line: 2061, baseType: !2477, size: 64, align: 64, offset: 2432)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !2099, file: !44, line: 2066, baseType: !897, size: 32, align: 32, offset: 2496)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !2099, file: !44, line: 2070, baseType: !897, size: 32, align: 32, offset: 2528)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !2099, file: !44, line: 2078, baseType: !897, size: 32, align: 32, offset: 2560)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !2099, file: !44, line: 2085, baseType: !897, size: 32, align: 32, offset: 2592)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !2099, file: !44, line: 2092, baseType: !897, size: 32, align: 32, offset: 2624)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !2099, file: !44, line: 2099, baseType: !897, size: 32, align: 32, offset: 2656)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !2099, file: !44, line: 2106, baseType: !897, size: 32, align: 32, offset: 2688)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !2099, file: !44, line: 2113, baseType: !897, size: 32, align: 32, offset: 2720)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !2099, file: !44, line: 2120, baseType: !897, size: 32, align: 32, offset: 2752)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !2099, file: !44, line: 2125, baseType: !897, size: 32, align: 32, offset: 2784)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !2099, file: !44, line: 2133, baseType: !897, size: 32, align: 32, offset: 2816)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !2099, file: !44, line: 2140, baseType: !897, size: 32, align: 32, offset: 2848)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !2099, file: !44, line: 2145, baseType: !897, size: 32, align: 32, offset: 2880)
!2492 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !2099, file: !44, line: 2153, baseType: !897, size: 32, align: 32, offset: 2912)
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !2099, file: !44, line: 2158, baseType: !897, size: 32, align: 32, offset: 2944)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !2099, file: !44, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !2099, file: !44, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !2099, file: !44, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !2099, file: !44, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !2099, file: !44, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !2099, file: !44, line: 2203, baseType: !897, size: 32, align: 32, offset: 3136)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !2099, file: !44, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !2099, file: !44, line: 2212, baseType: !897, size: 32, align: 32, offset: 3200)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !2099, file: !44, line: 2213, baseType: !897, size: 32, align: 32, offset: 3232)
!2503 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !2099, file: !44, line: 2220, baseType: !703, size: 32, align: 32, offset: 3264)
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !2099, file: !44, line: 2232, baseType: !897, size: 32, align: 32, offset: 3296)
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !2099, file: !44, line: 2243, baseType: !897, size: 32, align: 32, offset: 3328)
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !2099, file: !44, line: 2249, baseType: !897, size: 32, align: 32, offset: 3360)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !2099, file: !44, line: 2256, baseType: !897, size: 32, align: 32, offset: 3392)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !2099, file: !44, line: 2263, baseType: !2177, size: 64, align: 64, offset: 3456)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !2099, file: !44, line: 2270, baseType: !2177, size: 64, align: 64, offset: 3520)
!2510 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !2099, file: !44, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!2511 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !2099, file: !44, line: 2285, baseType: !703, size: 32, align: 32, offset: 3616)
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !2099, file: !44, line: 2367, baseType: !2513, size: 64, align: 64, offset: 3648)
!2513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2514, size: 64, align: 64)
!2514 = !DISubroutineType(types: !2515)
!2515 = !{!897, !2440, !2400, !897}
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !2099, file: !44, line: 2383, baseType: !897, size: 32, align: 32, offset: 3712)
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !2099, file: !44, line: 2386, baseType: !2447, size: 32, align: 32, offset: 3744)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !2099, file: !44, line: 2387, baseType: !2447, size: 32, align: 32, offset: 3776)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !2099, file: !44, line: 2394, baseType: !897, size: 32, align: 32, offset: 3808)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !2099, file: !44, line: 2401, baseType: !897, size: 32, align: 32, offset: 3840)
!2521 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !2099, file: !44, line: 2408, baseType: !897, size: 32, align: 32, offset: 3872)
!2522 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !2099, file: !44, line: 2415, baseType: !897, size: 32, align: 32, offset: 3904)
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !2099, file: !44, line: 2422, baseType: !897, size: 32, align: 32, offset: 3936)
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !2099, file: !44, line: 2423, baseType: !2525, size: 64, align: 64, offset: 3968)
!2525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2526, size: 64, align: 64)
!2526 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !44, line: 831, baseType: !2527)
!2527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !44, line: 826, size: 128, align: 32, elements: !2528)
!2528 = !{!2529, !2530, !2531, !2532}
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !2527, file: !44, line: 827, baseType: !897, size: 32, align: 32)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !2527, file: !44, line: 828, baseType: !897, size: 32, align: 32, offset: 32)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !2527, file: !44, line: 829, baseType: !897, size: 32, align: 32, offset: 64)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !2527, file: !44, line: 830, baseType: !2447, size: 32, align: 32, offset: 96)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !2099, file: !44, line: 2430, baseType: !2262, size: 64, align: 64, offset: 4032)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !2099, file: !44, line: 2437, baseType: !2262, size: 64, align: 64, offset: 4096)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !2099, file: !44, line: 2444, baseType: !2447, size: 32, align: 32, offset: 4160)
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !2099, file: !44, line: 2451, baseType: !2447, size: 32, align: 32, offset: 4192)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !2099, file: !44, line: 2458, baseType: !897, size: 32, align: 32, offset: 4224)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !2099, file: !44, line: 2469, baseType: !897, size: 32, align: 32, offset: 4256)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !2099, file: !44, line: 2475, baseType: !897, size: 32, align: 32, offset: 4288)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !2099, file: !44, line: 2481, baseType: !897, size: 32, align: 32, offset: 4320)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !2099, file: !44, line: 2485, baseType: !897, size: 32, align: 32, offset: 4352)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !2099, file: !44, line: 2489, baseType: !897, size: 32, align: 32, offset: 4384)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !2099, file: !44, line: 2493, baseType: !897, size: 32, align: 32, offset: 4416)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !2099, file: !44, line: 2501, baseType: !897, size: 32, align: 32, offset: 4448)
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !2099, file: !44, line: 2506, baseType: !897, size: 32, align: 32, offset: 4480)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !2099, file: !44, line: 2510, baseType: !897, size: 32, align: 32, offset: 4512)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !2099, file: !44, line: 2514, baseType: !2262, size: 64, align: 64, offset: 4544)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !2099, file: !44, line: 2528, baseType: !2549, size: 64, align: 64, offset: 4608)
!2549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2550, size: 64, align: 64)
!2550 = !DISubroutineType(types: !2551)
!2551 = !{null, !2440, !2115, !897, !897}
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !2099, file: !44, line: 2534, baseType: !897, size: 32, align: 32, offset: 4672)
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !2099, file: !44, line: 2545, baseType: !897, size: 32, align: 32, offset: 4704)
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !2099, file: !44, line: 2547, baseType: !897, size: 32, align: 32, offset: 4736)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !2099, file: !44, line: 2549, baseType: !897, size: 32, align: 32, offset: 4768)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !2099, file: !44, line: 2551, baseType: !897, size: 32, align: 32, offset: 4800)
!2557 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !2099, file: !44, line: 2553, baseType: !897, size: 32, align: 32, offset: 4832)
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !2099, file: !44, line: 2555, baseType: !897, size: 32, align: 32, offset: 4864)
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !2099, file: !44, line: 2557, baseType: !897, size: 32, align: 32, offset: 4896)
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !2099, file: !44, line: 2559, baseType: !897, size: 32, align: 32, offset: 4928)
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !2099, file: !44, line: 2563, baseType: !897, size: 32, align: 32, offset: 4960)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !2099, file: !44, line: 2571, baseType: !2258, size: 64, align: 64, offset: 4992)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !2099, file: !44, line: 2579, baseType: !2258, size: 64, align: 64, offset: 5056)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !2099, file: !44, line: 2586, baseType: !897, size: 32, align: 32, offset: 5120)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !2099, file: !44, line: 2615, baseType: !897, size: 32, align: 32, offset: 5152)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !2099, file: !44, line: 2627, baseType: !897, size: 32, align: 32, offset: 5184)
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !2099, file: !44, line: 2637, baseType: !897, size: 32, align: 32, offset: 5216)
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !2099, file: !44, line: 2681, baseType: !897, size: 32, align: 32, offset: 5248)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !2099, file: !44, line: 2709, baseType: !2262, size: 64, align: 64, offset: 5312)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !2099, file: !44, line: 2716, baseType: !2571, size: 64, align: 64, offset: 5376)
!2571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2572, size: 64, align: 64)
!2572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2573)
!2573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !44, line: 3636, size: 896, align: 64, elements: !2574)
!2574 = !{!2575, !2576, !2577, !2578, !2579, !2580, !2581, !2587, !2591, !2592, !2593, !2594, !2600, !2601, !2602, !2603, !2604}
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2573, file: !44, line: 3642, baseType: !2108, size: 64, align: 64)
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2573, file: !44, line: 3649, baseType: !33, size: 32, align: 32, offset: 64)
!2577 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2573, file: !44, line: 3656, baseType: !43, size: 32, align: 32, offset: 96)
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !2573, file: !44, line: 3663, baseType: !503, size: 32, align: 32, offset: 128)
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !2573, file: !44, line: 3669, baseType: !897, size: 32, align: 32, offset: 160)
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !2573, file: !44, line: 3682, baseType: !2397, size: 64, align: 64, offset: 192)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !2573, file: !44, line: 3698, baseType: !2582, size: 64, align: 64, offset: 256)
!2582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2583, size: 64, align: 64)
!2583 = !DISubroutineType(types: !2584)
!2584 = !{!897, !2097, !2585, !2225}
!2585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2586, size: 64, align: 64)
!2586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2075)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !2573, file: !44, line: 3712, baseType: !2588, size: 64, align: 64, offset: 320)
!2588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2589, size: 64, align: 64)
!2589 = !DISubroutineType(types: !2590)
!2590 = !{!897, !2097, !897, !2585, !2225}
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !2573, file: !44, line: 3726, baseType: !2582, size: 64, align: 64, offset: 384)
!2592 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !2573, file: !44, line: 3737, baseType: !2194, size: 64, align: 64, offset: 448)
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !2573, file: !44, line: 3746, baseType: !897, size: 32, align: 32, offset: 512)
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !2573, file: !44, line: 3757, baseType: !2595, size: 64, align: 64, offset: 576)
!2595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2596, size: 64, align: 64)
!2596 = !DISubroutineType(types: !2597)
!2597 = !{null, !2598}
!2598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2599, size: 64, align: 64)
!2599 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !44, line: 3617, flags: DIFlagFwdDecl)
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !2573, file: !44, line: 3766, baseType: !2194, size: 64, align: 64, offset: 640)
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !2573, file: !44, line: 3774, baseType: !2194, size: 64, align: 64, offset: 704)
!2602 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !2573, file: !44, line: 3780, baseType: !897, size: 32, align: 32, offset: 768)
!2603 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !2573, file: !44, line: 3785, baseType: !897, size: 32, align: 32, offset: 800)
!2604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !2573, file: !44, line: 3795, baseType: !2605, size: 64, align: 64, offset: 832)
!2605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2606, size: 64, align: 64)
!2606 = !DISubroutineType(types: !2607)
!2607 = !{!897, !2097, !2272}
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !2099, file: !44, line: 2728, baseType: !2115, size: 64, align: 64, offset: 5440)
!2609 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2099, file: !44, line: 2735, baseType: !2325, size: 512, align: 64, offset: 5504)
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !2099, file: !44, line: 2742, baseType: !897, size: 32, align: 32, offset: 6016)
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !2099, file: !44, line: 2755, baseType: !897, size: 32, align: 32, offset: 6048)
!2612 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !2099, file: !44, line: 2776, baseType: !897, size: 32, align: 32, offset: 6080)
!2613 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !2099, file: !44, line: 2783, baseType: !897, size: 32, align: 32, offset: 6112)
!2614 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !2099, file: !44, line: 2791, baseType: !897, size: 32, align: 32, offset: 6144)
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !2099, file: !44, line: 2802, baseType: !2400, size: 64, align: 64, offset: 6208)
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !2099, file: !44, line: 2811, baseType: !897, size: 32, align: 32, offset: 6272)
!2617 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !2099, file: !44, line: 2821, baseType: !897, size: 32, align: 32, offset: 6304)
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !2099, file: !44, line: 2830, baseType: !897, size: 32, align: 32, offset: 6336)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !2099, file: !44, line: 2840, baseType: !897, size: 32, align: 32, offset: 6368)
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !2099, file: !44, line: 2851, baseType: !2621, size: 64, align: 64, offset: 6400)
!2621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2622, size: 64, align: 64)
!2622 = !DISubroutineType(types: !2623)
!2623 = !{!897, !2440, !2624, !2115, !2382, !897, !897}
!2624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2625, size: 64, align: 64)
!2625 = !DISubroutineType(types: !2626)
!2626 = !{!897, !2440, !2115}
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !2099, file: !44, line: 2871, baseType: !2628, size: 64, align: 64, offset: 6464)
!2628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2629, size: 64, align: 64)
!2629 = !DISubroutineType(types: !2630)
!2630 = !{!897, !2440, !2631, !2115, !2382, !897}
!2631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2632, size: 64, align: 64)
!2632 = !DISubroutineType(types: !2633)
!2633 = !{!897, !2440, !2115, !897, !897}
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !2099, file: !44, line: 2878, baseType: !897, size: 32, align: 32, offset: 6528)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !2099, file: !44, line: 2885, baseType: !897, size: 32, align: 32, offset: 6560)
!2636 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !2099, file: !44, line: 3005, baseType: !897, size: 32, align: 32, offset: 6592)
!2637 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !2099, file: !44, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !2099, file: !44, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!2639 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !2099, file: !44, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !2099, file: !44, line: 3037, baseType: !2074, size: 64, align: 64, offset: 6720)
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !2099, file: !44, line: 3038, baseType: !897, size: 32, align: 32, offset: 6784)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !2099, file: !44, line: 3050, baseType: !2177, size: 64, align: 64, offset: 6848)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !2099, file: !44, line: 3065, baseType: !897, size: 32, align: 32, offset: 6912)
!2644 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !2099, file: !44, line: 3083, baseType: !897, size: 32, align: 32, offset: 6944)
!2645 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !2099, file: !44, line: 3092, baseType: !2161, size: 64, align: 32, offset: 6976)
!2646 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !2099, file: !44, line: 3099, baseType: !503, size: 32, align: 32, offset: 7040)
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !2099, file: !44, line: 3106, baseType: !2161, size: 64, align: 32, offset: 7072)
!2648 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !2099, file: !44, line: 3113, baseType: !2649, size: 64, align: 64, offset: 7168)
!2649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2650, size: 64, align: 64)
!2650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2651)
!2651 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !44, line: 740, baseType: !2652)
!2652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !44, line: 712, size: 384, align: 64, elements: !2653)
!2653 = !{!2654, !2655, !2656, !2657, !2658, !2659, !2662}
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2652, file: !44, line: 713, baseType: !43, size: 32, align: 32)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2652, file: !44, line: 714, baseType: !33, size: 32, align: 32, offset: 32)
!2656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2652, file: !44, line: 720, baseType: !2108, size: 64, align: 64, offset: 64)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !2652, file: !44, line: 724, baseType: !2108, size: 64, align: 64, offset: 128)
!2658 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !2652, file: !44, line: 728, baseType: !897, size: 32, align: 32, offset: 192)
!2659 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !2652, file: !44, line: 734, baseType: !2660, size: 64, align: 64, offset: 256)
!2660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2661, size: 64, align: 64)
!2661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2108)
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !2652, file: !44, line: 739, baseType: !2663, size: 64, align: 64, offset: 320)
!2663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2664, size: 64, align: 64)
!2664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2185)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !2099, file: !44, line: 3129, baseType: !2262, size: 64, align: 64, offset: 7232)
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !2099, file: !44, line: 3130, baseType: !2262, size: 64, align: 64, offset: 7296)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !2099, file: !44, line: 3131, baseType: !2262, size: 64, align: 64, offset: 7360)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !2099, file: !44, line: 3132, baseType: !2262, size: 64, align: 64, offset: 7424)
!2669 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !2099, file: !44, line: 3139, baseType: !2258, size: 64, align: 64, offset: 7488)
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !2099, file: !44, line: 3147, baseType: !897, size: 32, align: 32, offset: 7552)
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !2099, file: !44, line: 3165, baseType: !897, size: 32, align: 32, offset: 7584)
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !2099, file: !44, line: 3172, baseType: !897, size: 32, align: 32, offset: 7616)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !2099, file: !44, line: 3180, baseType: !897, size: 32, align: 32, offset: 7648)
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !2099, file: !44, line: 3191, baseType: !2477, size: 64, align: 64, offset: 7680)
!2675 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !2099, file: !44, line: 3199, baseType: !2074, size: 64, align: 64, offset: 7744)
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !2099, file: !44, line: 3207, baseType: !2258, size: 64, align: 64, offset: 7808)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !2099, file: !44, line: 3214, baseType: !2226, size: 32, align: 32, offset: 7872)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !2099, file: !44, line: 3224, baseType: !2290, size: 64, align: 64, offset: 7936)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !2099, file: !44, line: 3225, baseType: !897, size: 32, align: 32, offset: 8000)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !2099, file: !44, line: 3249, baseType: !2272, size: 64, align: 64, offset: 8064)
!2681 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !2099, file: !44, line: 3256, baseType: !897, size: 32, align: 32, offset: 8128)
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !2099, file: !44, line: 3271, baseType: !897, size: 32, align: 32, offset: 8160)
!2683 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !2099, file: !44, line: 3279, baseType: !2262, size: 64, align: 64, offset: 8192)
!2684 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !2099, file: !44, line: 3301, baseType: !2272, size: 64, align: 64, offset: 8256)
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !2099, file: !44, line: 3310, baseType: !897, size: 32, align: 32, offset: 8320)
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !2099, file: !44, line: 3337, baseType: !897, size: 32, align: 32, offset: 8352)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !2099, file: !44, line: 3351, baseType: !897, size: 32, align: 32, offset: 8384)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !2099, file: !44, line: 3359, baseType: !897, size: 32, align: 32, offset: 8416)
!2689 = !DILocalVariable(name: "c", arg: 1, scope: !2060, file: !903, line: 333, type: !2063)
!2690 = !DILocation(line: 333, column: 62, scope: !2060)
!2691 = !DILocalVariable(name: "avctx", arg: 2, scope: !2060, file: !903, line: 333, type: !2097)
!2692 = !DILocation(line: 333, column: 81, scope: !2060)
!2693 = !DILocalVariable(name: "high_bit_depth", scope: !2060, file: !903, line: 335, type: !2694)
!2694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2226)
!2695 = !DILocation(line: 335, column: 20, scope: !2060)
!2696 = !DILocation(line: 335, column: 37, scope: !2060)
!2697 = !DILocation(line: 335, column: 44, scope: !2060)
!2698 = !DILocation(line: 335, column: 64, scope: !2060)
!2699 = !DILocation(line: 337, column: 9, scope: !2700)
!2700 = distinct !DILexicalBlock(scope: !2060, file: !903, line: 337, column: 9)
!2701 = !DILocation(line: 337, column: 24, scope: !2700)
!2702 = !DILocation(line: 337, column: 27, scope: !2703)
!2703 = !DILexicalBlockFile(scope: !2700, file: !903, discriminator: 1)
!2704 = !DILocation(line: 337, column: 34, scope: !2703)
!2705 = !DILocation(line: 337, column: 41, scope: !2703)
!2706 = !DILocation(line: 338, column: 11, scope: !2700)
!2707 = !DILocation(line: 338, column: 18, scope: !2700)
!2708 = !DILocation(line: 338, column: 28, scope: !2700)
!2709 = !DILocation(line: 338, column: 33, scope: !2700)
!2710 = !DILocation(line: 339, column: 11, scope: !2700)
!2711 = !DILocation(line: 339, column: 18, scope: !2700)
!2712 = !DILocation(line: 339, column: 28, scope: !2700)
!2713 = !DILocation(line: 337, column: 9, scope: !2714)
!2714 = !DILexicalBlockFile(scope: !2060, file: !903, discriminator: 2)
!2715 = !DILocation(line: 340, column: 9, scope: !2700)
!2716 = !DILocation(line: 342, column: 9, scope: !2717)
!2717 = distinct !DILexicalBlock(scope: !2060, file: !903, line: 342, column: 9)
!2718 = !DILocation(line: 342, column: 16, scope: !2717)
!2719 = !DILocation(line: 342, column: 26, scope: !2717)
!2720 = !DILocation(line: 342, column: 9, scope: !2060)
!2721 = !DILocation(line: 343, column: 9, scope: !2722)
!2722 = distinct !DILexicalBlock(scope: !2717, file: !903, line: 342, column: 33)
!2723 = !DILocation(line: 343, column: 12, scope: !2722)
!2724 = !DILocation(line: 343, column: 21, scope: !2722)
!2725 = !DILocation(line: 344, column: 9, scope: !2722)
!2726 = !DILocation(line: 344, column: 12, scope: !2722)
!2727 = !DILocation(line: 344, column: 21, scope: !2722)
!2728 = !DILocation(line: 345, column: 9, scope: !2722)
!2729 = !DILocation(line: 345, column: 12, scope: !2722)
!2730 = !DILocation(line: 345, column: 17, scope: !2722)
!2731 = !DILocation(line: 346, column: 9, scope: !2722)
!2732 = !DILocation(line: 346, column: 12, scope: !2722)
!2733 = !DILocation(line: 346, column: 22, scope: !2722)
!2734 = !DILocation(line: 347, column: 5, scope: !2722)
!2735 = !DILocation(line: 350, column: 31, scope: !2736)
!2736 = distinct !DILexicalBlock(scope: !2060, file: !903, line: 349, column: 9)
!2737 = !DILocation(line: 350, column: 34, scope: !2736)
!2738 = !DILocation(line: 350, column: 41, scope: !2736)
!2739 = !DILocation(line: 350, column: 9, scope: !2736)
!2740 = !DILocation(line: 354, column: 35, scope: !2060)
!2741 = !DILocation(line: 354, column: 38, scope: !2060)
!2742 = !DILocation(line: 354, column: 56, scope: !2060)
!2743 = !DILocation(line: 354, column: 59, scope: !2060)
!2744 = !DILocation(line: 354, column: 5, scope: !2060)
!2745 = !DILocation(line: 355, column: 1, scope: !2060)
!2746 = !DILocation(line: 355, column: 1, scope: !2747)
!2747 = !DILexicalBlockFile(scope: !2060, file: !903, discriminator: 1)
!2748 = distinct !DISubprogram(name: "xvid_idct_put", scope: !903, file: !903, line: 321, type: !2088, isLocal: true, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !919)
