; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--svq1enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--svq1enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !895, line: 123, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!896 = !{!897, !898, !899, !900}
!897 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!898 = !DIEnumerator(name: "FMT_H261", value: 1)
!899 = !DIEnumerator(name: "FMT_H263", value: 2)
!900 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !902, line: 37, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !{!926, !927, !931, !934, !935, !936, !938, !944}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !929, line: 48, baseType: !930)
!929 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!930 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !929, line: 49, baseType: !933)
!933 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!934 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!935 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !929, line: 40, baseType: !937)
!937 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !940, line: 221, size: 32, align: 8, elements: !941)
!940 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !939, file: !940, line: 221, baseType: !943, size: 32, align: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !929, line: 51, baseType: !935)
!944 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!945 = !{!946, !2594, !2595, !2599, !2605}
!946 = distinct !DIGlobalVariable(name: "ff_svq1_encoder", scope: !0, file: !947, line: 684, type: !948, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_svq1_encoder)
!947 = !DIFile(filename: "libavcodec/svq1enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !950)
!950 = !{!951, !955, !956, !957, !958, !959, !968, !971, !974, !977, !982, !983, !1055, !1063, !1064, !1065, !1067, !2509, !2515, !2523, !2527, !2528, !2565, !2569, !2573, !2574, !2578, !2582, !2583, !2587, !2588, !2589}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !14, line: 3475, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !949, file: !14, line: 3480, baseType: !952, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !949, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !949, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !949, file: !14, line: 3487, baseType: !934, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !949, file: !14, line: 3488, baseType: !960, size: 64, align: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !963, line: 61, baseType: !964)
!963 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !963, line: 58, size: 64, align: 32, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !964, file: !963, line: 59, baseType: !934, size: 32, align: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !964, file: !963, line: 60, baseType: !934, size: 32, align: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !949, file: !14, line: 3489, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !949, file: !14, line: 3490, baseType: !972, size: 64, align: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !949, file: !14, line: 3491, baseType: !975, size: 64, align: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !949, file: !14, line: 3492, baseType: !978, size: 64, align: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !929, line: 55, baseType: !981)
!981 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !949, file: !14, line: 3493, baseType: !928, size: 8, align: 8, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !949, file: !14, line: 3494, baseType: !984, size: 64, align: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !988)
!988 = !{!989, !990, !994, !1014, !1015, !1016, !1017, !1021, !1027, !1029, !1033}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !987, file: !713, line: 72, baseType: !952, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !987, file: !713, line: 78, baseType: !991, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!952, !926}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !987, file: !713, line: 85, baseType: !995, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1010, !1011, !1012, !1013}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !691, line: 247, baseType: !952, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !997, file: !691, line: 253, baseType: !952, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !997, file: !691, line: 259, baseType: !934, size: 32, align: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !997, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !997, file: !691, line: 271, baseType: !1004, size: 64, align: 64, offset: 192)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !997, file: !691, line: 265, size: 64, align: 64, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1004, file: !691, line: 266, baseType: !936, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1004, file: !691, line: 267, baseType: !944, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1004, file: !691, line: 268, baseType: !952, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1004, file: !691, line: 270, baseType: !962, size: 64, align: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !997, file: !691, line: 272, baseType: !944, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !997, file: !691, line: 273, baseType: !944, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !691, line: 275, baseType: !934, size: 32, align: 32, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !997, file: !691, line: 300, baseType: !952, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !987, file: !713, line: 93, baseType: !934, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !987, file: !713, line: 99, baseType: !934, size: 32, align: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !987, file: !713, line: 108, baseType: !934, size: 32, align: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !987, file: !713, line: 113, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!926, !926, !926}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !987, file: !713, line: 123, baseType: !1022, size: 64, align: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !987, file: !713, line: 130, baseType: !1028, size: 32, align: 32, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !987, file: !713, line: 136, baseType: !1030, size: 64, align: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1028, !926}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !987, file: !713, line: 142, baseType: !1034, size: 64, align: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!934, !1037, !926, !952, !934}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1040)
!1040 = !{!1041, !1053, !1054}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1039, file: !691, line: 360, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1045, file: !691, line: 307, baseType: !952, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1045, file: !691, line: 313, baseType: !944, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1045, file: !691, line: 313, baseType: !944, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1045, file: !691, line: 318, baseType: !944, size: 64, align: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1045, file: !691, line: 318, baseType: !944, size: 64, align: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1045, file: !691, line: 323, baseType: !934, size: 32, align: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1039, file: !691, line: 364, baseType: !934, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1039, file: !691, line: 368, baseType: !934, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !949, file: !14, line: 3495, baseType: !1056, size: 64, align: 64, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1059, file: !14, line: 3402, baseType: !934, size: 32, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !14, line: 3403, baseType: !952, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !949, file: !14, line: 3507, baseType: !952, size: 64, align: 64, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !949, file: !14, line: 3516, baseType: !934, size: 32, align: 32, offset: 832)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !14, line: 3517, baseType: !1066, size: 64, align: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !949, file: !14, line: 3527, baseType: !1068, size: 64, align: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!934, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1081, !1082, !1083, !1084, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1363, !1367, !1368, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2447, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1073, file: !14, line: 1561, baseType: !984, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1073, file: !14, line: 1562, baseType: !934, size: 32, align: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1073, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1073, file: !14, line: 1565, baseType: !1079, size: 64, align: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1073, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1073, file: !14, line: 1581, baseType: !935, size: 32, align: 32, offset: 224)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1073, file: !14, line: 1583, baseType: !926, size: 64, align: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1073, file: !14, line: 1591, baseType: !1085, size: 64, align: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1087, line: 129, size: 1664, align: 64, elements: !1088)
!1087 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1088 = !{!1089, !1090, !1091, !1092, !1189, !1210, !1211, !1240, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1086, file: !1087, line: 136, baseType: !934, size: 32, align: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1086, file: !1087, line: 151, baseType: !934, size: 32, align: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1086, file: !1087, line: 157, baseType: !934, size: 32, align: 32, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1086, file: !1087, line: 159, baseType: !1093, size: 64, align: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1096)
!1096 = !{!1097, !1101, !1103, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1141, !1143, !1144, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1177, !1178, !1179, !1180, !1181, !1182, !1185, !1186, !1187, !1188}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1095, file: !744, line: 282, baseType: !1098, size: 512, align: 64)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 512, align: 64, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 8)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1095, file: !744, line: 299, baseType: !1102, size: 256, align: 32, offset: 512)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 256, align: 32, elements: !1099)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1095, file: !744, line: 315, baseType: !1104, size: 64, align: 64, offset: 768)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1095, file: !744, line: 326, baseType: !934, size: 32, align: 32, offset: 832)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1095, file: !744, line: 326, baseType: !934, size: 32, align: 32, offset: 864)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1095, file: !744, line: 334, baseType: !934, size: 32, align: 32, offset: 896)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1095, file: !744, line: 341, baseType: !934, size: 32, align: 32, offset: 928)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1095, file: !744, line: 346, baseType: !934, size: 32, align: 32, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1095, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1095, file: !744, line: 356, baseType: !962, size: 64, align: 32, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1095, file: !744, line: 361, baseType: !936, size: 64, align: 64, offset: 1088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1095, file: !744, line: 369, baseType: !936, size: 64, align: 64, offset: 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1095, file: !744, line: 377, baseType: !936, size: 64, align: 64, offset: 1216)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1095, file: !744, line: 382, baseType: !934, size: 32, align: 32, offset: 1280)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1095, file: !744, line: 386, baseType: !934, size: 32, align: 32, offset: 1312)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1095, file: !744, line: 391, baseType: !934, size: 32, align: 32, offset: 1344)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1095, file: !744, line: 396, baseType: !926, size: 64, align: 64, offset: 1408)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1095, file: !744, line: 403, baseType: !1120, size: 512, align: 64, offset: 1472)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 512, align: 64, elements: !1099)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1095, file: !744, line: 410, baseType: !934, size: 32, align: 32, offset: 1984)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1095, file: !744, line: 415, baseType: !934, size: 32, align: 32, offset: 2016)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1095, file: !744, line: 420, baseType: !934, size: 32, align: 32, offset: 2048)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1095, file: !744, line: 425, baseType: !934, size: 32, align: 32, offset: 2080)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1095, file: !744, line: 435, baseType: !936, size: 64, align: 64, offset: 2112)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1095, file: !744, line: 440, baseType: !934, size: 32, align: 32, offset: 2176)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1095, file: !744, line: 445, baseType: !980, size: 64, align: 64, offset: 2240)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1095, file: !744, line: 459, baseType: !1129, size: 512, align: 64, offset: 2304)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 512, align: 64, elements: !1099)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1132, line: 94, baseType: !1133)
!1132 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1132, line: 81, size: 192, align: 64, elements: !1134)
!1134 = !{!1135, !1139, !1140}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1133, file: !1132, line: 82, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1132, line: 73, baseType: !1138)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1132, line: 73, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !1132, line: 89, baseType: !927, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !1132, line: 93, baseType: !934, size: 32, align: 32, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1095, file: !744, line: 473, baseType: !1142, size: 64, align: 64, offset: 2816)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1095, file: !744, line: 477, baseType: !934, size: 32, align: 32, offset: 2880)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1095, file: !744, line: 479, baseType: !1145, size: 64, align: 64, offset: 2944)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1158}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1148, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !744, line: 203, baseType: !927, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !744, line: 204, baseType: !934, size: 32, align: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1148, file: !744, line: 205, baseType: !1154, size: 64, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1156, line: 86, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1156, line: 86, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1148, file: !744, line: 206, baseType: !1130, size: 64, align: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1095, file: !744, line: 480, baseType: !934, size: 32, align: 32, offset: 3008)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1095, file: !744, line: 505, baseType: !934, size: 32, align: 32, offset: 3040)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1095, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1095, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1095, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1095, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1095, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1095, file: !744, line: 532, baseType: !936, size: 64, align: 64, offset: 3264)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1095, file: !744, line: 539, baseType: !936, size: 64, align: 64, offset: 3328)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1095, file: !744, line: 547, baseType: !936, size: 64, align: 64, offset: 3392)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1095, file: !744, line: 554, baseType: !1154, size: 64, align: 64, offset: 3456)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1095, file: !744, line: 563, baseType: !934, size: 32, align: 32, offset: 3520)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1095, file: !744, line: 572, baseType: !934, size: 32, align: 32, offset: 3552)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1095, file: !744, line: 581, baseType: !934, size: 32, align: 32, offset: 3584)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1095, file: !744, line: 588, baseType: !1174, size: 64, align: 64, offset: 3648)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !929, line: 36, baseType: !1176)
!1176 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1095, file: !744, line: 593, baseType: !934, size: 32, align: 32, offset: 3712)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1095, file: !744, line: 596, baseType: !934, size: 32, align: 32, offset: 3744)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1095, file: !744, line: 599, baseType: !1130, size: 64, align: 64, offset: 3776)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1095, file: !744, line: 605, baseType: !1130, size: 64, align: 64, offset: 3840)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1095, file: !744, line: 616, baseType: !1130, size: 64, align: 64, offset: 3904)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1095, file: !744, line: 626, baseType: !1183, size: 64, align: 64, offset: 3968)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1184, line: 216, baseType: !981)
!1184 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1095, file: !744, line: 627, baseType: !1183, size: 64, align: 64, offset: 4032)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1095, file: !744, line: 628, baseType: !1183, size: 64, align: 64, offset: 4096)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1095, file: !744, line: 629, baseType: !1183, size: 64, align: 64, offset: 4160)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1095, file: !744, line: 645, baseType: !1130, size: 64, align: 64, offset: 4224)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1086, file: !1087, line: 161, baseType: !1190, size: 64, align: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1087, line: 117, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1087, line: 100, size: 832, align: 64, elements: !1193)
!1193 = !{!1194, !1201, !1202, !1203, !1204, !1205, !1207, !1208, !1209}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1192, file: !1087, line: 105, baseType: !1195, size: 256, align: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 256, align: 64, elements: !1199)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1132, line: 238, baseType: !1198)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1132, line: 238, flags: DIFlagFwdDecl)
!1199 = !{!1200}
!1200 = !DISubrange(count: 4)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1192, file: !1087, line: 110, baseType: !934, size: 32, align: 32, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1192, file: !1087, line: 111, baseType: !934, size: 32, align: 32, offset: 288)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1192, file: !1087, line: 111, baseType: !934, size: 32, align: 32, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1192, file: !1087, line: 112, baseType: !1102, size: 256, align: 32, offset: 352)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1192, file: !1087, line: 113, baseType: !1206, size: 128, align: 32, offset: 608)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 128, align: 32, elements: !1199)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1192, file: !1087, line: 114, baseType: !934, size: 32, align: 32, offset: 736)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1192, file: !1087, line: 115, baseType: !934, size: 32, align: 32, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1192, file: !1087, line: 116, baseType: !934, size: 32, align: 32, offset: 800)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1086, file: !1087, line: 163, baseType: !926, size: 64, align: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1086, file: !1087, line: 165, baseType: !1212, size: 128, align: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1087, line: 122, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1087, line: 119, size: 128, align: 64, elements: !1214)
!1214 = !{!1215, !1239}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1213, file: !1087, line: 120, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1235, !1236, !1237, !1238}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1218, file: !14, line: 1451, baseType: !1130, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1218, file: !14, line: 1461, baseType: !936, size: 64, align: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1218, file: !14, line: 1467, baseType: !936, size: 64, align: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1218, file: !14, line: 1468, baseType: !927, size: 64, align: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1218, file: !14, line: 1469, baseType: !934, size: 32, align: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1218, file: !14, line: 1470, baseType: !934, size: 32, align: 32, offset: 288)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1218, file: !14, line: 1474, baseType: !934, size: 32, align: 32, offset: 320)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1218, file: !14, line: 1479, baseType: !1228, size: 64, align: 64, offset: 384)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1230, file: !14, line: 1412, baseType: !927, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1230, file: !14, line: 1413, baseType: !934, size: 32, align: 32, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1230, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1218, file: !14, line: 1480, baseType: !934, size: 32, align: 32, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1218, file: !14, line: 1486, baseType: !936, size: 64, align: 64, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1218, file: !14, line: 1488, baseType: !936, size: 64, align: 64, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1218, file: !14, line: 1497, baseType: !936, size: 64, align: 64, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1213, file: !1087, line: 121, baseType: !1093, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1086, file: !1087, line: 166, baseType: !1241, size: 128, align: 64, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1087, line: 127, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1087, line: 124, size: 128, align: 64, elements: !1243)
!1243 = !{!1244, !1317}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1242, file: !1087, line: 125, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1249)
!1249 = !{!1250, !1251, !1275, !1279, !1280, !1314, !1315, !1316}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1248, file: !14, line: 5751, baseType: !984, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1248, file: !14, line: 5756, baseType: !1252, size: 64, align: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1260, !1261, !1262, !1266, !1270, !1274}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1254, file: !14, line: 5797, baseType: !952, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1254, file: !14, line: 5804, baseType: !1258, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1254, file: !14, line: 5815, baseType: !984, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1254, file: !14, line: 5825, baseType: !934, size: 32, align: 32, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1254, file: !14, line: 5826, baseType: !1263, size: 64, align: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!934, !1246}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1254, file: !14, line: 5827, baseType: !1267, size: 64, align: 64, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!934, !1246, !1216}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1254, file: !14, line: 5828, baseType: !1271, size: 64, align: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !1246}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1254, file: !14, line: 5829, baseType: !1271, size: 64, align: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1248, file: !14, line: 5762, baseType: !1276, size: 64, align: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1278)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1248, file: !14, line: 5768, baseType: !926, size: 64, align: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1248, file: !14, line: 5775, baseType: !1281, size: 64, align: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1283, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1283, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1283, file: !14, line: 3948, baseType: !943, size: 32, align: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1283, file: !14, line: 3958, baseType: !927, size: 64, align: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1283, file: !14, line: 3962, baseType: !934, size: 32, align: 32, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1283, file: !14, line: 3968, baseType: !934, size: 32, align: 32, offset: 224)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1283, file: !14, line: 3973, baseType: !936, size: 64, align: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1283, file: !14, line: 3986, baseType: !934, size: 32, align: 32, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1283, file: !14, line: 3999, baseType: !934, size: 32, align: 32, offset: 352)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1283, file: !14, line: 4004, baseType: !934, size: 32, align: 32, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1283, file: !14, line: 4005, baseType: !934, size: 32, align: 32, offset: 416)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1283, file: !14, line: 4010, baseType: !934, size: 32, align: 32, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1283, file: !14, line: 4011, baseType: !934, size: 32, align: 32, offset: 480)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1283, file: !14, line: 4020, baseType: !962, size: 64, align: 32, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1283, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1283, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1283, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1283, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1283, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1283, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1283, file: !14, line: 4039, baseType: !934, size: 32, align: 32, offset: 768)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1283, file: !14, line: 4046, baseType: !980, size: 64, align: 64, offset: 832)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1283, file: !14, line: 4050, baseType: !934, size: 32, align: 32, offset: 896)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1283, file: !14, line: 4054, baseType: !934, size: 32, align: 32, offset: 928)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1283, file: !14, line: 4061, baseType: !934, size: 32, align: 32, offset: 960)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1283, file: !14, line: 4065, baseType: !934, size: 32, align: 32, offset: 992)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1283, file: !14, line: 4073, baseType: !934, size: 32, align: 32, offset: 1024)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1283, file: !14, line: 4080, baseType: !934, size: 32, align: 32, offset: 1056)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1283, file: !14, line: 4084, baseType: !934, size: 32, align: 32, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1248, file: !14, line: 5781, baseType: !1281, size: 64, align: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1248, file: !14, line: 5787, baseType: !962, size: 64, align: 32, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1248, file: !14, line: 5793, baseType: !962, size: 64, align: 32, offset: 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1242, file: !1087, line: 126, baseType: !934, size: 32, align: 32, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1086, file: !1087, line: 172, baseType: !1216, size: 64, align: 64, offset: 576)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1086, file: !1087, line: 177, baseType: !927, size: 64, align: 64, offset: 640)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1086, file: !1087, line: 178, baseType: !935, size: 32, align: 32, offset: 704)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1086, file: !1087, line: 180, baseType: !926, size: 64, align: 64, offset: 768)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1086, file: !1087, line: 185, baseType: !934, size: 32, align: 32, offset: 832)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1086, file: !1087, line: 190, baseType: !926, size: 64, align: 64, offset: 896)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1086, file: !1087, line: 195, baseType: !934, size: 32, align: 32, offset: 960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1086, file: !1087, line: 200, baseType: !1216, size: 64, align: 64, offset: 1024)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1086, file: !1087, line: 201, baseType: !934, size: 32, align: 32, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1086, file: !1087, line: 202, baseType: !1093, size: 64, align: 64, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1086, file: !1087, line: 203, baseType: !934, size: 32, align: 32, offset: 1216)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1086, file: !1087, line: 205, baseType: !934, size: 32, align: 32, offset: 1248)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1086, file: !1087, line: 206, baseType: !934, size: 32, align: 32, offset: 1280)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1086, file: !1087, line: 209, baseType: !1183, size: 64, align: 64, offset: 1344)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1086, file: !1087, line: 212, baseType: !1183, size: 64, align: 64, offset: 1408)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1086, file: !1087, line: 213, baseType: !1093, size: 64, align: 64, offset: 1472)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1086, file: !1087, line: 215, baseType: !934, size: 32, align: 32, offset: 1536)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1086, file: !1087, line: 217, baseType: !934, size: 32, align: 32, offset: 1568)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1086, file: !1087, line: 220, baseType: !934, size: 32, align: 32, offset: 1600)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1073, file: !14, line: 1598, baseType: !926, size: 64, align: 64, offset: 384)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1073, file: !14, line: 1606, baseType: !936, size: 64, align: 64, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1073, file: !14, line: 1614, baseType: !934, size: 32, align: 32, offset: 512)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1073, file: !14, line: 1622, baseType: !934, size: 32, align: 32, offset: 544)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1073, file: !14, line: 1628, baseType: !934, size: 32, align: 32, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1073, file: !14, line: 1636, baseType: !934, size: 32, align: 32, offset: 608)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1073, file: !14, line: 1643, baseType: !934, size: 32, align: 32, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1073, file: !14, line: 1657, baseType: !927, size: 64, align: 64, offset: 704)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1073, file: !14, line: 1658, baseType: !934, size: 32, align: 32, offset: 768)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1073, file: !14, line: 1679, baseType: !962, size: 64, align: 32, offset: 800)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1073, file: !14, line: 1688, baseType: !934, size: 32, align: 32, offset: 864)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1073, file: !14, line: 1712, baseType: !934, size: 32, align: 32, offset: 896)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1073, file: !14, line: 1729, baseType: !934, size: 32, align: 32, offset: 928)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1073, file: !14, line: 1729, baseType: !934, size: 32, align: 32, offset: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1073, file: !14, line: 1744, baseType: !934, size: 32, align: 32, offset: 992)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1073, file: !14, line: 1744, baseType: !934, size: 32, align: 32, offset: 1024)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1073, file: !14, line: 1751, baseType: !934, size: 32, align: 32, offset: 1056)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1073, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1073, file: !14, line: 1791, baseType: !1356, size: 64, align: 64, offset: 1152)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{null, !1359, !1360, !1362, !934, !934, !934}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1073, file: !14, line: 1808, baseType: !1364, size: 64, align: 64, offset: 1216)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!473, !1359, !969}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1073, file: !14, line: 1816, baseType: !934, size: 32, align: 32, offset: 1280)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1073, file: !14, line: 1825, baseType: !1369, size: 32, align: 32, offset: 1312)
!1369 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1073, file: !14, line: 1830, baseType: !934, size: 32, align: 32, offset: 1344)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1073, file: !14, line: 1838, baseType: !1369, size: 32, align: 32, offset: 1376)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1073, file: !14, line: 1846, baseType: !934, size: 32, align: 32, offset: 1408)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1073, file: !14, line: 1851, baseType: !934, size: 32, align: 32, offset: 1440)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1073, file: !14, line: 1861, baseType: !1369, size: 32, align: 32, offset: 1472)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1073, file: !14, line: 1868, baseType: !1369, size: 32, align: 32, offset: 1504)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1073, file: !14, line: 1875, baseType: !1369, size: 32, align: 32, offset: 1536)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1073, file: !14, line: 1882, baseType: !1369, size: 32, align: 32, offset: 1568)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1073, file: !14, line: 1889, baseType: !1369, size: 32, align: 32, offset: 1600)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1073, file: !14, line: 1896, baseType: !1369, size: 32, align: 32, offset: 1632)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1073, file: !14, line: 1903, baseType: !1369, size: 32, align: 32, offset: 1664)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1073, file: !14, line: 1910, baseType: !934, size: 32, align: 32, offset: 1696)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1073, file: !14, line: 1915, baseType: !934, size: 32, align: 32, offset: 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1073, file: !14, line: 1926, baseType: !1362, size: 64, align: 64, offset: 1792)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1073, file: !14, line: 1935, baseType: !962, size: 64, align: 32, offset: 1856)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1073, file: !14, line: 1942, baseType: !934, size: 32, align: 32, offset: 1920)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1073, file: !14, line: 1948, baseType: !934, size: 32, align: 32, offset: 1952)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1073, file: !14, line: 1954, baseType: !934, size: 32, align: 32, offset: 1984)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1073, file: !14, line: 1960, baseType: !934, size: 32, align: 32, offset: 2016)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1073, file: !14, line: 1984, baseType: !934, size: 32, align: 32, offset: 2048)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1073, file: !14, line: 1991, baseType: !934, size: 32, align: 32, offset: 2080)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1073, file: !14, line: 1996, baseType: !934, size: 32, align: 32, offset: 2112)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1073, file: !14, line: 2004, baseType: !934, size: 32, align: 32, offset: 2144)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1073, file: !14, line: 2011, baseType: !934, size: 32, align: 32, offset: 2176)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1073, file: !14, line: 2018, baseType: !934, size: 32, align: 32, offset: 2208)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1073, file: !14, line: 2027, baseType: !934, size: 32, align: 32, offset: 2240)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1073, file: !14, line: 2034, baseType: !934, size: 32, align: 32, offset: 2272)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1073, file: !14, line: 2044, baseType: !934, size: 32, align: 32, offset: 2304)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1073, file: !14, line: 2054, baseType: !931, size: 64, align: 64, offset: 2368)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1073, file: !14, line: 2061, baseType: !931, size: 64, align: 64, offset: 2432)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1073, file: !14, line: 2066, baseType: !934, size: 32, align: 32, offset: 2496)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1073, file: !14, line: 2070, baseType: !934, size: 32, align: 32, offset: 2528)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1073, file: !14, line: 2078, baseType: !934, size: 32, align: 32, offset: 2560)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1073, file: !14, line: 2085, baseType: !934, size: 32, align: 32, offset: 2592)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1073, file: !14, line: 2092, baseType: !934, size: 32, align: 32, offset: 2624)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1073, file: !14, line: 2099, baseType: !934, size: 32, align: 32, offset: 2656)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1073, file: !14, line: 2106, baseType: !934, size: 32, align: 32, offset: 2688)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1073, file: !14, line: 2113, baseType: !934, size: 32, align: 32, offset: 2720)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1073, file: !14, line: 2120, baseType: !934, size: 32, align: 32, offset: 2752)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1073, file: !14, line: 2125, baseType: !934, size: 32, align: 32, offset: 2784)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1073, file: !14, line: 2133, baseType: !934, size: 32, align: 32, offset: 2816)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1073, file: !14, line: 2140, baseType: !934, size: 32, align: 32, offset: 2848)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1073, file: !14, line: 2145, baseType: !934, size: 32, align: 32, offset: 2880)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1073, file: !14, line: 2153, baseType: !934, size: 32, align: 32, offset: 2912)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1073, file: !14, line: 2158, baseType: !934, size: 32, align: 32, offset: 2944)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1073, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1073, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1073, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1073, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1073, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1073, file: !14, line: 2203, baseType: !934, size: 32, align: 32, offset: 3136)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1073, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1073, file: !14, line: 2212, baseType: !934, size: 32, align: 32, offset: 3200)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1073, file: !14, line: 2213, baseType: !934, size: 32, align: 32, offset: 3232)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1073, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1073, file: !14, line: 2232, baseType: !934, size: 32, align: 32, offset: 3296)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1073, file: !14, line: 2243, baseType: !934, size: 32, align: 32, offset: 3328)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1073, file: !14, line: 2249, baseType: !934, size: 32, align: 32, offset: 3360)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1073, file: !14, line: 2256, baseType: !934, size: 32, align: 32, offset: 3392)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1073, file: !14, line: 2263, baseType: !980, size: 64, align: 64, offset: 3456)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1073, file: !14, line: 2270, baseType: !980, size: 64, align: 64, offset: 3520)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1073, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1073, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1073, file: !14, line: 2367, baseType: !1434, size: 64, align: 64, offset: 3648)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!934, !1359, !1093, !934}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1073, file: !14, line: 2383, baseType: !934, size: 32, align: 32, offset: 3712)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1073, file: !14, line: 2386, baseType: !1369, size: 32, align: 32, offset: 3744)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1073, file: !14, line: 2387, baseType: !1369, size: 32, align: 32, offset: 3776)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1073, file: !14, line: 2394, baseType: !934, size: 32, align: 32, offset: 3808)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1073, file: !14, line: 2401, baseType: !934, size: 32, align: 32, offset: 3840)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1073, file: !14, line: 2408, baseType: !934, size: 32, align: 32, offset: 3872)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1073, file: !14, line: 2415, baseType: !934, size: 32, align: 32, offset: 3904)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1073, file: !14, line: 2422, baseType: !934, size: 32, align: 32, offset: 3936)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1073, file: !14, line: 2423, baseType: !1446, size: 64, align: 64, offset: 3968)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1448, file: !14, line: 827, baseType: !934, size: 32, align: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1448, file: !14, line: 828, baseType: !934, size: 32, align: 32, offset: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1448, file: !14, line: 829, baseType: !934, size: 32, align: 32, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1448, file: !14, line: 830, baseType: !1369, size: 32, align: 32, offset: 96)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1073, file: !14, line: 2430, baseType: !936, size: 64, align: 64, offset: 4032)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1073, file: !14, line: 2437, baseType: !936, size: 64, align: 64, offset: 4096)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1073, file: !14, line: 2444, baseType: !1369, size: 32, align: 32, offset: 4160)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1073, file: !14, line: 2451, baseType: !1369, size: 32, align: 32, offset: 4192)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1073, file: !14, line: 2458, baseType: !934, size: 32, align: 32, offset: 4224)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1073, file: !14, line: 2469, baseType: !934, size: 32, align: 32, offset: 4256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1073, file: !14, line: 2475, baseType: !934, size: 32, align: 32, offset: 4288)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1073, file: !14, line: 2481, baseType: !934, size: 32, align: 32, offset: 4320)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1073, file: !14, line: 2485, baseType: !934, size: 32, align: 32, offset: 4352)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1073, file: !14, line: 2489, baseType: !934, size: 32, align: 32, offset: 4384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1073, file: !14, line: 2493, baseType: !934, size: 32, align: 32, offset: 4416)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1073, file: !14, line: 2501, baseType: !934, size: 32, align: 32, offset: 4448)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1073, file: !14, line: 2506, baseType: !934, size: 32, align: 32, offset: 4480)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1073, file: !14, line: 2510, baseType: !934, size: 32, align: 32, offset: 4512)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1073, file: !14, line: 2514, baseType: !936, size: 64, align: 64, offset: 4544)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1073, file: !14, line: 2528, baseType: !1470, size: 64, align: 64, offset: 4608)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !1359, !926, !934, !934}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1073, file: !14, line: 2534, baseType: !934, size: 32, align: 32, offset: 4672)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1073, file: !14, line: 2545, baseType: !934, size: 32, align: 32, offset: 4704)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1073, file: !14, line: 2547, baseType: !934, size: 32, align: 32, offset: 4736)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1073, file: !14, line: 2549, baseType: !934, size: 32, align: 32, offset: 4768)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1073, file: !14, line: 2551, baseType: !934, size: 32, align: 32, offset: 4800)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1073, file: !14, line: 2553, baseType: !934, size: 32, align: 32, offset: 4832)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1073, file: !14, line: 2555, baseType: !934, size: 32, align: 32, offset: 4864)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1073, file: !14, line: 2557, baseType: !934, size: 32, align: 32, offset: 4896)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1073, file: !14, line: 2559, baseType: !934, size: 32, align: 32, offset: 4928)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1073, file: !14, line: 2563, baseType: !934, size: 32, align: 32, offset: 4960)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1073, file: !14, line: 2571, baseType: !1484, size: 64, align: 64, offset: 4992)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1073, file: !14, line: 2579, baseType: !1484, size: 64, align: 64, offset: 5056)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1073, file: !14, line: 2586, baseType: !934, size: 32, align: 32, offset: 5120)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1073, file: !14, line: 2615, baseType: !934, size: 32, align: 32, offset: 5152)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1073, file: !14, line: 2627, baseType: !934, size: 32, align: 32, offset: 5184)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1073, file: !14, line: 2637, baseType: !934, size: 32, align: 32, offset: 5216)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1073, file: !14, line: 2681, baseType: !934, size: 32, align: 32, offset: 5248)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1073, file: !14, line: 2709, baseType: !936, size: 64, align: 64, offset: 5312)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1073, file: !14, line: 2716, baseType: !1493, size: 64, align: 64, offset: 5376)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1495)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1496)
!1496 = !{!1497, !1498, !1499, !1500, !1501, !1502, !1506, !1512, !1516, !1517, !1518, !1519, !2420, !2421, !2422, !2423, !2424}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1495, file: !14, line: 3642, baseType: !952, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1495, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1495, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1495, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1495, file: !14, line: 3669, baseType: !934, size: 32, align: 32, offset: 160)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1495, file: !14, line: 3682, baseType: !1503, size: 64, align: 64, offset: 192)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!934, !1071, !1093}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1495, file: !14, line: 3698, baseType: !1507, size: 64, align: 64, offset: 256)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!934, !1071, !1510, !943}
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1495, file: !14, line: 3712, baseType: !1513, size: 64, align: 64, offset: 320)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!934, !1071, !934, !1510, !943}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1495, file: !14, line: 3726, baseType: !1507, size: 64, align: 64, offset: 384)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1495, file: !14, line: 3737, baseType: !1068, size: 64, align: 64, offset: 448)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1495, file: !14, line: 3746, baseType: !934, size: 32, align: 32, offset: 512)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1495, file: !14, line: 3757, baseType: !1520, size: 64, align: 64, offset: 576)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{null, !1523}
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1525, line: 81, size: 86208, align: 64, elements: !1526)
!1525 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1526 = !{!1527, !1529, !1530, !1531, !1532, !1536, !1537, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1584, !1585, !1640, !1642, !1643, !1644, !1645, !1646, !1657, !1658, !1659, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1675, !1677, !1679, !1680, !1681, !1682, !1683, !1684, !1689, !1691, !1692, !1693, !1694, !1695, !1696, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1723, !1724, !1725, !1726, !1742, !1749, !1761, !1777, !1799, !1839, !1852, !1879, !1894, !1908, !1921, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1942, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1955, !1957, !1958, !1959, !1960, !1961, !1962, !1965, !1967, !1969, !1970, !1973, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2040, !2041, !2043, !2044, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2066, !2067, !2068, !2071, !2072, !2073, !2074, !2076, !2078, !2079, !2080, !2081, !2082, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2164, !2165, !2166, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2295, !2296, !2297, !2298, !2302, !2303, !2307, !2311, !2315, !2316, !2321, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2336, !2337, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2355, !2356, !2357, !2407, !2408, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1524, file: !1525, line: 82, baseType: !1528, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1524, file: !1525, line: 84, baseType: !934, size: 32, align: 32, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1524, file: !1525, line: 84, baseType: !934, size: 32, align: 32, offset: 96)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1524, file: !1525, line: 85, baseType: !934, size: 32, align: 32, offset: 128)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1524, file: !1525, line: 86, baseType: !1533, size: 384, align: 32, offset: 160)
!1533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 384, align: 32, elements: !1534)
!1534 = !{!1535}
!1535 = !DISubrange(count: 12)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1524, file: !1525, line: 87, baseType: !934, size: 32, align: 32, offset: 544)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1524, file: !1525, line: 90, baseType: !1538, size: 1088, align: 64, offset: 576)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1539)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1540)
!1540 = !{!1541, !1542, !1546}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1539, file: !902, line: 32, baseType: !1510, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1539, file: !902, line: 33, baseType: !1543, size: 512, align: 8, offset: 64)
!1543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 512, align: 8, elements: !1544)
!1544 = !{!1545}
!1545 = !DISubrange(count: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1539, file: !902, line: 34, baseType: !1543, size: 512, align: 8, offset: 576)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1524, file: !1525, line: 91, baseType: !1538, size: 1088, align: 64, offset: 1664)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1524, file: !1525, line: 92, baseType: !1538, size: 1088, align: 64, offset: 2752)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1524, file: !1525, line: 93, baseType: !1538, size: 1088, align: 64, offset: 3840)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1524, file: !1525, line: 98, baseType: !1359, size: 64, align: 64, offset: 4928)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1524, file: !1525, line: 100, baseType: !934, size: 32, align: 32, offset: 4992)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1524, file: !1525, line: 100, baseType: !934, size: 32, align: 32, offset: 5024)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1524, file: !1525, line: 101, baseType: !934, size: 32, align: 32, offset: 5056)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1524, file: !1525, line: 102, baseType: !934, size: 32, align: 32, offset: 5088)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1524, file: !1525, line: 103, baseType: !936, size: 64, align: 64, offset: 5120)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1524, file: !1525, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1524, file: !1525, line: 105, baseType: !934, size: 32, align: 32, offset: 5216)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1524, file: !1525, line: 106, baseType: !934, size: 32, align: 32, offset: 5248)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1524, file: !1525, line: 109, baseType: !934, size: 32, align: 32, offset: 5280)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1524, file: !1525, line: 110, baseType: !934, size: 32, align: 32, offset: 5312)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1524, file: !1525, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1524, file: !1525, line: 113, baseType: !934, size: 32, align: 32, offset: 5376)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1524, file: !1525, line: 114, baseType: !934, size: 32, align: 32, offset: 5408)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1524, file: !1525, line: 115, baseType: !934, size: 32, align: 32, offset: 5440)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1524, file: !1525, line: 116, baseType: !934, size: 32, align: 32, offset: 5472)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1524, file: !1525, line: 117, baseType: !934, size: 32, align: 32, offset: 5504)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1524, file: !1525, line: 118, baseType: !934, size: 32, align: 32, offset: 5536)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1524, file: !1525, line: 119, baseType: !934, size: 32, align: 32, offset: 5568)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1524, file: !1525, line: 120, baseType: !934, size: 32, align: 32, offset: 5600)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1524, file: !1525, line: 124, baseType: !934, size: 32, align: 32, offset: 5632)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1524, file: !1525, line: 125, baseType: !934, size: 32, align: 32, offset: 5664)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1524, file: !1525, line: 126, baseType: !934, size: 32, align: 32, offset: 5696)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1524, file: !1525, line: 127, baseType: !934, size: 32, align: 32, offset: 5728)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1524, file: !1525, line: 128, baseType: !934, size: 32, align: 32, offset: 5760)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1524, file: !1525, line: 129, baseType: !934, size: 32, align: 32, offset: 5792)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1524, file: !1525, line: 129, baseType: !934, size: 32, align: 32, offset: 5824)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1524, file: !1525, line: 130, baseType: !934, size: 32, align: 32, offset: 5856)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1524, file: !1525, line: 131, baseType: !934, size: 32, align: 32, offset: 5888)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1524, file: !1525, line: 132, baseType: !934, size: 32, align: 32, offset: 5920)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1524, file: !1525, line: 132, baseType: !934, size: 32, align: 32, offset: 5952)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1524, file: !1525, line: 133, baseType: !934, size: 32, align: 32, offset: 5984)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1524, file: !1525, line: 134, baseType: !1583, size: 64, align: 64, offset: 6016)
!1583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1184, line: 149, baseType: !937)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1524, file: !1525, line: 135, baseType: !1583, size: 64, align: 64, offset: 6080)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1524, file: !1525, line: 136, baseType: !1586, size: 64, align: 64, offset: 6144)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1588, line: 91, baseType: !1589)
!1588 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1588, line: 45, size: 2624, align: 64, elements: !1590)
!1590 = !{!1591, !1593, !1604, !1605, !1606, !1608, !1614, !1615, !1617, !1618, !1619, !1620, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1589, file: !1588, line: 46, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1589, file: !1588, line: 47, baseType: !1594, size: 256, align: 64, offset: 64)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1595, line: 40, baseType: !1596)
!1595 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1595, line: 34, size: 256, align: 64, elements: !1597)
!1597 = !{!1598, !1599, !1603}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1596, file: !1595, line: 35, baseType: !1093, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1596, file: !1595, line: 36, baseType: !1600, size: 128, align: 64, offset: 64)
!1600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1071, size: 128, align: 64, elements: !1601)
!1601 = !{!1602}
!1602 = !DISubrange(count: 2)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1596, file: !1595, line: 39, baseType: !1130, size: 64, align: 64, offset: 192)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1589, file: !1588, line: 49, baseType: !1130, size: 64, align: 64, offset: 320)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1589, file: !1588, line: 50, baseType: !1174, size: 64, align: 64, offset: 384)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1589, file: !1588, line: 52, baseType: !1607, size: 128, align: 64, offset: 448)
!1607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 128, align: 64, elements: !1601)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1589, file: !1588, line: 53, baseType: !1609, size: 128, align: 64, offset: 576)
!1609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1610, size: 128, align: 64, elements: !1601)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1612, size: 32, align: 16, elements: !1601)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !929, line: 37, baseType: !1613)
!1613 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1589, file: !1588, line: 55, baseType: !1130, size: 64, align: 64, offset: 704)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1589, file: !1588, line: 56, baseType: !1616, size: 64, align: 64, offset: 768)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1589, file: !1588, line: 58, baseType: !1130, size: 64, align: 64, offset: 832)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1589, file: !1588, line: 59, baseType: !927, size: 64, align: 64, offset: 896)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1589, file: !1588, line: 61, baseType: !1607, size: 128, align: 64, offset: 960)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1589, file: !1588, line: 62, baseType: !1621, size: 128, align: 64, offset: 1088)
!1621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 128, align: 64, elements: !1601)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1589, file: !1588, line: 64, baseType: !1130, size: 64, align: 64, offset: 1216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1589, file: !1588, line: 65, baseType: !931, size: 64, align: 64, offset: 1280)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1589, file: !1588, line: 67, baseType: !1130, size: 64, align: 64, offset: 1344)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1589, file: !1588, line: 68, baseType: !931, size: 64, align: 64, offset: 1408)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1589, file: !1588, line: 70, baseType: !934, size: 32, align: 32, offset: 1472)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1589, file: !1588, line: 71, baseType: !934, size: 32, align: 32, offset: 1504)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1589, file: !1588, line: 73, baseType: !1130, size: 64, align: 64, offset: 1536)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1589, file: !1588, line: 74, baseType: !927, size: 64, align: 64, offset: 1600)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1589, file: !1588, line: 76, baseType: !1130, size: 64, align: 64, offset: 1664)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1589, file: !1588, line: 77, baseType: !926, size: 64, align: 64, offset: 1728)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1589, file: !1588, line: 79, baseType: !934, size: 32, align: 32, offset: 1792)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1589, file: !1588, line: 81, baseType: !936, size: 64, align: 64, offset: 1856)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1589, file: !1588, line: 82, baseType: !936, size: 64, align: 64, offset: 1920)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1589, file: !1588, line: 84, baseType: !934, size: 32, align: 32, offset: 1984)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1589, file: !1588, line: 85, baseType: !934, size: 32, align: 32, offset: 2016)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1589, file: !1588, line: 87, baseType: !934, size: 32, align: 32, offset: 2048)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1589, file: !1588, line: 88, baseType: !934, size: 32, align: 32, offset: 2080)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1589, file: !1588, line: 90, baseType: !1120, size: 512, align: 64, offset: 2112)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1524, file: !1525, line: 137, baseType: !1641, size: 64, align: 64, offset: 6208)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_input_picture", scope: !1524, file: !1525, line: 138, baseType: !1641, size: 64, align: 64, offset: 6272)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "user_specified_pts", scope: !1524, file: !1525, line: 140, baseType: !936, size: 64, align: 64, offset: 6336)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "dts_delta", scope: !1524, file: !1525, line: 144, baseType: !936, size: 64, align: 64, offset: 6400)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_pts", scope: !1524, file: !1525, line: 148, baseType: !936, size: 64, align: 64, offset: 6464)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1524, file: !1525, line: 151, baseType: !1647, size: 320, align: 64, offset: 6528)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1648, line: 40, baseType: !1649)
!1648 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
