; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rtjpeg.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--rtjpeg.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RTJpegContext = type { i32, i32, %struct.IDCTDSPContext, [64 x i8], [64 x i32], [64 x i32], [64 x i16] }
%struct.IDCTDSPContext = type { void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i16*)*, [64 x i8], i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }

!845 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!846 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!847 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!848 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!849 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!850 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!851 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!852 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!853 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!854 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!855 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!856 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!857 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!858 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!859 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!860 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!861 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!862 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!863 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!864 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!865 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!866 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !156, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !156, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !156, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !{!897, !898, !899, !907}
!897 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!898 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !902, line: 221, size: 32, align: 8, elements: !903)
!902 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !901, file: !902, line: 221, baseType: !905, size: 32, align: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !906, line: 51, baseType: !898)
!906 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !906, line: 48, baseType: !908)
!908 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!909 = !{i32 2, !"Dwarf Version", i32 4}
!910 = !{i32 2, !"Debug Info Version", i32 3}
!911 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!912 = distinct !DISubprogram(name: "ff_rtjpeg_decode_frame_yuv420", scope: !913, file: !913, line: 106, type: !914, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1071)
!913 = !DIFile(filename: "libavcodec/rtjpeg.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = !DISubroutineType(types: !915)
!915 = !{!897, !916, !964, !1069, !897}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTJpegContext", file: !918, line: 40, baseType: !919)
!918 = !DIFile(filename: "libavcodec/rtjpeg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTJpegContext", file: !918, line: 33, size: 6656, align: 128, elements: !920)
!920 = !{!921, !922, !923, !958, !959, !961, !962}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !919, file: !918, line: 34, baseType: !897, size: 32, align: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !919, file: !918, line: 34, baseType: !897, size: 32, align: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "idsp", scope: !919, file: !918, line: 35, baseType: !924, size: 960, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !4, line: 100, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !4, line: 53, size: 960, align: 64, elements: !926)
!926 = !{!927, !940, !941, !942, !947, !951, !952, !956, !957}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !925, file: !4, line: 55, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !931, !935, !937}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !906, line: 37, baseType: !934)
!934 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !938, line: 149, baseType: !939)
!938 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!939 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !925, file: !4, line: 58, baseType: !928, size: 64, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !925, file: !4, line: 61, baseType: !928, size: 64, align: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !925, file: !4, line: 65, baseType: !943, size: 64, align: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !925, file: !4, line: 72, baseType: !948, size: 64, align: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !936, !937, !946}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !925, file: !4, line: 79, baseType: !948, size: 64, align: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !925, file: !4, line: 96, baseType: !953, size: 512, align: 8, offset: 384)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 512, align: 8, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !925, file: !4, line: 97, baseType: !3, size: 32, align: 32, offset: 896)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !925, file: !4, line: 99, baseType: !897, size: 32, align: 32, offset: 928)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "scan", scope: !919, file: !918, line: 36, baseType: !953, size: 512, align: 8, offset: 1024)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lquant", scope: !919, file: !918, line: 37, baseType: !960, size: 2048, align: 32, offset: 1536)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 2048, align: 32, elements: !954)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cquant", scope: !919, file: !918, line: 38, baseType: !960, size: 2048, align: 32, offset: 3584)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !919, file: !918, line: 39, baseType: !963, size: 1024, align: 16, offset: 5632)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 1024, align: 16, elements: !954)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !967)
!967 = !{!968, !972, !974, !976, !977, !978, !979, !980, !981, !982, !989, !991, !992, !993, !994, !995, !996, !998, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1022, !1024, !1025, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1068}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !966, file: !24, line: 282, baseType: !969, size: 512, align: 64)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, align: 64, elements: !970)
!970 = !{!971}
!971 = !DISubrange(count: 8)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !966, file: !24, line: 299, baseType: !973, size: 256, align: 32, offset: 512)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 256, align: 32, elements: !970)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !966, file: !24, line: 315, baseType: !975, size: 64, align: 64, offset: 768)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !966, file: !24, line: 326, baseType: !897, size: 32, align: 32, offset: 832)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !966, file: !24, line: 326, baseType: !897, size: 32, align: 32, offset: 864)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !966, file: !24, line: 334, baseType: !897, size: 32, align: 32, offset: 896)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !966, file: !24, line: 341, baseType: !897, size: 32, align: 32, offset: 928)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !966, file: !24, line: 346, baseType: !897, size: 32, align: 32, offset: 960)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !966, file: !24, line: 351, baseType: !12, size: 32, align: 32, offset: 992)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !966, file: !24, line: 356, baseType: !983, size: 64, align: 32, offset: 1024)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !984, line: 61, baseType: !985)
!984 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !984, line: 58, size: 64, align: 32, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !985, file: !984, line: 59, baseType: !897, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !985, file: !984, line: 60, baseType: !897, size: 32, align: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !966, file: !24, line: 361, baseType: !990, size: 64, align: 64, offset: 1088)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !906, line: 40, baseType: !939)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !966, file: !24, line: 369, baseType: !990, size: 64, align: 64, offset: 1152)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !966, file: !24, line: 377, baseType: !990, size: 64, align: 64, offset: 1216)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !966, file: !24, line: 382, baseType: !897, size: 32, align: 32, offset: 1280)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !966, file: !24, line: 386, baseType: !897, size: 32, align: 32, offset: 1312)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !966, file: !24, line: 391, baseType: !897, size: 32, align: 32, offset: 1344)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !966, file: !24, line: 396, baseType: !997, size: 64, align: 64, offset: 1408)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !966, file: !24, line: 403, baseType: !999, size: 512, align: 64, offset: 1472)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 512, align: 64, elements: !970)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !906, line: 55, baseType: !1001)
!1001 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !966, file: !24, line: 410, baseType: !897, size: 32, align: 32, offset: 1984)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !966, file: !24, line: 415, baseType: !897, size: 32, align: 32, offset: 2016)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !966, file: !24, line: 420, baseType: !897, size: 32, align: 32, offset: 2048)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !966, file: !24, line: 425, baseType: !897, size: 32, align: 32, offset: 2080)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !966, file: !24, line: 435, baseType: !990, size: 64, align: 64, offset: 2112)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !966, file: !24, line: 440, baseType: !897, size: 32, align: 32, offset: 2176)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !966, file: !24, line: 445, baseType: !1000, size: 64, align: 64, offset: 2240)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !966, file: !24, line: 459, baseType: !1010, size: 512, align: 64, offset: 2304)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 512, align: 64, elements: !970)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1013, line: 94, baseType: !1014)
!1013 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1013, line: 81, size: 192, align: 64, elements: !1015)
!1015 = !{!1016, !1020, !1021}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1014, file: !1013, line: 82, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1013, line: 73, baseType: !1019)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1013, line: 73, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1014, file: !1013, line: 89, baseType: !936, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1014, file: !1013, line: 93, baseType: !897, size: 32, align: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !966, file: !24, line: 473, baseType: !1023, size: 64, align: 64, offset: 2816)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !966, file: !24, line: 477, baseType: !897, size: 32, align: 32, offset: 2880)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !966, file: !24, line: 479, baseType: !1026, size: 64, align: 64, offset: 2944)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1039}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1029, file: !24, line: 203, baseType: !936, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1029, file: !24, line: 204, baseType: !897, size: 32, align: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1029, file: !24, line: 205, baseType: !1035, size: 64, align: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1037, line: 86, baseType: !1038)
!1037 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1037, line: 86, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1029, file: !24, line: 206, baseType: !1011, size: 64, align: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !966, file: !24, line: 480, baseType: !897, size: 32, align: 32, offset: 3008)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !24, line: 505, baseType: !897, size: 32, align: 32, offset: 3040)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !966, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !966, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !966, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !966, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !966, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !966, file: !24, line: 532, baseType: !990, size: 64, align: 64, offset: 3264)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !966, file: !24, line: 539, baseType: !990, size: 64, align: 64, offset: 3328)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !966, file: !24, line: 547, baseType: !990, size: 64, align: 64, offset: 3392)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !966, file: !24, line: 554, baseType: !1035, size: 64, align: 64, offset: 3456)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !966, file: !24, line: 563, baseType: !897, size: 32, align: 32, offset: 3520)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !966, file: !24, line: 572, baseType: !897, size: 32, align: 32, offset: 3552)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !966, file: !24, line: 581, baseType: !897, size: 32, align: 32, offset: 3584)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !966, file: !24, line: 588, baseType: !1055, size: 64, align: 64, offset: 3648)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !906, line: 36, baseType: !1057)
!1057 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !966, file: !24, line: 593, baseType: !897, size: 32, align: 32, offset: 3712)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !966, file: !24, line: 596, baseType: !897, size: 32, align: 32, offset: 3744)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !966, file: !24, line: 599, baseType: !1011, size: 64, align: 64, offset: 3776)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !966, file: !24, line: 605, baseType: !1011, size: 64, align: 64, offset: 3840)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !966, file: !24, line: 616, baseType: !1011, size: 64, align: 64, offset: 3904)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !966, file: !24, line: 626, baseType: !1064, size: 64, align: 64, offset: 3968)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !938, line: 216, baseType: !1001)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !966, file: !24, line: 627, baseType: !1064, size: 64, align: 64, offset: 4032)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !966, file: !24, line: 628, baseType: !1064, size: 64, align: 64, offset: 4096)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !966, file: !24, line: 629, baseType: !1064, size: 64, align: 64, offset: 4160)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !966, file: !24, line: 645, baseType: !1011, size: 64, align: 64, offset: 4224)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!1071 = !{}
!1072 = !DILocalVariable(name: "c", arg: 1, scope: !912, file: !913, line: 106, type: !916)
!1073 = !DIExpression()
!1074 = !DILocation(line: 106, column: 50, scope: !912)
!1075 = !DILocalVariable(name: "f", arg: 2, scope: !912, file: !913, line: 106, type: !964)
!1076 = !DILocation(line: 106, column: 62, scope: !912)
!1077 = !DILocalVariable(name: "buf", arg: 3, scope: !912, file: !913, line: 107, type: !1069)
!1078 = !DILocation(line: 107, column: 50, scope: !912)
!1079 = !DILocalVariable(name: "buf_size", arg: 4, scope: !912, file: !913, line: 107, type: !897)
!1080 = !DILocation(line: 107, column: 59, scope: !912)
!1081 = !DILocalVariable(name: "gb", scope: !912, file: !913, line: 108, type: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1083, line: 70, baseType: !1084)
!1083 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1083, line: 61, size: 256, align: 64, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1084, file: !1083, line: 62, baseType: !1069, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1084, file: !1083, line: 62, baseType: !1069, size: 64, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1084, file: !1083, line: 67, baseType: !897, size: 32, align: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1084, file: !1083, line: 68, baseType: !897, size: 32, align: 32, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1084, file: !1083, line: 69, baseType: !897, size: 32, align: 32, offset: 192)
!1091 = !DILocation(line: 108, column: 19, scope: !912)
!1092 = !DILocalVariable(name: "w", scope: !912, file: !913, line: 109, type: !897)
!1093 = !DILocation(line: 109, column: 9, scope: !912)
!1094 = !DILocation(line: 109, column: 13, scope: !912)
!1095 = !DILocation(line: 109, column: 16, scope: !912)
!1096 = !DILocation(line: 109, column: 18, scope: !912)
!1097 = !DILocalVariable(name: "h", scope: !912, file: !913, line: 109, type: !897)
!1098 = !DILocation(line: 109, column: 24, scope: !912)
!1099 = !DILocation(line: 109, column: 28, scope: !912)
!1100 = !DILocation(line: 109, column: 31, scope: !912)
!1101 = !DILocation(line: 109, column: 33, scope: !912)
!1102 = !DILocalVariable(name: "x", scope: !912, file: !913, line: 110, type: !897)
!1103 = !DILocation(line: 110, column: 9, scope: !912)
!1104 = !DILocalVariable(name: "y", scope: !912, file: !913, line: 110, type: !897)
!1105 = !DILocation(line: 110, column: 12, scope: !912)
!1106 = !DILocalVariable(name: "ret", scope: !912, file: !913, line: 110, type: !897)
!1107 = !DILocation(line: 110, column: 15, scope: !912)
!1108 = !DILocalVariable(name: "y1", scope: !912, file: !913, line: 111, type: !936)
!1109 = !DILocation(line: 111, column: 14, scope: !912)
!1110 = !DILocation(line: 111, column: 19, scope: !912)
!1111 = !DILocation(line: 111, column: 22, scope: !912)
!1112 = !DILocalVariable(name: "y2", scope: !912, file: !913, line: 111, type: !936)
!1113 = !DILocation(line: 111, column: 32, scope: !912)
!1114 = !DILocation(line: 111, column: 37, scope: !912)
!1115 = !DILocation(line: 111, column: 40, scope: !912)
!1116 = !DILocation(line: 111, column: 54, scope: !912)
!1117 = !DILocation(line: 111, column: 57, scope: !912)
!1118 = !DILocation(line: 111, column: 52, scope: !912)
!1119 = !DILocation(line: 111, column: 48, scope: !912)
!1120 = !DILocalVariable(name: "u", scope: !912, file: !913, line: 112, type: !936)
!1121 = !DILocation(line: 112, column: 14, scope: !912)
!1122 = !DILocation(line: 112, column: 18, scope: !912)
!1123 = !DILocation(line: 112, column: 21, scope: !912)
!1124 = !DILocalVariable(name: "v", scope: !912, file: !913, line: 112, type: !936)
!1125 = !DILocation(line: 112, column: 31, scope: !912)
!1126 = !DILocation(line: 112, column: 35, scope: !912)
!1127 = !DILocation(line: 112, column: 38, scope: !912)
!1128 = !DILocation(line: 114, column: 36, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !912, file: !913, line: 114, column: 9)
!1130 = !DILocation(line: 114, column: 41, scope: !1129)
!1131 = !DILocation(line: 114, column: 16, scope: !1129)
!1132 = !DILocation(line: 114, column: 14, scope: !1129)
!1133 = !DILocation(line: 114, column: 52, scope: !1129)
!1134 = !DILocation(line: 114, column: 9, scope: !912)
!1135 = !DILocation(line: 115, column: 16, scope: !1129)
!1136 = !DILocation(line: 115, column: 9, scope: !1129)
!1137 = !DILocation(line: 117, column: 12, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !912, file: !913, line: 117, column: 5)
!1139 = !DILocation(line: 117, column: 10, scope: !1138)
!1140 = !DILocation(line: 117, column: 17, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1142, file: !913, discriminator: 1)
!1142 = distinct !DILexicalBlock(scope: !1138, file: !913, line: 117, column: 5)
!1143 = !DILocation(line: 117, column: 21, scope: !1141)
!1144 = !DILocation(line: 117, column: 19, scope: !1141)
!1145 = !DILocation(line: 117, column: 5, scope: !1141)
!1146 = !DILocation(line: 118, column: 16, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !913, line: 118, column: 9)
!1148 = distinct !DILexicalBlock(scope: !1142, file: !913, line: 117, column: 29)
!1149 = !DILocation(line: 118, column: 14, scope: !1147)
!1150 = !DILocation(line: 118, column: 21, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1152, file: !913, discriminator: 1)
!1152 = distinct !DILexicalBlock(scope: !1147, file: !913, line: 118, column: 9)
!1153 = !DILocation(line: 118, column: 25, scope: !1151)
!1154 = !DILocation(line: 118, column: 23, scope: !1151)
!1155 = !DILocation(line: 118, column: 9, scope: !1151)
!1156 = !DILocalVariable(name: "block", scope: !1157, file: !913, line: 126, type: !946)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !913, line: 118, column: 33)
!1158 = !DILocation(line: 126, column: 22, scope: !1157)
!1159 = !DILocation(line: 126, column: 30, scope: !1157)
!1160 = !DILocation(line: 126, column: 33, scope: !1157)
!1161 = !DILocation(line: 127, column: 13, scope: !1157)
!1162 = distinct !{!1162, !1161}
!1163 = !DILocalVariable(name: "res", scope: !1164, file: !913, line: 127, type: !897)
!1164 = distinct !DILexicalBlock(scope: !1157, file: !913, line: 127, column: 16)
!1165 = !DILocation(line: 127, column: 22, scope: !1164)
!1166 = !DILocation(line: 127, column: 43, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1164, file: !913, discriminator: 1)
!1168 = !DILocation(line: 127, column: 50, scope: !1167)
!1169 = !DILocation(line: 127, column: 53, scope: !1167)
!1170 = !DILocation(line: 127, column: 59, scope: !1167)
!1171 = !DILocation(line: 127, column: 62, scope: !1167)
!1172 = !DILocation(line: 127, column: 28, scope: !1167)
!1173 = !DILocation(line: 127, column: 22, scope: !1167)
!1174 = !DILocation(line: 127, column: 75, scope: !1167)
!1175 = !DILocation(line: 127, column: 79, scope: !1167)
!1176 = !DILocation(line: 127, column: 91, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1178, file: !913, discriminator: 2)
!1178 = distinct !DILexicalBlock(scope: !1164, file: !913, line: 127, column: 75)
!1179 = !DILocation(line: 127, column: 84, scope: !1177)
!1180 = !DILocation(line: 127, column: 100, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1182, file: !913, discriminator: 3)
!1182 = distinct !DILexicalBlock(scope: !1164, file: !913, line: 127, column: 100)
!1183 = !DILocation(line: 127, column: 104, scope: !1181)
!1184 = !DILocation(line: 127, column: 109, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1182, file: !913, discriminator: 4)
!1186 = !DILocation(line: 127, column: 112, scope: !1185)
!1187 = !DILocation(line: 127, column: 117, scope: !1185)
!1188 = !DILocation(line: 127, column: 126, scope: !1185)
!1189 = !DILocation(line: 127, column: 130, scope: !1185)
!1190 = !DILocation(line: 127, column: 133, scope: !1185)
!1191 = !DILocation(line: 127, column: 146, scope: !1185)
!1192 = !DILocation(line: 127, column: 154, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !1164, file: !913, discriminator: 5)
!1194 = !DILocation(line: 128, column: 16, scope: !1157)
!1195 = !DILocation(line: 129, column: 13, scope: !1157)
!1196 = distinct !{!1196, !1195}
!1197 = !DILocalVariable(name: "res", scope: !1198, file: !913, line: 129, type: !897)
!1198 = distinct !DILexicalBlock(scope: !1157, file: !913, line: 129, column: 16)
!1199 = !DILocation(line: 129, column: 22, scope: !1198)
!1200 = !DILocation(line: 129, column: 43, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !1198, file: !913, discriminator: 1)
!1202 = !DILocation(line: 129, column: 50, scope: !1201)
!1203 = !DILocation(line: 129, column: 53, scope: !1201)
!1204 = !DILocation(line: 129, column: 59, scope: !1201)
!1205 = !DILocation(line: 129, column: 62, scope: !1201)
!1206 = !DILocation(line: 129, column: 28, scope: !1201)
!1207 = !DILocation(line: 129, column: 22, scope: !1201)
!1208 = !DILocation(line: 129, column: 75, scope: !1201)
!1209 = !DILocation(line: 129, column: 79, scope: !1201)
!1210 = !DILocation(line: 129, column: 91, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1212, file: !913, discriminator: 2)
!1212 = distinct !DILexicalBlock(scope: !1198, file: !913, line: 129, column: 75)
!1213 = !DILocation(line: 129, column: 84, scope: !1211)
!1214 = !DILocation(line: 129, column: 100, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1216, file: !913, discriminator: 3)
!1216 = distinct !DILexicalBlock(scope: !1198, file: !913, line: 129, column: 100)
!1217 = !DILocation(line: 129, column: 104, scope: !1215)
!1218 = !DILocation(line: 129, column: 109, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !1216, file: !913, discriminator: 4)
!1220 = !DILocation(line: 129, column: 112, scope: !1219)
!1221 = !DILocation(line: 129, column: 117, scope: !1219)
!1222 = !DILocation(line: 129, column: 126, scope: !1219)
!1223 = !DILocation(line: 129, column: 130, scope: !1219)
!1224 = !DILocation(line: 129, column: 133, scope: !1219)
!1225 = !DILocation(line: 129, column: 146, scope: !1219)
!1226 = !DILocation(line: 129, column: 154, scope: !1227)
!1227 = !DILexicalBlockFile(scope: !1198, file: !913, discriminator: 5)
!1228 = !DILocation(line: 130, column: 16, scope: !1157)
!1229 = !DILocation(line: 131, column: 13, scope: !1157)
!1230 = distinct !{!1230, !1229}
!1231 = !DILocalVariable(name: "res", scope: !1232, file: !913, line: 131, type: !897)
!1232 = distinct !DILexicalBlock(scope: !1157, file: !913, line: 131, column: 16)
!1233 = !DILocation(line: 131, column: 22, scope: !1232)
!1234 = !DILocation(line: 131, column: 43, scope: !1235)
!1235 = !DILexicalBlockFile(scope: !1232, file: !913, discriminator: 1)
!1236 = !DILocation(line: 131, column: 50, scope: !1235)
!1237 = !DILocation(line: 131, column: 53, scope: !1235)
!1238 = !DILocation(line: 131, column: 59, scope: !1235)
!1239 = !DILocation(line: 131, column: 62, scope: !1235)
!1240 = !DILocation(line: 131, column: 28, scope: !1235)
!1241 = !DILocation(line: 131, column: 22, scope: !1235)
!1242 = !DILocation(line: 131, column: 75, scope: !1235)
!1243 = !DILocation(line: 131, column: 79, scope: !1235)
!1244 = !DILocation(line: 131, column: 91, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1246, file: !913, discriminator: 2)
!1246 = distinct !DILexicalBlock(scope: !1232, file: !913, line: 131, column: 75)
!1247 = !DILocation(line: 131, column: 84, scope: !1245)
!1248 = !DILocation(line: 131, column: 100, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1250, file: !913, discriminator: 3)
!1250 = distinct !DILexicalBlock(scope: !1232, file: !913, line: 131, column: 100)
!1251 = !DILocation(line: 131, column: 104, scope: !1249)
!1252 = !DILocation(line: 131, column: 109, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1250, file: !913, discriminator: 4)
!1254 = !DILocation(line: 131, column: 112, scope: !1253)
!1255 = !DILocation(line: 131, column: 117, scope: !1253)
!1256 = !DILocation(line: 131, column: 126, scope: !1253)
!1257 = !DILocation(line: 131, column: 130, scope: !1253)
!1258 = !DILocation(line: 131, column: 133, scope: !1253)
!1259 = !DILocation(line: 131, column: 146, scope: !1253)
!1260 = !DILocation(line: 131, column: 154, scope: !1261)
!1261 = !DILexicalBlockFile(scope: !1232, file: !913, discriminator: 5)
!1262 = !DILocation(line: 132, column: 16, scope: !1157)
!1263 = !DILocation(line: 133, column: 13, scope: !1157)
!1264 = distinct !{!1264, !1263}
!1265 = !DILocalVariable(name: "res", scope: !1266, file: !913, line: 133, type: !897)
!1266 = distinct !DILexicalBlock(scope: !1157, file: !913, line: 133, column: 16)
!1267 = !DILocation(line: 133, column: 22, scope: !1266)
!1268 = !DILocation(line: 133, column: 43, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1266, file: !913, discriminator: 1)
!1270 = !DILocation(line: 133, column: 50, scope: !1269)
!1271 = !DILocation(line: 133, column: 53, scope: !1269)
!1272 = !DILocation(line: 133, column: 59, scope: !1269)
!1273 = !DILocation(line: 133, column: 62, scope: !1269)
!1274 = !DILocation(line: 133, column: 28, scope: !1269)
!1275 = !DILocation(line: 133, column: 22, scope: !1269)
!1276 = !DILocation(line: 133, column: 75, scope: !1269)
!1277 = !DILocation(line: 133, column: 79, scope: !1269)
!1278 = !DILocation(line: 133, column: 91, scope: !1279)
!1279 = !DILexicalBlockFile(scope: !1280, file: !913, discriminator: 2)
!1280 = distinct !DILexicalBlock(scope: !1266, file: !913, line: 133, column: 75)
!1281 = !DILocation(line: 133, column: 84, scope: !1279)
!1282 = !DILocation(line: 133, column: 100, scope: !1283)
!1283 = !DILexicalBlockFile(scope: !1284, file: !913, discriminator: 3)
!1284 = distinct !DILexicalBlock(scope: !1266, file: !913, line: 133, column: 100)
!1285 = !DILocation(line: 133, column: 104, scope: !1283)
!1286 = !DILocation(line: 133, column: 109, scope: !1287)
!1287 = !DILexicalBlockFile(scope: !1284, file: !913, discriminator: 4)
!1288 = !DILocation(line: 133, column: 112, scope: !1287)
!1289 = !DILocation(line: 133, column: 117, scope: !1287)
!1290 = !DILocation(line: 133, column: 126, scope: !1287)
!1291 = !DILocation(line: 133, column: 130, scope: !1287)
!1292 = !DILocation(line: 133, column: 133, scope: !1287)
!1293 = !DILocation(line: 133, column: 146, scope: !1287)
!1294 = !DILocation(line: 133, column: 154, scope: !1295)
!1295 = !DILexicalBlockFile(scope: !1266, file: !913, discriminator: 5)
!1296 = !DILocation(line: 134, column: 16, scope: !1157)
!1297 = !DILocation(line: 135, column: 13, scope: !1157)
!1298 = distinct !{!1298, !1297}
!1299 = !DILocalVariable(name: "res", scope: !1300, file: !913, line: 135, type: !897)
!1300 = distinct !DILexicalBlock(scope: !1157, file: !913, line: 135, column: 16)
!1301 = !DILocation(line: 135, column: 22, scope: !1300)
!1302 = !DILocation(line: 135, column: 43, scope: !1303)
!1303 = !DILexicalBlockFile(scope: !1300, file: !913, discriminator: 1)
!1304 = !DILocation(line: 135, column: 50, scope: !1303)
!1305 = !DILocation(line: 135, column: 53, scope: !1303)
!1306 = !DILocation(line: 135, column: 59, scope: !1303)
!1307 = !DILocation(line: 135, column: 62, scope: !1303)
!1308 = !DILocation(line: 135, column: 28, scope: !1303)
!1309 = !DILocation(line: 135, column: 22, scope: !1303)
!1310 = !DILocation(line: 135, column: 75, scope: !1303)
!1311 = !DILocation(line: 135, column: 79, scope: !1303)
!1312 = !DILocation(line: 135, column: 91, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1314, file: !913, discriminator: 2)
!1314 = distinct !DILexicalBlock(scope: !1300, file: !913, line: 135, column: 75)
!1315 = !DILocation(line: 135, column: 84, scope: !1313)
!1316 = !DILocation(line: 135, column: 100, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !1318, file: !913, discriminator: 3)
!1318 = distinct !DILexicalBlock(scope: !1300, file: !913, line: 135, column: 100)
!1319 = !DILocation(line: 135, column: 104, scope: !1317)
!1320 = !DILocation(line: 135, column: 109, scope: !1321)
!1321 = !DILexicalBlockFile(scope: !1318, file: !913, discriminator: 4)
!1322 = !DILocation(line: 135, column: 112, scope: !1321)
!1323 = !DILocation(line: 135, column: 117, scope: !1321)
!1324 = !DILocation(line: 135, column: 126, scope: !1321)
!1325 = !DILocation(line: 135, column: 129, scope: !1321)
!1326 = !DILocation(line: 135, column: 132, scope: !1321)
!1327 = !DILocation(line: 135, column: 145, scope: !1321)
!1328 = !DILocation(line: 135, column: 153, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1300, file: !913, discriminator: 5)
!1330 = !DILocation(line: 136, column: 15, scope: !1157)
!1331 = !DILocation(line: 137, column: 13, scope: !1157)
!1332 = distinct !{!1332, !1331}
!1333 = !DILocalVariable(name: "res", scope: !1334, file: !913, line: 137, type: !897)
!1334 = distinct !DILexicalBlock(scope: !1157, file: !913, line: 137, column: 16)
!1335 = !DILocation(line: 137, column: 22, scope: !1334)
!1336 = !DILocation(line: 137, column: 43, scope: !1337)
!1337 = !DILexicalBlockFile(scope: !1334, file: !913, discriminator: 1)
!1338 = !DILocation(line: 137, column: 50, scope: !1337)
!1339 = !DILocation(line: 137, column: 53, scope: !1337)
!1340 = !DILocation(line: 137, column: 59, scope: !1337)
!1341 = !DILocation(line: 137, column: 62, scope: !1337)
!1342 = !DILocation(line: 137, column: 28, scope: !1337)
!1343 = !DILocation(line: 137, column: 22, scope: !1337)
!1344 = !DILocation(line: 137, column: 75, scope: !1337)
!1345 = !DILocation(line: 137, column: 79, scope: !1337)
!1346 = !DILocation(line: 137, column: 91, scope: !1347)
!1347 = !DILexicalBlockFile(scope: !1348, file: !913, discriminator: 2)
!1348 = distinct !DILexicalBlock(scope: !1334, file: !913, line: 137, column: 75)
!1349 = !DILocation(line: 137, column: 84, scope: !1347)
!1350 = !DILocation(line: 137, column: 100, scope: !1351)
!1351 = !DILexicalBlockFile(scope: !1352, file: !913, discriminator: 3)
!1352 = distinct !DILexicalBlock(scope: !1334, file: !913, line: 137, column: 100)
!1353 = !DILocation(line: 137, column: 104, scope: !1351)
!1354 = !DILocation(line: 137, column: 109, scope: !1355)
!1355 = !DILexicalBlockFile(scope: !1352, file: !913, discriminator: 4)
!1356 = !DILocation(line: 137, column: 112, scope: !1355)
!1357 = !DILocation(line: 137, column: 117, scope: !1355)
!1358 = !DILocation(line: 137, column: 126, scope: !1355)
!1359 = !DILocation(line: 137, column: 129, scope: !1355)
!1360 = !DILocation(line: 137, column: 132, scope: !1355)
!1361 = !DILocation(line: 137, column: 145, scope: !1355)
!1362 = !DILocation(line: 137, column: 153, scope: !1363)
!1363 = !DILexicalBlockFile(scope: !1334, file: !913, discriminator: 5)
!1364 = !DILocation(line: 138, column: 15, scope: !1157)
!1365 = !DILocation(line: 139, column: 9, scope: !1157)
!1366 = !DILocation(line: 118, column: 29, scope: !1367)
!1367 = !DILexicalBlockFile(scope: !1152, file: !913, discriminator: 2)
!1368 = !DILocation(line: 118, column: 9, scope: !1367)
!1369 = distinct !{!1369, !1370}
!1370 = !DILocation(line: 118, column: 9, scope: !1148)
!1371 = !DILocation(line: 140, column: 24, scope: !1148)
!1372 = !DILocation(line: 140, column: 27, scope: !1148)
!1373 = !DILocation(line: 140, column: 41, scope: !1148)
!1374 = !DILocation(line: 140, column: 39, scope: !1148)
!1375 = !DILocation(line: 140, column: 21, scope: !1148)
!1376 = !DILocation(line: 140, column: 12, scope: !1148)
!1377 = !DILocation(line: 141, column: 24, scope: !1148)
!1378 = !DILocation(line: 141, column: 27, scope: !1148)
!1379 = !DILocation(line: 141, column: 41, scope: !1148)
!1380 = !DILocation(line: 141, column: 39, scope: !1148)
!1381 = !DILocation(line: 141, column: 21, scope: !1148)
!1382 = !DILocation(line: 141, column: 12, scope: !1148)
!1383 = !DILocation(line: 142, column: 19, scope: !1148)
!1384 = !DILocation(line: 142, column: 22, scope: !1148)
!1385 = !DILocation(line: 142, column: 36, scope: !1148)
!1386 = !DILocation(line: 142, column: 34, scope: !1148)
!1387 = !DILocation(line: 142, column: 16, scope: !1148)
!1388 = !DILocation(line: 142, column: 11, scope: !1148)
!1389 = !DILocation(line: 143, column: 19, scope: !1148)
!1390 = !DILocation(line: 143, column: 22, scope: !1148)
!1391 = !DILocation(line: 143, column: 36, scope: !1148)
!1392 = !DILocation(line: 143, column: 34, scope: !1148)
!1393 = !DILocation(line: 143, column: 16, scope: !1148)
!1394 = !DILocation(line: 143, column: 11, scope: !1148)
!1395 = !DILocation(line: 144, column: 5, scope: !1148)
!1396 = !DILocation(line: 117, column: 25, scope: !1397)
!1397 = !DILexicalBlockFile(scope: !1142, file: !913, discriminator: 2)
!1398 = !DILocation(line: 117, column: 5, scope: !1397)
!1399 = distinct !{!1399, !1400}
!1400 = !DILocation(line: 117, column: 5, scope: !912)
!1401 = !DILocation(line: 145, column: 12, scope: !912)
!1402 = !DILocation(line: 145, column: 32, scope: !912)
!1403 = !DILocation(line: 145, column: 5, scope: !912)
!1404 = !DILocation(line: 146, column: 1, scope: !912)
!1405 = distinct !DISubprogram(name: "init_get_bits8", scope: !1083, file: !1083, line: 650, type: !1406, isLocal: true, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1071)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!897, !1408, !1069, !897}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1409 = !DILocalVariable(name: "s", arg: 1, scope: !1405, file: !1083, line: 650, type: !1408)
!1410 = !DILocation(line: 650, column: 49, scope: !1405)
!1411 = !DILocalVariable(name: "buffer", arg: 2, scope: !1405, file: !1083, line: 650, type: !1069)
!1412 = !DILocation(line: 650, column: 67, scope: !1405)
!1413 = !DILocalVariable(name: "byte_size", arg: 3, scope: !1405, file: !1083, line: 651, type: !897)
!1414 = !DILocation(line: 651, column: 38, scope: !1405)
!1415 = !DILocation(line: 653, column: 9, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1405, file: !1083, line: 653, column: 9)
!1417 = !DILocation(line: 653, column: 19, scope: !1416)
!1418 = !DILocation(line: 653, column: 36, scope: !1416)
!1419 = !DILocation(line: 653, column: 39, scope: !1420)
!1420 = !DILexicalBlockFile(scope: !1416, file: !1083, discriminator: 1)
!1421 = !DILocation(line: 653, column: 49, scope: !1420)
!1422 = !DILocation(line: 653, column: 9, scope: !1420)
!1423 = !DILocation(line: 654, column: 19, scope: !1416)
!1424 = !DILocation(line: 654, column: 9, scope: !1416)
!1425 = !DILocation(line: 655, column: 26, scope: !1405)
!1426 = !DILocation(line: 655, column: 29, scope: !1405)
!1427 = !DILocation(line: 655, column: 37, scope: !1405)
!1428 = !DILocation(line: 655, column: 47, scope: !1405)
!1429 = !DILocation(line: 655, column: 12, scope: !1405)
!1430 = !DILocation(line: 655, column: 5, scope: !1405)
!1431 = distinct !DISubprogram(name: "get_block", scope: !913, file: !913, line: 46, type: !1432, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1071)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!897, !1408, !946, !1069, !1434}
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!1436 = !DILocalVariable(name: "gb", arg: 1, scope: !1431, file: !913, line: 46, type: !1408)
!1437 = !DILocation(line: 46, column: 44, scope: !1431)
!1438 = !DILocalVariable(name: "block", arg: 2, scope: !1431, file: !913, line: 46, type: !946)
!1439 = !DILocation(line: 46, column: 57, scope: !1431)
!1440 = !DILocalVariable(name: "scan", arg: 3, scope: !1431, file: !913, line: 46, type: !1069)
!1441 = !DILocation(line: 46, column: 79, scope: !1431)
!1442 = !DILocalVariable(name: "quant", arg: 4, scope: !1431, file: !913, line: 47, type: !1434)
!1443 = !DILocation(line: 47, column: 45, scope: !1431)
!1444 = !DILocalVariable(name: "coeff", scope: !1431, file: !913, line: 48, type: !897)
!1445 = !DILocation(line: 48, column: 9, scope: !1431)
!1446 = !DILocalVariable(name: "i", scope: !1431, file: !913, line: 48, type: !897)
!1447 = !DILocation(line: 48, column: 16, scope: !1431)
!1448 = !DILocalVariable(name: "n", scope: !1431, file: !913, line: 48, type: !897)
!1449 = !DILocation(line: 48, column: 19, scope: !1431)
!1450 = !DILocalVariable(name: "ac", scope: !1431, file: !913, line: 49, type: !1056)
!1451 = !DILocation(line: 49, column: 12, scope: !1431)
!1452 = !DILocalVariable(name: "dc", scope: !1431, file: !913, line: 50, type: !907)
!1453 = !DILocation(line: 50, column: 13, scope: !1431)
!1454 = !DILocation(line: 50, column: 27, scope: !1431)
!1455 = !DILocation(line: 50, column: 18, scope: !1431)
!1456 = !DILocation(line: 53, column: 9, scope: !1457)
!1457 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 53, column: 9)
!1458 = !DILocation(line: 53, column: 12, scope: !1457)
!1459 = !DILocation(line: 53, column: 9, scope: !1431)
!1460 = !DILocation(line: 54, column: 8, scope: !1457)
!1461 = !DILocation(line: 57, column: 22, scope: !1431)
!1462 = !DILocation(line: 57, column: 13, scope: !1431)
!1463 = !DILocation(line: 57, column: 11, scope: !1431)
!1464 = !DILocation(line: 58, column: 23, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 58, column: 9)
!1466 = !DILocation(line: 58, column: 9, scope: !1465)
!1467 = !DILocation(line: 58, column: 30, scope: !1465)
!1468 = !DILocation(line: 58, column: 36, scope: !1465)
!1469 = !DILocation(line: 58, column: 27, scope: !1465)
!1470 = !DILocation(line: 58, column: 9, scope: !1431)
!1471 = !DILocation(line: 59, column: 9, scope: !1465)
!1472 = !DILocation(line: 63, column: 12, scope: !1431)
!1473 = !DILocation(line: 63, column: 5, scope: !1431)
!1474 = !DILocation(line: 66, column: 5, scope: !1431)
!1475 = !DILocation(line: 66, column: 12, scope: !1476)
!1476 = !DILexicalBlockFile(scope: !1431, file: !913, discriminator: 1)
!1477 = !DILocation(line: 66, column: 5, scope: !1476)
!1478 = !DILocation(line: 67, column: 24, scope: !1479)
!1479 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 66, column: 19)
!1480 = !DILocation(line: 67, column: 14, scope: !1479)
!1481 = !DILocation(line: 67, column: 12, scope: !1479)
!1482 = !DILocation(line: 68, column: 13, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1479, file: !913, line: 68, column: 13)
!1484 = !DILocation(line: 68, column: 16, scope: !1483)
!1485 = !DILocation(line: 68, column: 13, scope: !1479)
!1486 = !DILocation(line: 69, column: 13, scope: !1483)
!1487 = !DILocation(line: 70, column: 23, scope: !1479)
!1488 = !DILocation(line: 70, column: 13, scope: !1479)
!1489 = !DILocation(line: 70, column: 11, scope: !1479)
!1490 = !DILocation(line: 70, column: 40, scope: !1479)
!1491 = !DILocation(line: 70, column: 39, scope: !1479)
!1492 = !DILocation(line: 70, column: 52, scope: !1479)
!1493 = !DILocation(line: 70, column: 46, scope: !1479)
!1494 = !DILocation(line: 70, column: 44, scope: !1479)
!1495 = !DILocation(line: 70, column: 34, scope: !1479)
!1496 = !DILocation(line: 70, column: 28, scope: !1479)
!1497 = !DILocation(line: 70, column: 37, scope: !1479)
!1498 = !DILocation(line: 66, column: 5, scope: !1499)
!1499 = !DILexicalBlockFile(scope: !1431, file: !913, discriminator: 2)
!1500 = distinct !{!1500, !1474}
!1501 = !DILocation(line: 74, column: 26, scope: !1431)
!1502 = !DILocation(line: 74, column: 11, scope: !1431)
!1503 = !DILocation(line: 74, column: 10, scope: !1431)
!1504 = !DILocation(line: 74, column: 31, scope: !1431)
!1505 = !DILocation(line: 74, column: 7, scope: !1431)
!1506 = !DILocation(line: 74, column: 46, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 74, column: 46)
!1508 = !DILocation(line: 74, column: 46, scope: !1431)
!1509 = !DILocation(line: 74, column: 60, scope: !1510)
!1510 = !DILexicalBlockFile(scope: !1511, file: !913, discriminator: 1)
!1511 = distinct !DILexicalBlock(scope: !1507, file: !913, line: 74, column: 49)
!1512 = !DILocation(line: 74, column: 64, scope: !1510)
!1513 = !DILocation(line: 74, column: 50, scope: !1510)
!1514 = !DILocation(line: 74, column: 67, scope: !1510)
!1515 = !DILocation(line: 75, column: 23, scope: !1516)
!1516 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 75, column: 9)
!1517 = !DILocation(line: 75, column: 9, scope: !1516)
!1518 = !DILocation(line: 75, column: 30, scope: !1516)
!1519 = !DILocation(line: 75, column: 36, scope: !1516)
!1520 = !DILocation(line: 75, column: 27, scope: !1516)
!1521 = !DILocation(line: 75, column: 9, scope: !1431)
!1522 = !DILocation(line: 76, column: 9, scope: !1516)
!1523 = !DILocation(line: 77, column: 5, scope: !1431)
!1524 = !DILocation(line: 77, column: 12, scope: !1476)
!1525 = !DILocation(line: 77, column: 5, scope: !1476)
!1526 = !DILocation(line: 78, column: 24, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 77, column: 19)
!1528 = !DILocation(line: 78, column: 14, scope: !1527)
!1529 = !DILocation(line: 78, column: 12, scope: !1527)
!1530 = !DILocation(line: 79, column: 13, scope: !1531)
!1531 = distinct !DILexicalBlock(scope: !1527, file: !913, line: 79, column: 13)
!1532 = !DILocation(line: 79, column: 16, scope: !1531)
!1533 = !DILocation(line: 79, column: 13, scope: !1527)
!1534 = !DILocation(line: 80, column: 13, scope: !1531)
!1535 = !DILocation(line: 81, column: 23, scope: !1527)
!1536 = !DILocation(line: 81, column: 13, scope: !1527)
!1537 = !DILocation(line: 81, column: 11, scope: !1527)
!1538 = !DILocation(line: 81, column: 40, scope: !1527)
!1539 = !DILocation(line: 81, column: 39, scope: !1527)
!1540 = !DILocation(line: 81, column: 52, scope: !1527)
!1541 = !DILocation(line: 81, column: 46, scope: !1527)
!1542 = !DILocation(line: 81, column: 44, scope: !1527)
!1543 = !DILocation(line: 81, column: 34, scope: !1527)
!1544 = !DILocation(line: 81, column: 28, scope: !1527)
!1545 = !DILocation(line: 81, column: 37, scope: !1527)
!1546 = !DILocation(line: 77, column: 5, scope: !1499)
!1547 = distinct !{!1547, !1523}
!1548 = !DILocation(line: 85, column: 26, scope: !1431)
!1549 = !DILocation(line: 85, column: 11, scope: !1431)
!1550 = !DILocation(line: 85, column: 10, scope: !1431)
!1551 = !DILocation(line: 85, column: 31, scope: !1431)
!1552 = !DILocation(line: 85, column: 7, scope: !1431)
!1553 = !DILocation(line: 85, column: 46, scope: !1554)
!1554 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 85, column: 46)
!1555 = !DILocation(line: 85, column: 46, scope: !1431)
!1556 = !DILocation(line: 85, column: 60, scope: !1557)
!1557 = !DILexicalBlockFile(scope: !1558, file: !913, discriminator: 1)
!1558 = distinct !DILexicalBlock(scope: !1554, file: !913, line: 85, column: 49)
!1559 = !DILocation(line: 85, column: 64, scope: !1557)
!1560 = !DILocation(line: 85, column: 50, scope: !1557)
!1561 = !DILocation(line: 85, column: 67, scope: !1557)
!1562 = !DILocation(line: 86, column: 23, scope: !1563)
!1563 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 86, column: 9)
!1564 = !DILocation(line: 86, column: 9, scope: !1563)
!1565 = !DILocation(line: 86, column: 30, scope: !1563)
!1566 = !DILocation(line: 86, column: 36, scope: !1563)
!1567 = !DILocation(line: 86, column: 27, scope: !1563)
!1568 = !DILocation(line: 86, column: 9, scope: !1431)
!1569 = !DILocation(line: 87, column: 9, scope: !1563)
!1570 = !DILocation(line: 88, column: 5, scope: !1431)
!1571 = !DILocation(line: 88, column: 12, scope: !1476)
!1572 = !DILocation(line: 88, column: 5, scope: !1476)
!1573 = !DILocation(line: 89, column: 24, scope: !1574)
!1574 = distinct !DILexicalBlock(scope: !1431, file: !913, line: 88, column: 19)
!1575 = !DILocation(line: 89, column: 14, scope: !1574)
!1576 = !DILocation(line: 89, column: 12, scope: !1574)
!1577 = !DILocation(line: 90, column: 23, scope: !1574)
!1578 = !DILocation(line: 90, column: 13, scope: !1574)
!1579 = !DILocation(line: 90, column: 11, scope: !1574)
!1580 = !DILocation(line: 90, column: 40, scope: !1574)
!1581 = !DILocation(line: 90, column: 39, scope: !1574)
!1582 = !DILocation(line: 90, column: 52, scope: !1574)
!1583 = !DILocation(line: 90, column: 46, scope: !1574)
!1584 = !DILocation(line: 90, column: 44, scope: !1574)
!1585 = !DILocation(line: 90, column: 34, scope: !1574)
!1586 = !DILocation(line: 90, column: 28, scope: !1574)
!1587 = !DILocation(line: 90, column: 37, scope: !1574)
!1588 = !DILocation(line: 88, column: 5, scope: !1499)
!1589 = distinct !{!1589, !1570}
!1590 = !DILocation(line: 93, column: 19, scope: !1431)
!1591 = !DILocation(line: 93, column: 9, scope: !1431)
!1592 = !DILocation(line: 93, column: 7, scope: !1431)
!1593 = !DILocation(line: 93, column: 36, scope: !1431)
!1594 = !DILocation(line: 93, column: 35, scope: !1431)
!1595 = !DILocation(line: 93, column: 48, scope: !1431)
!1596 = !DILocation(line: 93, column: 42, scope: !1431)
!1597 = !DILocation(line: 93, column: 40, scope: !1431)
!1598 = !DILocation(line: 93, column: 30, scope: !1431)
!1599 = !DILocation(line: 93, column: 24, scope: !1431)
!1600 = !DILocation(line: 93, column: 33, scope: !1431)
!1601 = !DILocation(line: 94, column: 5, scope: !1431)
!1602 = !DILocation(line: 95, column: 1, scope: !1431)
!1603 = distinct !DISubprogram(name: "get_bits_count", scope: !1083, file: !1083, line: 219, type: !1604, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1071)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!897, !1606}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1608 = !DILocalVariable(name: "s", arg: 1, scope: !1603, file: !1083, line: 219, type: !1606)
!1609 = !DILocation(line: 219, column: 55, scope: !1603)
!1610 = !DILocation(line: 224, column: 12, scope: !1603)
!1611 = !DILocation(line: 224, column: 15, scope: !1603)
!1612 = !DILocation(line: 224, column: 5, scope: !1603)
!1613 = distinct !DISubprogram(name: "ff_rtjpeg_decode_init", scope: !913, file: !913, line: 158, type: !1614, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1071)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !916, !897, !897, !1434, !1434}
!1616 = !DILocalVariable(name: "c", arg: 1, scope: !1613, file: !913, line: 158, type: !916)
!1617 = !DILocation(line: 158, column: 43, scope: !1613)
!1618 = !DILocalVariable(name: "width", arg: 2, scope: !1613, file: !913, line: 158, type: !897)
!1619 = !DILocation(line: 158, column: 50, scope: !1613)
!1620 = !DILocalVariable(name: "height", arg: 3, scope: !1613, file: !913, line: 158, type: !897)
!1621 = !DILocation(line: 158, column: 61, scope: !1613)
!1622 = !DILocalVariable(name: "lquant", arg: 4, scope: !1613, file: !913, line: 159, type: !1434)
!1623 = !DILocation(line: 159, column: 44, scope: !1613)
!1624 = !DILocalVariable(name: "cquant", arg: 5, scope: !1613, file: !913, line: 159, type: !1434)
!1625 = !DILocation(line: 159, column: 68, scope: !1613)
!1626 = !DILocalVariable(name: "i", scope: !1613, file: !913, line: 160, type: !897)
!1627 = !DILocation(line: 160, column: 9, scope: !1613)
!1628 = !DILocation(line: 161, column: 12, scope: !1629)
!1629 = distinct !DILexicalBlock(scope: !1613, file: !913, line: 161, column: 5)
!1630 = !DILocation(line: 161, column: 10, scope: !1629)
!1631 = !DILocation(line: 161, column: 17, scope: !1632)
!1632 = !DILexicalBlockFile(scope: !1633, file: !913, discriminator: 1)
!1633 = distinct !DILexicalBlock(scope: !1629, file: !913, line: 161, column: 5)
!1634 = !DILocation(line: 161, column: 19, scope: !1632)
!1635 = !DILocation(line: 161, column: 5, scope: !1632)
!1636 = !DILocalVariable(name: "p", scope: !1637, file: !913, line: 162, type: !897)
!1637 = distinct !DILexicalBlock(scope: !1633, file: !913, line: 161, column: 30)
!1638 = !DILocation(line: 162, column: 13, scope: !1637)
!1639 = !DILocation(line: 162, column: 42, scope: !1637)
!1640 = !DILocation(line: 162, column: 17, scope: !1637)
!1641 = !DILocation(line: 162, column: 20, scope: !1637)
!1642 = !DILocation(line: 162, column: 25, scope: !1637)
!1643 = !DILocation(line: 163, column: 31, scope: !1637)
!1644 = !DILocation(line: 163, column: 24, scope: !1637)
!1645 = !DILocation(line: 163, column: 19, scope: !1637)
!1646 = !DILocation(line: 163, column: 9, scope: !1637)
!1647 = !DILocation(line: 163, column: 12, scope: !1637)
!1648 = !DILocation(line: 163, column: 22, scope: !1637)
!1649 = !DILocation(line: 164, column: 31, scope: !1637)
!1650 = !DILocation(line: 164, column: 24, scope: !1637)
!1651 = !DILocation(line: 164, column: 19, scope: !1637)
!1652 = !DILocation(line: 164, column: 9, scope: !1637)
!1653 = !DILocation(line: 164, column: 12, scope: !1637)
!1654 = !DILocation(line: 164, column: 22, scope: !1637)
!1655 = !DILocation(line: 165, column: 5, scope: !1637)
!1656 = !DILocation(line: 161, column: 26, scope: !1657)
!1657 = !DILexicalBlockFile(scope: !1633, file: !913, discriminator: 2)
!1658 = !DILocation(line: 161, column: 5, scope: !1657)
!1659 = distinct !{!1659, !1660}
!1660 = !DILocation(line: 161, column: 5, scope: !1613)
!1661 = !DILocation(line: 166, column: 12, scope: !1613)
!1662 = !DILocation(line: 166, column: 5, scope: !1613)
!1663 = !DILocation(line: 166, column: 8, scope: !1613)
!1664 = !DILocation(line: 166, column: 10, scope: !1613)
!1665 = !DILocation(line: 167, column: 12, scope: !1613)
!1666 = !DILocation(line: 167, column: 5, scope: !1613)
!1667 = !DILocation(line: 167, column: 8, scope: !1613)
!1668 = !DILocation(line: 167, column: 10, scope: !1613)
!1669 = !DILocation(line: 168, column: 1, scope: !1613)
!1670 = distinct !DISubprogram(name: "ff_rtjpeg_init", scope: !913, file: !913, line: 170, type: !1671, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1071)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !916, !1673}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !156, line: 3360, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !156, line: 1556, size: 8448, align: 64, elements: !1676)
!1676 = !{!1677, !1721, !1722, !1723, !1883, !1884, !1885, !1886, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1912, !1916, !1917, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2096, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1675, file: !156, line: 1561, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1680)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !126, line: 143, baseType: !1681)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !126, line: 67, size: 640, align: 64, elements: !1682)
!1682 = !{!1683, !1687, !1691, !1695, !1696, !1697, !1698, !1702, !1708, !1710, !1714}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1681, file: !126, line: 72, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1686)
!1686 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1681, file: !126, line: 78, baseType: !1688, size: 64, align: 64, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!1684, !997}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1681, file: !126, line: 85, baseType: !1692, size: 64, align: 64, offset: 128)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1694)
!1694 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 85, flags: DIFlagFwdDecl)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1681, file: !126, line: 93, baseType: !897, size: 32, align: 32, offset: 192)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1681, file: !126, line: 99, baseType: !897, size: 32, align: 32, offset: 224)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1681, file: !126, line: 108, baseType: !897, size: 32, align: 32, offset: 256)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1681, file: !126, line: 113, baseType: !1699, size: 64, align: 64, offset: 320)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!997, !997, !997}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1681, file: !126, line: 123, baseType: !1703, size: 64, align: 64, offset: 384)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!1706, !1706}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1681)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1681, file: !126, line: 130, baseType: !1709, size: 32, align: 32, offset: 448)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !126, line: 48, baseType: !125)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1681, file: !126, line: 136, baseType: !1711, size: 64, align: 64, offset: 512)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!1709, !997}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1681, file: !126, line: 142, baseType: !1715, size: 64, align: 64, offset: 576)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!897, !1718, !997, !1684, !897}
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 60, flags: DIFlagFwdDecl)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1675, file: !156, line: 1562, baseType: !897, size: 32, align: 32, offset: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1675, file: !156, line: 1564, baseType: !146, size: 32, align: 32, offset: 96)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1675, file: !156, line: 1565, baseType: !1724, size: 64, align: 64, offset: 128)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1726)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !156, line: 3468, size: 1984, align: 64, elements: !1727)
!1727 = !{!1728, !1729, !1730, !1731, !1732, !1733, !1736, !1739, !1742, !1745, !1748, !1749, !1750, !1758, !1759, !1760, !1762, !1766, !1772, !1777, !1781, !1782, !1825, !1855, !1859, !1860, !1864, !1868, !1872, !1876, !1877, !1878}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1726, file: !156, line: 3475, baseType: !1684, size: 64, align: 64)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1726, file: !156, line: 3480, baseType: !1684, size: 64, align: 64, offset: 64)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1726, file: !156, line: 3481, baseType: !146, size: 32, align: 32, offset: 128)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1726, file: !156, line: 3482, baseType: !155, size: 32, align: 32, offset: 160)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1726, file: !156, line: 3487, baseType: !897, size: 32, align: 32, offset: 192)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1726, file: !156, line: 3488, baseType: !1734, size: 64, align: 64, offset: 256)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1726, file: !156, line: 3489, baseType: !1737, size: 64, align: 64, offset: 320)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1726, file: !156, line: 3490, baseType: !1740, size: 64, align: 64, offset: 384)
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64, align: 64)
!1741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1726, file: !156, line: 3491, baseType: !1743, size: 64, align: 64, offset: 448)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1726, file: !156, line: 3492, baseType: !1746, size: 64, align: 64, offset: 512)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1726, file: !156, line: 3493, baseType: !907, size: 8, align: 8, offset: 576)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1726, file: !156, line: 3494, baseType: !1678, size: 64, align: 64, offset: 640)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1726, file: !156, line: 3495, baseType: !1751, size: 64, align: 64, offset: 704)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64, align: 64)
!1752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1753)
!1753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !156, line: 3404, baseType: !1754)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !156, line: 3401, size: 128, align: 64, elements: !1755)
!1755 = !{!1756, !1757}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1754, file: !156, line: 3402, baseType: !897, size: 32, align: 32)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1754, file: !156, line: 3403, baseType: !1684, size: 64, align: 64, offset: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1726, file: !156, line: 3507, baseType: !1684, size: 64, align: 64, offset: 768)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1726, file: !156, line: 3516, baseType: !897, size: 32, align: 32, offset: 832)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1726, file: !156, line: 3517, baseType: !1761, size: 64, align: 64, offset: 896)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1726, file: !156, line: 3527, baseType: !1763, size: 64, align: 64, offset: 960)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1764, size: 64, align: 64)
!1764 = !DISubroutineType(types: !1765)
!1765 = !{!897, !1673}
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1726, file: !156, line: 3535, baseType: !1767, size: 64, align: 64, offset: 1024)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64, align: 64)
!1768 = !DISubroutineType(types: !1769)
!1769 = !{!897, !1673, !1770}
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64, align: 64)
!1771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1674)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1726, file: !156, line: 3541, baseType: !1773, size: 64, align: 64, offset: 1088)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64, align: 64)
!1774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1775)
!1775 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !156, line: 3461, baseType: !1776)
!1776 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !156, line: 3461, flags: DIFlagFwdDecl)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1726, file: !156, line: 3549, baseType: !1778, size: 64, align: 64, offset: 1152)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64, align: 64)
!1779 = !DISubroutineType(types: !1780)
!1780 = !{null, !1761}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1726, file: !156, line: 3551, baseType: !1763, size: 64, align: 64, offset: 1216)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1726, file: !156, line: 3552, baseType: !1783, size: 64, align: 64, offset: 1280)
!1783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1784, size: 64, align: 64)
!1784 = !DISubroutineType(types: !1785)
!1785 = !{!897, !1673, !936, !897, !1786}
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1787, size: 64, align: 64)
!1787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1788)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !156, line: 3920, size: 256, align: 64, elements: !1789)
!1789 = !{!1790, !1793, !1794, !1795, !1796, !1824}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1788, file: !156, line: 3921, baseType: !1791, size: 16, align: 16)
!1791 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !906, line: 49, baseType: !1792)
!1792 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1788, file: !156, line: 3922, baseType: !905, size: 32, align: 32, offset: 32)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1788, file: !156, line: 3923, baseType: !905, size: 32, align: 32, offset: 64)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1788, file: !156, line: 3924, baseType: !898, size: 32, align: 32, offset: 96)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1788, file: !156, line: 3925, baseType: !1797, size: 64, align: 64, offset: 128)
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1798, size: 64, align: 64)
!1798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1799, size: 64, align: 64)
!1799 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !156, line: 3918, baseType: !1800)
!1800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !156, line: 3885, size: 1600, align: 64, elements: !1801)
!1801 = !{!1802, !1803, !1804, !1805, !1806, !1807, !1813, !1817, !1819, !1820, !1822, !1823}
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1800, file: !156, line: 3886, baseType: !897, size: 32, align: 32)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1800, file: !156, line: 3887, baseType: !897, size: 32, align: 32, offset: 32)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1800, file: !156, line: 3888, baseType: !897, size: 32, align: 32, offset: 64)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1800, file: !156, line: 3889, baseType: !897, size: 32, align: 32, offset: 96)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1800, file: !156, line: 3890, baseType: !897, size: 32, align: 32, offset: 128)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1800, file: !156, line: 3897, baseType: !1808, size: 768, align: 64, offset: 192)
!1808 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !156, line: 3858, baseType: !1809)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !156, line: 3853, size: 768, align: 64, elements: !1810)
!1810 = !{!1811, !1812}
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1809, file: !156, line: 3855, baseType: !969, size: 512, align: 64)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1809, file: !156, line: 3857, baseType: !973, size: 256, align: 32, offset: 512)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1800, file: !156, line: 3903, baseType: !1814, size: 256, align: 64, offset: 960)
!1814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 64, elements: !1815)
!1815 = !{!1816}
!1816 = !DISubrange(count: 4)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1800, file: !156, line: 3904, baseType: !1818, size: 128, align: 32, offset: 1216)
!1818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, align: 32, elements: !1815)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1800, file: !156, line: 3906, baseType: !831, size: 32, align: 32, offset: 1344)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1800, file: !156, line: 3908, baseType: !1821, size: 64, align: 64, offset: 1408)
!1821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1800, file: !156, line: 3915, baseType: !1821, size: 64, align: 64, offset: 1472)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1800, file: !156, line: 3917, baseType: !897, size: 32, align: 32, offset: 1536)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1788, file: !156, line: 3926, baseType: !990, size: 64, align: 64, offset: 192)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1726, file: !156, line: 3564, baseType: !1826, size: 64, align: 64, offset: 1344)
!1826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1827, size: 64, align: 64)
!1827 = !DISubroutineType(types: !1828)
!1828 = !{!897, !1673, !1829, !1852, !1854}
!1829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1830, size: 64, align: 64)
!1830 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !156, line: 1499, baseType: !1831)
!1831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !156, line: 1445, size: 704, align: 64, elements: !1832)
!1832 = !{!1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1848, !1849, !1850, !1851}
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1831, file: !156, line: 1451, baseType: !1011, size: 64, align: 64)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1831, file: !156, line: 1461, baseType: !990, size: 64, align: 64, offset: 64)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1831, file: !156, line: 1467, baseType: !990, size: 64, align: 64, offset: 128)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1831, file: !156, line: 1468, baseType: !936, size: 64, align: 64, offset: 192)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1831, file: !156, line: 1469, baseType: !897, size: 32, align: 32, offset: 256)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1831, file: !156, line: 1470, baseType: !897, size: 32, align: 32, offset: 288)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1831, file: !156, line: 1474, baseType: !897, size: 32, align: 32, offset: 320)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1831, file: !156, line: 1479, baseType: !1841, size: 64, align: 64, offset: 384)
!1841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1842, size: 64, align: 64)
!1842 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !156, line: 1415, baseType: !1843)
!1843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !156, line: 1411, size: 128, align: 64, elements: !1844)
!1844 = !{!1845, !1846, !1847}
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1843, file: !156, line: 1412, baseType: !936, size: 64, align: 64)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1843, file: !156, line: 1413, baseType: !897, size: 32, align: 32, offset: 64)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1843, file: !156, line: 1414, baseType: !837, size: 32, align: 32, offset: 96)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1831, file: !156, line: 1480, baseType: !897, size: 32, align: 32, offset: 448)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1831, file: !156, line: 1486, baseType: !990, size: 64, align: 64, offset: 512)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1831, file: !156, line: 1488, baseType: !990, size: 64, align: 64, offset: 576)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1831, file: !156, line: 1497, baseType: !990, size: 64, align: 64, offset: 640)
!1852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1853, size: 64, align: 64)
!1853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1726, file: !156, line: 3566, baseType: !1856, size: 64, align: 64, offset: 1408)
!1856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1857, size: 64, align: 64)
!1857 = !DISubroutineType(types: !1858)
!1858 = !{!897, !1673, !997, !1854, !1829}
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1726, file: !156, line: 3567, baseType: !1763, size: 64, align: 64, offset: 1472)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1726, file: !156, line: 3576, baseType: !1861, size: 64, align: 64, offset: 1536)
!1861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1862, size: 64, align: 64)
!1862 = !DISubroutineType(types: !1863)
!1863 = !{!897, !1673, !1852}
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1726, file: !156, line: 3577, baseType: !1865, size: 64, align: 64, offset: 1600)
!1865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1866, size: 64, align: 64)
!1866 = !DISubroutineType(types: !1867)
!1867 = !{!897, !1673, !1829}
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1726, file: !156, line: 3584, baseType: !1869, size: 64, align: 64, offset: 1664)
!1869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1870, size: 64, align: 64)
!1870 = !DISubroutineType(types: !1871)
!1871 = !{!897, !1673, !964}
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1726, file: !156, line: 3589, baseType: !1873, size: 64, align: 64, offset: 1728)
!1873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1874, size: 64, align: 64)
!1874 = !DISubroutineType(types: !1875)
!1875 = !{null, !1673}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1726, file: !156, line: 3594, baseType: !897, size: 32, align: 32, offset: 1792)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1726, file: !156, line: 3600, baseType: !1684, size: 64, align: 64, offset: 1856)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1726, file: !156, line: 3609, baseType: !1879, size: 64, align: 64, offset: 1920)
!1879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1880, size: 64, align: 64)
!1880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1881, size: 64, align: 64)
!1881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1882)
!1882 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !156, line: 3609, flags: DIFlagFwdDecl)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1675, file: !156, line: 1566, baseType: !155, size: 32, align: 32, offset: 192)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1675, file: !156, line: 1581, baseType: !898, size: 32, align: 32, offset: 224)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1675, file: !156, line: 1583, baseType: !997, size: 64, align: 64, offset: 256)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1675, file: !156, line: 1591, baseType: !1887, size: 64, align: 64, offset: 320)
!1887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1888, size: 64, align: 64)
!1888 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !156, line: 1532, flags: DIFlagFwdDecl)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1675, file: !156, line: 1598, baseType: !997, size: 64, align: 64, offset: 384)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1675, file: !156, line: 1606, baseType: !990, size: 64, align: 64, offset: 448)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1675, file: !156, line: 1614, baseType: !897, size: 32, align: 32, offset: 512)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1675, file: !156, line: 1622, baseType: !897, size: 32, align: 32, offset: 544)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1675, file: !156, line: 1628, baseType: !897, size: 32, align: 32, offset: 576)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1675, file: !156, line: 1636, baseType: !897, size: 32, align: 32, offset: 608)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1675, file: !156, line: 1643, baseType: !897, size: 32, align: 32, offset: 640)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1675, file: !156, line: 1657, baseType: !936, size: 64, align: 64, offset: 704)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1675, file: !156, line: 1658, baseType: !897, size: 32, align: 32, offset: 768)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1675, file: !156, line: 1679, baseType: !983, size: 64, align: 32, offset: 800)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1675, file: !156, line: 1688, baseType: !897, size: 32, align: 32, offset: 864)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1675, file: !156, line: 1712, baseType: !897, size: 32, align: 32, offset: 896)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1675, file: !156, line: 1729, baseType: !897, size: 32, align: 32, offset: 928)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1675, file: !156, line: 1729, baseType: !897, size: 32, align: 32, offset: 960)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1675, file: !156, line: 1744, baseType: !897, size: 32, align: 32, offset: 992)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1675, file: !156, line: 1744, baseType: !897, size: 32, align: 32, offset: 1024)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1675, file: !156, line: 1751, baseType: !897, size: 32, align: 32, offset: 1056)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1675, file: !156, line: 1766, baseType: !615, size: 32, align: 32, offset: 1088)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1675, file: !156, line: 1791, baseType: !1908, size: 64, align: 64, offset: 1152)
!1908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1909, size: 64, align: 64)
!1909 = !DISubroutineType(types: !1910)
!1910 = !{null, !1911, !1852, !1854, !897, !897, !897}
!1911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1675, file: !156, line: 1808, baseType: !1913, size: 64, align: 64, offset: 1216)
!1913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1914, size: 64, align: 64)
!1914 = !DISubroutineType(types: !1915)
!1915 = !{!615, !1911, !1737}
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1675, file: !156, line: 1816, baseType: !897, size: 32, align: 32, offset: 1280)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1675, file: !156, line: 1825, baseType: !1918, size: 32, align: 32, offset: 1312)
!1918 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1675, file: !156, line: 1830, baseType: !897, size: 32, align: 32, offset: 1344)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1675, file: !156, line: 1838, baseType: !1918, size: 32, align: 32, offset: 1376)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1675, file: !156, line: 1846, baseType: !897, size: 32, align: 32, offset: 1408)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1675, file: !156, line: 1851, baseType: !897, size: 32, align: 32, offset: 1440)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1675, file: !156, line: 1861, baseType: !1918, size: 32, align: 32, offset: 1472)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1675, file: !156, line: 1868, baseType: !1918, size: 32, align: 32, offset: 1504)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1675, file: !156, line: 1875, baseType: !1918, size: 32, align: 32, offset: 1536)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1675, file: !156, line: 1882, baseType: !1918, size: 32, align: 32, offset: 1568)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1675, file: !156, line: 1889, baseType: !1918, size: 32, align: 32, offset: 1600)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1675, file: !156, line: 1896, baseType: !1918, size: 32, align: 32, offset: 1632)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1675, file: !156, line: 1903, baseType: !1918, size: 32, align: 32, offset: 1664)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1675, file: !156, line: 1910, baseType: !897, size: 32, align: 32, offset: 1696)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1675, file: !156, line: 1915, baseType: !897, size: 32, align: 32, offset: 1728)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1675, file: !156, line: 1926, baseType: !1854, size: 64, align: 64, offset: 1792)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1675, file: !156, line: 1935, baseType: !983, size: 64, align: 32, offset: 1856)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1675, file: !156, line: 1942, baseType: !897, size: 32, align: 32, offset: 1920)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1675, file: !156, line: 1948, baseType: !897, size: 32, align: 32, offset: 1952)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1675, file: !156, line: 1954, baseType: !897, size: 32, align: 32, offset: 1984)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1675, file: !156, line: 1960, baseType: !897, size: 32, align: 32, offset: 2016)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1675, file: !156, line: 1984, baseType: !897, size: 32, align: 32, offset: 2048)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1675, file: !156, line: 1991, baseType: !897, size: 32, align: 32, offset: 2080)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1675, file: !156, line: 1996, baseType: !897, size: 32, align: 32, offset: 2112)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1675, file: !156, line: 2004, baseType: !897, size: 32, align: 32, offset: 2144)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1675, file: !156, line: 2011, baseType: !897, size: 32, align: 32, offset: 2176)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1675, file: !156, line: 2018, baseType: !897, size: 32, align: 32, offset: 2208)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1675, file: !156, line: 2027, baseType: !897, size: 32, align: 32, offset: 2240)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1675, file: !156, line: 2034, baseType: !897, size: 32, align: 32, offset: 2272)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1675, file: !156, line: 2044, baseType: !897, size: 32, align: 32, offset: 2304)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1675, file: !156, line: 2054, baseType: !1948, size: 64, align: 64, offset: 2368)
!1948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64, align: 64)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1675, file: !156, line: 2061, baseType: !1948, size: 64, align: 64, offset: 2432)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1675, file: !156, line: 2066, baseType: !897, size: 32, align: 32, offset: 2496)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1675, file: !156, line: 2070, baseType: !897, size: 32, align: 32, offset: 2528)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1675, file: !156, line: 2078, baseType: !897, size: 32, align: 32, offset: 2560)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1675, file: !156, line: 2085, baseType: !897, size: 32, align: 32, offset: 2592)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1675, file: !156, line: 2092, baseType: !897, size: 32, align: 32, offset: 2624)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1675, file: !156, line: 2099, baseType: !897, size: 32, align: 32, offset: 2656)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1675, file: !156, line: 2106, baseType: !897, size: 32, align: 32, offset: 2688)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1675, file: !156, line: 2113, baseType: !897, size: 32, align: 32, offset: 2720)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1675, file: !156, line: 2120, baseType: !897, size: 32, align: 32, offset: 2752)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1675, file: !156, line: 2125, baseType: !897, size: 32, align: 32, offset: 2784)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1675, file: !156, line: 2133, baseType: !897, size: 32, align: 32, offset: 2816)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1675, file: !156, line: 2140, baseType: !897, size: 32, align: 32, offset: 2848)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1675, file: !156, line: 2145, baseType: !897, size: 32, align: 32, offset: 2880)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1675, file: !156, line: 2153, baseType: !897, size: 32, align: 32, offset: 2912)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1675, file: !156, line: 2158, baseType: !897, size: 32, align: 32, offset: 2944)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1675, file: !156, line: 2166, baseType: !54, size: 32, align: 32, offset: 2976)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1675, file: !156, line: 2173, baseType: !72, size: 32, align: 32, offset: 3008)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1675, file: !156, line: 2180, baseType: !96, size: 32, align: 32, offset: 3040)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1675, file: !156, line: 2187, baseType: !47, size: 32, align: 32, offset: 3072)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1675, file: !156, line: 2194, baseType: !115, size: 32, align: 32, offset: 3104)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1675, file: !156, line: 2203, baseType: !897, size: 32, align: 32, offset: 3136)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1675, file: !156, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
