; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--texturedsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--texturedsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TextureDSPContext = type { i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)* }
%union.unaligned_16 = type { i16 }
%union.unaligned_32 = type { i32 }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_texturedsp_init(%struct.TextureDSPContext* %c) #0 !dbg !30 {
entry:
  %c.addr = alloca %struct.TextureDSPContext*, align 8
  store %struct.TextureDSPContext* %c, %struct.TextureDSPContext** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.TextureDSPContext** %c.addr, metadata !62, metadata !63), !dbg !64
  %0 = load %struct.TextureDSPContext*, %struct.TextureDSPContext** %c.addr, align 8, !dbg !65
  %dxt1_block = getelementptr inbounds %struct.TextureDSPContext, %struct.TextureDSPContext* %0, i32 0, i32 0, !dbg !66
  store i32 (i8*, i64, i8*)* @dxt1_block, i32 (i8*, i64, i8*)** %dxt1_block, align 8, !dbg !67

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--texturedsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !13, !20, !21, !19, !23, !25}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !7, line: 222, size: 16, align: 8, elements: !8)
!7 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !6, file: !7, line: 222, baseType: !10, size: 16, align: 16)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!12 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !7, line: 221, size: 32, align: 8, elements: !16)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !15, file: !7, line: 221, baseType: !18, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 51, baseType: !19)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 48, baseType: !22)
!22 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !11, line: 36, baseType: !26)
!26 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!30 = distinct !DISubprogram(name: "ff_texturedsp_init", scope: !31, file: !31, line: 637, type: !32, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!31 = !DIFile(filename: "libavcodec/texturedsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureDSPContext", file: !36, line: 61, baseType: !37)
!36 = !DIFile(filename: "libavcodec/texturedsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextureDSPContext", file: !36, line: 45, size: 960, align: 64, elements: !38)
!38 = !{!39, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dxt1_block", scope: !37, file: !36, line: 46, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !45, !23}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !46, line: 149, baseType: !47)
!46 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!47 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "dxt1a_block", scope: !37, file: !36, line: 47, baseType: !40, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dxt2_block", scope: !37, file: !36, line: 48, baseType: !40, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "dxt3_block", scope: !37, file: !36, line: 49, baseType: !40, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "dxt4_block", scope: !37, file: !36, line: 50, baseType: !40, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dxt5_block", scope: !37, file: !36, line: 51, baseType: !40, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dxt5y_block", scope: !37, file: !36, line: 52, baseType: !40, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dxt5ys_block", scope: !37, file: !36, line: 53, baseType: !40, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1s_block", scope: !37, file: !36, line: 54, baseType: !40, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1u_block", scope: !37, file: !36, line: 55, baseType: !40, size: 64, align: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1u_gray_block", scope: !37, file: !36, line: 56, baseType: !40, size: 64, align: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1u_alpha_block", scope: !37, file: !36, line: 57, baseType: !40, size: 64, align: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc2s_block", scope: !37, file: !36, line: 58, baseType: !40, size: 64, align: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc2u_block", scope: !37, file: !36, line: 59, baseType: !40, size: 64, align: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dxn3dc_block", scope: !37, file: !36, line: 60, baseType: !40, size: 64, align: 64, offset: 896)
!62 = !DILocalVariable(name: "c", arg: 1, scope: !30, file: !31, line: 637, type: !34)
!63 = !DIExpression()
!64 = !DILocation(line: 637, column: 66, scope: !30)
!65 = !DILocation(line: 639, column: 5, scope: !30)
!66 = !DILocation(line: 639, column: 8, scope: !30)
!67 = !DILocation(line: 639, column: 19, scope: !30)
!68 = !DILocation(line: 640, column: 5, scope: !30)
!69 = !DILocation(line: 640, column: 8, scope: !30)
!70 = !DILocation(line: 640, column: 20, scope: !30)
!71 = !DILocation(line: 641, column: 5, scope: !30)
!72 = !DILocation(line: 641, column: 8, scope: !30)
!73 = !DILocation(line: 641, column: 19, scope: !30)
!74 = !DILocation(line: 642, column: 5, scope: !30)
!75 = !DILocation(line: 642, column: 8, scope: !30)
!76 = !DILocation(line: 642, column: 19, scope: !30)
!77 = !DILocation(line: 643, column: 5, scope: !30)
!78 = !DILocation(line: 643, column: 8, scope: !30)
!79 = !DILocation(line: 643, column: 19, scope: !30)
!80 = !DILocation(line: 644, column: 5, scope: !30)
!81 = !DILocation(line: 644, column: 8, scope: !30)
!82 = !DILocation(line: 644, column: 19, scope: !30)
!83 = !DILocation(line: 645, column: 5, scope: !30)
!84 = !DILocation(line: 645, column: 8, scope: !30)
!85 = !DILocation(line: 645, column: 20, scope: !30)
!86 = !DILocation(line: 646, column: 5, scope: !30)
!87 = !DILocation(line: 646, column: 8, scope: !30)
!88 = !DILocation(line: 646, column: 21, scope: !30)
!89 = !DILocation(line: 647, column: 5, scope: !30)
!90 = !DILocation(line: 647, column: 8, scope: !30)
!91 = !DILocation(line: 647, column: 21, scope: !30)
!92 = !DILocation(line: 648, column: 5, scope: !30)
!93 = !DILocation(line: 648, column: 8, scope: !30)
!94 = !DILocation(line: 648, column: 21, scope: !30)
!95 = !DILocation(line: 649, column: 5, scope: !30)
!96 = !DILocation(line: 649, column: 8, scope: !30)
!97 = !DILocation(line: 649, column: 26, scope: !30)
!98 = !DILocation(line: 650, column: 5, scope: !30)
!99 = !DILocation(line: 650, column: 8, scope: !30)
!100 = !DILocation(line: 650, column: 27, scope: !30)
!101 = !DILocation(line: 651, column: 5, scope: !30)
!102 = !DILocation(line: 651, column: 8, scope: !30)
!103 = !DILocation(line: 651, column: 21, scope: !30)
!104 = !DILocation(line: 652, column: 5, scope: !30)
!105 = !DILocation(line: 652, column: 8, scope: !30)
!106 = !DILocation(line: 652, column: 21, scope: !30)
!107 = !DILocation(line: 653, column: 5, scope: !30)
!108 = !DILocation(line: 653, column: 8, scope: !30)
!109 = !DILocation(line: 653, column: 21, scope: !30)
!110 = !DILocation(line: 654, column: 1, scope: !30)
!111 = distinct !DISubprogram(name: "dxt1_block", scope: !31, file: !31, line: 115, type: !41, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!112 = !DILocalVariable(name: "dst", arg: 1, scope: !111, file: !31, line: 115, type: !44)
!113 = !DILocation(line: 115, column: 32, scope: !111)
!114 = !DILocalVariable(name: "stride", arg: 2, scope: !111, file: !31, line: 115, type: !45)
!115 = !DILocation(line: 115, column: 47, scope: !111)
!116 = !DILocalVariable(name: "block", arg: 3, scope: !111, file: !31, line: 115, type: !23)
!117 = !DILocation(line: 115, column: 70, scope: !111)
!118 = !DILocation(line: 117, column: 25, scope: !111)
!119 = !DILocation(line: 117, column: 30, scope: !111)
!120 = !DILocation(line: 117, column: 38, scope: !111)
!121 = !DILocation(line: 117, column: 5, scope: !111)
!122 = !DILocation(line: 119, column: 5, scope: !111)
!123 = distinct !DISubprogram(name: "dxt1a_block", scope: !31, file: !31, line: 132, type: !41, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!124 = !DILocalVariable(name: "dst", arg: 1, scope: !123, file: !31, line: 132, type: !44)
!125 = !DILocation(line: 132, column: 33, scope: !123)
