; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--atrac3plusdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--atrac3plusdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 65536, align: 32, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 2048)
!928 = distinct !DIGlobalVariable(name: "hann_window", scope: !0, file: !906, line: 94, type: !929, isLocal: true, isDefinition: true, variable: [256 x float]* @hann_window)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 8192, align: 32, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 256)
!932 = distinct !DIGlobalVariable(name: "amp_sf_tab", scope: !0, file: !906, line: 95, type: !933, isLocal: true, isDefinition: true, variable: [64 x float]* @amp_sf_tab)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 2048, align: 32, elements: !918)
!934 = distinct !DIGlobalVariable(name: "subband_to_powgrp", scope: !0, file: !906, line: 251, type: !935, isLocal: true, isDefinition: true, variable: [16 x i32]* @subband_to_powgrp)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, align: 32, elements: !938)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!938 = !{!939}
!939 = !DISubrange(count: 16)
!940 = distinct !DIGlobalVariable(name: "noise_tab", scope: !0, file: !906, line: 256, type: !941, isLocal: true, isDefinition: true, variable: [1024 x float]* @noise_tab)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 32768, align: 32, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 1024)
!944 = distinct !DIGlobalVariable(name: "pwc_levs", scope: !0, file: !906, line: 408, type: !945, isLocal: true, isDefinition: true, variable: [16 x float]* @pwc_levs)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 512, align: 32, elements: !938)
!946 = distinct !DIGlobalVariable(name: "subband_to_qu", scope: !0, file: !906, line: 414, type: !947, isLocal: true, isDefinition: true, variable: [17 x i32]* @subband_to_qu)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 544, align: 32, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 17)
!950 = distinct !DIGlobalVariable(name: "mod23_lut", scope: !0, file: !906, line: 496, type: !951, isLocal: true, isDefinition: true, variable: [26 x i32]* @mod23_lut)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 832, align: 32, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 26)
!954 = distinct !DIGlobalVariable(name: "ipqf_coeffs1", scope: !0, file: !906, line: 502, type: !955, isLocal: true, isDefinition: true, variable: [12 x [16 x float]]* @ipqf_coeffs1)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 6144, align: 32, elements: !956)
!956 = !{!957, !939}
!957 = !DISubrange(count: 12)
!958 = distinct !DIGlobalVariable(name: "ipqf_coeffs2", scope: !0, file: !906, line: 554, type: !955, isLocal: true, isDefinition: true, variable: [12 x [16 x float]]* @ipqf_coeffs2)
!959 = !{i32 2, !"Dwarf Version", i32 4}
!960 = !{i32 2, !"Debug Info Version", i32 3}
!961 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!962 = distinct !DISubprogram(name: "ff_atrac3p_init_imdct", scope: !906, file: !906, line: 80, type: !963, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1603)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !965, !1558}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !968)
!968 = !{!969, !1014, !1015, !1016, !1282, !1283, !1284, !1285, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1311, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1496, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !967, file: !35, line: 1561, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !974)
!974 = !{!975, !979, !984, !988, !989, !990, !991, !995, !1001, !1003, !1007}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !973, file: !4, line: 72, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !973, file: !4, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!976, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !973, file: !4, line: 85, baseType: !985, size: 64, align: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !973, file: !4, line: 93, baseType: !937, size: 32, align: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !973, file: !4, line: 99, baseType: !937, size: 32, align: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !973, file: !4, line: 108, baseType: !937, size: 32, align: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !973, file: !4, line: 113, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!983, !983, !983}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !973, file: !4, line: 123, baseType: !996, size: 64, align: 64, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!999, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !973, file: !4, line: 130, baseType: !1002, size: 32, align: 32, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !973, file: !4, line: 136, baseType: !1004, size: 64, align: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1002, !983}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !973, file: !4, line: 142, baseType: !1008, size: 64, align: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!937, !1011, !983, !976, !937}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !967, file: !35, line: 1562, baseType: !937, size: 32, align: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !967, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !967, file: !35, line: 1565, baseType: !1017, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1035, !1038, !1040, !1043, !1048, !1051, !1052, !1060, !1061, !1062, !1064, !1068, !1074, !1079, !1083, !1084, !1132, !1253, !1257, !1258, !1262, !1266, !1271, !1275, !1276, !1277}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1019, file: !35, line: 3475, baseType: !976, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1019, file: !35, line: 3480, baseType: !976, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1019, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1019, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1019, file: !35, line: 3487, baseType: !937, size: 32, align: 32, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1019, file: !35, line: 3488, baseType: !1027, size: 64, align: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1030, line: 61, baseType: !1031)
!1030 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1030, line: 58, size: 64, align: 32, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1031, file: !1030, line: 59, baseType: !937, size: 32, align: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1031, file: !1030, line: 60, baseType: !937, size: 32, align: 32, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1019, file: !35, line: 3489, baseType: !1036, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1019, file: !35, line: 3490, baseType: !1039, size: 64, align: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1019, file: !35, line: 3491, baseType: !1041, size: 64, align: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1019, file: !35, line: 3492, baseType: !1044, size: 64, align: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !910, line: 55, baseType: !1047)
!1047 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1019, file: !35, line: 3493, baseType: !1049, size: 8, align: 8, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !910, line: 48, baseType: !1050)
!1050 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1019, file: !35, line: 3494, baseType: !970, size: 64, align: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1019, file: !35, line: 3495, baseType: !1053, size: 64, align: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1056, file: !35, line: 3402, baseType: !937, size: 32, align: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !35, line: 3403, baseType: !976, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1019, file: !35, line: 3507, baseType: !976, size: 64, align: 64, offset: 768)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1019, file: !35, line: 3516, baseType: !937, size: 32, align: 32, offset: 832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !35, line: 3517, baseType: !1063, size: 64, align: 64, offset: 896)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1019, file: !35, line: 3527, baseType: !1065, size: 64, align: 64, offset: 960)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!937, !965}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1019, file: !35, line: 3535, baseType: !1069, size: 64, align: 64, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!937, !965, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1019, file: !35, line: 3541, baseType: !1075, size: 64, align: 64, offset: 1088)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1078)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1019, file: !35, line: 3549, baseType: !1080, size: 64, align: 64, offset: 1152)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !1063}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1019, file: !35, line: 3551, baseType: !1065, size: 64, align: 64, offset: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1019, file: !35, line: 3552, baseType: !1085, size: 64, align: 64, offset: 1280)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!937, !965, !1088, !937, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1097, !1098, !1099, !1129}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1091, file: !35, line: 3921, baseType: !909, size: 16, align: 16)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1091, file: !35, line: 3922, baseType: !1095, size: 32, align: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !910, line: 51, baseType: !1096)
!1096 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1091, file: !35, line: 3923, baseType: !1095, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1091, file: !35, line: 3924, baseType: !1096, size: 32, align: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1091, file: !35, line: 3925, baseType: !1100, size: 64, align: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1118, !1122, !1124, !1125, !1127, !1128}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1103, file: !35, line: 3886, baseType: !937, size: 32, align: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1103, file: !35, line: 3887, baseType: !937, size: 32, align: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1103, file: !35, line: 3888, baseType: !937, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1103, file: !35, line: 3889, baseType: !937, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1103, file: !35, line: 3890, baseType: !937, size: 32, align: 32, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1103, file: !35, line: 3897, baseType: !1111, size: 768, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1113)
!1113 = !{!1114, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !35, line: 3855, baseType: !1115, size: 512, align: 64)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 512, align: 64, elements: !922)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1112, file: !35, line: 3857, baseType: !1117, size: 256, align: 32, offset: 512)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 256, align: 32, elements: !922)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !35, line: 3903, baseType: !1119, size: 256, align: 64, offset: 960)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 256, align: 64, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 4)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1103, file: !35, line: 3904, baseType: !1123, size: 128, align: 32, offset: 1216)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 128, align: 32, elements: !1120)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1103, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1103, file: !35, line: 3908, baseType: !1126, size: 64, align: 64, offset: 1408)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1103, file: !35, line: 3915, baseType: !1126, size: 64, align: 64, offset: 1472)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !35, line: 3917, baseType: !937, size: 32, align: 32, offset: 1536)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1091, file: !35, line: 3926, baseType: !1130, size: 64, align: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !910, line: 40, baseType: !1131)
!1131 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1019, file: !35, line: 3564, baseType: !1133, size: 64, align: 64, offset: 1344)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!937, !965, !1136, !1170, !1252}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1139)
!1139 = !{!1140, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1166, !1167, !1168, !1169}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1138, file: !35, line: 1451, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1143, line: 94, baseType: !1144)
!1143 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1143, line: 81, size: 192, align: 64, elements: !1145)
!1145 = !{!1146, !1150, !1151}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1144, file: !1143, line: 82, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1143, line: 73, baseType: !1149)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1143, line: 73, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !1143, line: 89, baseType: !1088, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !1143, line: 93, baseType: !937, size: 32, align: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1138, file: !35, line: 1461, baseType: !1130, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1138, file: !35, line: 1467, baseType: !1130, size: 64, align: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1138, file: !35, line: 1468, baseType: !1088, size: 64, align: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !35, line: 1469, baseType: !937, size: 32, align: 32, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1138, file: !35, line: 1470, baseType: !937, size: 32, align: 32, offset: 288)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1138, file: !35, line: 1474, baseType: !937, size: 32, align: 32, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1138, file: !35, line: 1479, baseType: !1159, size: 64, align: 64, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !35, line: 1412, baseType: !1088, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !35, line: 1413, baseType: !937, size: 32, align: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1161, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1138, file: !35, line: 1480, baseType: !937, size: 32, align: 32, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1138, file: !35, line: 1486, baseType: !1130, size: 64, align: 64, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1138, file: !35, line: 1488, baseType: !1130, size: 64, align: 64, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1138, file: !35, line: 1497, baseType: !1130, size: 64, align: 64, offset: 640)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1206, !1207, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1248, !1249, !1250, !1251}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !758, line: 282, baseType: !1115, size: 512, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1173, file: !758, line: 299, baseType: !1117, size: 256, align: 32, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1173, file: !758, line: 315, baseType: !1178, size: 64, align: 64, offset: 768)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1173, file: !758, line: 326, baseType: !937, size: 32, align: 32, offset: 832)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1173, file: !758, line: 326, baseType: !937, size: 32, align: 32, offset: 864)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1173, file: !758, line: 334, baseType: !937, size: 32, align: 32, offset: 896)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1173, file: !758, line: 341, baseType: !937, size: 32, align: 32, offset: 928)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1173, file: !758, line: 346, baseType: !937, size: 32, align: 32, offset: 960)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1173, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1173, file: !758, line: 356, baseType: !1029, size: 64, align: 32, offset: 1024)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1173, file: !758, line: 361, baseType: !1130, size: 64, align: 64, offset: 1088)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1173, file: !758, line: 369, baseType: !1130, size: 64, align: 64, offset: 1152)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1173, file: !758, line: 377, baseType: !1130, size: 64, align: 64, offset: 1216)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1173, file: !758, line: 382, baseType: !937, size: 32, align: 32, offset: 1280)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1173, file: !758, line: 386, baseType: !937, size: 32, align: 32, offset: 1312)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1173, file: !758, line: 391, baseType: !937, size: 32, align: 32, offset: 1344)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1173, file: !758, line: 396, baseType: !983, size: 64, align: 64, offset: 1408)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1173, file: !758, line: 403, baseType: !1194, size: 512, align: 64, offset: 1472)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 512, align: 64, elements: !922)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1173, file: !758, line: 410, baseType: !937, size: 32, align: 32, offset: 1984)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1173, file: !758, line: 415, baseType: !937, size: 32, align: 32, offset: 2016)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1173, file: !758, line: 420, baseType: !937, size: 32, align: 32, offset: 2048)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1173, file: !758, line: 425, baseType: !937, size: 32, align: 32, offset: 2080)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1173, file: !758, line: 435, baseType: !1130, size: 64, align: 64, offset: 2112)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1173, file: !758, line: 440, baseType: !937, size: 32, align: 32, offset: 2176)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1173, file: !758, line: 445, baseType: !1046, size: 64, align: 64, offset: 2240)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1173, file: !758, line: 459, baseType: !1203, size: 512, align: 64, offset: 2304)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 512, align: 64, elements: !922)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1173, file: !758, line: 473, baseType: !1205, size: 64, align: 64, offset: 2816)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1173, file: !758, line: 477, baseType: !937, size: 32, align: 32, offset: 2880)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1173, file: !758, line: 479, baseType: !1208, size: 64, align: 64, offset: 2944)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1221}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1211, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !758, line: 203, baseType: !1088, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !758, line: 204, baseType: !937, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1211, file: !758, line: 205, baseType: !1217, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1219, line: 86, baseType: !1220)
!1219 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1219, line: 86, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1211, file: !758, line: 206, baseType: !1141, size: 64, align: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1173, file: !758, line: 480, baseType: !937, size: 32, align: 32, offset: 3008)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !758, line: 505, baseType: !937, size: 32, align: 32, offset: 3040)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1173, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1173, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1173, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1173, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1173, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1173, file: !758, line: 532, baseType: !1130, size: 64, align: 64, offset: 3264)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1173, file: !758, line: 539, baseType: !1130, size: 64, align: 64, offset: 3328)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1173, file: !758, line: 547, baseType: !1130, size: 64, align: 64, offset: 3392)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1173, file: !758, line: 554, baseType: !1217, size: 64, align: 64, offset: 3456)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1173, file: !758, line: 563, baseType: !937, size: 32, align: 32, offset: 3520)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1173, file: !758, line: 572, baseType: !937, size: 32, align: 32, offset: 3552)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1173, file: !758, line: 581, baseType: !937, size: 32, align: 32, offset: 3584)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1173, file: !758, line: 588, baseType: !1237, size: 64, align: 64, offset: 3648)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !910, line: 36, baseType: !1239)
!1239 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1173, file: !758, line: 593, baseType: !937, size: 32, align: 32, offset: 3712)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1173, file: !758, line: 596, baseType: !937, size: 32, align: 32, offset: 3744)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1173, file: !758, line: 599, baseType: !1141, size: 64, align: 64, offset: 3776)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1173, file: !758, line: 605, baseType: !1141, size: 64, align: 64, offset: 3840)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1173, file: !758, line: 616, baseType: !1141, size: 64, align: 64, offset: 3904)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1173, file: !758, line: 626, baseType: !1246, size: 64, align: 64, offset: 3968)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1247, line: 216, baseType: !1047)
!1247 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1173, file: !758, line: 627, baseType: !1246, size: 64, align: 64, offset: 4032)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1173, file: !758, line: 628, baseType: !1246, size: 64, align: 64, offset: 4096)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1173, file: !758, line: 629, baseType: !1246, size: 64, align: 64, offset: 4160)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1173, file: !758, line: 645, baseType: !1141, size: 64, align: 64, offset: 4224)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1019, file: !35, line: 3566, baseType: !1254, size: 64, align: 64, offset: 1408)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!937, !965, !983, !1252, !1136}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1019, file: !35, line: 3567, baseType: !1065, size: 64, align: 64, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1019, file: !35, line: 3576, baseType: !1259, size: 64, align: 64, offset: 1536)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!937, !965, !1170}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1019, file: !35, line: 3577, baseType: !1263, size: 64, align: 64, offset: 1600)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!937, !965, !1136}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1019, file: !35, line: 3584, baseType: !1267, size: 64, align: 64, offset: 1664)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!937, !965, !1270}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1019, file: !35, line: 3589, baseType: !1272, size: 64, align: 64, offset: 1728)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !965}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1019, file: !35, line: 3594, baseType: !937, size: 32, align: 32, offset: 1792)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1019, file: !35, line: 3600, baseType: !976, size: 64, align: 64, offset: 1856)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1019, file: !35, line: 3609, baseType: !1278, size: 64, align: 64, offset: 1920)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !967, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !967, file: !35, line: 1581, baseType: !1096, size: 32, align: 32, offset: 224)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !967, file: !35, line: 1583, baseType: !983, size: 64, align: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !967, file: !35, line: 1591, baseType: !1286, size: 64, align: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !967, file: !35, line: 1598, baseType: !983, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !967, file: !35, line: 1606, baseType: !1130, size: 64, align: 64, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !967, file: !35, line: 1614, baseType: !937, size: 32, align: 32, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !967, file: !35, line: 1622, baseType: !937, size: 32, align: 32, offset: 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !967, file: !35, line: 1628, baseType: !937, size: 32, align: 32, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !967, file: !35, line: 1636, baseType: !937, size: 32, align: 32, offset: 608)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !967, file: !35, line: 1643, baseType: !937, size: 32, align: 32, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !967, file: !35, line: 1657, baseType: !1088, size: 64, align: 64, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !967, file: !35, line: 1658, baseType: !937, size: 32, align: 32, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !967, file: !35, line: 1679, baseType: !1029, size: 64, align: 32, offset: 800)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !967, file: !35, line: 1688, baseType: !937, size: 32, align: 32, offset: 864)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !967, file: !35, line: 1712, baseType: !937, size: 32, align: 32, offset: 896)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !967, file: !35, line: 1729, baseType: !937, size: 32, align: 32, offset: 928)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !967, file: !35, line: 1729, baseType: !937, size: 32, align: 32, offset: 960)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !967, file: !35, line: 1744, baseType: !937, size: 32, align: 32, offset: 992)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !967, file: !35, line: 1744, baseType: !937, size: 32, align: 32, offset: 1024)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !967, file: !35, line: 1751, baseType: !937, size: 32, align: 32, offset: 1056)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !967, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !967, file: !35, line: 1791, baseType: !1307, size: 64, align: 64, offset: 1152)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{null, !1310, !1170, !1252, !937, !937, !937}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !967, file: !35, line: 1808, baseType: !1312, size: 64, align: 64, offset: 1216)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!494, !1310, !1036}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !967, file: !35, line: 1816, baseType: !937, size: 32, align: 32, offset: 1280)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !967, file: !35, line: 1825, baseType: !917, size: 32, align: 32, offset: 1312)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !967, file: !35, line: 1830, baseType: !937, size: 32, align: 32, offset: 1344)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !967, file: !35, line: 1838, baseType: !917, size: 32, align: 32, offset: 1376)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !967, file: !35, line: 1846, baseType: !937, size: 32, align: 32, offset: 1408)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !967, file: !35, line: 1851, baseType: !937, size: 32, align: 32, offset: 1440)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !967, file: !35, line: 1861, baseType: !917, size: 32, align: 32, offset: 1472)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !967, file: !35, line: 1868, baseType: !917, size: 32, align: 32, offset: 1504)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !967, file: !35, line: 1875, baseType: !917, size: 32, align: 32, offset: 1536)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !967, file: !35, line: 1882, baseType: !917, size: 32, align: 32, offset: 1568)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !967, file: !35, line: 1889, baseType: !917, size: 32, align: 32, offset: 1600)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !967, file: !35, line: 1896, baseType: !917, size: 32, align: 32, offset: 1632)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !967, file: !35, line: 1903, baseType: !917, size: 32, align: 32, offset: 1664)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !967, file: !35, line: 1910, baseType: !937, size: 32, align: 32, offset: 1696)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !967, file: !35, line: 1915, baseType: !937, size: 32, align: 32, offset: 1728)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !967, file: !35, line: 1926, baseType: !1252, size: 64, align: 64, offset: 1792)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !967, file: !35, line: 1935, baseType: !1029, size: 64, align: 32, offset: 1856)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !967, file: !35, line: 1942, baseType: !937, size: 32, align: 32, offset: 1920)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !967, file: !35, line: 1948, baseType: !937, size: 32, align: 32, offset: 1952)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !967, file: !35, line: 1954, baseType: !937, size: 32, align: 32, offset: 1984)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !967, file: !35, line: 1960, baseType: !937, size: 32, align: 32, offset: 2016)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !967, file: !35, line: 1984, baseType: !937, size: 32, align: 32, offset: 2048)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !967, file: !35, line: 1991, baseType: !937, size: 32, align: 32, offset: 2080)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !967, file: !35, line: 1996, baseType: !937, size: 32, align: 32, offset: 2112)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !967, file: !35, line: 2004, baseType: !937, size: 32, align: 32, offset: 2144)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !967, file: !35, line: 2011, baseType: !937, size: 32, align: 32, offset: 2176)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !967, file: !35, line: 2018, baseType: !937, size: 32, align: 32, offset: 2208)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !967, file: !35, line: 2027, baseType: !937, size: 32, align: 32, offset: 2240)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !967, file: !35, line: 2034, baseType: !937, size: 32, align: 32, offset: 2272)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !967, file: !35, line: 2044, baseType: !937, size: 32, align: 32, offset: 2304)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !967, file: !35, line: 2054, baseType: !1346, size: 64, align: 64, offset: 2368)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !967, file: !35, line: 2061, baseType: !1346, size: 64, align: 64, offset: 2432)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !967, file: !35, line: 2066, baseType: !937, size: 32, align: 32, offset: 2496)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !967, file: !35, line: 2070, baseType: !937, size: 32, align: 32, offset: 2528)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !967, file: !35, line: 2078, baseType: !937, size: 32, align: 32, offset: 2560)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !967, file: !35, line: 2085, baseType: !937, size: 32, align: 32, offset: 2592)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !967, file: !35, line: 2092, baseType: !937, size: 32, align: 32, offset: 2624)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !967, file: !35, line: 2099, baseType: !937, size: 32, align: 32, offset: 2656)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !967, file: !35, line: 2106, baseType: !937, size: 32, align: 32, offset: 2688)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !967, file: !35, line: 2113, baseType: !937, size: 32, align: 32, offset: 2720)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !967, file: !35, line: 2120, baseType: !937, size: 32, align: 32, offset: 2752)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !967, file: !35, line: 2125, baseType: !937, size: 32, align: 32, offset: 2784)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !967, file: !35, line: 2133, baseType: !937, size: 32, align: 32, offset: 2816)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !967, file: !35, line: 2140, baseType: !937, size: 32, align: 32, offset: 2848)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !967, file: !35, line: 2145, baseType: !937, size: 32, align: 32, offset: 2880)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !967, file: !35, line: 2153, baseType: !937, size: 32, align: 32, offset: 2912)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !967, file: !35, line: 2158, baseType: !937, size: 32, align: 32, offset: 2944)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !967, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !967, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !967, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !967, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !967, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !967, file: !35, line: 2203, baseType: !937, size: 32, align: 32, offset: 3136)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !967, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !967, file: !35, line: 2212, baseType: !937, size: 32, align: 32, offset: 3200)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !967, file: !35, line: 2213, baseType: !937, size: 32, align: 32, offset: 3232)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !967, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !967, file: !35, line: 2232, baseType: !937, size: 32, align: 32, offset: 3296)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !967, file: !35, line: 2243, baseType: !937, size: 32, align: 32, offset: 3328)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !967, file: !35, line: 2249, baseType: !937, size: 32, align: 32, offset: 3360)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !967, file: !35, line: 2256, baseType: !937, size: 32, align: 32, offset: 3392)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !967, file: !35, line: 2263, baseType: !1046, size: 64, align: 64, offset: 3456)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !967, file: !35, line: 2270, baseType: !1046, size: 64, align: 64, offset: 3520)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !967, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !967, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !967, file: !35, line: 2367, baseType: !1382, size: 64, align: 64, offset: 3648)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!937, !1310, !1270, !937}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !967, file: !35, line: 2383, baseType: !937, size: 32, align: 32, offset: 3712)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !967, file: !35, line: 2386, baseType: !917, size: 32, align: 32, offset: 3744)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !967, file: !35, line: 2387, baseType: !917, size: 32, align: 32, offset: 3776)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !967, file: !35, line: 2394, baseType: !937, size: 32, align: 32, offset: 3808)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !967, file: !35, line: 2401, baseType: !937, size: 32, align: 32, offset: 3840)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !967, file: !35, line: 2408, baseType: !937, size: 32, align: 32, offset: 3872)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !967, file: !35, line: 2415, baseType: !937, size: 32, align: 32, offset: 3904)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !967, file: !35, line: 2422, baseType: !937, size: 32, align: 32, offset: 3936)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !967, file: !35, line: 2423, baseType: !1394, size: 64, align: 64, offset: 3968)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1397)
!1397 = !{!1398, !1399, !1400, !1401}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1396, file: !35, line: 827, baseType: !937, size: 32, align: 32)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1396, file: !35, line: 828, baseType: !937, size: 32, align: 32, offset: 32)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1396, file: !35, line: 829, baseType: !937, size: 32, align: 32, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1396, file: !35, line: 830, baseType: !917, size: 32, align: 32, offset: 96)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !967, file: !35, line: 2430, baseType: !1130, size: 64, align: 64, offset: 4032)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !967, file: !35, line: 2437, baseType: !1130, size: 64, align: 64, offset: 4096)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !967, file: !35, line: 2444, baseType: !917, size: 32, align: 32, offset: 4160)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !967, file: !35, line: 2451, baseType: !917, size: 32, align: 32, offset: 4192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !967, file: !35, line: 2458, baseType: !937, size: 32, align: 32, offset: 4224)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !967, file: !35, line: 2469, baseType: !937, size: 32, align: 32, offset: 4256)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !967, file: !35, line: 2475, baseType: !937, size: 32, align: 32, offset: 4288)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !967, file: !35, line: 2481, baseType: !937, size: 32, align: 32, offset: 4320)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !967, file: !35, line: 2485, baseType: !937, size: 32, align: 32, offset: 4352)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !967, file: !35, line: 2489, baseType: !937, size: 32, align: 32, offset: 4384)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !967, file: !35, line: 2493, baseType: !937, size: 32, align: 32, offset: 4416)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !967, file: !35, line: 2501, baseType: !937, size: 32, align: 32, offset: 4448)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !967, file: !35, line: 2506, baseType: !937, size: 32, align: 32, offset: 4480)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !967, file: !35, line: 2510, baseType: !937, size: 32, align: 32, offset: 4512)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !967, file: !35, line: 2514, baseType: !1130, size: 64, align: 64, offset: 4544)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !967, file: !35, line: 2528, baseType: !1418, size: 64, align: 64, offset: 4608)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{null, !1310, !983, !937, !937}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !967, file: !35, line: 2534, baseType: !937, size: 32, align: 32, offset: 4672)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !967, file: !35, line: 2545, baseType: !937, size: 32, align: 32, offset: 4704)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !967, file: !35, line: 2547, baseType: !937, size: 32, align: 32, offset: 4736)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !967, file: !35, line: 2549, baseType: !937, size: 32, align: 32, offset: 4768)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !967, file: !35, line: 2551, baseType: !937, size: 32, align: 32, offset: 4800)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !967, file: !35, line: 2553, baseType: !937, size: 32, align: 32, offset: 4832)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !967, file: !35, line: 2555, baseType: !937, size: 32, align: 32, offset: 4864)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !967, file: !35, line: 2557, baseType: !937, size: 32, align: 32, offset: 4896)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !967, file: !35, line: 2559, baseType: !937, size: 32, align: 32, offset: 4928)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !967, file: !35, line: 2563, baseType: !937, size: 32, align: 32, offset: 4960)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !967, file: !35, line: 2571, baseType: !1126, size: 64, align: 64, offset: 4992)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !967, file: !35, line: 2579, baseType: !1126, size: 64, align: 64, offset: 5056)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !967, file: !35, line: 2586, baseType: !937, size: 32, align: 32, offset: 5120)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !967, file: !35, line: 2615, baseType: !937, size: 32, align: 32, offset: 5152)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !967, file: !35, line: 2627, baseType: !937, size: 32, align: 32, offset: 5184)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !967, file: !35, line: 2637, baseType: !937, size: 32, align: 32, offset: 5216)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !967, file: !35, line: 2681, baseType: !937, size: 32, align: 32, offset: 5248)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !967, file: !35, line: 2709, baseType: !1130, size: 64, align: 64, offset: 5312)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !967, file: !35, line: 2716, baseType: !1440, size: 64, align: 64, offset: 5376)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447, !1448, !1449, !1450, !1456, !1460, !1461, !1462, !1463, !1469, !1470, !1471, !1472, !1473}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1442, file: !35, line: 3642, baseType: !976, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1442, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1442, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1442, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1442, file: !35, line: 3669, baseType: !937, size: 32, align: 32, offset: 160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1442, file: !35, line: 3682, baseType: !1267, size: 64, align: 64, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1442, file: !35, line: 3698, baseType: !1451, size: 64, align: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!937, !965, !1454, !1095}
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1442, file: !35, line: 3712, baseType: !1457, size: 64, align: 64, offset: 320)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!937, !965, !937, !1454, !1095}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1442, file: !35, line: 3726, baseType: !1451, size: 64, align: 64, offset: 384)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1442, file: !35, line: 3737, baseType: !1065, size: 64, align: 64, offset: 448)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1442, file: !35, line: 3746, baseType: !937, size: 32, align: 32, offset: 512)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1442, file: !35, line: 3757, baseType: !1464, size: 64, align: 64, offset: 576)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{null, !1467}
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1442, file: !35, line: 3766, baseType: !1065, size: 64, align: 64, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1442, file: !35, line: 3774, baseType: !1065, size: 64, align: 64, offset: 704)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1442, file: !35, line: 3780, baseType: !937, size: 32, align: 32, offset: 768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1442, file: !35, line: 3785, baseType: !937, size: 32, align: 32, offset: 800)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1442, file: !35, line: 3795, baseType: !1474, size: 64, align: 64, offset: 832)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{!937, !965, !1141}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !967, file: !35, line: 2728, baseType: !983, size: 64, align: 64, offset: 5440)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !967, file: !35, line: 2735, baseType: !1194, size: 512, align: 64, offset: 5504)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !967, file: !35, line: 2742, baseType: !937, size: 32, align: 32, offset: 6016)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !967, file: !35, line: 2755, baseType: !937, size: 32, align: 32, offset: 6048)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !967, file: !35, line: 2776, baseType: !937, size: 32, align: 32, offset: 6080)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !967, file: !35, line: 2783, baseType: !937, size: 32, align: 32, offset: 6112)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !967, file: !35, line: 2791, baseType: !937, size: 32, align: 32, offset: 6144)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !967, file: !35, line: 2802, baseType: !1270, size: 64, align: 64, offset: 6208)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !967, file: !35, line: 2811, baseType: !937, size: 32, align: 32, offset: 6272)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !967, file: !35, line: 2821, baseType: !937, size: 32, align: 32, offset: 6304)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !967, file: !35, line: 2830, baseType: !937, size: 32, align: 32, offset: 6336)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !967, file: !35, line: 2840, baseType: !937, size: 32, align: 32, offset: 6368)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !967, file: !35, line: 2851, baseType: !1490, size: 64, align: 64, offset: 6400)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!937, !1310, !1493, !983, !1252, !937, !937}
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!937, !1310, !983}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !967, file: !35, line: 2871, baseType: !1497, size: 64, align: 64, offset: 6464)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!937, !1310, !1500, !983, !1252, !937}
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!937, !1310, !983, !937, !937}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !967, file: !35, line: 2878, baseType: !937, size: 32, align: 32, offset: 6528)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !967, file: !35, line: 2885, baseType: !937, size: 32, align: 32, offset: 6560)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !967, file: !35, line: 3005, baseType: !937, size: 32, align: 32, offset: 6592)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !967, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !967, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !967, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !967, file: !35, line: 3037, baseType: !1088, size: 64, align: 64, offset: 6720)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !967, file: !35, line: 3038, baseType: !937, size: 32, align: 32, offset: 6784)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !967, file: !35, line: 3050, baseType: !1046, size: 64, align: 64, offset: 6848)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !967, file: !35, line: 3065, baseType: !937, size: 32, align: 32, offset: 6912)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !967, file: !35, line: 3083, baseType: !937, size: 32, align: 32, offset: 6944)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !967, file: !35, line: 3092, baseType: !1029, size: 64, align: 32, offset: 6976)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !967, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !967, file: !35, line: 3106, baseType: !1029, size: 64, align: 32, offset: 7072)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !967, file: !35, line: 3113, baseType: !1518, size: 64, align: 64, offset: 7168)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1520)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1521)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1522)
!1522 = !{!1523, !1524, !1525, !1526, !1527, !1528, !1531}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1521, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1521, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1521, file: !35, line: 720, baseType: !976, size: 64, align: 64, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1521, file: !35, line: 724, baseType: !976, size: 64, align: 64, offset: 128)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1521, file: !35, line: 728, baseType: !937, size: 32, align: 32, offset: 192)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1521, file: !35, line: 734, baseType: !1529, size: 64, align: 64, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1521, file: !35, line: 739, baseType: !1532, size: 64, align: 64, offset: 320)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !967, file: !35, line: 3129, baseType: !1130, size: 64, align: 64, offset: 7232)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !967, file: !35, line: 3130, baseType: !1130, size: 64, align: 64, offset: 7296)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !967, file: !35, line: 3131, baseType: !1130, size: 64, align: 64, offset: 7360)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !967, file: !35, line: 3132, baseType: !1130, size: 64, align: 64, offset: 7424)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !967, file: !35, line: 3139, baseType: !1126, size: 64, align: 64, offset: 7488)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !967, file: !35, line: 3147, baseType: !937, size: 32, align: 32, offset: 7552)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !967, file: !35, line: 3165, baseType: !937, size: 32, align: 32, offset: 7584)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !967, file: !35, line: 3172, baseType: !937, size: 32, align: 32, offset: 7616)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !967, file: !35, line: 3180, baseType: !937, size: 32, align: 32, offset: 7648)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !967, file: !35, line: 3191, baseType: !1346, size: 64, align: 64, offset: 7680)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !967, file: !35, line: 3199, baseType: !1088, size: 64, align: 64, offset: 7744)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !967, file: !35, line: 3207, baseType: !1126, size: 64, align: 64, offset: 7808)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !967, file: !35, line: 3214, baseType: !1096, size: 32, align: 32, offset: 7872)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !967, file: !35, line: 3224, baseType: !1159, size: 64, align: 64, offset: 7936)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !967, file: !35, line: 3225, baseType: !937, size: 32, align: 32, offset: 8000)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !967, file: !35, line: 3249, baseType: !1141, size: 64, align: 64, offset: 8064)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !967, file: !35, line: 3256, baseType: !937, size: 32, align: 32, offset: 8128)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !967, file: !35, line: 3271, baseType: !937, size: 32, align: 32, offset: 8160)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !967, file: !35, line: 3279, baseType: !1130, size: 64, align: 64, offset: 8192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !967, file: !35, line: 3301, baseType: !1141, size: 64, align: 64, offset: 8256)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !967, file: !35, line: 3310, baseType: !937, size: 32, align: 32, offset: 8320)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !967, file: !35, line: 3337, baseType: !937, size: 32, align: 32, offset: 8352)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !967, file: !35, line: 3351, baseType: !937, size: 32, align: 32, offset: 8384)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !967, file: !35, line: 3359, baseType: !937, size: 32, align: 32, offset: 8416)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1560, line: 41, baseType: !1561)
!1560 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !888, line: 88, size: 896, align: 64, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1574, !1575, !1576, !1578, !1579, !1584, !1585, !1591, !1592, !1593, !1599, !1600, !1601}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1561, file: !888, line: 89, baseType: !937, size: 32, align: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1561, file: !888, line: 90, baseType: !937, size: 32, align: 32, offset: 32)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1561, file: !888, line: 91, baseType: !1346, size: 64, align: 64, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1561, file: !888, line: 92, baseType: !1567, size: 64, align: 64, offset: 128)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1560, line: 39, baseType: !1569)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1560, line: 37, size: 64, align: 32, elements: !1570)
!1570 = !{!1571, !1573}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1569, file: !1560, line: 38, baseType: !1572, size: 32, align: 32)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1560, line: 35, baseType: !917)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1569, file: !1560, line: 38, baseType: !1572, size: 32, align: 32, offset: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1561, file: !888, line: 93, baseType: !937, size: 32, align: 32, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1561, file: !888, line: 94, baseType: !937, size: 32, align: 32, offset: 224)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1561, file: !888, line: 96, baseType: !1577, size: 64, align: 64, offset: 256)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1561, file: !888, line: 97, baseType: !1577, size: 64, align: 64, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1561, file: !888, line: 101, baseType: !1580, size: 64, align: 64, offset: 384)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{null, !1583, !1567}
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1561, file: !888, line: 106, baseType: !1580, size: 64, align: 64, offset: 448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1561, file: !888, line: 107, baseType: !1586, size: 64, align: 64, offset: 512)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{null, !1583, !1577, !1589}
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1572)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1561, file: !888, line: 108, baseType: !1586, size: 64, align: 64, offset: 576)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1561, file: !888, line: 109, baseType: !1586, size: 64, align: 64, offset: 640)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1561, file: !888, line: 110, baseType: !1594, size: 64, align: 64, offset: 704)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{null, !1583, !1597, !1589}
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !888, line: 43, baseType: !917)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1561, file: !888, line: 111, baseType: !887, size: 32, align: 32, offset: 768)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1561, file: !888, line: 112, baseType: !893, size: 32, align: 32, offset: 800)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1561, file: !888, line: 113, baseType: !1602, size: 64, align: 64, offset: 832)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1603 = !{}
!1604 = !DILocalVariable(name: "avctx", arg: 1, scope: !962, file: !906, line: 80, type: !965)
!1605 = !DIExpression()
!1606 = !DILocation(line: 80, column: 66, scope: !962)
!1607 = !DILocalVariable(name: "mdct_ctx", arg: 2, scope: !962, file: !906, line: 80, type: !1558)
!1608 = !DILocation(line: 80, column: 85, scope: !962)
!1609 = !DILocation(line: 82, column: 5, scope: !962)
!1610 = !DILocation(line: 83, column: 5, scope: !962)
!1611 = !DILocation(line: 86, column: 18, scope: !962)
!1612 = !DILocation(line: 86, column: 5, scope: !962)
!1613 = !DILocation(line: 87, column: 1, scope: !962)
!1614 = distinct !DISubprogram(name: "ff_atrac3p_init_wave_synth", scope: !906, file: !906, line: 97, type: !1615, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1603)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{null}
!1617 = !DILocalVariable(name: "i", scope: !1614, file: !906, line: 99, type: !937)
!1618 = !DILocation(line: 99, column: 9, scope: !1614)
!1619 = !DILocation(line: 102, column: 12, scope: !1620)
!1620 = distinct !DILexicalBlock(scope: !1614, file: !906, line: 102, column: 5)
!1621 = !DILocation(line: 102, column: 10, scope: !1620)
!1622 = !DILocation(line: 102, column: 17, scope: !1623)
!1623 = !DILexicalBlockFile(scope: !1624, file: !906, discriminator: 1)
!1624 = distinct !DILexicalBlock(scope: !1620, file: !906, line: 102, column: 5)
!1625 = !DILocation(line: 102, column: 19, scope: !1623)
!1626 = !DILocation(line: 102, column: 5, scope: !1623)
!1627 = !DILocation(line: 103, column: 32, scope: !1624)
!1628 = !DILocation(line: 103, column: 30, scope: !1624)
!1629 = !DILocation(line: 103, column: 34, scope: !1624)
!1630 = !DILocation(line: 103, column: 25, scope: !1624)
!1631 = !DILocation(line: 103, column: 20, scope: !1624)
!1632 = !DILocation(line: 103, column: 9, scope: !1624)
!1633 = !DILocation(line: 103, column: 23, scope: !1624)
!1634 = !DILocation(line: 102, column: 28, scope: !1635)
!1635 = !DILexicalBlockFile(scope: !1624, file: !906, discriminator: 2)
!1636 = !DILocation(line: 102, column: 5, scope: !1635)
!1637 = distinct !{!1637, !1638}
!1638 = !DILocation(line: 102, column: 5, scope: !1614)
!1639 = !DILocation(line: 106, column: 12, scope: !1640)
!1640 = distinct !DILexicalBlock(scope: !1614, file: !906, line: 106, column: 5)
!1641 = !DILocation(line: 106, column: 10, scope: !1640)
!1642 = !DILocation(line: 106, column: 17, scope: !1643)
!1643 = !DILexicalBlockFile(scope: !1644, file: !906, discriminator: 1)
!1644 = distinct !DILexicalBlock(scope: !1640, file: !906, line: 106, column: 5)
!1645 = !DILocation(line: 106, column: 19, scope: !1643)
!1646 = !DILocation(line: 106, column: 5, scope: !1643)
!1647 = !DILocation(line: 107, column: 41, scope: !1644)
!1648 = !DILocation(line: 107, column: 39, scope: !1644)
!1649 = !DILocation(line: 107, column: 43, scope: !1644)
!1650 = !DILocation(line: 107, column: 34, scope: !1644)
!1651 = !DILocation(line: 107, column: 32, scope: !1644)
!1652 = !DILocation(line: 107, column: 54, scope: !1644)
!1653 = !DILocation(line: 107, column: 26, scope: !1644)
!1654 = !DILocation(line: 107, column: 21, scope: !1644)
!1655 = !DILocation(line: 107, column: 9, scope: !1644)
!1656 = !DILocation(line: 107, column: 24, scope: !1644)
!1657 = !DILocation(line: 106, column: 27, scope: !1658)
!1658 = !DILexicalBlockFile(scope: !1644, file: !906, discriminator: 2)
!1659 = !DILocation(line: 106, column: 5, scope: !1658)
!1660 = distinct !{!1660, !1661}
!1661 = !DILocation(line: 106, column: 5, scope: !1614)
!1662 = !DILocation(line: 110, column: 12, scope: !1663)
!1663 = distinct !DILexicalBlock(scope: !1614, file: !906, line: 110, column: 5)
!1664 = !DILocation(line: 110, column: 10, scope: !1663)
!1665 = !DILocation(line: 110, column: 17, scope: !1666)
!1666 = !DILexicalBlockFile(scope: !1667, file: !906, discriminator: 1)
!1667 = distinct !DILexicalBlock(scope: !1663, file: !906, line: 110, column: 5)
!1668 = !DILocation(line: 110, column: 19, scope: !1666)
!1669 = !DILocation(line: 110, column: 5, scope: !1666)
!1670 = !DILocation(line: 111, column: 32, scope: !1667)
!1671 = !DILocation(line: 111, column: 34, scope: !1667)
!1672 = !DILocation(line: 111, column: 31, scope: !1667)
!1673 = !DILocation(line: 111, column: 39, scope: !1667)
!1674 = !DILocation(line: 111, column: 25, scope: !1667)
!1675 = !DILocation(line: 111, column: 20, scope: !1667)
!1676 = !DILocation(line: 111, column: 9, scope: !1667)
!1677 = !DILocation(line: 111, column: 23, scope: !1667)
!1678 = !DILocation(line: 110, column: 26, scope: !1679)
!1679 = !DILexicalBlockFile(scope: !1667, file: !906, discriminator: 2)
!1680 = !DILocation(line: 110, column: 5, scope: !1679)
!1681 = distinct !{!1681, !1682}
!1682 = !DILocation(line: 110, column: 5, scope: !1614)
!1683 = !DILocation(line: 112, column: 1, scope: !1614)
!1684 = distinct !DISubprogram(name: "ff_atrac3p_generate_tones", scope: !906, file: !906, line: 184, type: !1685, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1603)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{null, !1687, !1810, !937, !937, !1819}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pChanUnitCtx", file: !898, line: 154, baseType: !1689)
!1689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pChanUnitCtx", file: !898, line: 131, size: 295168, align: 256, elements: !1690)
!1690 = !{!1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1703, !1704, !1770, !1793, !1795, !1796, !1807}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !1689, file: !898, line: 133, baseType: !937, size: 32, align: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "num_quant_units", scope: !1689, file: !898, line: 134, baseType: !937, size: 32, align: 32, offset: 32)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "num_subbands", scope: !1689, file: !898, line: 135, baseType: !937, size: 32, align: 32, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "used_quant_units", scope: !1689, file: !898, line: 136, baseType: !937, size: 32, align: 32, offset: 96)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "num_coded_subbands", scope: !1689, file: !898, line: 137, baseType: !937, size: 32, align: 32, offset: 128)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "mute_flag", scope: !1689, file: !898, line: 138, baseType: !937, size: 32, align: 32, offset: 160)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "use_full_table", scope: !1689, file: !898, line: 139, baseType: !937, size: 32, align: 32, offset: 192)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "noise_present", scope: !1689, file: !898, line: 140, baseType: !937, size: 32, align: 32, offset: 224)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "noise_level_index", scope: !1689, file: !898, line: 141, baseType: !937, size: 32, align: 32, offset: 256)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "noise_table_index", scope: !1689, file: !898, line: 142, baseType: !937, size: 32, align: 32, offset: 288)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "swap_channels", scope: !1689, file: !898, line: 143, baseType: !1702, size: 128, align: 8, offset: 320)
!1702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 128, align: 8, elements: !938)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "negate_coeffs", scope: !1689, file: !898, line: 144, baseType: !1702, size: 128, align: 8, offset: 448)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1689, file: !898, line: 145, baseType: !1705, size: 124800, align: 64, offset: 576)
!1705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1706, size: 124800, align: 64, elements: !1769)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pChanParams", file: !898, line: 116, baseType: !1707)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pChanParams", file: !898, line: 89, size: 62400, align: 64, elements: !1708)
!1708 = !{!1709, !1710, !1711, !1712, !1713, !1714, !1718, !1719, !1720, !1724, !1728, !1732, !1733, !1734, !1746, !1748, !1749, !1750, !1766, !1768}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "ch_num", scope: !1707, file: !898, line: 90, baseType: !937, size: 32, align: 32)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "num_coded_vals", scope: !1707, file: !898, line: 91, baseType: !937, size: 32, align: 32, offset: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "fill_mode", scope: !1707, file: !898, line: 92, baseType: !937, size: 32, align: 32, offset: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "split_point", scope: !1707, file: !898, line: 93, baseType: !937, size: 32, align: 32, offset: 96)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "table_type", scope: !1707, file: !898, line: 94, baseType: !937, size: 32, align: 32, offset: 128)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "qu_wordlen", scope: !1707, file: !898, line: 95, baseType: !1715, size: 1024, align: 32, offset: 160)
!1715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 1024, align: 32, elements: !1716)
!1716 = !{!1717}
!1717 = !DISubrange(count: 32)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "qu_sf_idx", scope: !1707, file: !898, line: 96, baseType: !1715, size: 1024, align: 32, offset: 1184)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "qu_tab_idx", scope: !1707, file: !898, line: 97, baseType: !1715, size: 1024, align: 32, offset: 2208)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum", scope: !1707, file: !898, line: 98, baseType: !1721, size: 32768, align: 16, offset: 3232)
!1721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1722, size: 32768, align: 16, elements: !926)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !910, line: 37, baseType: !1723)
!1723 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "power_levs", scope: !1707, file: !898, line: 99, baseType: !1725, size: 40, align: 8, offset: 36000)
!1725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 40, align: 8, elements: !1726)
!1726 = !{!1727}
!1727 = !DISubrange(count: 5)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "wnd_shape_hist", scope: !1707, file: !898, line: 102, baseType: !1729, size: 256, align: 8, offset: 36040)
!1729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 256, align: 8, elements: !1730)
!1730 = !{!1731, !939}
!1731 = !DISubrange(count: 2)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "wnd_shape", scope: !1707, file: !898, line: 103, baseType: !1088, size: 64, align: 64, offset: 36352)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "wnd_shape_prev", scope: !1707, file: !898, line: 104, baseType: !1088, size: 64, align: 64, offset: 36416)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "gain_data_hist", scope: !1707, file: !898, line: 107, baseType: !1735, size: 15360, align: 32, offset: 36480)
!1735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1736, size: 15360, align: 32, elements: !1730)
!1736 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtracGainInfo", file: !1737, line: 39, baseType: !1738)
!1737 = !DIFile(filename: "libavcodec/atrac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtracGainInfo", file: !1737, line: 35, size: 480, align: 32, elements: !1739)
!1739 = !{!1740, !1741, !1745}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "num_points", scope: !1738, file: !1737, line: 36, baseType: !937, size: 32, align: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "lev_code", scope: !1738, file: !1737, line: 37, baseType: !1742, size: 224, align: 32, offset: 32)
!1742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 224, align: 32, elements: !1743)
!1743 = !{!1744}
!1744 = !DISubrange(count: 7)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "loc_code", scope: !1738, file: !1737, line: 38, baseType: !1742, size: 224, align: 32, offset: 256)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "gain_data", scope: !1707, file: !898, line: 108, baseType: !1747, size: 64, align: 64, offset: 51840)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "gain_data_prev", scope: !1707, file: !898, line: 109, baseType: !1747, size: 64, align: 64, offset: 51904)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "num_gain_subbands", scope: !1707, file: !898, line: 110, baseType: !937, size: 32, align: 32, offset: 51968)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "tones_info_hist", scope: !1707, file: !898, line: 113, baseType: !1751, size: 10240, align: 32, offset: 52000)
!1751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1752, size: 10240, align: 32, elements: !1730)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWavesData", file: !898, line: 78, baseType: !1753)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWavesData", file: !898, line: 73, size: 320, align: 32, elements: !1754)
!1754 = !{!1755, !1763, !1764, !1765}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "pend_env", scope: !1753, file: !898, line: 74, baseType: !1756, size: 128, align: 32)
!1756 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWaveEnvelope", file: !898, line: 70, baseType: !1757)
!1757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWaveEnvelope", file: !898, line: 65, size: 128, align: 32, elements: !1758)
!1758 = !{!1759, !1760, !1761, !1762}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "has_start_point", scope: !1757, file: !898, line: 66, baseType: !937, size: 32, align: 32)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "has_stop_point", scope: !1757, file: !898, line: 67, baseType: !937, size: 32, align: 32, offset: 32)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !1757, file: !898, line: 68, baseType: !937, size: 32, align: 32, offset: 64)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "stop_pos", scope: !1757, file: !898, line: 69, baseType: !937, size: 32, align: 32, offset: 96)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "curr_env", scope: !1753, file: !898, line: 75, baseType: !1756, size: 128, align: 32, offset: 128)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "num_wavs", scope: !1753, file: !898, line: 76, baseType: !937, size: 32, align: 32, offset: 256)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "start_index", scope: !1753, file: !898, line: 77, baseType: !937, size: 32, align: 32, offset: 288)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "tones_info", scope: !1707, file: !898, line: 114, baseType: !1767, size: 64, align: 64, offset: 62272)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64, align: 64)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "tones_info_prev", scope: !1707, file: !898, line: 115, baseType: !1767, size: 64, align: 64, offset: 62336)
!1769 = !{!1731}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "wave_synth_hist", scope: !1689, file: !898, line: 148, baseType: !1771, size: 13312, align: 32, offset: 125376)
!1771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1772, size: 13312, align: 32, elements: !1769)
!1772 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWaveSynthParams", file: !898, line: 128, baseType: !1773)
!1773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWaveSynthParams", file: !898, line: 119, size: 6656, align: 32, elements: !1774)
!1774 = !{!1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "tones_present", scope: !1773, file: !898, line: 120, baseType: !937, size: 32, align: 32)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude_mode", scope: !1773, file: !898, line: 121, baseType: !937, size: 32, align: 32, offset: 32)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "num_tone_bands", scope: !1773, file: !898, line: 122, baseType: !937, size: 32, align: 32, offset: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "tone_sharing", scope: !1773, file: !898, line: 123, baseType: !1702, size: 128, align: 8, offset: 96)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "tone_master", scope: !1773, file: !898, line: 124, baseType: !1702, size: 128, align: 8, offset: 224)
