; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegvideo_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegvideo_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!863 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!864 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !531, line: 493, size: 32, align: 32, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!867 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!868 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!869 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!870 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!871 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!872 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!873 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!874 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!875 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!876 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!877 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!878 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!879 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!880 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!881 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!882 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!883 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !531, line: 538, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893}
!886 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!889 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!890 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!891 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!892 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!893 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !907, line: 123, size: 32, align: 32, elements: !908)
!907 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!908 = !{!909, !910, !911, !912}
!909 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!910 = !DIEnumerator(name: "FMT_H261", value: 1)
!911 = !DIEnumerator(name: "FMT_H263", value: 2)
!912 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !914, line: 37, size: 32, align: 32, elements: !915)
!914 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!915 = !{!916, !917, !918, !919, !920, !921}
!916 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!917 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!918 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!919 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930}
!924 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!925 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!926 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!927 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!928 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!929 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!930 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!931 = !{!932}
!932 = distinct !DIGlobalVariable(name: "ff_mpegvideo_parser", scope: !0, file: !933, line: 239, type: !934, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_mpegvideo_parser)
!933 = !DIFile(filename: "libavcodec/mpegvideo_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !936)
!936 = !{!937, !942, !943, !995, !2649, !2653, !2657}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !935, file: !4, line: 5260, baseType: !938, size: 160, align: 32)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 160, align: 32, elements: !940)
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !{!941}
!941 = !DISubrange(count: 5)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !935, file: !4, line: 5261, baseType: !939, size: 32, align: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !935, file: !4, line: 5262, baseType: !944, size: 64, align: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!939, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !950)
!950 = !{!951, !953, !955, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !949, file: !4, line: 5093, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !949, file: !4, line: 5094, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !949, file: !4, line: 5095, baseType: !956, size: 64, align: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !957, line: 40, baseType: !958)
!957 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!958 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !949, file: !4, line: 5096, baseType: !956, size: 64, align: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !949, file: !4, line: 5098, baseType: !956, size: 64, align: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !949, file: !4, line: 5100, baseType: !939, size: 32, align: 32, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !949, file: !4, line: 5110, baseType: !939, size: 32, align: 32, offset: 352)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !949, file: !4, line: 5111, baseType: !956, size: 64, align: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !949, file: !4, line: 5112, baseType: !956, size: 64, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !949, file: !4, line: 5115, baseType: !956, size: 64, align: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !949, file: !4, line: 5116, baseType: !956, size: 64, align: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !949, file: !4, line: 5117, baseType: !939, size: 32, align: 32, offset: 640)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !949, file: !4, line: 5120, baseType: !939, size: 32, align: 32, offset: 672)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !949, file: !4, line: 5121, baseType: !970, size: 256, align: 64, offset: 704)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 256, align: 64, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 4)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !949, file: !4, line: 5122, baseType: !970, size: 256, align: 64, offset: 960)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !949, file: !4, line: 5123, baseType: !970, size: 256, align: 64, offset: 1216)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !949, file: !4, line: 5125, baseType: !939, size: 32, align: 32, offset: 1472)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !949, file: !4, line: 5132, baseType: !956, size: 64, align: 64, offset: 1536)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !949, file: !4, line: 5133, baseType: !970, size: 256, align: 64, offset: 1600)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !949, file: !4, line: 5141, baseType: !939, size: 32, align: 32, offset: 1856)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !949, file: !4, line: 5148, baseType: !956, size: 64, align: 64, offset: 1920)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !949, file: !4, line: 5161, baseType: !939, size: 32, align: 32, offset: 1984)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !949, file: !4, line: 5176, baseType: !939, size: 32, align: 32, offset: 2016)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !949, file: !4, line: 5190, baseType: !939, size: 32, align: 32, offset: 2048)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !949, file: !4, line: 5197, baseType: !970, size: 256, align: 64, offset: 2112)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !949, file: !4, line: 5202, baseType: !956, size: 64, align: 64, offset: 2368)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !949, file: !4, line: 5207, baseType: !956, size: 64, align: 64, offset: 2432)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !949, file: !4, line: 5214, baseType: !939, size: 32, align: 32, offset: 2496)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !949, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !949, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !949, file: !4, line: 5234, baseType: !939, size: 32, align: 32, offset: 2592)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !949, file: !4, line: 5239, baseType: !939, size: 32, align: 32, offset: 2624)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !949, file: !4, line: 5240, baseType: !939, size: 32, align: 32, offset: 2656)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !949, file: !4, line: 5245, baseType: !939, size: 32, align: 32, offset: 2688)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !949, file: !4, line: 5246, baseType: !939, size: 32, align: 32, offset: 2720)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !949, file: !4, line: 5256, baseType: !939, size: 32, align: 32, offset: 2752)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !935, file: !4, line: 5265, baseType: !996, size: 64, align: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!939, !947, !999, !2648, !1324, !1148, !939}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1002)
!1002 = !{!1003, !1085, !1086, !1087, !1354, !1355, !1356, !1357, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1510, !1514, !1515, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2586, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1001, file: !4, line: 1561, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !41, line: 143, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !41, line: 67, size: 640, align: 64, elements: !1008)
!1008 = !{!1009, !1013, !1017, !1044, !1045, !1046, !1047, !1051, !1057, !1059, !1063}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1007, file: !41, line: 72, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1007, file: !41, line: 78, baseType: !1014, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1010, !952}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1007, file: !41, line: 85, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 246, size: 512, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1040, !1041, !1042, !1043}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !19, line: 247, baseType: !1010, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1020, file: !19, line: 253, baseType: !1010, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1020, file: !19, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1020, file: !19, line: 260, baseType: !18, size: 32, align: 32, offset: 160)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1020, file: !19, line: 271, baseType: !1027, size: 64, align: 64, offset: 192)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !19, line: 265, size: 64, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1032, !1033}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1027, file: !19, line: 266, baseType: !956, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1027, file: !19, line: 267, baseType: !1031, size: 64, align: 64)
!1031 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1027, file: !19, line: 268, baseType: !1010, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1027, file: !19, line: 270, baseType: !1034, size: 64, align: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1035, line: 61, baseType: !1036)
!1035 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1035, line: 58, size: 64, align: 32, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1036, file: !1035, line: 59, baseType: !939, size: 32, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1036, file: !1035, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1020, file: !19, line: 272, baseType: !1031, size: 64, align: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1020, file: !19, line: 273, baseType: !1031, size: 64, align: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !19, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1020, file: !19, line: 300, baseType: !1010, size: 64, align: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1007, file: !41, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1007, file: !41, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1007, file: !41, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1007, file: !41, line: 113, baseType: !1048, size: 64, align: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!952, !952, !952}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1007, file: !41, line: 123, baseType: !1052, size: 64, align: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1055, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1007, file: !41, line: 130, baseType: !1058, size: 32, align: 32, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !41, line: 48, baseType: !40)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1007, file: !41, line: 136, baseType: !1060, size: 64, align: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1058, !952}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1007, file: !41, line: 142, baseType: !1064, size: 64, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!939, !1067, !952, !1010, !939}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 329, size: 128, align: 64, elements: !1070)
!1070 = !{!1071, !1083, !1084}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1069, file: !19, line: 360, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !19, line: 324, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !19, line: 306, size: 384, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1075, file: !19, line: 307, baseType: !1010, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1075, file: !19, line: 313, baseType: !1031, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1075, file: !19, line: 313, baseType: !1031, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1075, file: !19, line: 318, baseType: !1031, size: 64, align: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1075, file: !19, line: 318, baseType: !1031, size: 64, align: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1075, file: !19, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1069, file: !19, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1069, file: !19, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1001, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1001, file: !4, line: 1564, baseType: !61, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1001, file: !4, line: 1565, baseType: !1088, size: 64, align: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1100, !1103, !1106, !1109, !1114, !1117, !1118, !1126, !1127, !1128, !1130, !1134, !1140, !1151, !1155, !1156, !1204, !1325, !1329, !1330, !1334, !1338, !1343, !1347, !1348, !1349}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1090, file: !4, line: 3475, baseType: !1010, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1090, file: !4, line: 3480, baseType: !1010, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !4, line: 3481, baseType: !61, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1090, file: !4, line: 3482, baseType: !71, size: 32, align: 32, offset: 160)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1090, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1090, file: !4, line: 3488, baseType: !1098, size: 64, align: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1090, file: !4, line: 3489, baseType: !1101, size: 64, align: 64, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1090, file: !4, line: 3490, baseType: !1104, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1090, file: !4, line: 3491, baseType: !1107, size: 64, align: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1090, file: !4, line: 3492, baseType: !1110, size: 64, align: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !957, line: 55, baseType: !1113)
!1113 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1090, file: !4, line: 3493, baseType: !1115, size: 8, align: 8, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !957, line: 48, baseType: !1116)
!1116 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1090, file: !4, line: 3494, baseType: !1004, size: 64, align: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1090, file: !4, line: 3495, baseType: !1119, size: 64, align: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1122, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !4, line: 3403, baseType: !1010, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1090, file: !4, line: 3507, baseType: !1010, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1090, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !4, line: 3517, baseType: !1129, size: 64, align: 64, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1090, file: !4, line: 3527, baseType: !1131, size: 64, align: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!939, !999}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1090, file: !4, line: 3535, baseType: !1135, size: 64, align: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!939, !999, !1138}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1090, file: !4, line: 3541, baseType: !1141, size: 64, align: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1145, line: 223, size: 128, align: 64, elements: !1146)
!1145 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1146 = !{!1147, !1150}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1144, file: !1145, line: 224, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1144, file: !1145, line: 225, baseType: !1148, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1090, file: !4, line: 3549, baseType: !1152, size: 64, align: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1129}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1090, file: !4, line: 3551, baseType: !1131, size: 64, align: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1090, file: !4, line: 3552, baseType: !1157, size: 64, align: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!939, !999, !1160, !939, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1164)
!1164 = !{!1165, !1168, !1171, !1172, !1173, !1203}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1163, file: !4, line: 3921, baseType: !1166, size: 16, align: 16)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !957, line: 49, baseType: !1167)
!1167 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1163, file: !4, line: 3922, baseType: !1169, size: 32, align: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !957, line: 51, baseType: !1170)
!1170 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1163, file: !4, line: 3923, baseType: !1169, size: 32, align: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1163, file: !4, line: 3924, baseType: !1170, size: 32, align: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1163, file: !4, line: 3925, baseType: !1174, size: 64, align: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1194, !1196, !1198, !1199, !1201, !1202}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1177, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1177, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1177, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1177, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1177, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1177, file: !4, line: 3897, baseType: !1185, size: 768, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1187)
!1187 = !{!1188, !1192}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !4, line: 3855, baseType: !1189, size: 512, align: 64)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 512, align: 64, elements: !1190)
!1190 = !{!1191}
!1191 = !DISubrange(count: 8)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1186, file: !4, line: 3857, baseType: !1193, size: 256, align: 32, offset: 512)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1190)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !4, line: 3903, baseType: !1195, size: 256, align: 64, offset: 960)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 256, align: 64, elements: !971)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1177, file: !4, line: 3904, baseType: !1197, size: 128, align: 32, offset: 1216)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !971)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !4, line: 3906, baseType: !747, size: 32, align: 32, offset: 1344)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1177, file: !4, line: 3908, baseType: !1200, size: 64, align: 64, offset: 1408)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1177, file: !4, line: 3915, baseType: !1200, size: 64, align: 64, offset: 1472)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1163, file: !4, line: 3926, baseType: !956, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1090, file: !4, line: 3564, baseType: !1205, size: 64, align: 64, offset: 1344)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!939, !999, !1208, !1242, !1324}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1211)
!1211 = !{!1212, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1238, !1239, !1240, !1241}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1210, file: !4, line: 1451, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1215, line: 94, baseType: !1216)
!1215 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1215, line: 81, size: 192, align: 64, elements: !1217)
!1217 = !{!1218, !1222, !1223}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1216, file: !1215, line: 82, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1215, line: 73, baseType: !1221)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1215, line: 73, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !1215, line: 89, baseType: !1160, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1216, file: !1215, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1210, file: !4, line: 1461, baseType: !956, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1210, file: !4, line: 1467, baseType: !956, size: 64, align: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1210, file: !4, line: 1468, baseType: !1160, size: 64, align: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1210, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1210, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1210, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1210, file: !4, line: 1479, baseType: !1231, size: 64, align: 64, offset: 384)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1233, file: !4, line: 1412, baseType: !1160, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1233, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1233, file: !4, line: 1414, baseType: !753, size: 32, align: 32, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1210, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1210, file: !4, line: 1486, baseType: !956, size: 64, align: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1210, file: !4, line: 1488, baseType: !956, size: 64, align: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1210, file: !4, line: 1497, baseType: !956, size: 64, align: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !794, line: 646, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !794, line: 268, size: 4288, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1276, !1278, !1279, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1313, !1314, !1315, !1316, !1317, !1320, !1321, !1322, !1323}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !794, line: 282, baseType: !1189, size: 512, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1245, file: !794, line: 299, baseType: !1193, size: 256, align: 32, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1245, file: !794, line: 315, baseType: !1250, size: 64, align: 64, offset: 768)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1245, file: !794, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1245, file: !794, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1245, file: !794, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1245, file: !794, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1245, file: !794, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1245, file: !794, line: 351, baseType: !783, size: 32, align: 32, offset: 992)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1245, file: !794, line: 356, baseType: !1034, size: 64, align: 32, offset: 1024)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1245, file: !794, line: 361, baseType: !956, size: 64, align: 64, offset: 1088)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1245, file: !794, line: 369, baseType: !956, size: 64, align: 64, offset: 1152)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1245, file: !794, line: 377, baseType: !956, size: 64, align: 64, offset: 1216)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1245, file: !794, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1245, file: !794, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1245, file: !794, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1245, file: !794, line: 396, baseType: !952, size: 64, align: 64, offset: 1408)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1245, file: !794, line: 403, baseType: !1266, size: 512, align: 64, offset: 1472)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 512, align: 64, elements: !1190)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1245, file: !794, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1245, file: !794, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1245, file: !794, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1245, file: !794, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1245, file: !794, line: 435, baseType: !956, size: 64, align: 64, offset: 2112)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1245, file: !794, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1245, file: !794, line: 445, baseType: !1112, size: 64, align: 64, offset: 2240)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1245, file: !794, line: 459, baseType: !1275, size: 512, align: 64, offset: 2304)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 512, align: 64, elements: !1190)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1245, file: !794, line: 473, baseType: !1277, size: 64, align: 64, offset: 2816)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1245, file: !794, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1245, file: !794, line: 479, baseType: !1280, size: 64, align: 64, offset: 2944)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !794, line: 207, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !794, line: 201, size: 320, align: 64, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1293}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1283, file: !794, line: 202, baseType: !793, size: 32, align: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1283, file: !794, line: 203, baseType: !1160, size: 64, align: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1283, file: !794, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1283, file: !794, line: 205, baseType: !1289, size: 64, align: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1291, line: 86, baseType: !1292)
!1291 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1291, line: 86, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1283, file: !794, line: 206, baseType: !1213, size: 64, align: 64, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1245, file: !794, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1245, file: !794, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1245, file: !794, line: 512, baseType: !817, size: 32, align: 32, offset: 3072)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1245, file: !794, line: 514, baseType: !823, size: 32, align: 32, offset: 3104)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1245, file: !794, line: 516, baseType: !841, size: 32, align: 32, offset: 3136)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1245, file: !794, line: 523, baseType: !865, size: 32, align: 32, offset: 3168)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1245, file: !794, line: 525, baseType: !884, size: 32, align: 32, offset: 3200)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1245, file: !794, line: 532, baseType: !956, size: 64, align: 64, offset: 3264)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1245, file: !794, line: 539, baseType: !956, size: 64, align: 64, offset: 3328)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1245, file: !794, line: 547, baseType: !956, size: 64, align: 64, offset: 3392)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1245, file: !794, line: 554, baseType: !1289, size: 64, align: 64, offset: 3456)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1245, file: !794, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1245, file: !794, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1245, file: !794, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1245, file: !794, line: 588, baseType: !1309, size: 64, align: 64, offset: 3648)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !957, line: 36, baseType: !1311)
!1311 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1245, file: !794, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1245, file: !794, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1245, file: !794, line: 599, baseType: !1213, size: 64, align: 64, offset: 3776)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1245, file: !794, line: 605, baseType: !1213, size: 64, align: 64, offset: 3840)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1245, file: !794, line: 616, baseType: !1213, size: 64, align: 64, offset: 3904)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1245, file: !794, line: 626, baseType: !1318, size: 64, align: 64, offset: 3968)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1319, line: 216, baseType: !1113)
!1319 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1245, file: !794, line: 627, baseType: !1318, size: 64, align: 64, offset: 4032)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1245, file: !794, line: 628, baseType: !1318, size: 64, align: 64, offset: 4096)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1245, file: !794, line: 629, baseType: !1318, size: 64, align: 64, offset: 4160)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1245, file: !794, line: 645, baseType: !1213, size: 64, align: 64, offset: 4224)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1090, file: !4, line: 3566, baseType: !1326, size: 64, align: 64, offset: 1408)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!939, !999, !952, !1324, !1208}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1090, file: !4, line: 3567, baseType: !1131, size: 64, align: 64, offset: 1472)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1090, file: !4, line: 3576, baseType: !1331, size: 64, align: 64, offset: 1536)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!939, !999, !1242}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1090, file: !4, line: 3577, baseType: !1335, size: 64, align: 64, offset: 1600)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!939, !999, !1208}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1090, file: !4, line: 3584, baseType: !1339, size: 64, align: 64, offset: 1664)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!939, !999, !1342}
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1090, file: !4, line: 3589, baseType: !1344, size: 64, align: 64, offset: 1728)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{null, !999}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1090, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1090, file: !4, line: 3600, baseType: !1010, size: 64, align: 64, offset: 1856)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1090, file: !4, line: 3609, baseType: !1350, size: 64, align: 64, offset: 1920)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1001, file: !4, line: 1566, baseType: !71, size: 32, align: 32, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1001, file: !4, line: 1581, baseType: !1170, size: 32, align: 32, offset: 224)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1001, file: !4, line: 1583, baseType: !952, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1001, file: !4, line: 1591, baseType: !1358, size: 64, align: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1145, line: 129, size: 1664, align: 64, elements: !1360)
!1360 = !{!1361, !1362, !1363, !1364, !1365, !1383, !1384, !1390, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1359, file: !1145, line: 136, baseType: !939, size: 32, align: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1359, file: !1145, line: 151, baseType: !939, size: 32, align: 32, offset: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1359, file: !1145, line: 157, baseType: !939, size: 32, align: 32, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1359, file: !1145, line: 159, baseType: !1342, size: 64, align: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1359, file: !1145, line: 161, baseType: !1366, size: 64, align: 64, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1145, line: 117, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1145, line: 100, size: 832, align: 64, elements: !1369)
!1369 = !{!1370, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1368, file: !1145, line: 105, baseType: !1371, size: 256, align: 64)
!1371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1372, size: 256, align: 64, elements: !971)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1215, line: 238, baseType: !1374)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1215, line: 238, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1368, file: !1145, line: 110, baseType: !939, size: 32, align: 32, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1368, file: !1145, line: 111, baseType: !939, size: 32, align: 32, offset: 288)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1368, file: !1145, line: 111, baseType: !939, size: 32, align: 32, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1368, file: !1145, line: 112, baseType: !1193, size: 256, align: 32, offset: 352)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1368, file: !1145, line: 113, baseType: !1197, size: 128, align: 32, offset: 608)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1368, file: !1145, line: 114, baseType: !939, size: 32, align: 32, offset: 736)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1368, file: !1145, line: 115, baseType: !939, size: 32, align: 32, offset: 768)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1368, file: !1145, line: 116, baseType: !939, size: 32, align: 32, offset: 800)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1359, file: !1145, line: 163, baseType: !952, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1359, file: !1145, line: 165, baseType: !1385, size: 128, align: 64, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1145, line: 122, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1145, line: 119, size: 128, align: 64, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1386, file: !1145, line: 120, baseType: !1208, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1386, file: !1145, line: 121, baseType: !1342, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1359, file: !1145, line: 166, baseType: !1391, size: 128, align: 64, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1145, line: 127, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1145, line: 124, size: 128, align: 64, elements: !1393)
!1393 = !{!1394, !1467}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1392, file: !1145, line: 125, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1399)
!1399 = !{!1400, !1401, !1425, !1429, !1430, !1464, !1465, !1466}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1398, file: !4, line: 5751, baseType: !1004, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1398, file: !4, line: 5756, baseType: !1402, size: 64, align: 64, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1405)
!1405 = !{!1406, !1407, !1410, !1411, !1412, !1416, !1420, !1424}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1404, file: !4, line: 5797, baseType: !1010, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1404, file: !4, line: 5804, baseType: !1408, size: 64, align: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1404, file: !4, line: 5815, baseType: !1004, size: 64, align: 64, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1404, file: !4, line: 5825, baseType: !939, size: 32, align: 32, offset: 192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1404, file: !4, line: 5826, baseType: !1413, size: 64, align: 64, offset: 256)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!939, !1396}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1404, file: !4, line: 5827, baseType: !1417, size: 64, align: 64, offset: 320)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!939, !1396, !1208}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1404, file: !4, line: 5828, baseType: !1421, size: 64, align: 64, offset: 384)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !1396}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1404, file: !4, line: 5829, baseType: !1421, size: 64, align: 64, offset: 448)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1398, file: !4, line: 5762, baseType: !1426, size: 64, align: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1428)
!1428 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1398, file: !4, line: 5768, baseType: !952, size: 64, align: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1398, file: !4, line: 5775, baseType: !1431, size: 64, align: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1433, file: !4, line: 3940, baseType: !61, size: 32, align: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1433, file: !4, line: 3944, baseType: !71, size: 32, align: 32, offset: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1433, file: !4, line: 3948, baseType: !1169, size: 32, align: 32, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1433, file: !4, line: 3958, baseType: !1160, size: 64, align: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1433, file: !4, line: 3962, baseType: !939, size: 32, align: 32, offset: 192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1433, file: !4, line: 3968, baseType: !939, size: 32, align: 32, offset: 224)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1433, file: !4, line: 3973, baseType: !956, size: 64, align: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1433, file: !4, line: 3986, baseType: !939, size: 32, align: 32, offset: 320)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1433, file: !4, line: 3999, baseType: !939, size: 32, align: 32, offset: 352)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1433, file: !4, line: 4004, baseType: !939, size: 32, align: 32, offset: 384)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1433, file: !4, line: 4005, baseType: !939, size: 32, align: 32, offset: 416)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1433, file: !4, line: 4010, baseType: !939, size: 32, align: 32, offset: 448)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1433, file: !4, line: 4011, baseType: !939, size: 32, align: 32, offset: 480)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1433, file: !4, line: 4020, baseType: !1034, size: 64, align: 32, offset: 512)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1433, file: !4, line: 4025, baseType: !3, size: 32, align: 32, offset: 576)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1433, file: !4, line: 4030, baseType: !817, size: 32, align: 32, offset: 608)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1433, file: !4, line: 4031, baseType: !823, size: 32, align: 32, offset: 640)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1433, file: !4, line: 4032, baseType: !841, size: 32, align: 32, offset: 672)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1433, file: !4, line: 4033, baseType: !865, size: 32, align: 32, offset: 704)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1433, file: !4, line: 4034, baseType: !884, size: 32, align: 32, offset: 736)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1433, file: !4, line: 4039, baseType: !939, size: 32, align: 32, offset: 768)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1433, file: !4, line: 4046, baseType: !1112, size: 64, align: 64, offset: 832)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1433, file: !4, line: 4050, baseType: !939, size: 32, align: 32, offset: 896)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1433, file: !4, line: 4054, baseType: !939, size: 32, align: 32, offset: 928)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1433, file: !4, line: 4061, baseType: !939, size: 32, align: 32, offset: 960)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1433, file: !4, line: 4065, baseType: !939, size: 32, align: 32, offset: 992)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1433, file: !4, line: 4073, baseType: !939, size: 32, align: 32, offset: 1024)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1433, file: !4, line: 4080, baseType: !939, size: 32, align: 32, offset: 1056)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1433, file: !4, line: 4084, baseType: !939, size: 32, align: 32, offset: 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1398, file: !4, line: 5781, baseType: !1431, size: 64, align: 64, offset: 320)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1398, file: !4, line: 5787, baseType: !1034, size: 64, align: 32, offset: 384)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1398, file: !4, line: 5793, baseType: !1034, size: 64, align: 32, offset: 448)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1392, file: !1145, line: 126, baseType: !939, size: 32, align: 32, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1359, file: !1145, line: 172, baseType: !1208, size: 64, align: 64, offset: 576)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1359, file: !1145, line: 177, baseType: !1160, size: 64, align: 64, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1359, file: !1145, line: 178, baseType: !1170, size: 32, align: 32, offset: 704)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1359, file: !1145, line: 180, baseType: !952, size: 64, align: 64, offset: 768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1359, file: !1145, line: 185, baseType: !939, size: 32, align: 32, offset: 832)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1359, file: !1145, line: 190, baseType: !952, size: 64, align: 64, offset: 896)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1359, file: !1145, line: 195, baseType: !939, size: 32, align: 32, offset: 960)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1359, file: !1145, line: 200, baseType: !1208, size: 64, align: 64, offset: 1024)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1359, file: !1145, line: 201, baseType: !939, size: 32, align: 32, offset: 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1359, file: !1145, line: 202, baseType: !1342, size: 64, align: 64, offset: 1152)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1359, file: !1145, line: 203, baseType: !939, size: 32, align: 32, offset: 1216)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1359, file: !1145, line: 205, baseType: !939, size: 32, align: 32, offset: 1248)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1359, file: !1145, line: 206, baseType: !939, size: 32, align: 32, offset: 1280)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1359, file: !1145, line: 209, baseType: !1318, size: 64, align: 64, offset: 1344)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1359, file: !1145, line: 212, baseType: !1318, size: 64, align: 64, offset: 1408)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1359, file: !1145, line: 213, baseType: !1342, size: 64, align: 64, offset: 1472)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1359, file: !1145, line: 215, baseType: !939, size: 32, align: 32, offset: 1536)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1359, file: !1145, line: 217, baseType: !939, size: 32, align: 32, offset: 1568)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1359, file: !1145, line: 220, baseType: !939, size: 32, align: 32, offset: 1600)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1001, file: !4, line: 1598, baseType: !952, size: 64, align: 64, offset: 384)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1001, file: !4, line: 1606, baseType: !956, size: 64, align: 64, offset: 448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1001, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1001, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1001, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1001, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1001, file: !4, line: 1657, baseType: !1160, size: 64, align: 64, offset: 704)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1001, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1001, file: !4, line: 1679, baseType: !1034, size: 64, align: 32, offset: 800)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1001, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1001, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1001, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1001, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1001, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1001, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1001, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1001, file: !4, line: 1766, baseType: !530, size: 32, align: 32, offset: 1088)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1001, file: !4, line: 1791, baseType: !1506, size: 64, align: 64, offset: 1152)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !1509, !1242, !1324, !939, !939, !939}
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1001, file: !4, line: 1808, baseType: !1511, size: 64, align: 64, offset: 1216)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!530, !1509, !1101}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1001, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1001, file: !4, line: 1825, baseType: !1516, size: 32, align: 32, offset: 1312)
!1516 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1001, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1001, file: !4, line: 1838, baseType: !1516, size: 32, align: 32, offset: 1376)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1001, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1001, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1001, file: !4, line: 1861, baseType: !1516, size: 32, align: 32, offset: 1472)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1001, file: !4, line: 1868, baseType: !1516, size: 32, align: 32, offset: 1504)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1001, file: !4, line: 1875, baseType: !1516, size: 32, align: 32, offset: 1536)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1001, file: !4, line: 1882, baseType: !1516, size: 32, align: 32, offset: 1568)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1001, file: !4, line: 1889, baseType: !1516, size: 32, align: 32, offset: 1600)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1001, file: !4, line: 1896, baseType: !1516, size: 32, align: 32, offset: 1632)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1001, file: !4, line: 1903, baseType: !1516, size: 32, align: 32, offset: 1664)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1001, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1001, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1001, file: !4, line: 1926, baseType: !1324, size: 64, align: 64, offset: 1792)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1001, file: !4, line: 1935, baseType: !1034, size: 64, align: 32, offset: 1856)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1001, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1001, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1001, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1001, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1001, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1001, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1001, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1001, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1001, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1001, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1001, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1001, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1001, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1001, file: !4, line: 2054, baseType: !1546, size: 64, align: 64, offset: 2368)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1001, file: !4, line: 2061, baseType: !1546, size: 64, align: 64, offset: 2432)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1001, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1001, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1001, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1001, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1001, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1001, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1001, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1001, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1001, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1001, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1001, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1001, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1001, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1001, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1001, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1001, file: !4, line: 2166, baseType: !823, size: 32, align: 32, offset: 2976)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1001, file: !4, line: 2173, baseType: !841, size: 32, align: 32, offset: 3008)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1001, file: !4, line: 2180, baseType: !865, size: 32, align: 32, offset: 3040)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1001, file: !4, line: 2187, baseType: !817, size: 32, align: 32, offset: 3072)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1001, file: !4, line: 2194, baseType: !884, size: 32, align: 32, offset: 3104)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1001, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1001, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1001, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1001, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1001, file: !4, line: 2220, baseType: !730, size: 32, align: 32, offset: 3264)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1001, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1001, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1001, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1001, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1001, file: !4, line: 2263, baseType: !1112, size: 64, align: 64, offset: 3456)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1001, file: !4, line: 2270, baseType: !1112, size: 64, align: 64, offset: 3520)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1001, file: !4, line: 2277, baseType: !894, size: 32, align: 32, offset: 3584)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1001, file: !4, line: 2285, baseType: !730, size: 32, align: 32, offset: 3616)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1001, file: !4, line: 2367, baseType: !1582, size: 64, align: 64, offset: 3648)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!939, !1509, !1342, !939}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1001, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1001, file: !4, line: 2386, baseType: !1516, size: 32, align: 32, offset: 3744)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1001, file: !4, line: 2387, baseType: !1516, size: 32, align: 32, offset: 3776)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1001, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1001, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1001, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1001, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1001, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1001, file: !4, line: 2423, baseType: !1594, size: 64, align: 64, offset: 3968)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1597)
!1597 = !{!1598, !1599, !1600, !1601}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1596, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1596, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1596, file: !4, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1596, file: !4, line: 830, baseType: !1516, size: 32, align: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1001, file: !4, line: 2430, baseType: !956, size: 64, align: 64, offset: 4032)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1001, file: !4, line: 2437, baseType: !956, size: 64, align: 64, offset: 4096)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1001, file: !4, line: 2444, baseType: !1516, size: 32, align: 32, offset: 4160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1001, file: !4, line: 2451, baseType: !1516, size: 32, align: 32, offset: 4192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1001, file: !4, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1001, file: !4, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1001, file: !4, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1001, file: !4, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1001, file: !4, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1001, file: !4, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1001, file: !4, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1001, file: !4, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1001, file: !4, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1001, file: !4, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1001, file: !4, line: 2514, baseType: !956, size: 64, align: 64, offset: 4544)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1001, file: !4, line: 2528, baseType: !1618, size: 64, align: 64, offset: 4608)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{null, !1509, !952, !939, !939}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1001, file: !4, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1001, file: !4, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1001, file: !4, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1001, file: !4, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1001, file: !4, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1001, file: !4, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1001, file: !4, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1001, file: !4, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1001, file: !4, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1001, file: !4, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1001, file: !4, line: 2571, baseType: !1200, size: 64, align: 64, offset: 4992)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1001, file: !4, line: 2579, baseType: !1200, size: 64, align: 64, offset: 5056)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1001, file: !4, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1001, file: !4, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1001, file: !4, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1001, file: !4, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1001, file: !4, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1001, file: !4, line: 2709, baseType: !956, size: 64, align: 64, offset: 5312)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1001, file: !4, line: 2716, baseType: !1640, size: 64, align: 64, offset: 5376)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1643)
!1643 = !{!1644, !1645, !1646, !1647, !1648, !1649, !1650, !1654, !1658, !1659, !1660, !1661, !2559, !2560, !2561, !2562, !2563}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1642, file: !4, line: 3642, baseType: !1010, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1642, file: !4, line: 3649, baseType: !61, size: 32, align: 32, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1642, file: !4, line: 3656, baseType: !71, size: 32, align: 32, offset: 96)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1642, file: !4, line: 3663, baseType: !530, size: 32, align: 32, offset: 128)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1642, file: !4, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1642, file: !4, line: 3682, baseType: !1339, size: 64, align: 64, offset: 192)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1642, file: !4, line: 3698, baseType: !1651, size: 64, align: 64, offset: 256)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!939, !999, !1148, !1169}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1642, file: !4, line: 3712, baseType: !1655, size: 64, align: 64, offset: 320)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!939, !999, !939, !1148, !1169}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1642, file: !4, line: 3726, baseType: !1651, size: 64, align: 64, offset: 384)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1642, file: !4, line: 3737, baseType: !1131, size: 64, align: 64, offset: 448)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1642, file: !4, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1642, file: !4, line: 3757, baseType: !1662, size: 64, align: 64, offset: 576)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{null, !1665}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1667, line: 81, size: 86208, align: 64, elements: !1668)
!1667 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
