; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mediacodec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mediacodec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVMediaCodecContext = type { i8* }

!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{i32 2, !"Dwarf Version", i32 4}
!888 = !{i32 2, !"Debug Info Version", i32 3}
!889 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!890 = distinct !DISubprogram(name: "av_mediacodec_alloc_context", scope: !891, file: !891, line: 125, type: !892, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !901)
!891 = !DIFile(filename: "libavcodec/mediacodec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!892 = !DISubroutineType(types: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMediaCodecContext", file: !896, line: 40, baseType: !897)
!896 = !DIFile(filename: "libavcodec/mediacodec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMediaCodecContext", file: !896, line: 33, size: 64, align: 64, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "surface", scope: !897, file: !896, line: 38, baseType: !900, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!901 = !{}
!902 = !DILocation(line: 127, column: 5, scope: !890)
!903 = distinct !DISubprogram(name: "av_mediacodec_default_init", scope: !891, file: !891, line: 130, type: !904, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !901)
!904 = !DISubroutineType(types: !905)
!905 = !{!906, !907, !894, !900}
!906 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !910)
!910 = !{!911, !955, !956, !957, !1229, !1230, !1231, !1232, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1258, !1262, !1263, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1444, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !909, file: !35, line: 1561, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !916)
!916 = !{!917, !921, !925, !929, !930, !931, !932, !936, !942, !944, !948}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !915, file: !4, line: 72, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !915, file: !4, line: 78, baseType: !922, size: 64, align: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!918, !900}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !915, file: !4, line: 85, baseType: !926, size: 64, align: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !915, file: !4, line: 93, baseType: !906, size: 32, align: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !915, file: !4, line: 99, baseType: !906, size: 32, align: 32, offset: 224)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !915, file: !4, line: 108, baseType: !906, size: 32, align: 32, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !915, file: !4, line: 113, baseType: !933, size: 64, align: 64, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!900, !900, !900}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !915, file: !4, line: 123, baseType: !937, size: 64, align: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!940, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !915, file: !4, line: 130, baseType: !943, size: 32, align: 32, offset: 448)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !915, file: !4, line: 136, baseType: !945, size: 64, align: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!943, !900}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !915, file: !4, line: 142, baseType: !949, size: 64, align: 64, offset: 576)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!906, !952, !900, !918, !906}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !909, file: !35, line: 1562, baseType: !906, size: 32, align: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !909, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !909, file: !35, line: 1565, baseType: !958, size: 64, align: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !961)
!961 = !{!962, !963, !964, !965, !966, !967, !976, !979, !982, !985, !991, !994, !995, !1003, !1004, !1005, !1007, !1011, !1017, !1022, !1026, !1027, !1079, !1200, !1204, !1205, !1209, !1213, !1218, !1222, !1223, !1224}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !960, file: !35, line: 3475, baseType: !918, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !960, file: !35, line: 3480, baseType: !918, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !960, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !960, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !960, file: !35, line: 3487, baseType: !906, size: 32, align: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !960, file: !35, line: 3488, baseType: !968, size: 64, align: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !971, line: 61, baseType: !972)
!971 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !971, line: 58, size: 64, align: 32, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !972, file: !971, line: 59, baseType: !906, size: 32, align: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !972, file: !971, line: 60, baseType: !906, size: 32, align: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !960, file: !35, line: 3489, baseType: !977, size: 64, align: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !960, file: !35, line: 3490, baseType: !980, size: 64, align: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !960, file: !35, line: 3491, baseType: !983, size: 64, align: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !960, file: !35, line: 3492, baseType: !986, size: 64, align: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !989, line: 55, baseType: !990)
!989 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!990 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !960, file: !35, line: 3493, baseType: !992, size: 8, align: 8, offset: 576)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !989, line: 48, baseType: !993)
!993 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !960, file: !35, line: 3494, baseType: !912, size: 64, align: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !960, file: !35, line: 3495, baseType: !996, size: 64, align: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !999, file: !35, line: 3402, baseType: !906, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !35, line: 3403, baseType: !918, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !960, file: !35, line: 3507, baseType: !918, size: 64, align: 64, offset: 768)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !960, file: !35, line: 3516, baseType: !906, size: 32, align: 32, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !35, line: 3517, baseType: !1006, size: 64, align: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !960, file: !35, line: 3527, baseType: !1008, size: 64, align: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!906, !907}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !960, file: !35, line: 3535, baseType: !1012, size: 64, align: 64, offset: 1024)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!906, !907, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !960, file: !35, line: 3541, baseType: !1018, size: 64, align: 64, offset: 1088)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1021)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !960, file: !35, line: 3549, baseType: !1023, size: 64, align: 64, offset: 1152)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !1006}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !960, file: !35, line: 3551, baseType: !1008, size: 64, align: 64, offset: 1216)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !960, file: !35, line: 3552, baseType: !1028, size: 64, align: 64, offset: 1280)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!906, !907, !1031, !906, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1035)
!1035 = !{!1036, !1039, !1042, !1043, !1044, !1076}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1034, file: !35, line: 3921, baseType: !1037, size: 16, align: 16)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !989, line: 49, baseType: !1038)
!1038 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1034, file: !35, line: 3922, baseType: !1040, size: 32, align: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !989, line: 51, baseType: !1041)
!1041 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1034, file: !35, line: 3923, baseType: !1040, size: 32, align: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1034, file: !35, line: 3924, baseType: !1041, size: 32, align: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1034, file: !35, line: 3925, baseType: !1045, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1065, !1069, !1071, !1072, !1074, !1075}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1048, file: !35, line: 3886, baseType: !906, size: 32, align: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1048, file: !35, line: 3887, baseType: !906, size: 32, align: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1048, file: !35, line: 3888, baseType: !906, size: 32, align: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1048, file: !35, line: 3889, baseType: !906, size: 32, align: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1048, file: !35, line: 3890, baseType: !906, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1048, file: !35, line: 3897, baseType: !1056, size: 768, align: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1058)
!1058 = !{!1059, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1057, file: !35, line: 3855, baseType: !1060, size: 512, align: 64)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 512, align: 64, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 8)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1057, file: !35, line: 3857, baseType: !1064, size: 256, align: 32, offset: 512)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 256, align: 32, elements: !1061)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !35, line: 3903, baseType: !1066, size: 256, align: 64, offset: 960)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 256, align: 64, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 4)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1048, file: !35, line: 3904, baseType: !1070, size: 128, align: 32, offset: 1216)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 128, align: 32, elements: !1067)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1048, file: !35, line: 3908, baseType: !1073, size: 64, align: 64, offset: 1408)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1048, file: !35, line: 3915, baseType: !1073, size: 64, align: 64, offset: 1472)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1048, file: !35, line: 3917, baseType: !906, size: 32, align: 32, offset: 1536)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1034, file: !35, line: 3926, baseType: !1077, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !989, line: 40, baseType: !1078)
!1078 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !960, file: !35, line: 3564, baseType: !1080, size: 64, align: 64, offset: 1344)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!906, !907, !1083, !1117, !1199}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1086)
!1086 = !{!1087, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1113, !1114, !1115, !1116}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1085, file: !35, line: 1451, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1090, line: 94, baseType: !1091)
!1090 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1090, line: 81, size: 192, align: 64, elements: !1092)
!1092 = !{!1093, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1091, file: !1090, line: 82, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1090, line: 73, baseType: !1096)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1090, line: 73, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1091, file: !1090, line: 89, baseType: !1031, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1091, file: !1090, line: 93, baseType: !906, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1085, file: !35, line: 1461, baseType: !1077, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1085, file: !35, line: 1467, baseType: !1077, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !35, line: 1468, baseType: !1031, size: 64, align: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1085, file: !35, line: 1469, baseType: !906, size: 32, align: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1085, file: !35, line: 1470, baseType: !906, size: 32, align: 32, offset: 288)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !35, line: 1474, baseType: !906, size: 32, align: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1085, file: !35, line: 1479, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !35, line: 1412, baseType: !1031, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !35, line: 1413, baseType: !906, size: 32, align: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1085, file: !35, line: 1480, baseType: !906, size: 32, align: 32, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1085, file: !35, line: 1486, baseType: !1077, size: 64, align: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1085, file: !35, line: 1488, baseType: !1077, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1085, file: !35, line: 1497, baseType: !1077, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1151, !1153, !1154, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !758, line: 282, baseType: !1060, size: 512, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1120, file: !758, line: 299, baseType: !1064, size: 256, align: 32, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1120, file: !758, line: 315, baseType: !1125, size: 64, align: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1120, file: !758, line: 326, baseType: !906, size: 32, align: 32, offset: 832)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1120, file: !758, line: 326, baseType: !906, size: 32, align: 32, offset: 864)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1120, file: !758, line: 334, baseType: !906, size: 32, align: 32, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1120, file: !758, line: 341, baseType: !906, size: 32, align: 32, offset: 928)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1120, file: !758, line: 346, baseType: !906, size: 32, align: 32, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1120, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1120, file: !758, line: 356, baseType: !970, size: 64, align: 32, offset: 1024)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1120, file: !758, line: 361, baseType: !1077, size: 64, align: 64, offset: 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1120, file: !758, line: 369, baseType: !1077, size: 64, align: 64, offset: 1152)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1120, file: !758, line: 377, baseType: !1077, size: 64, align: 64, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1120, file: !758, line: 382, baseType: !906, size: 32, align: 32, offset: 1280)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1120, file: !758, line: 386, baseType: !906, size: 32, align: 32, offset: 1312)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1120, file: !758, line: 391, baseType: !906, size: 32, align: 32, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1120, file: !758, line: 396, baseType: !900, size: 64, align: 64, offset: 1408)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1120, file: !758, line: 403, baseType: !1141, size: 512, align: 64, offset: 1472)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 512, align: 64, elements: !1061)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1120, file: !758, line: 410, baseType: !906, size: 32, align: 32, offset: 1984)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1120, file: !758, line: 415, baseType: !906, size: 32, align: 32, offset: 2016)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1120, file: !758, line: 420, baseType: !906, size: 32, align: 32, offset: 2048)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1120, file: !758, line: 425, baseType: !906, size: 32, align: 32, offset: 2080)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1120, file: !758, line: 435, baseType: !1077, size: 64, align: 64, offset: 2112)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1120, file: !758, line: 440, baseType: !906, size: 32, align: 32, offset: 2176)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1120, file: !758, line: 445, baseType: !988, size: 64, align: 64, offset: 2240)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1120, file: !758, line: 459, baseType: !1150, size: 512, align: 64, offset: 2304)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 512, align: 64, elements: !1061)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1120, file: !758, line: 473, baseType: !1152, size: 64, align: 64, offset: 2816)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1120, file: !758, line: 477, baseType: !906, size: 32, align: 32, offset: 2880)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1120, file: !758, line: 479, baseType: !1155, size: 64, align: 64, offset: 2944)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1168}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1158, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !758, line: 203, baseType: !1031, size: 64, align: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !758, line: 204, baseType: !906, size: 32, align: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1158, file: !758, line: 205, baseType: !1164, size: 64, align: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1166, line: 86, baseType: !1167)
!1166 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1166, line: 86, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1158, file: !758, line: 206, baseType: !1088, size: 64, align: 64, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1120, file: !758, line: 480, baseType: !906, size: 32, align: 32, offset: 3008)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1120, file: !758, line: 505, baseType: !906, size: 32, align: 32, offset: 3040)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1120, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1120, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1120, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1120, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1120, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1120, file: !758, line: 532, baseType: !1077, size: 64, align: 64, offset: 3264)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1120, file: !758, line: 539, baseType: !1077, size: 64, align: 64, offset: 3328)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1120, file: !758, line: 547, baseType: !1077, size: 64, align: 64, offset: 3392)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1120, file: !758, line: 554, baseType: !1164, size: 64, align: 64, offset: 3456)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1120, file: !758, line: 563, baseType: !906, size: 32, align: 32, offset: 3520)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1120, file: !758, line: 572, baseType: !906, size: 32, align: 32, offset: 3552)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1120, file: !758, line: 581, baseType: !906, size: 32, align: 32, offset: 3584)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1120, file: !758, line: 588, baseType: !1184, size: 64, align: 64, offset: 3648)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !989, line: 36, baseType: !1186)
!1186 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1120, file: !758, line: 593, baseType: !906, size: 32, align: 32, offset: 3712)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1120, file: !758, line: 596, baseType: !906, size: 32, align: 32, offset: 3744)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1120, file: !758, line: 599, baseType: !1088, size: 64, align: 64, offset: 3776)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1120, file: !758, line: 605, baseType: !1088, size: 64, align: 64, offset: 3840)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1120, file: !758, line: 616, baseType: !1088, size: 64, align: 64, offset: 3904)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1120, file: !758, line: 626, baseType: !1193, size: 64, align: 64, offset: 3968)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1194, line: 216, baseType: !990)
!1194 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1120, file: !758, line: 627, baseType: !1193, size: 64, align: 64, offset: 4032)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1120, file: !758, line: 628, baseType: !1193, size: 64, align: 64, offset: 4096)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1120, file: !758, line: 629, baseType: !1193, size: 64, align: 64, offset: 4160)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1120, file: !758, line: 645, baseType: !1088, size: 64, align: 64, offset: 4224)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !960, file: !35, line: 3566, baseType: !1201, size: 64, align: 64, offset: 1408)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!906, !907, !900, !1199, !1083}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !960, file: !35, line: 3567, baseType: !1008, size: 64, align: 64, offset: 1472)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !960, file: !35, line: 3576, baseType: !1206, size: 64, align: 64, offset: 1536)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!906, !907, !1117}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !960, file: !35, line: 3577, baseType: !1210, size: 64, align: 64, offset: 1600)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!906, !907, !1083}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !960, file: !35, line: 3584, baseType: !1214, size: 64, align: 64, offset: 1664)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!906, !907, !1217}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !960, file: !35, line: 3589, baseType: !1219, size: 64, align: 64, offset: 1728)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{null, !907}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !960, file: !35, line: 3594, baseType: !906, size: 32, align: 32, offset: 1792)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !960, file: !35, line: 3600, baseType: !918, size: 64, align: 64, offset: 1856)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !960, file: !35, line: 3609, baseType: !1225, size: 64, align: 64, offset: 1920)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !909, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !909, file: !35, line: 1581, baseType: !1041, size: 32, align: 32, offset: 224)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !909, file: !35, line: 1583, baseType: !900, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !909, file: !35, line: 1591, baseType: !1233, size: 64, align: 64, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !909, file: !35, line: 1598, baseType: !900, size: 64, align: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !909, file: !35, line: 1606, baseType: !1077, size: 64, align: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !909, file: !35, line: 1614, baseType: !906, size: 32, align: 32, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !909, file: !35, line: 1622, baseType: !906, size: 32, align: 32, offset: 544)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !909, file: !35, line: 1628, baseType: !906, size: 32, align: 32, offset: 576)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !909, file: !35, line: 1636, baseType: !906, size: 32, align: 32, offset: 608)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !909, file: !35, line: 1643, baseType: !906, size: 32, align: 32, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !909, file: !35, line: 1657, baseType: !1031, size: 64, align: 64, offset: 704)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !909, file: !35, line: 1658, baseType: !906, size: 32, align: 32, offset: 768)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !909, file: !35, line: 1679, baseType: !970, size: 64, align: 32, offset: 800)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !909, file: !35, line: 1688, baseType: !906, size: 32, align: 32, offset: 864)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !909, file: !35, line: 1712, baseType: !906, size: 32, align: 32, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !909, file: !35, line: 1729, baseType: !906, size: 32, align: 32, offset: 928)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !909, file: !35, line: 1729, baseType: !906, size: 32, align: 32, offset: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !909, file: !35, line: 1744, baseType: !906, size: 32, align: 32, offset: 992)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !909, file: !35, line: 1744, baseType: !906, size: 32, align: 32, offset: 1024)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !909, file: !35, line: 1751, baseType: !906, size: 32, align: 32, offset: 1056)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !909, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !909, file: !35, line: 1791, baseType: !1254, size: 64, align: 64, offset: 1152)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !1257, !1117, !1199, !906, !906, !906}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !909, file: !35, line: 1808, baseType: !1259, size: 64, align: 64, offset: 1216)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!494, !1257, !977}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !909, file: !35, line: 1816, baseType: !906, size: 32, align: 32, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !909, file: !35, line: 1825, baseType: !1264, size: 32, align: 32, offset: 1312)
!1264 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !909, file: !35, line: 1830, baseType: !906, size: 32, align: 32, offset: 1344)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !909, file: !35, line: 1838, baseType: !1264, size: 32, align: 32, offset: 1376)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !909, file: !35, line: 1846, baseType: !906, size: 32, align: 32, offset: 1408)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !909, file: !35, line: 1851, baseType: !906, size: 32, align: 32, offset: 1440)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !909, file: !35, line: 1861, baseType: !1264, size: 32, align: 32, offset: 1472)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !909, file: !35, line: 1868, baseType: !1264, size: 32, align: 32, offset: 1504)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !909, file: !35, line: 1875, baseType: !1264, size: 32, align: 32, offset: 1536)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !909, file: !35, line: 1882, baseType: !1264, size: 32, align: 32, offset: 1568)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !909, file: !35, line: 1889, baseType: !1264, size: 32, align: 32, offset: 1600)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !909, file: !35, line: 1896, baseType: !1264, size: 32, align: 32, offset: 1632)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !909, file: !35, line: 1903, baseType: !1264, size: 32, align: 32, offset: 1664)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !909, file: !35, line: 1910, baseType: !906, size: 32, align: 32, offset: 1696)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !909, file: !35, line: 1915, baseType: !906, size: 32, align: 32, offset: 1728)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !909, file: !35, line: 1926, baseType: !1199, size: 64, align: 64, offset: 1792)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !909, file: !35, line: 1935, baseType: !970, size: 64, align: 32, offset: 1856)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !909, file: !35, line: 1942, baseType: !906, size: 32, align: 32, offset: 1920)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !909, file: !35, line: 1948, baseType: !906, size: 32, align: 32, offset: 1952)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !909, file: !35, line: 1954, baseType: !906, size: 32, align: 32, offset: 1984)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !909, file: !35, line: 1960, baseType: !906, size: 32, align: 32, offset: 2016)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !909, file: !35, line: 1984, baseType: !906, size: 32, align: 32, offset: 2048)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !909, file: !35, line: 1991, baseType: !906, size: 32, align: 32, offset: 2080)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !909, file: !35, line: 1996, baseType: !906, size: 32, align: 32, offset: 2112)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !909, file: !35, line: 2004, baseType: !906, size: 32, align: 32, offset: 2144)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !909, file: !35, line: 2011, baseType: !906, size: 32, align: 32, offset: 2176)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !909, file: !35, line: 2018, baseType: !906, size: 32, align: 32, offset: 2208)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !909, file: !35, line: 2027, baseType: !906, size: 32, align: 32, offset: 2240)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !909, file: !35, line: 2034, baseType: !906, size: 32, align: 32, offset: 2272)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !909, file: !35, line: 2044, baseType: !906, size: 32, align: 32, offset: 2304)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !909, file: !35, line: 2054, baseType: !1294, size: 64, align: 64, offset: 2368)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !909, file: !35, line: 2061, baseType: !1294, size: 64, align: 64, offset: 2432)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !909, file: !35, line: 2066, baseType: !906, size: 32, align: 32, offset: 2496)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !909, file: !35, line: 2070, baseType: !906, size: 32, align: 32, offset: 2528)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !909, file: !35, line: 2078, baseType: !906, size: 32, align: 32, offset: 2560)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !909, file: !35, line: 2085, baseType: !906, size: 32, align: 32, offset: 2592)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !909, file: !35, line: 2092, baseType: !906, size: 32, align: 32, offset: 2624)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !909, file: !35, line: 2099, baseType: !906, size: 32, align: 32, offset: 2656)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !909, file: !35, line: 2106, baseType: !906, size: 32, align: 32, offset: 2688)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !909, file: !35, line: 2113, baseType: !906, size: 32, align: 32, offset: 2720)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !909, file: !35, line: 2120, baseType: !906, size: 32, align: 32, offset: 2752)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !909, file: !35, line: 2125, baseType: !906, size: 32, align: 32, offset: 2784)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !909, file: !35, line: 2133, baseType: !906, size: 32, align: 32, offset: 2816)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !909, file: !35, line: 2140, baseType: !906, size: 32, align: 32, offset: 2848)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !909, file: !35, line: 2145, baseType: !906, size: 32, align: 32, offset: 2880)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !909, file: !35, line: 2153, baseType: !906, size: 32, align: 32, offset: 2912)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !909, file: !35, line: 2158, baseType: !906, size: 32, align: 32, offset: 2944)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !909, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !909, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !909, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !909, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !909, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !909, file: !35, line: 2203, baseType: !906, size: 32, align: 32, offset: 3136)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !909, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !909, file: !35, line: 2212, baseType: !906, size: 32, align: 32, offset: 3200)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !909, file: !35, line: 2213, baseType: !906, size: 32, align: 32, offset: 3232)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !909, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !909, file: !35, line: 2232, baseType: !906, size: 32, align: 32, offset: 3296)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !909, file: !35, line: 2243, baseType: !906, size: 32, align: 32, offset: 3328)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !909, file: !35, line: 2249, baseType: !906, size: 32, align: 32, offset: 3360)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !909, file: !35, line: 2256, baseType: !906, size: 32, align: 32, offset: 3392)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !909, file: !35, line: 2263, baseType: !988, size: 64, align: 64, offset: 3456)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !909, file: !35, line: 2270, baseType: !988, size: 64, align: 64, offset: 3520)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !909, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !909, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !909, file: !35, line: 2367, baseType: !1330, size: 64, align: 64, offset: 3648)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!906, !1257, !1217, !906}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !909, file: !35, line: 2383, baseType: !906, size: 32, align: 32, offset: 3712)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !909, file: !35, line: 2386, baseType: !1264, size: 32, align: 32, offset: 3744)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !909, file: !35, line: 2387, baseType: !1264, size: 32, align: 32, offset: 3776)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !909, file: !35, line: 2394, baseType: !906, size: 32, align: 32, offset: 3808)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !909, file: !35, line: 2401, baseType: !906, size: 32, align: 32, offset: 3840)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !909, file: !35, line: 2408, baseType: !906, size: 32, align: 32, offset: 3872)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !909, file: !35, line: 2415, baseType: !906, size: 32, align: 32, offset: 3904)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !909, file: !35, line: 2422, baseType: !906, size: 32, align: 32, offset: 3936)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !909, file: !35, line: 2423, baseType: !1342, size: 64, align: 64, offset: 3968)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1344, file: !35, line: 827, baseType: !906, size: 32, align: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1344, file: !35, line: 828, baseType: !906, size: 32, align: 32, offset: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1344, file: !35, line: 829, baseType: !906, size: 32, align: 32, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1344, file: !35, line: 830, baseType: !1264, size: 32, align: 32, offset: 96)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !909, file: !35, line: 2430, baseType: !1077, size: 64, align: 64, offset: 4032)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !909, file: !35, line: 2437, baseType: !1077, size: 64, align: 64, offset: 4096)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !909, file: !35, line: 2444, baseType: !1264, size: 32, align: 32, offset: 4160)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !909, file: !35, line: 2451, baseType: !1264, size: 32, align: 32, offset: 4192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !909, file: !35, line: 2458, baseType: !906, size: 32, align: 32, offset: 4224)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !909, file: !35, line: 2469, baseType: !906, size: 32, align: 32, offset: 4256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !909, file: !35, line: 2475, baseType: !906, size: 32, align: 32, offset: 4288)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !909, file: !35, line: 2481, baseType: !906, size: 32, align: 32, offset: 4320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !909, file: !35, line: 2485, baseType: !906, size: 32, align: 32, offset: 4352)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !909, file: !35, line: 2489, baseType: !906, size: 32, align: 32, offset: 4384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !909, file: !35, line: 2493, baseType: !906, size: 32, align: 32, offset: 4416)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !909, file: !35, line: 2501, baseType: !906, size: 32, align: 32, offset: 4448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !909, file: !35, line: 2506, baseType: !906, size: 32, align: 32, offset: 4480)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !909, file: !35, line: 2510, baseType: !906, size: 32, align: 32, offset: 4512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !909, file: !35, line: 2514, baseType: !1077, size: 64, align: 64, offset: 4544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !909, file: !35, line: 2528, baseType: !1366, size: 64, align: 64, offset: 4608)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{null, !1257, !900, !906, !906}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !909, file: !35, line: 2534, baseType: !906, size: 32, align: 32, offset: 4672)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !909, file: !35, line: 2545, baseType: !906, size: 32, align: 32, offset: 4704)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !909, file: !35, line: 2547, baseType: !906, size: 32, align: 32, offset: 4736)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !909, file: !35, line: 2549, baseType: !906, size: 32, align: 32, offset: 4768)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !909, file: !35, line: 2551, baseType: !906, size: 32, align: 32, offset: 4800)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !909, file: !35, line: 2553, baseType: !906, size: 32, align: 32, offset: 4832)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !909, file: !35, line: 2555, baseType: !906, size: 32, align: 32, offset: 4864)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !909, file: !35, line: 2557, baseType: !906, size: 32, align: 32, offset: 4896)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !909, file: !35, line: 2559, baseType: !906, size: 32, align: 32, offset: 4928)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !909, file: !35, line: 2563, baseType: !906, size: 32, align: 32, offset: 4960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !909, file: !35, line: 2571, baseType: !1073, size: 64, align: 64, offset: 4992)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !909, file: !35, line: 2579, baseType: !1073, size: 64, align: 64, offset: 5056)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !909, file: !35, line: 2586, baseType: !906, size: 32, align: 32, offset: 5120)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !909, file: !35, line: 2615, baseType: !906, size: 32, align: 32, offset: 5152)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !909, file: !35, line: 2627, baseType: !906, size: 32, align: 32, offset: 5184)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !909, file: !35, line: 2637, baseType: !906, size: 32, align: 32, offset: 5216)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !909, file: !35, line: 2681, baseType: !906, size: 32, align: 32, offset: 5248)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !909, file: !35, line: 2709, baseType: !1077, size: 64, align: 64, offset: 5312)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !909, file: !35, line: 2716, baseType: !1388, size: 64, align: 64, offset: 5376)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1397, !1398, !1404, !1408, !1409, !1410, !1411, !1417, !1418, !1419, !1420, !1421}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1390, file: !35, line: 3642, baseType: !918, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1390, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1390, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1390, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1390, file: !35, line: 3669, baseType: !906, size: 32, align: 32, offset: 160)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1390, file: !35, line: 3682, baseType: !1214, size: 64, align: 64, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1390, file: !35, line: 3698, baseType: !1399, size: 64, align: 64, offset: 256)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!906, !907, !1402, !1040}
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1390, file: !35, line: 3712, baseType: !1405, size: 64, align: 64, offset: 320)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!906, !907, !906, !1402, !1040}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1390, file: !35, line: 3726, baseType: !1399, size: 64, align: 64, offset: 384)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1390, file: !35, line: 3737, baseType: !1008, size: 64, align: 64, offset: 448)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1390, file: !35, line: 3746, baseType: !906, size: 32, align: 32, offset: 512)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1390, file: !35, line: 3757, baseType: !1412, size: 64, align: 64, offset: 576)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{null, !1415}
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1390, file: !35, line: 3766, baseType: !1008, size: 64, align: 64, offset: 640)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1390, file: !35, line: 3774, baseType: !1008, size: 64, align: 64, offset: 704)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1390, file: !35, line: 3780, baseType: !906, size: 32, align: 32, offset: 768)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1390, file: !35, line: 3785, baseType: !906, size: 32, align: 32, offset: 800)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1390, file: !35, line: 3795, baseType: !1422, size: 64, align: 64, offset: 832)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!906, !907, !1088}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !909, file: !35, line: 2728, baseType: !900, size: 64, align: 64, offset: 5440)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !909, file: !35, line: 2735, baseType: !1141, size: 512, align: 64, offset: 5504)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !909, file: !35, line: 2742, baseType: !906, size: 32, align: 32, offset: 6016)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !909, file: !35, line: 2755, baseType: !906, size: 32, align: 32, offset: 6048)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !909, file: !35, line: 2776, baseType: !906, size: 32, align: 32, offset: 6080)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !909, file: !35, line: 2783, baseType: !906, size: 32, align: 32, offset: 6112)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !909, file: !35, line: 2791, baseType: !906, size: 32, align: 32, offset: 6144)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !909, file: !35, line: 2802, baseType: !1217, size: 64, align: 64, offset: 6208)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !909, file: !35, line: 2811, baseType: !906, size: 32, align: 32, offset: 6272)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !909, file: !35, line: 2821, baseType: !906, size: 32, align: 32, offset: 6304)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !909, file: !35, line: 2830, baseType: !906, size: 32, align: 32, offset: 6336)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !909, file: !35, line: 2840, baseType: !906, size: 32, align: 32, offset: 6368)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !909, file: !35, line: 2851, baseType: !1438, size: 64, align: 64, offset: 6400)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!906, !1257, !1441, !900, !1199, !906, !906}
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!906, !1257, !900}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !909, file: !35, line: 2871, baseType: !1445, size: 64, align: 64, offset: 6464)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!906, !1257, !1448, !900, !1199, !906}
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!906, !1257, !900, !906, !906}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !909, file: !35, line: 2878, baseType: !906, size: 32, align: 32, offset: 6528)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !909, file: !35, line: 2885, baseType: !906, size: 32, align: 32, offset: 6560)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !909, file: !35, line: 3005, baseType: !906, size: 32, align: 32, offset: 6592)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !909, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !909, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !909, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !909, file: !35, line: 3037, baseType: !1031, size: 64, align: 64, offset: 6720)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !909, file: !35, line: 3038, baseType: !906, size: 32, align: 32, offset: 6784)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !909, file: !35, line: 3050, baseType: !988, size: 64, align: 64, offset: 6848)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !909, file: !35, line: 3065, baseType: !906, size: 32, align: 32, offset: 6912)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !909, file: !35, line: 3083, baseType: !906, size: 32, align: 32, offset: 6944)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !909, file: !35, line: 3092, baseType: !970, size: 64, align: 32, offset: 6976)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !909, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !909, file: !35, line: 3106, baseType: !970, size: 64, align: 32, offset: 7072)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !909, file: !35, line: 3113, baseType: !1466, size: 64, align: 64, offset: 7168)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1468)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1470)
!1470 = !{!1471, !1472, !1473, !1474, !1475, !1476, !1479}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1469, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1469, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1469, file: !35, line: 720, baseType: !918, size: 64, align: 64, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1469, file: !35, line: 724, baseType: !918, size: 64, align: 64, offset: 128)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1469, file: !35, line: 728, baseType: !906, size: 32, align: 32, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1469, file: !35, line: 734, baseType: !1477, size: 64, align: 64, offset: 256)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1469, file: !35, line: 739, baseType: !1480, size: 64, align: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !909, file: !35, line: 3129, baseType: !1077, size: 64, align: 64, offset: 7232)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !909, file: !35, line: 3130, baseType: !1077, size: 64, align: 64, offset: 7296)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !909, file: !35, line: 3131, baseType: !1077, size: 64, align: 64, offset: 7360)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !909, file: !35, line: 3132, baseType: !1077, size: 64, align: 64, offset: 7424)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !909, file: !35, line: 3139, baseType: !1073, size: 64, align: 64, offset: 7488)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !909, file: !35, line: 3147, baseType: !906, size: 32, align: 32, offset: 7552)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !909, file: !35, line: 3165, baseType: !906, size: 32, align: 32, offset: 7584)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !909, file: !35, line: 3172, baseType: !906, size: 32, align: 32, offset: 7616)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !909, file: !35, line: 3180, baseType: !906, size: 32, align: 32, offset: 7648)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !909, file: !35, line: 3191, baseType: !1294, size: 64, align: 64, offset: 7680)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !909, file: !35, line: 3199, baseType: !1031, size: 64, align: 64, offset: 7744)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !909, file: !35, line: 3207, baseType: !1073, size: 64, align: 64, offset: 7808)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !909, file: !35, line: 3214, baseType: !1041, size: 32, align: 32, offset: 7872)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !909, file: !35, line: 3224, baseType: !1106, size: 64, align: 64, offset: 7936)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !909, file: !35, line: 3225, baseType: !906, size: 32, align: 32, offset: 8000)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !909, file: !35, line: 3249, baseType: !1088, size: 64, align: 64, offset: 8064)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !909, file: !35, line: 3256, baseType: !906, size: 32, align: 32, offset: 8128)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !909, file: !35, line: 3271, baseType: !906, size: 32, align: 32, offset: 8160)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !909, file: !35, line: 3279, baseType: !1077, size: 64, align: 64, offset: 8192)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !909, file: !35, line: 3301, baseType: !1088, size: 64, align: 64, offset: 8256)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !909, file: !35, line: 3310, baseType: !906, size: 32, align: 32, offset: 8320)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !909, file: !35, line: 3337, baseType: !906, size: 32, align: 32, offset: 8352)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !909, file: !35, line: 3351, baseType: !906, size: 32, align: 32, offset: 8384)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !909, file: !35, line: 3359, baseType: !906, size: 32, align: 32, offset: 8416)
!1506 = !DILocalVariable(name: "avctx", arg: 1, scope: !903, file: !891, line: 130, type: !907)
!1507 = !DIExpression()
!1508 = !DILocation(line: 130, column: 48, scope: !903)
!1509 = !DILocalVariable(name: "ctx", arg: 2, scope: !903, file: !891, line: 130, type: !894)
!1510 = !DILocation(line: 130, column: 76, scope: !903)
!1511 = !DILocalVariable(name: "surface", arg: 3, scope: !903, file: !891, line: 130, type: !900)
!1512 = !DILocation(line: 130, column: 87, scope: !903)
!1513 = !DILocation(line: 132, column: 5, scope: !903)
!1514 = distinct !DISubprogram(name: "av_mediacodec_default_free", scope: !891, file: !891, line: 135, type: !1220, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !901)
!1515 = !DILocalVariable(name: "avctx", arg: 1, scope: !1514, file: !891, line: 135, type: !907)
!1516 = !DILocation(line: 135, column: 49, scope: !1514)
!1517 = !DILocation(line: 137, column: 1, scope: !1514)
!1518 = distinct !DISubprogram(name: "av_mediacodec_release_buffer", scope: !891, file: !891, line: 139, type: !1519, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !901)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!906, !1521, !906}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMediaCodecBuffer", file: !896, line: 73, baseType: !1523)
!1523 = !DICompositeType(tag: DW_TAG_structure_type, name: "MediaCodecBuffer", file: !896, line: 73, flags: DIFlagFwdDecl)
!1524 = !DILocalVariable(name: "buffer", arg: 1, scope: !1518, file: !891, line: 139, type: !1521)
!1525 = !DILocation(line: 139, column: 54, scope: !1518)
!1526 = !DILocalVariable(name: "render", arg: 2, scope: !1518, file: !891, line: 139, type: !906)
!1527 = !DILocation(line: 139, column: 66, scope: !1518)
!1528 = !DILocation(line: 141, column: 5, scope: !1518)
!1529 = distinct !DISubprogram(name: "av_mediacodec_render_buffer_at_time", scope: !891, file: !891, line: 144, type: !1530, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !901)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!906, !1521, !1077}
!1532 = !DILocalVariable(name: "buffer", arg: 1, scope: !1529, file: !891, line: 144, type: !1521)
!1533 = !DILocation(line: 144, column: 61, scope: !1529)
!1534 = !DILocalVariable(name: "time", arg: 2, scope: !1529, file: !891, line: 144, type: !1077)
!1535 = !DILocation(line: 144, column: 77, scope: !1529)
!1536 = !DILocation(line: 146, column: 5, scope: !1529)
