; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h2645_parse.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h2645_parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.H2645RBSP = type { i8*, %struct.AVBufferRef*, i32, i32 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.H2645NAL = type { i8*, i32, i8*, i32, i32, i8*, %struct.GetBitContext, i32, i32, i32, i32, i32*, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%union.unaligned_64 = type { i64 }
%struct.H2645Packet = type { %struct.H2645NAL*, %struct.H2645RBSP, i32, i32 }
%struct.GetByteContext = type { i8*, i8*, i8* }
%union.unaligned_32 = type { i32 }

@.str = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [50 x i8] c"nal->skipped_bytes_pos_size >= nal->skipped_bytes\00", align 1
@.str.2 = private unnamed_addr constant [25 x i8] c"libavcodec/h2645_parse.c\00", align 1
@.str.3 = private unnamed_addr constant [43 x i8] c"Exceeded next NALFF position, re-syncing.\0A\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"No start code is found.\0A\00", align 1
@.str.5 = private unnamed_addr constant [45 x i8] c"NALFF: Consumed only %d bytes instead of %d\0A\00", align 1

!437 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER", value: 96263)
!438 = !DIEnumerator(name: "AV_CODEC_ID_SUBRIP", value: 96264)
!439 = !DIEnumerator(name: "AV_CODEC_ID_WEBVTT", value: 96265)
!440 = !DIEnumerator(name: "AV_CODEC_ID_MPL2", value: 96266)
!441 = !DIEnumerator(name: "AV_CODEC_ID_VPLAYER", value: 96267)
!442 = !DIEnumerator(name: "AV_CODEC_ID_PJS", value: 96268)
!443 = !DIEnumerator(name: "AV_CODEC_ID_ASS", value: 96269)
!444 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_TEXT_SUBTITLE", value: 96270)
!445 = !DIEnumerator(name: "AV_CODEC_ID_TTML", value: 96271)
!446 = !DIEnumerator(name: "AV_CODEC_ID_ARIB_CAPTION", value: 96272)
!447 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_UNKNOWN", value: 98304)
!448 = !DIEnumerator(name: "AV_CODEC_ID_TTF", value: 98304)
!449 = !DIEnumerator(name: "AV_CODEC_ID_SCTE_35", value: 98305)
!450 = !DIEnumerator(name: "AV_CODEC_ID_BINTEXT", value: 100352)
!451 = !DIEnumerator(name: "AV_CODEC_ID_XBIN", value: 100353)
!452 = !DIEnumerator(name: "AV_CODEC_ID_IDF", value: 100354)
!453 = !DIEnumerator(name: "AV_CODEC_ID_OTF", value: 100355)
!454 = !DIEnumerator(name: "AV_CODEC_ID_SMPTE_KLV", value: 100356)
!455 = !DIEnumerator(name: "AV_CODEC_ID_DVD_NAV", value: 100357)
!456 = !DIEnumerator(name: "AV_CODEC_ID_TIMED_ID3", value: 100358)
!457 = !DIEnumerator(name: "AV_CODEC_ID_BIN_DATA", value: 100359)
!458 = !DIEnumerator(name: "AV_CODEC_ID_PROBE", value: 102400)
!459 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2TS", value: 131072)
!460 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4SYSTEMS", value: 131073)
!461 = !DIEnumerator(name: "AV_CODEC_ID_FFMETADATA", value: 135168)
!462 = !DIEnumerator(name: "AV_CODEC_ID_WRAPPED_AVFRAME", value: 135169)
!463 = !{!464, !473, !474, !475, !476, !482}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !467, line: 220, size: 64, align: 8, elements: !468)
!467 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !466, file: !467, line: 220, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !471, line: 55, baseType: !472)
!471 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!472 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!474 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!475 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !467, line: 221, size: 32, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !478, file: !467, line: 221, baseType: !481, size: 32, align: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !471, line: 51, baseType: !475)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !471, line: 48, baseType: !483)
!483 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!484 = !{!485, !493}
!485 = distinct !DIGlobalVariable(name: "hevc_nal_type_name", scope: !0, file: !486, line: 149, type: !487, isLocal: true, isDefinition: true, variable: [64 x i8*]* @hevc_nal_type_name)
!486 = !DIFile(filename: "libavcodec/h2645_parse.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 4096, align: 64, elements: !491)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!491 = !{!492}
!492 = !DISubrange(count: 64)
!493 = distinct !DIGlobalVariable(name: "h264_nal_type_name", scope: !0, file: !486, line: 222, type: !494, isLocal: true, isDefinition: true, variable: [32 x i8*]* @h264_nal_type_name)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 2048, align: 64, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 32)
!497 = !{i32 2, !"Dwarf Version", i32 4}
!498 = !{i32 2, !"Debug Info Version", i32 3}
!499 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!500 = distinct !DISubprogram(name: "ff_h2645_extract_rbsp", scope: !486, file: !486, line: 34, type: !501, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !553)
!501 = !DISubroutineType(types: !502)
!502 = !{!474, !503, !474, !505, !526, !474}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645RBSP", file: !507, line: 73, baseType: !508)
!507 = !DIFile(filename: "libavcodec/h2645_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645RBSP", file: !507, line: 68, size: 192, align: 64, elements: !509)
!509 = !{!510, !512, !524, !525}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer", scope: !508, file: !507, line: 69, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_ref", scope: !508, file: !507, line: 70, baseType: !513, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !515, line: 94, baseType: !516)
!515 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !515, line: 81, size: 192, align: 64, elements: !517)
!517 = !{!518, !522, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !516, file: !515, line: 82, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !515, line: 73, baseType: !521)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !515, line: 73, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !515, line: 89, baseType: !511, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !516, file: !515, line: 93, baseType: !474, size: 32, align: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_alloc_size", scope: !508, file: !507, line: 71, baseType: !474, size: 32, align: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_size", scope: !508, file: !507, line: 72, baseType: !474, size: 32, align: 32, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645NAL", file: !507, line: 66, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645NAL", file: !507, line: 32, size: 832, align: 64, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !546, !547, !548, !549, !550, !552}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer", scope: !528, file: !507, line: 33, baseType: !511, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !528, file: !507, line: 35, baseType: !474, size: 32, align: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !528, file: !507, line: 36, baseType: !503, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size_bits", scope: !528, file: !507, line: 42, baseType: !474, size: 32, align: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "raw_size", scope: !528, file: !507, line: 44, baseType: !474, size: 32, align: 32, offset: 224)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !528, file: !507, line: 45, baseType: !503, size: 64, align: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !528, file: !507, line: 47, baseType: !537, size: 256, align: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !538, line: 70, baseType: !539)
!538 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !538, line: 61, size: 256, align: 64, elements: !540)
!540 = !{!541, !542, !543, !544, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !539, file: !538, line: 62, baseType: !503, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !539, file: !538, line: 62, baseType: !503, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !539, file: !538, line: 67, baseType: !474, size: 32, align: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !539, file: !538, line: 68, baseType: !474, size: 32, align: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !539, file: !538, line: 69, baseType: !474, size: 32, align: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !507, line: 52, baseType: !474, size: 32, align: 32, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !528, file: !507, line: 57, baseType: !474, size: 32, align: 32, offset: 608)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes", scope: !528, file: !507, line: 59, baseType: !474, size: 32, align: 32, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes_pos_size", scope: !528, file: !507, line: 60, baseType: !474, size: 32, align: 32, offset: 672)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes_pos", scope: !528, file: !507, line: 61, baseType: !551, size: 64, align: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idc", scope: !528, file: !507, line: 65, baseType: !474, size: 32, align: 32, offset: 768)
!553 = !{}
!554 = !DILocalVariable(name: "src", arg: 1, scope: !500, file: !486, line: 34, type: !503)
!555 = !DIExpression()
!556 = !DILocation(line: 34, column: 42, scope: !500)
!557 = !DILocalVariable(name: "length", arg: 2, scope: !500, file: !486, line: 34, type: !474)
!558 = !DILocation(line: 34, column: 51, scope: !500)
!559 = !DILocalVariable(name: "rbsp", arg: 3, scope: !500, file: !486, line: 35, type: !505)
!560 = !DILocation(line: 35, column: 38, scope: !500)
!561 = !DILocalVariable(name: "nal", arg: 4, scope: !500, file: !486, line: 35, type: !526)
!562 = !DILocation(line: 35, column: 54, scope: !500)
!563 = !DILocalVariable(name: "small_padding", arg: 5, scope: !500, file: !486, line: 35, type: !474)
!564 = !DILocation(line: 35, column: 63, scope: !500)
!565 = !DILocalVariable(name: "i", scope: !500, file: !486, line: 37, type: !474)
!566 = !DILocation(line: 37, column: 9, scope: !500)
!567 = !DILocalVariable(name: "si", scope: !500, file: !486, line: 37, type: !474)
!568 = !DILocation(line: 37, column: 12, scope: !500)
!569 = !DILocalVariable(name: "di", scope: !500, file: !486, line: 37, type: !474)
!570 = !DILocation(line: 37, column: 16, scope: !500)
!571 = !DILocalVariable(name: "dst", scope: !500, file: !486, line: 38, type: !511)
!572 = !DILocation(line: 38, column: 14, scope: !500)
!573 = !DILocation(line: 40, column: 5, scope: !500)
!574 = !DILocation(line: 40, column: 10, scope: !500)
!575 = !DILocation(line: 40, column: 24, scope: !500)
!576 = !DILocation(line: 56, column: 12, scope: !577)
!577 = distinct !DILexicalBlock(scope: !500, file: !486, line: 56, column: 5)
!578 = !DILocation(line: 56, column: 10, scope: !577)
!579 = !DILocation(line: 56, column: 17, scope: !580)
!580 = !DILexicalBlockFile(scope: !581, file: !486, discriminator: 1)
!581 = distinct !DILexicalBlock(scope: !577, file: !486, line: 56, column: 5)
!582 = !DILocation(line: 56, column: 19, scope: !580)
!583 = !DILocation(line: 56, column: 25, scope: !580)
!584 = !DILocation(line: 56, column: 23, scope: !580)
!585 = !DILocation(line: 56, column: 5, scope: !580)
!586 = !DILocation(line: 57, column: 49, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !486, line: 57, column: 13)
!588 = distinct !DILexicalBlock(scope: !581, file: !486, line: 56, column: 41)
!589 = !DILocation(line: 57, column: 55, scope: !587)
!590 = !DILocation(line: 57, column: 53, scope: !587)
!591 = !DILocation(line: 57, column: 60, scope: !587)
!592 = !DILocation(line: 57, column: 16, scope: !587)
!593 = !DILocation(line: 58, column: 49, scope: !587)
!594 = !DILocation(line: 58, column: 55, scope: !587)
!595 = !DILocation(line: 58, column: 53, scope: !587)
!596 = !DILocation(line: 58, column: 60, scope: !587)
!597 = !DILocation(line: 58, column: 63, scope: !587)
!598 = !DILocation(line: 57, column: 63, scope: !587)
!599 = !DILocation(line: 58, column: 89, scope: !587)
!600 = !DILocation(line: 57, column: 13, scope: !588)
!601 = !DILocation(line: 60, column: 13, scope: !587)
!602 = !DILocation(line: 61, column: 13, scope: !603)
!603 = distinct !DILexicalBlock(scope: !588, file: !486, line: 61, column: 13)
!604 = !DILocation(line: 61, column: 15, scope: !603)
!605 = !DILocation(line: 61, column: 19, scope: !603)
!606 = !DILocation(line: 61, column: 27, scope: !607)
!607 = !DILexicalBlockFile(scope: !603, file: !486, discriminator: 1)
!608 = !DILocation(line: 61, column: 23, scope: !607)
!609 = !DILocation(line: 61, column: 13, scope: !607)
!610 = !DILocation(line: 61, column: 32, scope: !611)
!611 = !DILexicalBlockFile(scope: !603, file: !486, discriminator: 2)
!612 = !DILocation(line: 61, column: 31, scope: !611)
!613 = !DILocation(line: 61, column: 36, scope: !614)
!614 = !DILexicalBlockFile(scope: !588, file: !486, discriminator: 3)
!615 = !DILocation(line: 61, column: 47, scope: !616)
!616 = !DILexicalBlockFile(scope: !588, file: !486, discriminator: 4)
!617 = !DILocation(line: 61, column: 43, scope: !616)
!618 = !DILocation(line: 61, column: 36, scope: !616)
!619 = !DILocation(line: 61, column: 52, scope: !620)
!620 = !DILexicalBlockFile(scope: !588, file: !486, discriminator: 5)
!621 = !DILocation(line: 61, column: 36, scope: !620)
!622 = distinct !{!622, !623}
!623 = !DILocation(line: 61, column: 36, scope: !588)
!624 = !DILocation(line: 62, column: 13, scope: !625)
!625 = distinct !DILexicalBlock(scope: !588, file: !486, line: 62, column: 13)
!626 = !DILocation(line: 62, column: 15, scope: !625)
!627 = !DILocation(line: 62, column: 21, scope: !625)
!628 = !DILocation(line: 62, column: 19, scope: !625)
!629 = !DILocation(line: 62, column: 28, scope: !625)
!630 = !DILocation(line: 62, column: 35, scope: !631)
!631 = !DILexicalBlockFile(scope: !625, file: !486, discriminator: 1)
!632 = !DILocation(line: 62, column: 37, scope: !631)
!633 = !DILocation(line: 62, column: 31, scope: !631)
!634 = !DILocation(line: 62, column: 42, scope: !631)
!635 = !DILocation(line: 62, column: 47, scope: !631)
!636 = !DILocation(line: 62, column: 54, scope: !637)
!637 = !DILexicalBlockFile(scope: !625, file: !486, discriminator: 2)
!638 = !DILocation(line: 62, column: 56, scope: !637)
!639 = !DILocation(line: 62, column: 50, scope: !637)
!640 = !DILocation(line: 62, column: 61, scope: !637)
!641 = !DILocation(line: 62, column: 13, scope: !637)
!642 = !DILocation(line: 62, column: 77, scope: !643)
!643 = !DILexicalBlockFile(scope: !644, file: !486, discriminator: 3)
!644 = distinct !DILexicalBlock(scope: !645, file: !486, line: 62, column: 73)
!645 = distinct !DILexicalBlock(scope: !625, file: !486, line: 62, column: 67)
!646 = !DILocation(line: 62, column: 79, scope: !643)
!647 = !DILocation(line: 62, column: 73, scope: !643)
!648 = !DILocation(line: 62, column: 84, scope: !643)
!649 = !DILocation(line: 62, column: 89, scope: !643)
!650 = !DILocation(line: 62, column: 96, scope: !651)
!651 = !DILexicalBlockFile(scope: !644, file: !486, discriminator: 4)
!652 = !DILocation(line: 62, column: 98, scope: !651)
!653 = !DILocation(line: 62, column: 92, scope: !651)
!654 = !DILocation(line: 62, column: 103, scope: !651)
!655 = !DILocation(line: 62, column: 73, scope: !651)
!656 = !DILocation(line: 62, column: 120, scope: !657)
!657 = !DILexicalBlockFile(scope: !658, file: !486, discriminator: 5)
!658 = distinct !DILexicalBlock(scope: !644, file: !486, line: 62, column: 109)
!659 = !DILocation(line: 62, column: 118, scope: !657)
!660 = !DILocation(line: 62, column: 123, scope: !657)
!661 = !DILocation(line: 62, column: 125, scope: !662)
!662 = !DILexicalBlockFile(scope: !645, file: !486, discriminator: 6)
!663 = !DILocation(line: 63, column: 11, scope: !588)
!664 = !DILocation(line: 64, column: 5, scope: !588)
!665 = !DILocation(line: 56, column: 35, scope: !666)
!666 = !DILexicalBlockFile(scope: !581, file: !486, discriminator: 2)
!667 = !DILocation(line: 56, column: 5, scope: !666)
!668 = distinct !{!668, !669}
!669 = !DILocation(line: 56, column: 5, scope: !500)
!670 = !DILocation(line: 86, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !500, file: !486, line: 86, column: 9)
!672 = !DILocation(line: 86, column: 14, scope: !671)
!673 = !DILocation(line: 86, column: 21, scope: !671)
!674 = !DILocation(line: 86, column: 11, scope: !671)
!675 = !DILocation(line: 86, column: 25, scope: !671)
!676 = !DILocation(line: 86, column: 28, scope: !677)
!677 = !DILexicalBlockFile(scope: !671, file: !486, discriminator: 1)
!678 = !DILocation(line: 86, column: 9, scope: !677)
!679 = !DILocation(line: 88, column: 25, scope: !680)
!680 = distinct !DILexicalBlock(scope: !671, file: !486, line: 86, column: 43)
!681 = !DILocation(line: 88, column: 9, scope: !680)
!682 = !DILocation(line: 88, column: 14, scope: !680)
!683 = !DILocation(line: 88, column: 23, scope: !680)
!684 = !DILocation(line: 87, column: 9, scope: !680)
!685 = !DILocation(line: 87, column: 14, scope: !680)
!686 = !DILocation(line: 87, column: 19, scope: !680)
!687 = !DILocation(line: 90, column: 25, scope: !680)
!688 = !DILocation(line: 90, column: 9, scope: !680)
!689 = !DILocation(line: 90, column: 14, scope: !680)
!690 = !DILocation(line: 90, column: 23, scope: !680)
!691 = !DILocation(line: 89, column: 9, scope: !680)
!692 = !DILocation(line: 89, column: 14, scope: !680)
!693 = !DILocation(line: 89, column: 19, scope: !680)
!694 = !DILocation(line: 91, column: 16, scope: !680)
!695 = !DILocation(line: 91, column: 9, scope: !680)
!696 = !DILocation(line: 92, column: 16, scope: !697)
!697 = distinct !DILexicalBlock(scope: !671, file: !486, line: 92, column: 16)
!698 = !DILocation(line: 92, column: 20, scope: !697)
!699 = !DILocation(line: 92, column: 18, scope: !697)
!700 = !DILocation(line: 92, column: 16, scope: !671)
!701 = !DILocation(line: 93, column: 13, scope: !697)
!702 = !DILocation(line: 93, column: 11, scope: !697)
!703 = !DILocation(line: 93, column: 9, scope: !697)
!704 = !DILocation(line: 95, column: 43, scope: !500)
!705 = !DILocation(line: 95, column: 49, scope: !500)
!706 = !DILocation(line: 95, column: 25, scope: !500)
!707 = !DILocation(line: 95, column: 31, scope: !500)
!708 = !DILocation(line: 95, column: 5, scope: !500)
!709 = !DILocation(line: 95, column: 10, scope: !500)
!710 = !DILocation(line: 95, column: 22, scope: !500)
!711 = !DILocation(line: 96, column: 11, scope: !500)
!712 = !DILocation(line: 96, column: 16, scope: !500)
!713 = !DILocation(line: 96, column: 9, scope: !500)
!714 = !DILocation(line: 98, column: 12, scope: !500)
!715 = !DILocation(line: 98, column: 17, scope: !500)
!716 = !DILocation(line: 98, column: 22, scope: !500)
!717 = !DILocation(line: 98, column: 5, scope: !500)
!718 = !DILocation(line: 99, column: 15, scope: !500)
!719 = !DILocation(line: 99, column: 13, scope: !500)
!720 = !DILocation(line: 99, column: 8, scope: !500)
!721 = !DILocation(line: 100, column: 5, scope: !500)
!722 = !DILocation(line: 100, column: 12, scope: !723)
!723 = !DILexicalBlockFile(scope: !500, file: !486, discriminator: 1)
!724 = !DILocation(line: 100, column: 15, scope: !723)
!725 = !DILocation(line: 100, column: 21, scope: !723)
!726 = !DILocation(line: 100, column: 19, scope: !723)
!727 = !DILocation(line: 100, column: 5, scope: !723)
!728 = !DILocation(line: 102, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !730, file: !486, line: 102, column: 13)
!730 = distinct !DILexicalBlock(scope: !500, file: !486, line: 100, column: 29)
!731 = !DILocation(line: 102, column: 20, scope: !729)
!732 = !DILocation(line: 102, column: 13, scope: !729)
!733 = !DILocation(line: 102, column: 25, scope: !729)
!734 = !DILocation(line: 102, column: 13, scope: !730)
!735 = !DILocation(line: 103, column: 31, scope: !736)
!736 = distinct !DILexicalBlock(scope: !729, file: !486, line: 102, column: 30)
!737 = !DILocation(line: 103, column: 25, scope: !736)
!738 = !DILocation(line: 103, column: 19, scope: !736)
!739 = !DILocation(line: 103, column: 13, scope: !736)
!740 = !DILocation(line: 103, column: 23, scope: !736)
!741 = !DILocation(line: 104, column: 31, scope: !736)
!742 = !DILocation(line: 104, column: 25, scope: !736)
!743 = !DILocation(line: 104, column: 19, scope: !736)
!744 = !DILocation(line: 104, column: 13, scope: !736)
!745 = !DILocation(line: 104, column: 23, scope: !736)
!746 = !DILocation(line: 105, column: 9, scope: !736)
!747 = !DILocation(line: 105, column: 24, scope: !748)
!748 = !DILexicalBlockFile(scope: !749, file: !486, discriminator: 1)
!749 = distinct !DILexicalBlock(scope: !729, file: !486, line: 105, column: 20)
!750 = !DILocation(line: 105, column: 20, scope: !748)
!751 = !DILocation(line: 105, column: 28, scope: !748)
!752 = !DILocation(line: 105, column: 33, scope: !748)
!753 = !DILocation(line: 105, column: 40, scope: !754)
!754 = !DILexicalBlockFile(scope: !749, file: !486, discriminator: 2)
!755 = !DILocation(line: 105, column: 43, scope: !754)
!756 = !DILocation(line: 105, column: 36, scope: !754)
!757 = !DILocation(line: 105, column: 48, scope: !754)
!758 = !DILocation(line: 105, column: 53, scope: !754)
!759 = !DILocation(line: 105, column: 60, scope: !760)
!760 = !DILexicalBlockFile(scope: !749, file: !486, discriminator: 3)
!761 = !DILocation(line: 105, column: 63, scope: !760)
!762 = !DILocation(line: 105, column: 56, scope: !760)
!763 = !DILocation(line: 105, column: 68, scope: !760)
!764 = !DILocation(line: 105, column: 20, scope: !760)
!765 = !DILocation(line: 106, column: 21, scope: !766)
!766 = distinct !DILexicalBlock(scope: !767, file: !486, line: 106, column: 17)
!767 = distinct !DILexicalBlock(scope: !749, file: !486, line: 105, column: 74)
!768 = !DILocation(line: 106, column: 24, scope: !766)
!769 = !DILocation(line: 106, column: 17, scope: !766)
!770 = !DILocation(line: 106, column: 29, scope: !766)
!771 = !DILocation(line: 106, column: 17, scope: !767)
!772 = !DILocation(line: 107, column: 23, scope: !773)
!773 = distinct !DILexicalBlock(scope: !766, file: !486, line: 106, column: 35)
!774 = !DILocation(line: 107, column: 17, scope: !773)
!775 = !DILocation(line: 107, column: 27, scope: !773)
!776 = !DILocation(line: 108, column: 23, scope: !773)
!777 = !DILocation(line: 108, column: 17, scope: !773)
!778 = !DILocation(line: 108, column: 27, scope: !773)
!779 = !DILocation(line: 109, column: 20, scope: !773)
!780 = !DILocation(line: 111, column: 21, scope: !781)
!781 = distinct !DILexicalBlock(scope: !773, file: !486, line: 111, column: 21)
!782 = !DILocation(line: 111, column: 26, scope: !781)
!783 = !DILocation(line: 111, column: 21, scope: !773)
!784 = !DILocation(line: 112, column: 21, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !486, line: 111, column: 45)
!786 = !DILocation(line: 112, column: 26, scope: !785)
!787 = !DILocation(line: 112, column: 39, scope: !785)
!788 = !DILocation(line: 113, column: 25, scope: !789)
!789 = distinct !DILexicalBlock(scope: !785, file: !486, line: 113, column: 25)
!790 = !DILocation(line: 113, column: 30, scope: !789)
!791 = !DILocation(line: 113, column: 55, scope: !789)
!792 = !DILocation(line: 113, column: 60, scope: !789)
!793 = !DILocation(line: 113, column: 53, scope: !789)
!794 = !DILocation(line: 113, column: 25, scope: !785)
!795 = !DILocation(line: 114, column: 25, scope: !796)
!796 = distinct !DILexicalBlock(scope: !789, file: !486, line: 113, column: 75)
!797 = !DILocation(line: 114, column: 30, scope: !796)
!798 = !DILocation(line: 114, column: 53, scope: !796)
!799 = !DILocation(line: 115, column: 25, scope: !796)
!800 = distinct !{!800, !799}
!801 = !DILocation(line: 115, column: 36, scope: !802)
!802 = !DILexicalBlockFile(scope: !803, file: !486, discriminator: 1)
!803 = distinct !DILexicalBlock(scope: !804, file: !486, line: 115, column: 34)
!804 = distinct !DILexicalBlock(scope: !796, file: !486, line: 115, column: 28)
!805 = !DILocation(line: 115, column: 41, scope: !802)
!806 = !DILocation(line: 115, column: 67, scope: !802)
!807 = !DILocation(line: 115, column: 72, scope: !802)
!808 = !DILocation(line: 115, column: 64, scope: !802)
!809 = !DILocation(line: 115, column: 34, scope: !802)
!810 = !DILocation(line: 115, column: 90, scope: !811)
!811 = !DILexicalBlockFile(scope: !812, file: !486, discriminator: 2)
!812 = distinct !DILexicalBlock(scope: !803, file: !486, line: 115, column: 88)
!813 = !DILocation(line: 115, column: 150, scope: !814)
!814 = !DILexicalBlockFile(scope: !811, file: !486, discriminator: 4)
!815 = !DILocation(line: 115, column: 150, scope: !811)
!816 = !DILocation(line: 115, column: 161, scope: !817)
!817 = !DILexicalBlockFile(scope: !804, file: !486, discriminator: 3)
!818 = !DILocation(line: 116, column: 44, scope: !796)
!819 = !DILocation(line: 116, column: 49, scope: !796)
!820 = !DILocation(line: 116, column: 43, scope: !796)
!821 = !DILocation(line: 117, column: 33, scope: !796)
!822 = !DILocation(line: 117, column: 38, scope: !796)
!823 = !DILocation(line: 116, column: 25, scope: !796)
!824 = !DILocation(line: 119, column: 30, scope: !825)
!825 = distinct !DILexicalBlock(scope: !796, file: !486, line: 119, column: 29)
!826 = !DILocation(line: 119, column: 35, scope: !825)
!827 = !DILocation(line: 119, column: 29, scope: !796)
!828 = !DILocation(line: 120, column: 29, scope: !829)
!829 = distinct !DILexicalBlock(scope: !825, file: !486, line: 119, column: 54)
!830 = !DILocation(line: 120, column: 34, scope: !829)
!831 = !DILocation(line: 120, column: 57, scope: !829)
!832 = !DILocation(line: 121, column: 29, scope: !829)
!833 = !DILocation(line: 123, column: 21, scope: !796)
!834 = !DILocation(line: 124, column: 25, scope: !835)
!835 = distinct !DILexicalBlock(scope: !785, file: !486, line: 124, column: 25)
!836 = !DILocation(line: 124, column: 30, scope: !835)
!837 = !DILocation(line: 124, column: 25, scope: !785)
!838 = !DILocation(line: 125, column: 72, scope: !835)
!839 = !DILocation(line: 125, column: 75, scope: !835)
!840 = !DILocation(line: 125, column: 48, scope: !835)
!841 = !DILocation(line: 125, column: 53, scope: !835)
!842 = !DILocation(line: 125, column: 66, scope: !835)
!843 = !DILocation(line: 125, column: 25, scope: !835)
!844 = !DILocation(line: 125, column: 30, scope: !835)
!845 = !DILocation(line: 125, column: 70, scope: !835)
!846 = !DILocation(line: 126, column: 17, scope: !785)
!847 = !DILocation(line: 127, column: 17, scope: !773)
!848 = distinct !{!848, !721}
!849 = !DILocation(line: 129, column: 17, scope: !766)
!850 = !DILocation(line: 132, column: 27, scope: !730)
!851 = !DILocation(line: 132, column: 21, scope: !730)
!852 = !DILocation(line: 132, column: 15, scope: !730)
!853 = !DILocation(line: 132, column: 9, scope: !730)
!854 = !DILocation(line: 132, column: 19, scope: !730)
!855 = !DILocation(line: 100, column: 5, scope: !856)
!856 = !DILexicalBlockFile(scope: !500, file: !486, discriminator: 2)
!857 = !DILocation(line: 134, column: 5, scope: !500)
!858 = !DILocation(line: 134, column: 12, scope: !723)
!859 = !DILocation(line: 134, column: 17, scope: !723)
!860 = !DILocation(line: 134, column: 15, scope: !723)
!861 = !DILocation(line: 134, column: 5, scope: !723)
!862 = !DILocation(line: 135, column: 27, scope: !500)
!863 = !DILocation(line: 135, column: 21, scope: !500)
!864 = !DILocation(line: 135, column: 15, scope: !500)
!865 = !DILocation(line: 135, column: 9, scope: !500)
!866 = !DILocation(line: 135, column: 19, scope: !500)
!867 = !DILocation(line: 134, column: 5, scope: !856)
!868 = distinct !{!868, !857}
!869 = !DILocation(line: 134, column: 5, scope: !870)
!870 = !DILexicalBlockFile(scope: !500, file: !486, discriminator: 3)
!871 = !DILocation(line: 138, column: 12, scope: !500)
!872 = !DILocation(line: 138, column: 18, scope: !500)
!873 = !DILocation(line: 138, column: 16, scope: !500)
!874 = !DILocation(line: 138, column: 5, scope: !500)
!875 = !DILocation(line: 140, column: 17, scope: !500)
!876 = !DILocation(line: 140, column: 5, scope: !500)
!877 = !DILocation(line: 140, column: 10, scope: !500)
!878 = !DILocation(line: 140, column: 15, scope: !500)
!879 = !DILocation(line: 141, column: 17, scope: !500)
!880 = !DILocation(line: 141, column: 5, scope: !500)
!881 = !DILocation(line: 141, column: 10, scope: !500)
!882 = !DILocation(line: 141, column: 15, scope: !500)
!883 = !DILocation(line: 142, column: 21, scope: !500)
!884 = !DILocation(line: 142, column: 5, scope: !500)
!885 = !DILocation(line: 142, column: 10, scope: !500)
!886 = !DILocation(line: 142, column: 19, scope: !500)
!887 = !DILocation(line: 143, column: 21, scope: !500)
!888 = !DILocation(line: 143, column: 5, scope: !500)
!889 = !DILocation(line: 143, column: 10, scope: !500)
!890 = !DILocation(line: 143, column: 19, scope: !500)
!891 = !DILocation(line: 144, column: 31, scope: !500)
!892 = !DILocation(line: 144, column: 5, scope: !500)
!893 = !DILocation(line: 144, column: 11, scope: !500)
!894 = !DILocation(line: 144, column: 28, scope: !500)
!895 = !DILocation(line: 146, column: 12, scope: !500)
!896 = !DILocation(line: 146, column: 5, scope: !500)
!897 = !DILocation(line: 147, column: 1, scope: !500)
!898 = distinct !DISubprogram(name: "ff_h2645_packet_split", scope: !486, file: !486, line: 388, type: !899, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !553)
!899 = !DISubroutineType(types: !900)
!900 = !{!474, !901, !503, !474, !473, !474, !474, !3, !474, !474}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645Packet", file: !507, line: 81, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645Packet", file: !507, line: 76, size: 320, align: 64, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nals", scope: !903, file: !507, line: 77, baseType: !526, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp", scope: !903, file: !507, line: 78, baseType: !506, size: 192, align: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nb_nals", scope: !903, file: !507, line: 79, baseType: !474, size: 32, align: 32, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nals_allocated", scope: !903, file: !507, line: 80, baseType: !474, size: 32, align: 32, offset: 288)
!909 = !DILocalVariable(name: "g", arg: 1, scope: !910, file: !911, line: 154, type: !914)
!910 = distinct !DISubprogram(name: "bytestream2_get_bytes_left", scope: !911, file: !911, line: 154, type: !912, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !553)
!911 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!912 = !DISubroutineType(types: !913)
!913 = !{!475, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !911, line: 35, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !911, line: 33, size: 192, align: 64, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !916, file: !911, line: 34, baseType: !503, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !916, file: !911, line: 34, baseType: !503, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !916, file: !911, line: 34, baseType: !503, size: 64, align: 64, offset: 128)
!921 = !DILocation(line: 154, column: 102, scope: !910, inlinedAt: !922)
!922 = distinct !DILocation(line: 431, column: 18, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !486, line: 431, column: 17)
!924 = distinct !DILexicalBlock(scope: !925, file: !486, line: 420, column: 16)
!925 = distinct !DILexicalBlock(scope: !926, file: !486, line: 410, column: 13)
!926 = distinct !DILexicalBlock(scope: !898, file: !486, line: 405, column: 50)
!927 = !DILocation(line: 154, column: 102, scope: !910, inlinedAt: !928)
!928 = distinct !DILocation(line: 442, column: 32, scope: !924)
!929 = !DILocalVariable(name: "g", arg: 1, scope: !930, file: !911, line: 188, type: !914)
!930 = distinct !DISubprogram(name: "bytestream2_tell", scope: !911, file: !911, line: 188, type: !931, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !553)
!931 = !DISubroutineType(types: !932)
!932 = !{!474, !914}
!933 = !DILocation(line: 188, column: 83, scope: !930, inlinedAt: !934)
!934 = distinct !DILocation(line: 442, column: 79, scope: !935)
!935 = !DILexicalBlockFile(scope: !924, file: !486, discriminator: 4)
!936 = !DILocation(line: 188, column: 83, scope: !930, inlinedAt: !937)
!937 = distinct !DILocation(line: 442, column: 116, scope: !938)
!938 = !DILexicalBlockFile(scope: !924, file: !486, discriminator: 1)
!939 = !DILocation(line: 154, column: 102, scope: !910, inlinedAt: !940)
!940 = distinct !DILocation(line: 442, column: 142, scope: !941)
!941 = !DILexicalBlockFile(scope: !924, file: !486, discriminator: 2)
!942 = !DILocation(line: 188, column: 83, scope: !930, inlinedAt: !943)
!943 = distinct !DILocation(line: 444, column: 17, scope: !944)
!944 = distinct !DILexicalBlock(scope: !924, file: !486, line: 444, column: 17)
!945 = !DILocation(line: 188, column: 83, scope: !930, inlinedAt: !946)
!946 = distinct !DILocation(line: 446, column: 50, scope: !947)
!947 = distinct !DILexicalBlock(scope: !944, file: !486, line: 444, column: 52)
!948 = !DILocalVariable(name: "g", arg: 1, scope: !949, file: !911, line: 164, type: !914)
!949 = distinct !DISubprogram(name: "bytestream2_skip", scope: !911, file: !911, line: 164, type: !950, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !553)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !914, !475}
!952 = !DILocation(line: 164, column: 84, scope: !949, inlinedAt: !953)
!953 = distinct !DILocation(line: 446, column: 17, scope: !954)
!954 = !DILexicalBlockFile(scope: !947, file: !486, discriminator: 1)
!955 = !DILocalVariable(name: "size", arg: 2, scope: !949, file: !911, line: 165, type: !475)
!956 = !DILocation(line: 165, column: 60, scope: !949, inlinedAt: !953)
!957 = !DILocation(line: 164, column: 84, scope: !949, inlinedAt: !958)
!958 = distinct !DILocation(line: 429, column: 13, scope: !924)
!959 = !DILocation(line: 165, column: 60, scope: !949, inlinedAt: !958)
!960 = !DILocation(line: 164, column: 84, scope: !949, inlinedAt: !961)
!961 = distinct !DILocation(line: 483, column: 9, scope: !926)
!962 = !DILocation(line: 165, column: 60, scope: !949, inlinedAt: !961)
!963 = !DILocation(line: 154, column: 102, scope: !910, inlinedAt: !964)
!964 = distinct !DILocation(line: 486, column: 13, scope: !965)
!965 = distinct !DILexicalBlock(scope: !926, file: !486, line: 486, column: 13)
!966 = !DILocalVariable(name: "x", arg: 1, scope: !967, file: !968, line: 66, type: !481)
!967 = distinct !DISubprogram(name: "av_bswap32", scope: !968, file: !968, line: 66, type: !969, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !553)
!968 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
