; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_core.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_core.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DCAVLC = type { i32, i32, [7 x %struct.VLC] }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.DCACoreDecoder = type { %struct.AVCodecContext*, %struct.GetBitContext, %struct.GetBitContext, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [7 x i8], [7 x i8], [7 x i8], [7 x i8], [7 x i8], [7 x i8], [7 x [10 x i8]], [7 x [10 x i32]], [16 x i8], [7 x [64 x i8]], [7 x [64 x i16]], [7 x [64 x i8]], [16 x [7 x [32 x i8]]], [7 x [32 x [2 x i32]]], [7 x i8], [7 x [64 x i32]], i32, i32, [24 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [12 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32*, [7 x [64 x i32*]], i32, i32*, [7 x [32 x i32*]], i32*, [24 x i8], [7 x %struct.DCADSPData], %struct.DCADSPContext*, %struct.DCADCTContext, [2 x %struct.FFTContext], %struct.SynthFilterContext, %struct.AVFloatDSPContext*, %struct.AVFixedDSPContext*, i32, i8*, [32 x i32*], i32, float, [32 x i32], i32, i32, i32, i32, [16 x i8] }

!1066 = distinct !DISubprogram(name: "AV_ZERO128", scope: !1047, file: !1047, line: 83, type: !1067, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1054)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !1051}
!1069 = !{!1070}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1065, file: !1047, line: 85, baseType: !1057, size: 128, align: 64)
!1071 = !{!1072, !1077, !1081}
!1072 = distinct !DIGlobalVariable(name: "block_code_nbits", scope: !0, file: !898, line: 64, type: !1073, isLocal: true, isDefinition: true, variable: [7 x i8]* @block_code_nbits)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 56, align: 8, elements: !1075)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1075 = !{!1076}
!1076 = !DISubrange(count: 7)
!1077 = distinct !DIGlobalVariable(name: "audio_mode_ch_mask", scope: !0, file: !898, line: 51, type: !1078, isLocal: true, isDefinition: true, variable: [10 x i8]* @audio_mode_ch_mask)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 80, align: 8, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 10)
!1081 = distinct !DIGlobalVariable(name: "prm_ch_to_spkr_map", scope: !0, file: !898, line: 38, type: !1082, isLocal: true, isDefinition: true, variable: [10 x [5 x i8]]* @prm_ch_to_spkr_map)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 400, align: 8, elements: !1086)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1031, line: 36, baseType: !1085)
!1085 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1086 = !{!1080, !1087}
!1087 = !DISubrange(count: 5)
!1088 = !{i32 2, !"Dwarf Version", i32 4}
!1089 = !{i32 2, !"Debug Info Version", i32 3}
!1090 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1091 = distinct !DISubprogram(name: "ff_dca_core_parse", scope: !898, file: !898, line: 1798, type: !1092, isLocal: false, isDefinition: true, scopeLine: 1799, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1054)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!1027, !1094, !1223, !1027}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCACoreDecoder", file: !986, line: 214, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCACoreDecoder", file: !986, line: 101, size: 372992, align: 256, elements: !1097)
!1097 = !{!1098, !1816, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1851, !1852, !1853, !1854, !1855, !1856, !1859, !1861, !1865, !1869, !1873, !1874, !1878, !1881, !1882, !1884, !1885, !1886, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1900, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1916, !1917, !1918, !1921, !1922, !1948, !2101, !2102, !2104, !2105, !2148, !2181, !2182, !2183, !2185, !2186, !2187, !2189, !2190, !2191, !2192}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1096, file: !986, line: 102, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1102)
!1102 = !{!1103, !1147, !1148, !1149, !1415, !1416, !1417, !1418, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1571, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1754, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1101, file: !35, line: 1561, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1108)
!1108 = !{!1109, !1113, !1117, !1121, !1122, !1123, !1124, !1128, !1134, !1136, !1140}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1107, file: !4, line: 72, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1107, file: !4, line: 78, baseType: !1114, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!1110, !1051}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1107, file: !4, line: 85, baseType: !1118, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1107, file: !4, line: 93, baseType: !1027, size: 32, align: 32, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1107, file: !4, line: 99, baseType: !1027, size: 32, align: 32, offset: 224)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1107, file: !4, line: 108, baseType: !1027, size: 32, align: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1107, file: !4, line: 113, baseType: !1125, size: 64, align: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!1051, !1051, !1051}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1107, file: !4, line: 123, baseType: !1129, size: 64, align: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1132, !1132}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1107, file: !4, line: 130, baseType: !1135, size: 32, align: 32, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1107, file: !4, line: 136, baseType: !1137, size: 64, align: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!1135, !1051}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1107, file: !4, line: 142, baseType: !1141, size: 64, align: 64, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!1027, !1144, !1051, !1110, !1027}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1101, file: !35, line: 1562, baseType: !1027, size: 32, align: 32, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1101, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1101, file: !35, line: 1565, baseType: !1150, size: 64, align: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1168, !1171, !1174, !1177, !1180, !1181, !1182, !1190, !1191, !1192, !1194, !1198, !1204, !1214, !1218, !1219, !1267, !1386, !1390, !1391, !1395, !1399, !1404, !1408, !1409, !1410}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !35, line: 3475, baseType: !1110, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1152, file: !35, line: 3480, baseType: !1110, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1152, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1152, file: !35, line: 3487, baseType: !1027, size: 32, align: 32, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1152, file: !35, line: 3488, baseType: !1160, size: 64, align: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1163, line: 61, baseType: !1164)
!1163 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1163, line: 58, size: 64, align: 32, elements: !1165)
!1165 = !{!1166, !1167}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1164, file: !1163, line: 59, baseType: !1027, size: 32, align: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1164, file: !1163, line: 60, baseType: !1027, size: 32, align: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1152, file: !35, line: 3489, baseType: !1169, size: 64, align: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1152, file: !35, line: 3490, baseType: !1172, size: 64, align: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1152, file: !35, line: 3491, baseType: !1175, size: 64, align: 64, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1152, file: !35, line: 3492, baseType: !1178, size: 64, align: 64, offset: 512)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1152, file: !35, line: 3493, baseType: !1039, size: 8, align: 8, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1152, file: !35, line: 3494, baseType: !1104, size: 64, align: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1152, file: !35, line: 3495, baseType: !1183, size: 64, align: 64, offset: 704)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1186, file: !35, line: 3402, baseType: !1027, size: 32, align: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1186, file: !35, line: 3403, baseType: !1110, size: 64, align: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1152, file: !35, line: 3507, baseType: !1110, size: 64, align: 64, offset: 768)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1152, file: !35, line: 3516, baseType: !1027, size: 32, align: 32, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1152, file: !35, line: 3517, baseType: !1193, size: 64, align: 64, offset: 896)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1152, file: !35, line: 3527, baseType: !1195, size: 64, align: 64, offset: 960)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!1027, !1099}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1152, file: !35, line: 3535, baseType: !1199, size: 64, align: 64, offset: 1024)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!1027, !1099, !1202}
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1152, file: !35, line: 3541, baseType: !1205, size: 64, align: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1209, line: 223, size: 128, align: 64, elements: !1210)
!1209 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1210 = !{!1211, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1208, file: !1209, line: 224, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1208, file: !1209, line: 225, baseType: !1212, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1152, file: !35, line: 3549, baseType: !1215, size: 64, align: 64, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !1193}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1152, file: !35, line: 3551, baseType: !1195, size: 64, align: 64, offset: 1216)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1152, file: !35, line: 3552, baseType: !1220, size: 64, align: 64, offset: 1280)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!1027, !1099, !1223, !1027, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1227)
!1227 = !{!1228, !1231, !1232, !1233, !1234, !1266}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1226, file: !35, line: 3921, baseType: !1229, size: 16, align: 16)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1031, line: 49, baseType: !1230)
!1230 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1226, file: !35, line: 3922, baseType: !1038, size: 32, align: 32, offset: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1226, file: !35, line: 3923, baseType: !1038, size: 32, align: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1226, file: !35, line: 3924, baseType: !1028, size: 32, align: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1226, file: !35, line: 3925, baseType: !1235, size: 64, align: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1255, !1259, !1261, !1262, !1264, !1265}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1238, file: !35, line: 3886, baseType: !1027, size: 32, align: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1238, file: !35, line: 3887, baseType: !1027, size: 32, align: 32, offset: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1238, file: !35, line: 3888, baseType: !1027, size: 32, align: 32, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1238, file: !35, line: 3889, baseType: !1027, size: 32, align: 32, offset: 96)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1238, file: !35, line: 3890, baseType: !1027, size: 32, align: 32, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1238, file: !35, line: 3897, baseType: !1246, size: 768, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1248)
!1248 = !{!1249, !1253}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1247, file: !35, line: 3855, baseType: !1250, size: 512, align: 64)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1223, size: 512, align: 64, elements: !1251)
!1251 = !{!1252}
!1252 = !DISubrange(count: 8)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1247, file: !35, line: 3857, baseType: !1254, size: 256, align: 32, offset: 512)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 256, align: 32, elements: !1251)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !35, line: 3903, baseType: !1256, size: 256, align: 64, offset: 960)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1223, size: 256, align: 64, elements: !1257)
!1257 = !{!1258}
!1258 = !DISubrange(count: 4)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1238, file: !35, line: 3904, baseType: !1260, size: 128, align: 32, offset: 1216)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 128, align: 32, elements: !1257)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1238, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1238, file: !35, line: 3908, baseType: !1263, size: 64, align: 64, offset: 1408)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1238, file: !35, line: 3915, baseType: !1263, size: 64, align: 64, offset: 1472)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1238, file: !35, line: 3917, baseType: !1027, size: 32, align: 32, offset: 1536)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1226, file: !35, line: 3926, baseType: !1041, size: 64, align: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1152, file: !35, line: 3564, baseType: !1268, size: 64, align: 64, offset: 1344)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!1027, !1099, !1271, !1305, !1385}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1274)
!1274 = !{!1275, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1301, !1302, !1303, !1304}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1273, file: !35, line: 1451, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1278, line: 94, baseType: !1279)
!1278 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1278, line: 81, size: 192, align: 64, elements: !1280)
!1280 = !{!1281, !1285, !1286}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1279, file: !1278, line: 82, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1278, line: 73, baseType: !1284)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1278, line: 73, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1279, file: !1278, line: 89, baseType: !1223, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1279, file: !1278, line: 93, baseType: !1027, size: 32, align: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1273, file: !35, line: 1461, baseType: !1041, size: 64, align: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1273, file: !35, line: 1467, baseType: !1041, size: 64, align: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1273, file: !35, line: 1468, baseType: !1223, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1273, file: !35, line: 1469, baseType: !1027, size: 32, align: 32, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1273, file: !35, line: 1470, baseType: !1027, size: 32, align: 32, offset: 288)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1273, file: !35, line: 1474, baseType: !1027, size: 32, align: 32, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1273, file: !35, line: 1479, baseType: !1294, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1297)
!1297 = !{!1298, !1299, !1300}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1296, file: !35, line: 1412, baseType: !1223, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1296, file: !35, line: 1413, baseType: !1027, size: 32, align: 32, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1296, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1273, file: !35, line: 1480, baseType: !1027, size: 32, align: 32, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1273, file: !35, line: 1486, baseType: !1041, size: 64, align: 64, offset: 512)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1273, file: !35, line: 1488, baseType: !1041, size: 64, align: 64, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1273, file: !35, line: 1497, baseType: !1041, size: 64, align: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1339, !1341, !1342, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1373, !1374, !1375, !1376, !1377, !1378, !1381, !1382, !1383, !1384}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1308, file: !758, line: 282, baseType: !1250, size: 512, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1308, file: !758, line: 299, baseType: !1254, size: 256, align: 32, offset: 512)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1308, file: !758, line: 315, baseType: !1313, size: 64, align: 64, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1308, file: !758, line: 326, baseType: !1027, size: 32, align: 32, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1308, file: !758, line: 326, baseType: !1027, size: 32, align: 32, offset: 864)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1308, file: !758, line: 334, baseType: !1027, size: 32, align: 32, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1308, file: !758, line: 341, baseType: !1027, size: 32, align: 32, offset: 928)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1308, file: !758, line: 346, baseType: !1027, size: 32, align: 32, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1308, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1308, file: !758, line: 356, baseType: !1162, size: 64, align: 32, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1308, file: !758, line: 361, baseType: !1041, size: 64, align: 64, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1308, file: !758, line: 369, baseType: !1041, size: 64, align: 64, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1308, file: !758, line: 377, baseType: !1041, size: 64, align: 64, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1308, file: !758, line: 382, baseType: !1027, size: 32, align: 32, offset: 1280)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1308, file: !758, line: 386, baseType: !1027, size: 32, align: 32, offset: 1312)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1308, file: !758, line: 391, baseType: !1027, size: 32, align: 32, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1308, file: !758, line: 396, baseType: !1051, size: 64, align: 64, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1308, file: !758, line: 403, baseType: !1329, size: 512, align: 64, offset: 1472)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 512, align: 64, elements: !1251)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1308, file: !758, line: 410, baseType: !1027, size: 32, align: 32, offset: 1984)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1308, file: !758, line: 415, baseType: !1027, size: 32, align: 32, offset: 2016)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1308, file: !758, line: 420, baseType: !1027, size: 32, align: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1308, file: !758, line: 425, baseType: !1027, size: 32, align: 32, offset: 2080)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1308, file: !758, line: 435, baseType: !1041, size: 64, align: 64, offset: 2112)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1308, file: !758, line: 440, baseType: !1027, size: 32, align: 32, offset: 2176)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1308, file: !758, line: 445, baseType: !1043, size: 64, align: 64, offset: 2240)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1308, file: !758, line: 459, baseType: !1338, size: 512, align: 64, offset: 2304)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 512, align: 64, elements: !1251)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1308, file: !758, line: 473, baseType: !1340, size: 64, align: 64, offset: 2816)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1308, file: !758, line: 477, baseType: !1027, size: 32, align: 32, offset: 2880)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1308, file: !758, line: 479, baseType: !1343, size: 64, align: 64, offset: 2944)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1356}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1346, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1346, file: !758, line: 203, baseType: !1223, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1346, file: !758, line: 204, baseType: !1027, size: 32, align: 32, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1346, file: !758, line: 205, baseType: !1352, size: 64, align: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1354, line: 86, baseType: !1355)
!1354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1354, line: 86, flags: DIFlagFwdDecl)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1346, file: !758, line: 206, baseType: !1276, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1308, file: !758, line: 480, baseType: !1027, size: 32, align: 32, offset: 3008)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1308, file: !758, line: 505, baseType: !1027, size: 32, align: 32, offset: 3040)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1308, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1308, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1308, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1308, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1308, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1308, file: !758, line: 532, baseType: !1041, size: 64, align: 64, offset: 3264)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1308, file: !758, line: 539, baseType: !1041, size: 64, align: 64, offset: 3328)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1308, file: !758, line: 547, baseType: !1041, size: 64, align: 64, offset: 3392)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1308, file: !758, line: 554, baseType: !1352, size: 64, align: 64, offset: 3456)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1308, file: !758, line: 563, baseType: !1027, size: 32, align: 32, offset: 3520)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1308, file: !758, line: 572, baseType: !1027, size: 32, align: 32, offset: 3552)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1308, file: !758, line: 581, baseType: !1027, size: 32, align: 32, offset: 3584)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1308, file: !758, line: 588, baseType: !1372, size: 64, align: 64, offset: 3648)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1308, file: !758, line: 593, baseType: !1027, size: 32, align: 32, offset: 3712)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1308, file: !758, line: 596, baseType: !1027, size: 32, align: 32, offset: 3744)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1308, file: !758, line: 599, baseType: !1276, size: 64, align: 64, offset: 3776)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1308, file: !758, line: 605, baseType: !1276, size: 64, align: 64, offset: 3840)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1308, file: !758, line: 616, baseType: !1276, size: 64, align: 64, offset: 3904)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1308, file: !758, line: 626, baseType: !1379, size: 64, align: 64, offset: 3968)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1380, line: 216, baseType: !1044)
!1380 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1308, file: !758, line: 627, baseType: !1379, size: 64, align: 64, offset: 4032)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1308, file: !758, line: 628, baseType: !1379, size: 64, align: 64, offset: 4096)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1308, file: !758, line: 629, baseType: !1379, size: 64, align: 64, offset: 4160)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1308, file: !758, line: 645, baseType: !1276, size: 64, align: 64, offset: 4224)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1152, file: !35, line: 3566, baseType: !1387, size: 64, align: 64, offset: 1408)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!1027, !1099, !1051, !1385, !1271}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1152, file: !35, line: 3567, baseType: !1195, size: 64, align: 64, offset: 1472)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1152, file: !35, line: 3576, baseType: !1392, size: 64, align: 64, offset: 1536)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!1027, !1099, !1305}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1152, file: !35, line: 3577, baseType: !1396, size: 64, align: 64, offset: 1600)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!1027, !1099, !1271}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1152, file: !35, line: 3584, baseType: !1400, size: 64, align: 64, offset: 1664)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!1027, !1099, !1403}
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1152, file: !35, line: 3589, baseType: !1405, size: 64, align: 64, offset: 1728)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{null, !1099}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1152, file: !35, line: 3594, baseType: !1027, size: 32, align: 32, offset: 1792)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1152, file: !35, line: 3600, baseType: !1110, size: 64, align: 64, offset: 1856)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1152, file: !35, line: 3609, baseType: !1411, size: 64, align: 64, offset: 1920)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1101, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1101, file: !35, line: 1581, baseType: !1028, size: 32, align: 32, offset: 224)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1101, file: !35, line: 1583, baseType: !1051, size: 64, align: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1101, file: !35, line: 1591, baseType: !1419, size: 64, align: 64, offset: 320)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1209, line: 129, size: 1664, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426, !1444, !1445, !1451, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1420, file: !1209, line: 136, baseType: !1027, size: 32, align: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1420, file: !1209, line: 151, baseType: !1027, size: 32, align: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1420, file: !1209, line: 157, baseType: !1027, size: 32, align: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1420, file: !1209, line: 159, baseType: !1403, size: 64, align: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1420, file: !1209, line: 161, baseType: !1427, size: 64, align: 64, offset: 192)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1209, line: 117, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1209, line: 100, size: 832, align: 64, elements: !1430)
!1430 = !{!1431, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1429, file: !1209, line: 105, baseType: !1432, size: 256, align: 64)
!1432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1433, size: 256, align: 64, elements: !1257)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1278, line: 238, baseType: !1435)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1278, line: 238, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1429, file: !1209, line: 110, baseType: !1027, size: 32, align: 32, offset: 256)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1429, file: !1209, line: 111, baseType: !1027, size: 32, align: 32, offset: 288)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1429, file: !1209, line: 111, baseType: !1027, size: 32, align: 32, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1429, file: !1209, line: 112, baseType: !1254, size: 256, align: 32, offset: 352)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1429, file: !1209, line: 113, baseType: !1260, size: 128, align: 32, offset: 608)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1429, file: !1209, line: 114, baseType: !1027, size: 32, align: 32, offset: 736)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1429, file: !1209, line: 115, baseType: !1027, size: 32, align: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1429, file: !1209, line: 116, baseType: !1027, size: 32, align: 32, offset: 800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1420, file: !1209, line: 163, baseType: !1051, size: 64, align: 64, offset: 256)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1420, file: !1209, line: 165, baseType: !1446, size: 128, align: 64, offset: 320)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1209, line: 122, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1209, line: 119, size: 128, align: 64, elements: !1448)
!1448 = !{!1449, !1450}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1447, file: !1209, line: 120, baseType: !1271, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1447, file: !1209, line: 121, baseType: !1403, size: 64, align: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1420, file: !1209, line: 166, baseType: !1452, size: 128, align: 64, offset: 448)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1209, line: 127, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1209, line: 124, size: 128, align: 64, elements: !1454)
!1454 = !{!1455, !1528}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1453, file: !1209, line: 125, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1460)
!1460 = !{!1461, !1462, !1486, !1490, !1491, !1525, !1526, !1527}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1459, file: !35, line: 5751, baseType: !1104, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1459, file: !35, line: 5756, baseType: !1463, size: 64, align: 64, offset: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1466)
!1466 = !{!1467, !1468, !1471, !1472, !1473, !1477, !1481, !1485}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1465, file: !35, line: 5797, baseType: !1110, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1465, file: !35, line: 5804, baseType: !1469, size: 64, align: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1465, file: !35, line: 5815, baseType: !1104, size: 64, align: 64, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1465, file: !35, line: 5825, baseType: !1027, size: 32, align: 32, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1465, file: !35, line: 5826, baseType: !1474, size: 64, align: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{!1027, !1457}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1465, file: !35, line: 5827, baseType: !1478, size: 64, align: 64, offset: 320)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!1027, !1457, !1271}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1465, file: !35, line: 5828, baseType: !1482, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{null, !1457}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1465, file: !35, line: 5829, baseType: !1482, size: 64, align: 64, offset: 448)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1459, file: !35, line: 5762, baseType: !1487, size: 64, align: 64, offset: 128)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1489)
!1489 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1459, file: !35, line: 5768, baseType: !1051, size: 64, align: 64, offset: 192)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1459, file: !35, line: 5775, baseType: !1492, size: 64, align: 64, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1495)
!1495 = !{!1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1494, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1494, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1494, file: !35, line: 3948, baseType: !1038, size: 32, align: 32, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1494, file: !35, line: 3958, baseType: !1223, size: 64, align: 64, offset: 128)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1494, file: !35, line: 3962, baseType: !1027, size: 32, align: 32, offset: 192)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1494, file: !35, line: 3968, baseType: !1027, size: 32, align: 32, offset: 224)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1494, file: !35, line: 3973, baseType: !1041, size: 64, align: 64, offset: 256)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1494, file: !35, line: 3986, baseType: !1027, size: 32, align: 32, offset: 320)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1494, file: !35, line: 3999, baseType: !1027, size: 32, align: 32, offset: 352)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1494, file: !35, line: 4004, baseType: !1027, size: 32, align: 32, offset: 384)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1494, file: !35, line: 4005, baseType: !1027, size: 32, align: 32, offset: 416)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1494, file: !35, line: 4010, baseType: !1027, size: 32, align: 32, offset: 448)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1494, file: !35, line: 4011, baseType: !1027, size: 32, align: 32, offset: 480)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1494, file: !35, line: 4020, baseType: !1162, size: 64, align: 32, offset: 512)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1494, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1494, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1494, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1494, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1494, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1494, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1494, file: !35, line: 4039, baseType: !1027, size: 32, align: 32, offset: 768)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1494, file: !35, line: 4046, baseType: !1043, size: 64, align: 64, offset: 832)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1494, file: !35, line: 4050, baseType: !1027, size: 32, align: 32, offset: 896)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1494, file: !35, line: 4054, baseType: !1027, size: 32, align: 32, offset: 928)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1494, file: !35, line: 4061, baseType: !1027, size: 32, align: 32, offset: 960)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1494, file: !35, line: 4065, baseType: !1027, size: 32, align: 32, offset: 992)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1494, file: !35, line: 4073, baseType: !1027, size: 32, align: 32, offset: 1024)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1494, file: !35, line: 4080, baseType: !1027, size: 32, align: 32, offset: 1056)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1494, file: !35, line: 4084, baseType: !1027, size: 32, align: 32, offset: 1088)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1459, file: !35, line: 5781, baseType: !1492, size: 64, align: 64, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1459, file: !35, line: 5787, baseType: !1162, size: 64, align: 32, offset: 384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1459, file: !35, line: 5793, baseType: !1162, size: 64, align: 32, offset: 448)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1453, file: !1209, line: 126, baseType: !1027, size: 32, align: 32, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1420, file: !1209, line: 172, baseType: !1271, size: 64, align: 64, offset: 576)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1420, file: !1209, line: 177, baseType: !1223, size: 64, align: 64, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1420, file: !1209, line: 178, baseType: !1028, size: 32, align: 32, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1420, file: !1209, line: 180, baseType: !1051, size: 64, align: 64, offset: 768)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1420, file: !1209, line: 185, baseType: !1027, size: 32, align: 32, offset: 832)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1420, file: !1209, line: 190, baseType: !1051, size: 64, align: 64, offset: 896)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1420, file: !1209, line: 195, baseType: !1027, size: 32, align: 32, offset: 960)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1420, file: !1209, line: 200, baseType: !1271, size: 64, align: 64, offset: 1024)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1420, file: !1209, line: 201, baseType: !1027, size: 32, align: 32, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1420, file: !1209, line: 202, baseType: !1403, size: 64, align: 64, offset: 1152)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1420, file: !1209, line: 203, baseType: !1027, size: 32, align: 32, offset: 1216)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1420, file: !1209, line: 205, baseType: !1027, size: 32, align: 32, offset: 1248)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1420, file: !1209, line: 206, baseType: !1027, size: 32, align: 32, offset: 1280)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1420, file: !1209, line: 209, baseType: !1379, size: 64, align: 64, offset: 1344)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1420, file: !1209, line: 212, baseType: !1379, size: 64, align: 64, offset: 1408)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1420, file: !1209, line: 213, baseType: !1403, size: 64, align: 64, offset: 1472)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1420, file: !1209, line: 215, baseType: !1027, size: 32, align: 32, offset: 1536)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1420, file: !1209, line: 217, baseType: !1027, size: 32, align: 32, offset: 1568)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1420, file: !1209, line: 220, baseType: !1027, size: 32, align: 32, offset: 1600)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1101, file: !35, line: 1598, baseType: !1051, size: 64, align: 64, offset: 384)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1101, file: !35, line: 1606, baseType: !1041, size: 64, align: 64, offset: 448)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1101, file: !35, line: 1614, baseType: !1027, size: 32, align: 32, offset: 512)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1101, file: !35, line: 1622, baseType: !1027, size: 32, align: 32, offset: 544)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1101, file: !35, line: 1628, baseType: !1027, size: 32, align: 32, offset: 576)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !35, line: 1636, baseType: !1027, size: 32, align: 32, offset: 608)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1101, file: !35, line: 1643, baseType: !1027, size: 32, align: 32, offset: 640)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1101, file: !35, line: 1657, baseType: !1223, size: 64, align: 64, offset: 704)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1101, file: !35, line: 1658, baseType: !1027, size: 32, align: 32, offset: 768)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1101, file: !35, line: 1679, baseType: !1162, size: 64, align: 32, offset: 800)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1101, file: !35, line: 1688, baseType: !1027, size: 32, align: 32, offset: 864)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1101, file: !35, line: 1712, baseType: !1027, size: 32, align: 32, offset: 896)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1101, file: !35, line: 1729, baseType: !1027, size: 32, align: 32, offset: 928)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1101, file: !35, line: 1729, baseType: !1027, size: 32, align: 32, offset: 960)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1101, file: !35, line: 1744, baseType: !1027, size: 32, align: 32, offset: 992)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1101, file: !35, line: 1744, baseType: !1027, size: 32, align: 32, offset: 1024)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1101, file: !35, line: 1751, baseType: !1027, size: 32, align: 32, offset: 1056)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1101, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1101, file: !35, line: 1791, baseType: !1567, size: 64, align: 64, offset: 1152)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{null, !1570, !1305, !1385, !1027, !1027, !1027}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1101, file: !35, line: 1808, baseType: !1572, size: 64, align: 64, offset: 1216)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!494, !1570, !1169}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1101, file: !35, line: 1816, baseType: !1027, size: 32, align: 32, offset: 1280)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1101, file: !35, line: 1825, baseType: !1063, size: 32, align: 32, offset: 1312)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1101, file: !35, line: 1830, baseType: !1027, size: 32, align: 32, offset: 1344)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1101, file: !35, line: 1838, baseType: !1063, size: 32, align: 32, offset: 1376)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1101, file: !35, line: 1846, baseType: !1027, size: 32, align: 32, offset: 1408)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1101, file: !35, line: 1851, baseType: !1027, size: 32, align: 32, offset: 1440)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1101, file: !35, line: 1861, baseType: !1063, size: 32, align: 32, offset: 1472)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1101, file: !35, line: 1868, baseType: !1063, size: 32, align: 32, offset: 1504)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1101, file: !35, line: 1875, baseType: !1063, size: 32, align: 32, offset: 1536)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1101, file: !35, line: 1882, baseType: !1063, size: 32, align: 32, offset: 1568)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1101, file: !35, line: 1889, baseType: !1063, size: 32, align: 32, offset: 1600)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1101, file: !35, line: 1896, baseType: !1063, size: 32, align: 32, offset: 1632)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1101, file: !35, line: 1903, baseType: !1063, size: 32, align: 32, offset: 1664)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1101, file: !35, line: 1910, baseType: !1027, size: 32, align: 32, offset: 1696)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1101, file: !35, line: 1915, baseType: !1027, size: 32, align: 32, offset: 1728)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1101, file: !35, line: 1926, baseType: !1385, size: 64, align: 64, offset: 1792)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1101, file: !35, line: 1935, baseType: !1162, size: 64, align: 32, offset: 1856)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1101, file: !35, line: 1942, baseType: !1027, size: 32, align: 32, offset: 1920)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1101, file: !35, line: 1948, baseType: !1027, size: 32, align: 32, offset: 1952)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1101, file: !35, line: 1954, baseType: !1027, size: 32, align: 32, offset: 1984)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1101, file: !35, line: 1960, baseType: !1027, size: 32, align: 32, offset: 2016)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1101, file: !35, line: 1984, baseType: !1027, size: 32, align: 32, offset: 2048)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1101, file: !35, line: 1991, baseType: !1027, size: 32, align: 32, offset: 2080)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1101, file: !35, line: 1996, baseType: !1027, size: 32, align: 32, offset: 2112)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1101, file: !35, line: 2004, baseType: !1027, size: 32, align: 32, offset: 2144)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1101, file: !35, line: 2011, baseType: !1027, size: 32, align: 32, offset: 2176)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1101, file: !35, line: 2018, baseType: !1027, size: 32, align: 32, offset: 2208)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1101, file: !35, line: 2027, baseType: !1027, size: 32, align: 32, offset: 2240)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1101, file: !35, line: 2034, baseType: !1027, size: 32, align: 32, offset: 2272)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1101, file: !35, line: 2044, baseType: !1027, size: 32, align: 32, offset: 2304)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1101, file: !35, line: 2054, baseType: !1606, size: 64, align: 64, offset: 2368)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1101, file: !35, line: 2061, baseType: !1606, size: 64, align: 64, offset: 2432)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1101, file: !35, line: 2066, baseType: !1027, size: 32, align: 32, offset: 2496)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1101, file: !35, line: 2070, baseType: !1027, size: 32, align: 32, offset: 2528)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1101, file: !35, line: 2078, baseType: !1027, size: 32, align: 32, offset: 2560)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1101, file: !35, line: 2085, baseType: !1027, size: 32, align: 32, offset: 2592)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1101, file: !35, line: 2092, baseType: !1027, size: 32, align: 32, offset: 2624)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1101, file: !35, line: 2099, baseType: !1027, size: 32, align: 32, offset: 2656)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1101, file: !35, line: 2106, baseType: !1027, size: 32, align: 32, offset: 2688)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1101, file: !35, line: 2113, baseType: !1027, size: 32, align: 32, offset: 2720)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1101, file: !35, line: 2120, baseType: !1027, size: 32, align: 32, offset: 2752)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1101, file: !35, line: 2125, baseType: !1027, size: 32, align: 32, offset: 2784)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1101, file: !35, line: 2133, baseType: !1027, size: 32, align: 32, offset: 2816)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1101, file: !35, line: 2140, baseType: !1027, size: 32, align: 32, offset: 2848)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1101, file: !35, line: 2145, baseType: !1027, size: 32, align: 32, offset: 2880)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1101, file: !35, line: 2153, baseType: !1027, size: 32, align: 32, offset: 2912)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1101, file: !35, line: 2158, baseType: !1027, size: 32, align: 32, offset: 2944)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1101, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1101, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1101, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1101, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1101, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1101, file: !35, line: 2203, baseType: !1027, size: 32, align: 32, offset: 3136)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1101, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1101, file: !35, line: 2212, baseType: !1027, size: 32, align: 32, offset: 3200)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1101, file: !35, line: 2213, baseType: !1027, size: 32, align: 32, offset: 3232)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1101, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1101, file: !35, line: 2232, baseType: !1027, size: 32, align: 32, offset: 3296)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1101, file: !35, line: 2243, baseType: !1027, size: 32, align: 32, offset: 3328)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1101, file: !35, line: 2249, baseType: !1027, size: 32, align: 32, offset: 3360)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1101, file: !35, line: 2256, baseType: !1027, size: 32, align: 32, offset: 3392)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1101, file: !35, line: 2263, baseType: !1043, size: 64, align: 64, offset: 3456)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1101, file: !35, line: 2270, baseType: !1043, size: 64, align: 64, offset: 3520)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1101, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1101, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1101, file: !35, line: 2367, baseType: !1642, size: 64, align: 64, offset: 3648)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!1027, !1570, !1403, !1027}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1101, file: !35, line: 2383, baseType: !1027, size: 32, align: 32, offset: 3712)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1101, file: !35, line: 2386, baseType: !1063, size: 32, align: 32, offset: 3744)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1101, file: !35, line: 2387, baseType: !1063, size: 32, align: 32, offset: 3776)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1101, file: !35, line: 2394, baseType: !1027, size: 32, align: 32, offset: 3808)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1101, file: !35, line: 2401, baseType: !1027, size: 32, align: 32, offset: 3840)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1101, file: !35, line: 2408, baseType: !1027, size: 32, align: 32, offset: 3872)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1101, file: !35, line: 2415, baseType: !1027, size: 32, align: 32, offset: 3904)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1101, file: !35, line: 2422, baseType: !1027, size: 32, align: 32, offset: 3936)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1101, file: !35, line: 2423, baseType: !1654, size: 64, align: 64, offset: 3968)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1656)
!1656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1657)
!1657 = !{!1658, !1659, !1660, !1661}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1656, file: !35, line: 827, baseType: !1027, size: 32, align: 32)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1656, file: !35, line: 828, baseType: !1027, size: 32, align: 32, offset: 32)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1656, file: !35, line: 829, baseType: !1027, size: 32, align: 32, offset: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1656, file: !35, line: 830, baseType: !1063, size: 32, align: 32, offset: 96)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1101, file: !35, line: 2430, baseType: !1041, size: 64, align: 64, offset: 4032)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1101, file: !35, line: 2437, baseType: !1041, size: 64, align: 64, offset: 4096)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1101, file: !35, line: 2444, baseType: !1063, size: 32, align: 32, offset: 4160)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1101, file: !35, line: 2451, baseType: !1063, size: 32, align: 32, offset: 4192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1101, file: !35, line: 2458, baseType: !1027, size: 32, align: 32, offset: 4224)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1101, file: !35, line: 2469, baseType: !1027, size: 32, align: 32, offset: 4256)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1101, file: !35, line: 2475, baseType: !1027, size: 32, align: 32, offset: 4288)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1101, file: !35, line: 2481, baseType: !1027, size: 32, align: 32, offset: 4320)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1101, file: !35, line: 2485, baseType: !1027, size: 32, align: 32, offset: 4352)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1101, file: !35, line: 2489, baseType: !1027, size: 32, align: 32, offset: 4384)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1101, file: !35, line: 2493, baseType: !1027, size: 32, align: 32, offset: 4416)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1101, file: !35, line: 2501, baseType: !1027, size: 32, align: 32, offset: 4448)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1101, file: !35, line: 2506, baseType: !1027, size: 32, align: 32, offset: 4480)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1101, file: !35, line: 2510, baseType: !1027, size: 32, align: 32, offset: 4512)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1101, file: !35, line: 2514, baseType: !1041, size: 64, align: 64, offset: 4544)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1101, file: !35, line: 2528, baseType: !1678, size: 64, align: 64, offset: 4608)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1570, !1051, !1027, !1027}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1101, file: !35, line: 2534, baseType: !1027, size: 32, align: 32, offset: 4672)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1101, file: !35, line: 2545, baseType: !1027, size: 32, align: 32, offset: 4704)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1101, file: !35, line: 2547, baseType: !1027, size: 32, align: 32, offset: 4736)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1101, file: !35, line: 2549, baseType: !1027, size: 32, align: 32, offset: 4768)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1101, file: !35, line: 2551, baseType: !1027, size: 32, align: 32, offset: 4800)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1101, file: !35, line: 2553, baseType: !1027, size: 32, align: 32, offset: 4832)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1101, file: !35, line: 2555, baseType: !1027, size: 32, align: 32, offset: 4864)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1101, file: !35, line: 2557, baseType: !1027, size: 32, align: 32, offset: 4896)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1101, file: !35, line: 2559, baseType: !1027, size: 32, align: 32, offset: 4928)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1101, file: !35, line: 2563, baseType: !1027, size: 32, align: 32, offset: 4960)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1101, file: !35, line: 2571, baseType: !1263, size: 64, align: 64, offset: 4992)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1101, file: !35, line: 2579, baseType: !1263, size: 64, align: 64, offset: 5056)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1101, file: !35, line: 2586, baseType: !1027, size: 32, align: 32, offset: 5120)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1101, file: !35, line: 2615, baseType: !1027, size: 32, align: 32, offset: 5152)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1101, file: !35, line: 2627, baseType: !1027, size: 32, align: 32, offset: 5184)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1101, file: !35, line: 2637, baseType: !1027, size: 32, align: 32, offset: 5216)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1101, file: !35, line: 2681, baseType: !1027, size: 32, align: 32, offset: 5248)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1101, file: !35, line: 2709, baseType: !1041, size: 64, align: 64, offset: 5312)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1101, file: !35, line: 2716, baseType: !1700, size: 64, align: 64, offset: 5376)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1703)
!1703 = !{!1704, !1705, !1706, !1707, !1708, !1709, !1710, !1714, !1718, !1719, !1720, !1721, !1727, !1728, !1729, !1730, !1731}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1702, file: !35, line: 3642, baseType: !1110, size: 64, align: 64)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1702, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1702, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1702, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1702, file: !35, line: 3669, baseType: !1027, size: 32, align: 32, offset: 160)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1702, file: !35, line: 3682, baseType: !1400, size: 64, align: 64, offset: 192)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1702, file: !35, line: 3698, baseType: !1711, size: 64, align: 64, offset: 256)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!1027, !1099, !1212, !1038}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1702, file: !35, line: 3712, baseType: !1715, size: 64, align: 64, offset: 320)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!1027, !1099, !1027, !1212, !1038}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1702, file: !35, line: 3726, baseType: !1711, size: 64, align: 64, offset: 384)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1702, file: !35, line: 3737, baseType: !1195, size: 64, align: 64, offset: 448)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1702, file: !35, line: 3746, baseType: !1027, size: 32, align: 32, offset: 512)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1702, file: !35, line: 3757, baseType: !1722, size: 64, align: 64, offset: 576)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64, align: 64)
!1723 = !DISubroutineType(types: !1724)
!1724 = !{null, !1725}
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1702, file: !35, line: 3766, baseType: !1195, size: 64, align: 64, offset: 640)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1702, file: !35, line: 3774, baseType: !1195, size: 64, align: 64, offset: 704)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1702, file: !35, line: 3780, baseType: !1027, size: 32, align: 32, offset: 768)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1702, file: !35, line: 3785, baseType: !1027, size: 32, align: 32, offset: 800)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1702, file: !35, line: 3795, baseType: !1732, size: 64, align: 64, offset: 832)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!1027, !1099, !1276}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1101, file: !35, line: 2728, baseType: !1051, size: 64, align: 64, offset: 5440)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1101, file: !35, line: 2735, baseType: !1329, size: 512, align: 64, offset: 5504)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1101, file: !35, line: 2742, baseType: !1027, size: 32, align: 32, offset: 6016)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1101, file: !35, line: 2755, baseType: !1027, size: 32, align: 32, offset: 6048)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1101, file: !35, line: 2776, baseType: !1027, size: 32, align: 32, offset: 6080)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1101, file: !35, line: 2783, baseType: !1027, size: 32, align: 32, offset: 6112)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1101, file: !35, line: 2791, baseType: !1027, size: 32, align: 32, offset: 6144)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1101, file: !35, line: 2802, baseType: !1403, size: 64, align: 64, offset: 6208)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1101, file: !35, line: 2811, baseType: !1027, size: 32, align: 32, offset: 6272)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1101, file: !35, line: 2821, baseType: !1027, size: 32, align: 32, offset: 6304)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1101, file: !35, line: 2830, baseType: !1027, size: 32, align: 32, offset: 6336)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1101, file: !35, line: 2840, baseType: !1027, size: 32, align: 32, offset: 6368)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1101, file: !35, line: 2851, baseType: !1748, size: 64, align: 64, offset: 6400)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1749, size: 64, align: 64)
!1749 = !DISubroutineType(types: !1750)
!1750 = !{!1027, !1570, !1751, !1051, !1385, !1027, !1027}
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64, align: 64)
!1752 = !DISubroutineType(types: !1753)
!1753 = !{!1027, !1570, !1051}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1101, file: !35, line: 2871, baseType: !1755, size: 64, align: 64, offset: 6464)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64, align: 64)
!1756 = !DISubroutineType(types: !1757)
!1757 = !{!1027, !1570, !1758, !1051, !1385, !1027}
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64, align: 64)
!1759 = !DISubroutineType(types: !1760)
!1760 = !{!1027, !1570, !1051, !1027, !1027}
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1101, file: !35, line: 2878, baseType: !1027, size: 32, align: 32, offset: 6528)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1101, file: !35, line: 2885, baseType: !1027, size: 32, align: 32, offset: 6560)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1101, file: !35, line: 3005, baseType: !1027, size: 32, align: 32, offset: 6592)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1101, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1101, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1101, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1101, file: !35, line: 3037, baseType: !1223, size: 64, align: 64, offset: 6720)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1101, file: !35, line: 3038, baseType: !1027, size: 32, align: 32, offset: 6784)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1101, file: !35, line: 3050, baseType: !1043, size: 64, align: 64, offset: 6848)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1101, file: !35, line: 3065, baseType: !1027, size: 32, align: 32, offset: 6912)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1101, file: !35, line: 3083, baseType: !1027, size: 32, align: 32, offset: 6944)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1101, file: !35, line: 3092, baseType: !1162, size: 64, align: 32, offset: 6976)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1101, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1101, file: !35, line: 3106, baseType: !1162, size: 64, align: 32, offset: 7072)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1101, file: !35, line: 3113, baseType: !1776, size: 64, align: 64, offset: 7168)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64, align: 64)
!1777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1778)
!1778 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1779)
!1779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1780)
!1780 = !{!1781, !1782, !1783, !1784, !1785, !1786, !1789}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1779, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1779, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1779, file: !35, line: 720, baseType: !1110, size: 64, align: 64, offset: 64)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1779, file: !35, line: 724, baseType: !1110, size: 64, align: 64, offset: 128)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1779, file: !35, line: 728, baseType: !1027, size: 32, align: 32, offset: 192)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1779, file: !35, line: 734, baseType: !1787, size: 64, align: 64, offset: 256)
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1788, size: 64, align: 64)
!1788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1779, file: !35, line: 739, baseType: !1790, size: 64, align: 64, offset: 320)
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64, align: 64)
!1791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1101, file: !35, line: 3129, baseType: !1041, size: 64, align: 64, offset: 7232)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1101, file: !35, line: 3130, baseType: !1041, size: 64, align: 64, offset: 7296)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1101, file: !35, line: 3131, baseType: !1041, size: 64, align: 64, offset: 7360)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1101, file: !35, line: 3132, baseType: !1041, size: 64, align: 64, offset: 7424)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1101, file: !35, line: 3139, baseType: !1263, size: 64, align: 64, offset: 7488)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1101, file: !35, line: 3147, baseType: !1027, size: 32, align: 32, offset: 7552)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1101, file: !35, line: 3165, baseType: !1027, size: 32, align: 32, offset: 7584)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1101, file: !35, line: 3172, baseType: !1027, size: 32, align: 32, offset: 7616)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1101, file: !35, line: 3180, baseType: !1027, size: 32, align: 32, offset: 7648)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1101, file: !35, line: 3191, baseType: !1606, size: 64, align: 64, offset: 7680)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1101, file: !35, line: 3199, baseType: !1223, size: 64, align: 64, offset: 7744)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1101, file: !35, line: 3207, baseType: !1263, size: 64, align: 64, offset: 7808)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1101, file: !35, line: 3214, baseType: !1028, size: 32, align: 32, offset: 7872)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1101, file: !35, line: 3224, baseType: !1294, size: 64, align: 64, offset: 7936)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1101, file: !35, line: 3225, baseType: !1027, size: 32, align: 32, offset: 8000)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1101, file: !35, line: 3249, baseType: !1276, size: 64, align: 64, offset: 8064)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1101, file: !35, line: 3256, baseType: !1027, size: 32, align: 32, offset: 8128)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1101, file: !35, line: 3271, baseType: !1027, size: 32, align: 32, offset: 8160)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1101, file: !35, line: 3279, baseType: !1041, size: 64, align: 64, offset: 8192)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1101, file: !35, line: 3301, baseType: !1276, size: 64, align: 64, offset: 8256)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1101, file: !35, line: 3310, baseType: !1027, size: 32, align: 32, offset: 8320)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1101, file: !35, line: 3337, baseType: !1027, size: 32, align: 32, offset: 8352)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1101, file: !35, line: 3351, baseType: !1027, size: 32, align: 32, offset: 8384)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1101, file: !35, line: 3359, baseType: !1027, size: 32, align: 32, offset: 8416)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1096, file: !986, line: 103, baseType: !1817, size: 256, align: 64, offset: 64)
!1817 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1818, line: 70, baseType: !1819)
!1818 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1818, line: 61, size: 256, align: 64, elements: !1820)
!1820 = !{!1821, !1822, !1823, !1824, !1825}
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1819, file: !1818, line: 62, baseType: !1212, size: 64, align: 64)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1819, file: !1818, line: 62, baseType: !1212, size: 64, align: 64, offset: 64)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1819, file: !1818, line: 67, baseType: !1027, size: 32, align: 32, offset: 128)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1819, file: !1818, line: 68, baseType: !1027, size: 32, align: 32, offset: 160)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1819, file: !1818, line: 69, baseType: !1027, size: 32, align: 32, offset: 192)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "gb_in", scope: !1096, file: !986, line: 104, baseType: !1817, size: 256, align: 64, offset: 320)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "crc_present", scope: !1096, file: !986, line: 107, baseType: !1027, size: 32, align: 32, offset: 576)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "npcmblocks", scope: !1096, file: !986, line: 108, baseType: !1027, size: 32, align: 32, offset: 608)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1096, file: !986, line: 109, baseType: !1027, size: 32, align: 32, offset: 640)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mode", scope: !1096, file: !986, line: 110, baseType: !1027, size: 32, align: 32, offset: 672)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1096, file: !986, line: 111, baseType: !1027, size: 32, align: 32, offset: 704)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1096, file: !986, line: 112, baseType: !1027, size: 32, align: 32, offset: 736)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "drc_present", scope: !1096, file: !986, line: 113, baseType: !1027, size: 32, align: 32, offset: 768)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "ts_present", scope: !1096, file: !986, line: 114, baseType: !1027, size: 32, align: 32, offset: 800)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "aux_present", scope: !1096, file: !986, line: 115, baseType: !1027, size: 32, align: 32, offset: 832)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "ext_audio_type", scope: !1096, file: !986, line: 116, baseType: !1027, size: 32, align: 32, offset: 864)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "ext_audio_present", scope: !1096, file: !986, line: 117, baseType: !1027, size: 32, align: 32, offset: 896)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "sync_ssf", scope: !1096, file: !986, line: 118, baseType: !1027, size: 32, align: 32, offset: 928)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_present", scope: !1096, file: !986, line: 119, baseType: !1027, size: 32, align: 32, offset: 960)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_history", scope: !1096, file: !986, line: 120, baseType: !1027, size: 32, align: 32, offset: 992)
