; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_ps.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_ps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVRational = type { i32, i32 }
%struct.H264ParamSets = type { [32 x %struct.AVBufferRef*], [256 x %struct.AVBufferRef*], %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.PPS*, %struct.SPS* }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.PPS = type { i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, [6 x [16 x i8]], [6 x [64 x i8]], [2 x [88 x i8]], i32, [4096 x i8], i64, [6 x [88 x [16 x i32]]], [6 x [88 x [64 x i32]]], [6 x [16 x i32]*], [6 x [64 x i32]*] }
%struct.SPS = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i16], i32, i32, i32, [6 x [16 x i8]], [6 x [64 x i8]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [4096 x i8], i64 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }

!818 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFrameSideDataType", file: !819, line: 48, size: 32, align: 32, elements: !820)
!819 = !DIFile(filename: "./libavutil/frame.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!821 = !DIEnumerator(name: "AV_FRAME_DATA_PANSCAN", value: 0)
!822 = !DIEnumerator(name: "AV_FRAME_DATA_A53_CC", value: 1)
!823 = !DIEnumerator(name: "AV_FRAME_DATA_STEREO3D", value: 2)
!824 = !DIEnumerator(name: "AV_FRAME_DATA_MATRIXENCODING", value: 3)
!825 = !DIEnumerator(name: "AV_FRAME_DATA_DOWNMIX_INFO", value: 4)
!826 = !DIEnumerator(name: "AV_FRAME_DATA_REPLAYGAIN", value: 5)
!827 = !DIEnumerator(name: "AV_FRAME_DATA_DISPLAYMATRIX", value: 6)
!828 = !DIEnumerator(name: "AV_FRAME_DATA_AFD", value: 7)
!829 = !DIEnumerator(name: "AV_FRAME_DATA_MOTION_VECTORS", value: 8)
!830 = !DIEnumerator(name: "AV_FRAME_DATA_SKIP_SAMPLES", value: 9)
!831 = !DIEnumerator(name: "AV_FRAME_DATA_AUDIO_SERVICE_TYPE", value: 10)
!832 = !DIEnumerator(name: "AV_FRAME_DATA_MASTERING_DISPLAY_METADATA", value: 11)
!833 = !DIEnumerator(name: "AV_FRAME_DATA_GOP_TIMECODE", value: 12)
!834 = !DIEnumerator(name: "AV_FRAME_DATA_SPHERICAL", value: 13)
!835 = !DIEnumerator(name: "AV_FRAME_DATA_CONTENT_LIGHT_LEVEL", value: 14)
!836 = !DIEnumerator(name: "AV_FRAME_DATA_ICC_PROFILE", value: 15)
!837 = !DIEnumerator(name: "AV_FRAME_DATA_QP_TABLE_PROPERTIES", value: 16)
!838 = !DIEnumerator(name: "AV_FRAME_DATA_QP_TABLE_DATA", value: 17)
!839 = !DIEnumerator(name: "AV_FRAME_DATA_S12M_TIMECODE", value: 18)
!840 = !DIEnumerator(name: "AV_FRAME_DATA_DYNAMIC_HDR_PLUS", value: 19)
!841 = !DIEnumerator(name: "AV_FRAME_DATA_REGIONS_OF_INTEREST", value: 20)
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorRange", file: !4, line: 516, size: 32, align: 32, elements: !843)
!843 = !{!844, !845, !846, !847}
!844 = !DIEnumerator(name: "AVCOL_RANGE_UNSPECIFIED", value: 0)
!845 = !DIEnumerator(name: "AVCOL_RANGE_MPEG", value: 1)
!846 = !DIEnumerator(name: "AVCOL_RANGE_JPEG", value: 2)
!847 = !DIEnumerator(name: "AVCOL_RANGE_NB", value: 3)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !4, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !97, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !97, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !97, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !894, !896, !978, !1027, !1029, !949, !935, !1035}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPS", file: !890, line: 104, baseType: !891)
!890 = !DIFile(filename: "libavcodec/h264_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SPS", file: !890, line: 44, size: 42432, align: 64, elements: !892)
!892 = !{!893, !895, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !927, !928, !929, !930, !931, !932, !933, !934, !937, !938, !939, !944, !945, !946, !947, !954, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !974}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !891, file: !890, line: 45, baseType: !894, size: 32, align: 32)
!894 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !891, file: !890, line: 46, baseType: !896, size: 32, align: 32, offset: 32)
!896 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !891, file: !890, line: 47, baseType: !896, size: 32, align: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !891, file: !890, line: 48, baseType: !896, size: 32, align: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "transform_bypass", scope: !891, file: !890, line: 49, baseType: !896, size: 32, align: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num", scope: !891, file: !890, line: 50, baseType: !896, size: 32, align: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "poc_type", scope: !891, file: !890, line: 51, baseType: !896, size: 32, align: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !891, file: !890, line: 52, baseType: !896, size: 32, align: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !891, file: !890, line: 53, baseType: !896, size: 32, align: 32, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !891, file: !890, line: 54, baseType: !896, size: 32, align: 32, offset: 288)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !891, file: !890, line: 55, baseType: !896, size: 32, align: 32, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "poc_cycle_length", scope: !891, file: !890, line: 56, baseType: !896, size: 32, align: 32, offset: 352)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_count", scope: !891, file: !890, line: 57, baseType: !896, size: 32, align: 32, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_allowed_flag", scope: !891, file: !890, line: 58, baseType: !896, size: 32, align: 32, offset: 416)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !891, file: !890, line: 59, baseType: !896, size: 32, align: 32, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !891, file: !890, line: 61, baseType: !896, size: 32, align: 32, offset: 480)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !891, file: !890, line: 62, baseType: !896, size: 32, align: 32, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff", scope: !891, file: !890, line: 63, baseType: !896, size: 32, align: 32, offset: 544)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !891, file: !890, line: 64, baseType: !896, size: 32, align: 32, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !891, file: !890, line: 65, baseType: !896, size: 32, align: 32, offset: 608)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !891, file: !890, line: 68, baseType: !894, size: 32, align: 32, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !891, file: !890, line: 69, baseType: !894, size: 32, align: 32, offset: 672)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !891, file: !890, line: 70, baseType: !894, size: 32, align: 32, offset: 704)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !891, file: !890, line: 71, baseType: !894, size: 32, align: 32, offset: 736)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !891, file: !890, line: 72, baseType: !896, size: 32, align: 32, offset: 768)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !891, file: !890, line: 73, baseType: !921, size: 64, align: 32, offset: 800)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !922, line: 61, baseType: !923)
!922 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !922, line: 58, size: 64, align: 32, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !923, file: !922, line: 59, baseType: !896, size: 32, align: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !923, file: !922, line: 60, baseType: !896, size: 32, align: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !891, file: !890, line: 74, baseType: !896, size: 32, align: 32, offset: 864)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "full_range", scope: !891, file: !890, line: 75, baseType: !896, size: 32, align: 32, offset: 896)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !891, file: !890, line: 76, baseType: !896, size: 32, align: 32, offset: 928)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !891, file: !890, line: 77, baseType: !3, size: 32, align: 32, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !891, file: !890, line: 78, baseType: !22, size: 32, align: 32, offset: 992)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !891, file: !890, line: 79, baseType: !46, size: 32, align: 32, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !891, file: !890, line: 80, baseType: !896, size: 32, align: 32, offset: 1056)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !891, file: !890, line: 81, baseType: !935, size: 32, align: 32, offset: 1088)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !936, line: 51, baseType: !894)
!936 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!937 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !891, file: !890, line: 82, baseType: !935, size: 32, align: 32, offset: 1120)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !891, file: !890, line: 83, baseType: !896, size: 32, align: 32, offset: 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !891, file: !890, line: 84, baseType: !940, size: 4096, align: 16, offset: 1184)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 4096, align: 16, elements: !942)
!941 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!942 = !{!943}
!943 = !DISubrange(count: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !891, file: !890, line: 85, baseType: !896, size: 32, align: 32, offset: 5280)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !891, file: !890, line: 86, baseType: !896, size: 32, align: 32, offset: 5312)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix_present", scope: !891, file: !890, line: 87, baseType: !896, size: 32, align: 32, offset: 5344)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !891, file: !890, line: 88, baseType: !948, size: 768, align: 8, offset: 5376)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 768, align: 8, elements: !951)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !936, line: 48, baseType: !950)
!950 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!951 = !{!952, !953}
!952 = !DISubrange(count: 6)
!953 = !DISubrange(count: 16)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !891, file: !890, line: 89, baseType: !955, size: 3072, align: 8, offset: 6144)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 3072, align: 8, elements: !956)
!956 = !{!952, !957}
!957 = !DISubrange(count: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !891, file: !890, line: 90, baseType: !896, size: 32, align: 32, offset: 9216)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !891, file: !890, line: 91, baseType: !896, size: 32, align: 32, offset: 9248)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !891, file: !890, line: 92, baseType: !896, size: 32, align: 32, offset: 9280)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !891, file: !890, line: 93, baseType: !896, size: 32, align: 32, offset: 9312)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !891, file: !890, line: 94, baseType: !896, size: 32, align: 32, offset: 9344)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length", scope: !891, file: !890, line: 95, baseType: !896, size: 32, align: 32, offset: 9376)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length", scope: !891, file: !890, line: 96, baseType: !896, size: 32, align: 32, offset: 9408)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length", scope: !891, file: !890, line: 97, baseType: !896, size: 32, align: 32, offset: 9440)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma", scope: !891, file: !890, line: 98, baseType: !896, size: 32, align: 32, offset: 9472)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !891, file: !890, line: 99, baseType: !896, size: 32, align: 32, offset: 9504)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "residual_color_transform_flag", scope: !891, file: !890, line: 100, baseType: !896, size: 32, align: 32, offset: 9536)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set_flags", scope: !891, file: !890, line: 101, baseType: !896, size: 32, align: 32, offset: 9568)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !891, file: !890, line: 102, baseType: !971, size: 32768, align: 8, offset: 9600)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 32768, align: 8, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 4096)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !891, file: !890, line: 103, baseType: !975, size: 64, align: 64, offset: 42368)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !976, line: 216, baseType: !977)
!976 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!977 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPS", file: !890, line: 136, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PPS", file: !890, line: 109, size: 1391104, align: 64, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !991, !992, !993, !994, !995, !997, !998, !999, !1000, !1001, !1002, !1003, !1007, !1008, !1009, !1010, !1013, !1016, !1022}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !980, file: !890, line: 110, baseType: !894, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !980, file: !890, line: 111, baseType: !896, size: 32, align: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present", scope: !980, file: !890, line: 112, baseType: !896, size: 32, align: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_count", scope: !980, file: !890, line: 113, baseType: !896, size: 32, align: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mb_slice_group_map_type", scope: !980, file: !890, line: 114, baseType: !896, size: 32, align: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !980, file: !890, line: 115, baseType: !988, size: 64, align: 32, offset: 160)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 64, align: 32, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 2)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred", scope: !980, file: !890, line: 116, baseType: !896, size: 32, align: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !980, file: !890, line: 117, baseType: !896, size: 32, align: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "init_qp", scope: !980, file: !890, line: 118, baseType: !896, size: 32, align: 32, offset: 288)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "init_qs", scope: !980, file: !890, line: 119, baseType: !896, size: 32, align: 32, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !980, file: !890, line: 120, baseType: !996, size: 64, align: 32, offset: 352)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 64, align: 32, elements: !989)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_parameters_present", scope: !980, file: !890, line: 121, baseType: !896, size: 32, align: 32, offset: 416)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred", scope: !980, file: !890, line: 122, baseType: !896, size: 32, align: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present", scope: !980, file: !890, line: 123, baseType: !896, size: 32, align: 32, offset: 480)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode", scope: !980, file: !890, line: 124, baseType: !896, size: 32, align: 32, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !980, file: !890, line: 125, baseType: !948, size: 768, align: 8, offset: 544)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !980, file: !890, line: 126, baseType: !955, size: 3072, align: 8, offset: 1312)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !980, file: !890, line: 127, baseType: !1004, size: 1408, align: 8, offset: 4384)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 1408, align: 8, elements: !1005)
!1005 = !{!990, !1006}
!1006 = !DISubrange(count: 88)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_diff", scope: !980, file: !890, line: 128, baseType: !896, size: 32, align: 32, offset: 5792)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !980, file: !890, line: 129, baseType: !971, size: 32768, align: 8, offset: 5824)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !980, file: !890, line: 130, baseType: !975, size: 64, align: 64, offset: 38592)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_buffer", scope: !980, file: !890, line: 132, baseType: !1011, size: 270336, align: 32, offset: 38656)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 270336, align: 32, elements: !1012)
!1012 = !{!952, !1006, !953}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_buffer", scope: !980, file: !890, line: 133, baseType: !1014, size: 1081344, align: 32, offset: 308992)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 1081344, align: 32, elements: !1015)
!1015 = !{!952, !1006, !957}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_coeff", scope: !980, file: !890, line: 134, baseType: !1017, size: 384, align: 64, offset: 1390336)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 384, align: 64, elements: !1021)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 512, align: 32, elements: !1020)
!1020 = !{!953}
!1021 = !{!952}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_coeff", scope: !980, file: !890, line: 135, baseType: !1023, size: 384, align: 64, offset: 1390720)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 384, align: 64, elements: !1021)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 2048, align: 32, elements: !1026)
!1026 = !{!957}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1032, line: 221, size: 32, align: 8, elements: !1033)
!1032 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1031, file: !1032, line: 221, baseType: !935, size: 32, align: 32)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1036 = !{!1037, !1788, !1791, !1794, !1799}
!1037 = distinct !DIGlobalVariable(name: "csp", scope: !1038, file: !1039, line: 591, type: !1785, isLocal: true, isDefinition: true, variable: [4 x [5 x i8]]* @ff_h264_decode_seq_parameter_set.csp)
!1038 = distinct !DISubprogram(name: "ff_h264_decode_seq_parameter_set", scope: !1039, file: !1039, line: 333, type: !1040, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1784)
!1039 = !DIFile(filename: "libavcodec/h264_ps.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!896, !1042, !1054, !1768, !896}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1044, line: 70, baseType: !1045)
!1044 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1044, line: 61, size: 256, align: 64, elements: !1046)
!1046 = !{!1047, !1050, !1051, !1052, !1053}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1045, file: !1044, line: 62, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1045, file: !1044, line: 62, baseType: !1048, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1045, file: !1044, line: 67, baseType: !896, size: 32, align: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1045, file: !1044, line: 68, baseType: !896, size: 32, align: 32, offset: 160)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1045, file: !1044, line: 69, baseType: !896, size: 32, align: 32, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !97, line: 3360, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !97, line: 1556, size: 8448, align: 64, elements: !1057)
!1057 = !{!1058, !1102, !1103, !1104, !1366, !1367, !1368, !1369, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1522, !1526, !1527, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1706, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1056, file: !97, line: 1561, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !66, line: 143, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !66, line: 67, size: 640, align: 64, elements: !1063)
!1063 = !{!1064, !1068, !1072, !1076, !1077, !1078, !1079, !1083, !1089, !1091, !1095}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1062, file: !66, line: 72, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1062, file: !66, line: 78, baseType: !1069, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!1065, !1035}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1062, file: !66, line: 85, baseType: !1073, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !66, line: 85, flags: DIFlagFwdDecl)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1062, file: !66, line: 93, baseType: !896, size: 32, align: 32, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1062, file: !66, line: 99, baseType: !896, size: 32, align: 32, offset: 224)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1062, file: !66, line: 108, baseType: !896, size: 32, align: 32, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1062, file: !66, line: 113, baseType: !1080, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1035, !1035, !1035}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1062, file: !66, line: 123, baseType: !1084, size: 64, align: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!1087, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1062, file: !66, line: 130, baseType: !1090, size: 32, align: 32, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !66, line: 48, baseType: !65)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1062, file: !66, line: 136, baseType: !1092, size: 64, align: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!1090, !1035}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1062, file: !66, line: 142, baseType: !1096, size: 64, align: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!896, !1099, !1035, !1065, !896}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !66, line: 60, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1056, file: !97, line: 1562, baseType: !896, size: 32, align: 32, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1056, file: !97, line: 1564, baseType: !86, size: 32, align: 32, offset: 96)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1056, file: !97, line: 1565, baseType: !1105, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !97, line: 3468, size: 1984, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1117, !1120, !1123, !1126, !1130, !1131, !1132, !1140, !1141, !1142, !1144, !1148, !1154, !1163, !1167, !1168, !1218, !1337, !1341, !1342, !1346, !1350, !1355, !1359, !1360, !1361}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1107, file: !97, line: 3475, baseType: !1065, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1107, file: !97, line: 3480, baseType: !1065, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1107, file: !97, line: 3481, baseType: !86, size: 32, align: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1107, file: !97, line: 3482, baseType: !96, size: 32, align: 32, offset: 160)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1107, file: !97, line: 3487, baseType: !896, size: 32, align: 32, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1107, file: !97, line: 3488, baseType: !1115, size: 64, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1107, file: !97, line: 3489, baseType: !1118, size: 64, align: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1107, file: !97, line: 3490, baseType: !1121, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1107, file: !97, line: 3491, baseType: !1124, size: 64, align: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1107, file: !97, line: 3492, baseType: !1127, size: 64, align: 64, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !936, line: 55, baseType: !977)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1107, file: !97, line: 3493, baseType: !949, size: 8, align: 8, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1107, file: !97, line: 3494, baseType: !1059, size: 64, align: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1107, file: !97, line: 3495, baseType: !1133, size: 64, align: 64, offset: 704)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !97, line: 3404, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !97, line: 3401, size: 128, align: 64, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1136, file: !97, line: 3402, baseType: !896, size: 32, align: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1136, file: !97, line: 3403, baseType: !1065, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1107, file: !97, line: 3507, baseType: !1065, size: 64, align: 64, offset: 768)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1107, file: !97, line: 3516, baseType: !896, size: 32, align: 32, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1107, file: !97, line: 3517, baseType: !1143, size: 64, align: 64, offset: 896)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1107, file: !97, line: 3527, baseType: !1145, size: 64, align: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!896, !1054}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1107, file: !97, line: 3535, baseType: !1149, size: 64, align: 64, offset: 1024)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!896, !1054, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1107, file: !97, line: 3541, baseType: !1155, size: 64, align: 64, offset: 1088)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !97, line: 3461, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1159, line: 223, size: 128, align: 64, elements: !1160)
!1159 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1158, file: !1159, line: 224, baseType: !1048, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1158, file: !1159, line: 225, baseType: !1048, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1107, file: !97, line: 3549, baseType: !1164, size: 64, align: 64, offset: 1152)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null, !1143}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1107, file: !97, line: 3551, baseType: !1145, size: 64, align: 64, offset: 1216)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1107, file: !97, line: 3552, baseType: !1169, size: 64, align: 64, offset: 1280)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!896, !1054, !1172, !896, !1173}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !97, line: 3920, size: 256, align: 64, elements: !1176)
!1176 = !{!1177, !1180, !1181, !1182, !1183, !1215}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1175, file: !97, line: 3921, baseType: !1178, size: 16, align: 16)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !936, line: 49, baseType: !1179)
!1179 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1175, file: !97, line: 3922, baseType: !935, size: 32, align: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1175, file: !97, line: 3923, baseType: !935, size: 32, align: 32, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1175, file: !97, line: 3924, baseType: !894, size: 32, align: 32, offset: 96)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1175, file: !97, line: 3925, baseType: !1184, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !97, line: 3918, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !97, line: 3885, size: 1600, align: 64, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1194, !1204, !1208, !1210, !1211, !1213, !1214}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1187, file: !97, line: 3886, baseType: !896, size: 32, align: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1187, file: !97, line: 3887, baseType: !896, size: 32, align: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1187, file: !97, line: 3888, baseType: !896, size: 32, align: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1187, file: !97, line: 3889, baseType: !896, size: 32, align: 32, offset: 96)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1187, file: !97, line: 3890, baseType: !896, size: 32, align: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1187, file: !97, line: 3897, baseType: !1195, size: 768, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !97, line: 3858, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !97, line: 3853, size: 768, align: 64, elements: !1197)
!1197 = !{!1198, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1196, file: !97, line: 3855, baseType: !1199, size: 512, align: 64)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 512, align: 64, elements: !1200)
!1200 = !{!1201}
!1201 = !DISubrange(count: 8)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1196, file: !97, line: 3857, baseType: !1203, size: 256, align: 32, offset: 512)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 256, align: 32, elements: !1200)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !97, line: 3903, baseType: !1205, size: 256, align: 64, offset: 960)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 256, align: 64, elements: !1206)
!1206 = !{!1207}
!1207 = !DISubrange(count: 4)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !97, line: 3904, baseType: !1209, size: 128, align: 32, offset: 1216)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 128, align: 32, elements: !1206)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1187, file: !97, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1187, file: !97, line: 3908, baseType: !1212, size: 64, align: 64, offset: 1408)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1187, file: !97, line: 3915, baseType: !1212, size: 64, align: 64, offset: 1472)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1187, file: !97, line: 3917, baseType: !896, size: 32, align: 32, offset: 1536)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1175, file: !97, line: 3926, baseType: !1216, size: 64, align: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !936, line: 40, baseType: !1217)
!1217 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1107, file: !97, line: 3564, baseType: !1219, size: 64, align: 64, offset: 1344)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!896, !1054, !1222, !1256, !1336}
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !97, line: 1499, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !97, line: 1445, size: 704, align: 64, elements: !1225)
!1225 = !{!1226, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1252, !1253, !1254, !1255}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1224, file: !97, line: 1451, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1229, line: 94, baseType: !1230)
!1229 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1229, line: 81, size: 192, align: 64, elements: !1231)
!1231 = !{!1232, !1236, !1237}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1230, file: !1229, line: 82, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1229, line: 73, baseType: !1235)
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1229, line: 73, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1230, file: !1229, line: 89, baseType: !1172, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1230, file: !1229, line: 93, baseType: !896, size: 32, align: 32, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1224, file: !97, line: 1461, baseType: !1216, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1224, file: !97, line: 1467, baseType: !1216, size: 64, align: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1224, file: !97, line: 1468, baseType: !1172, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1224, file: !97, line: 1469, baseType: !896, size: 32, align: 32, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1224, file: !97, line: 1470, baseType: !896, size: 32, align: 32, offset: 288)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1224, file: !97, line: 1474, baseType: !896, size: 32, align: 32, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1224, file: !97, line: 1479, baseType: !1245, size: 64, align: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !97, line: 1415, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !97, line: 1411, size: 128, align: 64, elements: !1248)
!1248 = !{!1249, !1250, !1251}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1247, file: !97, line: 1412, baseType: !1172, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1247, file: !97, line: 1413, baseType: !896, size: 32, align: 32, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1247, file: !97, line: 1414, baseType: !778, size: 32, align: 32, offset: 96)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1224, file: !97, line: 1480, baseType: !896, size: 32, align: 32, offset: 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1224, file: !97, line: 1486, baseType: !1216, size: 64, align: 64, offset: 512)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1224, file: !97, line: 1488, baseType: !1216, size: 64, align: 64, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1224, file: !97, line: 1497, baseType: !1216, size: 64, align: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !819, line: 646, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !819, line: 268, size: 4288, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1290, !1292, !1293, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1259, file: !819, line: 282, baseType: !1199, size: 512, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1259, file: !819, line: 299, baseType: !1203, size: 256, align: 32, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1259, file: !819, line: 315, baseType: !1264, size: 64, align: 64, offset: 768)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1259, file: !819, line: 326, baseType: !896, size: 32, align: 32, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1259, file: !819, line: 326, baseType: !896, size: 32, align: 32, offset: 864)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1259, file: !819, line: 334, baseType: !896, size: 32, align: 32, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1259, file: !819, line: 341, baseType: !896, size: 32, align: 32, offset: 928)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1259, file: !819, line: 346, baseType: !896, size: 32, align: 32, offset: 960)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1259, file: !819, line: 351, baseType: !808, size: 32, align: 32, offset: 992)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1259, file: !819, line: 356, baseType: !921, size: 64, align: 32, offset: 1024)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1259, file: !819, line: 361, baseType: !1216, size: 64, align: 64, offset: 1088)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1259, file: !819, line: 369, baseType: !1216, size: 64, align: 64, offset: 1152)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1259, file: !819, line: 377, baseType: !1216, size: 64, align: 64, offset: 1216)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1259, file: !819, line: 382, baseType: !896, size: 32, align: 32, offset: 1280)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1259, file: !819, line: 386, baseType: !896, size: 32, align: 32, offset: 1312)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1259, file: !819, line: 391, baseType: !896, size: 32, align: 32, offset: 1344)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1259, file: !819, line: 396, baseType: !1035, size: 64, align: 64, offset: 1408)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1259, file: !819, line: 403, baseType: !1280, size: 512, align: 64, offset: 1472)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 512, align: 64, elements: !1200)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1259, file: !819, line: 410, baseType: !896, size: 32, align: 32, offset: 1984)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1259, file: !819, line: 415, baseType: !896, size: 32, align: 32, offset: 2016)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1259, file: !819, line: 420, baseType: !896, size: 32, align: 32, offset: 2048)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1259, file: !819, line: 425, baseType: !896, size: 32, align: 32, offset: 2080)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1259, file: !819, line: 435, baseType: !1216, size: 64, align: 64, offset: 2112)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1259, file: !819, line: 440, baseType: !896, size: 32, align: 32, offset: 2176)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1259, file: !819, line: 445, baseType: !1129, size: 64, align: 64, offset: 2240)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1259, file: !819, line: 459, baseType: !1289, size: 512, align: 64, offset: 2304)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1227, size: 512, align: 64, elements: !1200)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1259, file: !819, line: 473, baseType: !1291, size: 64, align: 64, offset: 2816)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1259, file: !819, line: 477, baseType: !896, size: 32, align: 32, offset: 2880)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1259, file: !819, line: 479, baseType: !1294, size: 64, align: 64, offset: 2944)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !819, line: 207, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !819, line: 201, size: 320, align: 64, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1302, !1307}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1297, file: !819, line: 202, baseType: !818, size: 32, align: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1297, file: !819, line: 203, baseType: !1172, size: 64, align: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1297, file: !819, line: 204, baseType: !896, size: 32, align: 32, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1297, file: !819, line: 205, baseType: !1303, size: 64, align: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1305, line: 86, baseType: !1306)
!1305 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1305, line: 86, flags: DIFlagFwdDecl)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1297, file: !819, line: 206, baseType: !1227, size: 64, align: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1259, file: !819, line: 480, baseType: !896, size: 32, align: 32, offset: 3008)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1259, file: !819, line: 505, baseType: !896, size: 32, align: 32, offset: 3040)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1259, file: !819, line: 512, baseType: !842, size: 32, align: 32, offset: 3072)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1259, file: !819, line: 514, baseType: !3, size: 32, align: 32, offset: 3104)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1259, file: !819, line: 516, baseType: !22, size: 32, align: 32, offset: 3136)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1259, file: !819, line: 523, baseType: !46, size: 32, align: 32, offset: 3168)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1259, file: !819, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1259, file: !819, line: 532, baseType: !1216, size: 64, align: 64, offset: 3264)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1259, file: !819, line: 539, baseType: !1216, size: 64, align: 64, offset: 3328)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1259, file: !819, line: 547, baseType: !1216, size: 64, align: 64, offset: 3392)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1259, file: !819, line: 554, baseType: !1303, size: 64, align: 64, offset: 3456)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1259, file: !819, line: 563, baseType: !896, size: 32, align: 32, offset: 3520)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1259, file: !819, line: 572, baseType: !896, size: 32, align: 32, offset: 3552)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1259, file: !819, line: 581, baseType: !896, size: 32, align: 32, offset: 3584)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1259, file: !819, line: 588, baseType: !1323, size: 64, align: 64, offset: 3648)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !936, line: 36, baseType: !1325)
!1325 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1259, file: !819, line: 593, baseType: !896, size: 32, align: 32, offset: 3712)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1259, file: !819, line: 596, baseType: !896, size: 32, align: 32, offset: 3744)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1259, file: !819, line: 599, baseType: !1227, size: 64, align: 64, offset: 3776)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1259, file: !819, line: 605, baseType: !1227, size: 64, align: 64, offset: 3840)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1259, file: !819, line: 616, baseType: !1227, size: 64, align: 64, offset: 3904)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1259, file: !819, line: 626, baseType: !975, size: 64, align: 64, offset: 3968)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1259, file: !819, line: 627, baseType: !975, size: 64, align: 64, offset: 4032)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1259, file: !819, line: 628, baseType: !975, size: 64, align: 64, offset: 4096)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1259, file: !819, line: 629, baseType: !975, size: 64, align: 64, offset: 4160)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1259, file: !819, line: 645, baseType: !1227, size: 64, align: 64, offset: 4224)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1107, file: !97, line: 3566, baseType: !1338, size: 64, align: 64, offset: 1408)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!896, !1054, !1035, !1336, !1222}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1107, file: !97, line: 3567, baseType: !1145, size: 64, align: 64, offset: 1472)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1107, file: !97, line: 3576, baseType: !1343, size: 64, align: 64, offset: 1536)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!896, !1054, !1256}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1107, file: !97, line: 3577, baseType: !1347, size: 64, align: 64, offset: 1600)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!896, !1054, !1222}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1107, file: !97, line: 3584, baseType: !1351, size: 64, align: 64, offset: 1664)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!896, !1054, !1354}
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1107, file: !97, line: 3589, baseType: !1356, size: 64, align: 64, offset: 1728)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{null, !1054}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1107, file: !97, line: 3594, baseType: !896, size: 32, align: 32, offset: 1792)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1107, file: !97, line: 3600, baseType: !1065, size: 64, align: 64, offset: 1856)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1107, file: !97, line: 3609, baseType: !1362, size: 64, align: 64, offset: 1920)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !97, line: 3609, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1056, file: !97, line: 1566, baseType: !96, size: 32, align: 32, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1056, file: !97, line: 1581, baseType: !894, size: 32, align: 32, offset: 224)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1056, file: !97, line: 1583, baseType: !1035, size: 64, align: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1056, file: !97, line: 1591, baseType: !1370, size: 64, align: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1159, line: 129, size: 1664, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1395, !1396, !1402, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1371, file: !1159, line: 136, baseType: !896, size: 32, align: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1371, file: !1159, line: 151, baseType: !896, size: 32, align: 32, offset: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1371, file: !1159, line: 157, baseType: !896, size: 32, align: 32, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1371, file: !1159, line: 159, baseType: !1354, size: 64, align: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1371, file: !1159, line: 161, baseType: !1378, size: 64, align: 64, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1159, line: 117, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1159, line: 100, size: 832, align: 64, elements: !1381)
!1381 = !{!1382, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1380, file: !1159, line: 105, baseType: !1383, size: 256, align: 64)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1384, size: 256, align: 64, elements: !1206)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1229, line: 238, baseType: !1386)
!1386 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1229, line: 238, flags: DIFlagFwdDecl)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1380, file: !1159, line: 110, baseType: !896, size: 32, align: 32, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1380, file: !1159, line: 111, baseType: !896, size: 32, align: 32, offset: 288)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1380, file: !1159, line: 111, baseType: !896, size: 32, align: 32, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1380, file: !1159, line: 112, baseType: !1203, size: 256, align: 32, offset: 352)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1380, file: !1159, line: 113, baseType: !1209, size: 128, align: 32, offset: 608)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1380, file: !1159, line: 114, baseType: !896, size: 32, align: 32, offset: 736)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1380, file: !1159, line: 115, baseType: !896, size: 32, align: 32, offset: 768)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1380, file: !1159, line: 116, baseType: !896, size: 32, align: 32, offset: 800)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1371, file: !1159, line: 163, baseType: !1035, size: 64, align: 64, offset: 256)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1371, file: !1159, line: 165, baseType: !1397, size: 128, align: 64, offset: 320)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1159, line: 122, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1159, line: 119, size: 128, align: 64, elements: !1399)
!1399 = !{!1400, !1401}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1398, file: !1159, line: 120, baseType: !1222, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1398, file: !1159, line: 121, baseType: !1354, size: 64, align: 64, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1371, file: !1159, line: 166, baseType: !1403, size: 128, align: 64, offset: 448)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1159, line: 127, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1159, line: 124, size: 128, align: 64, elements: !1405)
!1405 = !{!1406, !1479}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1404, file: !1159, line: 125, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !97, line: 5794, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !97, line: 5747, size: 512, align: 64, elements: !1411)
!1411 = !{!1412, !1413, !1437, !1441, !1442, !1476, !1477, !1478}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1410, file: !97, line: 5751, baseType: !1059, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1410, file: !97, line: 5756, baseType: !1414, size: 64, align: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !97, line: 5796, size: 512, align: 64, elements: !1417)
!1417 = !{!1418, !1419, !1422, !1423, !1424, !1428, !1432, !1436}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1416, file: !97, line: 5797, baseType: !1065, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1416, file: !97, line: 5804, baseType: !1420, size: 64, align: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1416, file: !97, line: 5815, baseType: !1059, size: 64, align: 64, offset: 128)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1416, file: !97, line: 5825, baseType: !896, size: 32, align: 32, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1416, file: !97, line: 5826, baseType: !1425, size: 64, align: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!896, !1408}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1416, file: !97, line: 5827, baseType: !1429, size: 64, align: 64, offset: 320)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!896, !1408, !1222}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1416, file: !97, line: 5828, baseType: !1433, size: 64, align: 64, offset: 384)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{null, !1408}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1416, file: !97, line: 5829, baseType: !1433, size: 64, align: 64, offset: 448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1410, file: !97, line: 5762, baseType: !1438, size: 64, align: 64, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !97, line: 5735, baseType: !1440)
!1440 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !97, line: 5735, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1410, file: !97, line: 5768, baseType: !1035, size: 64, align: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1410, file: !97, line: 5775, baseType: !1443, size: 64, align: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !97, line: 4085, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !97, line: 3936, size: 1152, align: 64, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1445, file: !97, line: 3940, baseType: !86, size: 32, align: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1445, file: !97, line: 3944, baseType: !96, size: 32, align: 32, offset: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1445, file: !97, line: 3948, baseType: !935, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1445, file: !97, line: 3958, baseType: !1172, size: 64, align: 64, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1445, file: !97, line: 3962, baseType: !896, size: 32, align: 32, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1445, file: !97, line: 3968, baseType: !896, size: 32, align: 32, offset: 224)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1445, file: !97, line: 3973, baseType: !1216, size: 64, align: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1445, file: !97, line: 3986, baseType: !896, size: 32, align: 32, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1445, file: !97, line: 3999, baseType: !896, size: 32, align: 32, offset: 352)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1445, file: !97, line: 4004, baseType: !896, size: 32, align: 32, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1445, file: !97, line: 4005, baseType: !896, size: 32, align: 32, offset: 416)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1445, file: !97, line: 4010, baseType: !896, size: 32, align: 32, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1445, file: !97, line: 4011, baseType: !896, size: 32, align: 32, offset: 480)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1445, file: !97, line: 4020, baseType: !921, size: 64, align: 32, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1445, file: !97, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1445, file: !97, line: 4030, baseType: !842, size: 32, align: 32, offset: 608)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1445, file: !97, line: 4031, baseType: !3, size: 32, align: 32, offset: 640)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1445, file: !97, line: 4032, baseType: !22, size: 32, align: 32, offset: 672)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1445, file: !97, line: 4033, baseType: !46, size: 32, align: 32, offset: 704)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1445, file: !97, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1445, file: !97, line: 4039, baseType: !896, size: 32, align: 32, offset: 768)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1445, file: !97, line: 4046, baseType: !1129, size: 64, align: 64, offset: 832)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1445, file: !97, line: 4050, baseType: !896, size: 32, align: 32, offset: 896)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1445, file: !97, line: 4054, baseType: !896, size: 32, align: 32, offset: 928)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1445, file: !97, line: 4061, baseType: !896, size: 32, align: 32, offset: 960)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1445, file: !97, line: 4065, baseType: !896, size: 32, align: 32, offset: 992)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1445, file: !97, line: 4073, baseType: !896, size: 32, align: 32, offset: 1024)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1445, file: !97, line: 4080, baseType: !896, size: 32, align: 32, offset: 1056)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1445, file: !97, line: 4084, baseType: !896, size: 32, align: 32, offset: 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1410, file: !97, line: 5781, baseType: !1443, size: 64, align: 64, offset: 320)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1410, file: !97, line: 5787, baseType: !921, size: 64, align: 32, offset: 384)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1410, file: !97, line: 5793, baseType: !921, size: 64, align: 32, offset: 448)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1404, file: !1159, line: 126, baseType: !896, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1371, file: !1159, line: 172, baseType: !1222, size: 64, align: 64, offset: 576)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1371, file: !1159, line: 177, baseType: !1172, size: 64, align: 64, offset: 640)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1371, file: !1159, line: 178, baseType: !894, size: 32, align: 32, offset: 704)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1371, file: !1159, line: 180, baseType: !1035, size: 64, align: 64, offset: 768)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1371, file: !1159, line: 185, baseType: !896, size: 32, align: 32, offset: 832)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1371, file: !1159, line: 190, baseType: !1035, size: 64, align: 64, offset: 896)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1371, file: !1159, line: 195, baseType: !896, size: 32, align: 32, offset: 960)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1371, file: !1159, line: 200, baseType: !1222, size: 64, align: 64, offset: 1024)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1371, file: !1159, line: 201, baseType: !896, size: 32, align: 32, offset: 1088)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1371, file: !1159, line: 202, baseType: !1354, size: 64, align: 64, offset: 1152)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1371, file: !1159, line: 203, baseType: !896, size: 32, align: 32, offset: 1216)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1371, file: !1159, line: 205, baseType: !896, size: 32, align: 32, offset: 1248)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1371, file: !1159, line: 206, baseType: !896, size: 32, align: 32, offset: 1280)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1371, file: !1159, line: 209, baseType: !975, size: 64, align: 64, offset: 1344)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1371, file: !1159, line: 212, baseType: !975, size: 64, align: 64, offset: 1408)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1371, file: !1159, line: 213, baseType: !1354, size: 64, align: 64, offset: 1472)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1371, file: !1159, line: 215, baseType: !896, size: 32, align: 32, offset: 1536)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1371, file: !1159, line: 217, baseType: !896, size: 32, align: 32, offset: 1568)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1371, file: !1159, line: 220, baseType: !896, size: 32, align: 32, offset: 1600)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1056, file: !97, line: 1598, baseType: !1035, size: 64, align: 64, offset: 384)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1056, file: !97, line: 1606, baseType: !1216, size: 64, align: 64, offset: 448)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1056, file: !97, line: 1614, baseType: !896, size: 32, align: 32, offset: 512)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1056, file: !97, line: 1622, baseType: !896, size: 32, align: 32, offset: 544)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1056, file: !97, line: 1628, baseType: !896, size: 32, align: 32, offset: 576)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1056, file: !97, line: 1636, baseType: !896, size: 32, align: 32, offset: 608)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1056, file: !97, line: 1643, baseType: !896, size: 32, align: 32, offset: 640)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1056, file: !97, line: 1657, baseType: !1172, size: 64, align: 64, offset: 704)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1056, file: !97, line: 1658, baseType: !896, size: 32, align: 32, offset: 768)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1056, file: !97, line: 1679, baseType: !921, size: 64, align: 32, offset: 800)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1056, file: !97, line: 1688, baseType: !896, size: 32, align: 32, offset: 864)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1056, file: !97, line: 1712, baseType: !896, size: 32, align: 32, offset: 896)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1056, file: !97, line: 1729, baseType: !896, size: 32, align: 32, offset: 928)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1056, file: !97, line: 1729, baseType: !896, size: 32, align: 32, offset: 960)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1056, file: !97, line: 1744, baseType: !896, size: 32, align: 32, offset: 992)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1056, file: !97, line: 1744, baseType: !896, size: 32, align: 32, offset: 1024)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1056, file: !97, line: 1751, baseType: !896, size: 32, align: 32, offset: 1056)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1056, file: !97, line: 1766, baseType: !556, size: 32, align: 32, offset: 1088)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1056, file: !97, line: 1791, baseType: !1518, size: 64, align: 64, offset: 1152)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{null, !1521, !1256, !1336, !896, !896, !896}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1056, file: !97, line: 1808, baseType: !1523, size: 64, align: 64, offset: 1216)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!556, !1521, !1118}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1056, file: !97, line: 1816, baseType: !896, size: 32, align: 32, offset: 1280)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1056, file: !97, line: 1825, baseType: !1528, size: 32, align: 32, offset: 1312)
!1528 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1056, file: !97, line: 1830, baseType: !896, size: 32, align: 32, offset: 1344)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1056, file: !97, line: 1838, baseType: !1528, size: 32, align: 32, offset: 1376)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1056, file: !97, line: 1846, baseType: !896, size: 32, align: 32, offset: 1408)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1056, file: !97, line: 1851, baseType: !896, size: 32, align: 32, offset: 1440)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1056, file: !97, line: 1861, baseType: !1528, size: 32, align: 32, offset: 1472)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1056, file: !97, line: 1868, baseType: !1528, size: 32, align: 32, offset: 1504)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1056, file: !97, line: 1875, baseType: !1528, size: 32, align: 32, offset: 1536)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1056, file: !97, line: 1882, baseType: !1528, size: 32, align: 32, offset: 1568)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1056, file: !97, line: 1889, baseType: !1528, size: 32, align: 32, offset: 1600)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1056, file: !97, line: 1896, baseType: !1528, size: 32, align: 32, offset: 1632)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1056, file: !97, line: 1903, baseType: !1528, size: 32, align: 32, offset: 1664)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1056, file: !97, line: 1910, baseType: !896, size: 32, align: 32, offset: 1696)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1056, file: !97, line: 1915, baseType: !896, size: 32, align: 32, offset: 1728)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1056, file: !97, line: 1926, baseType: !1336, size: 64, align: 64, offset: 1792)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1056, file: !97, line: 1935, baseType: !921, size: 64, align: 32, offset: 1856)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1056, file: !97, line: 1942, baseType: !896, size: 32, align: 32, offset: 1920)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1056, file: !97, line: 1948, baseType: !896, size: 32, align: 32, offset: 1952)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1056, file: !97, line: 1954, baseType: !896, size: 32, align: 32, offset: 1984)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1056, file: !97, line: 1960, baseType: !896, size: 32, align: 32, offset: 2016)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1056, file: !97, line: 1984, baseType: !896, size: 32, align: 32, offset: 2048)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1056, file: !97, line: 1991, baseType: !896, size: 32, align: 32, offset: 2080)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1056, file: !97, line: 1996, baseType: !896, size: 32, align: 32, offset: 2112)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1056, file: !97, line: 2004, baseType: !896, size: 32, align: 32, offset: 2144)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1056, file: !97, line: 2011, baseType: !896, size: 32, align: 32, offset: 2176)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1056, file: !97, line: 2018, baseType: !896, size: 32, align: 32, offset: 2208)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1056, file: !97, line: 2027, baseType: !896, size: 32, align: 32, offset: 2240)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1056, file: !97, line: 2034, baseType: !896, size: 32, align: 32, offset: 2272)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1056, file: !97, line: 2044, baseType: !896, size: 32, align: 32, offset: 2304)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1056, file: !97, line: 2054, baseType: !1558, size: 64, align: 64, offset: 2368)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1056, file: !97, line: 2061, baseType: !1558, size: 64, align: 64, offset: 2432)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1056, file: !97, line: 2066, baseType: !896, size: 32, align: 32, offset: 2496)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1056, file: !97, line: 2070, baseType: !896, size: 32, align: 32, offset: 2528)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1056, file: !97, line: 2078, baseType: !896, size: 32, align: 32, offset: 2560)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1056, file: !97, line: 2085, baseType: !896, size: 32, align: 32, offset: 2592)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1056, file: !97, line: 2092, baseType: !896, size: 32, align: 32, offset: 2624)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1056, file: !97, line: 2099, baseType: !896, size: 32, align: 32, offset: 2656)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1056, file: !97, line: 2106, baseType: !896, size: 32, align: 32, offset: 2688)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1056, file: !97, line: 2113, baseType: !896, size: 32, align: 32, offset: 2720)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1056, file: !97, line: 2120, baseType: !896, size: 32, align: 32, offset: 2752)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1056, file: !97, line: 2125, baseType: !896, size: 32, align: 32, offset: 2784)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1056, file: !97, line: 2133, baseType: !896, size: 32, align: 32, offset: 2816)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1056, file: !97, line: 2140, baseType: !896, size: 32, align: 32, offset: 2848)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1056, file: !97, line: 2145, baseType: !896, size: 32, align: 32, offset: 2880)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1056, file: !97, line: 2153, baseType: !896, size: 32, align: 32, offset: 2912)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1056, file: !97, line: 2158, baseType: !896, size: 32, align: 32, offset: 2944)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1056, file: !97, line: 2166, baseType: !3, size: 32, align: 32, offset: 2976)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1056, file: !97, line: 2173, baseType: !22, size: 32, align: 32, offset: 3008)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1056, file: !97, line: 2180, baseType: !46, size: 32, align: 32, offset: 3040)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1056, file: !97, line: 2187, baseType: !842, size: 32, align: 32, offset: 3072)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1056, file: !97, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1056, file: !97, line: 2203, baseType: !896, size: 32, align: 32, offset: 3136)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1056, file: !97, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1056, file: !97, line: 2212, baseType: !896, size: 32, align: 32, offset: 3200)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1056, file: !97, line: 2213, baseType: !896, size: 32, align: 32, offset: 3232)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1056, file: !97, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1056, file: !97, line: 2232, baseType: !896, size: 32, align: 32, offset: 3296)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1056, file: !97, line: 2243, baseType: !896, size: 32, align: 32, offset: 3328)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1056, file: !97, line: 2249, baseType: !896, size: 32, align: 32, offset: 3360)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1056, file: !97, line: 2256, baseType: !896, size: 32, align: 32, offset: 3392)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1056, file: !97, line: 2263, baseType: !1129, size: 64, align: 64, offset: 3456)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1056, file: !97, line: 2270, baseType: !1129, size: 64, align: 64, offset: 3520)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1056, file: !97, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1056, file: !97, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1056, file: !97, line: 2367, baseType: !1594, size: 64, align: 64, offset: 3648)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!896, !1521, !1354, !896}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1056, file: !97, line: 2383, baseType: !896, size: 32, align: 32, offset: 3712)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1056, file: !97, line: 2386, baseType: !1528, size: 32, align: 32, offset: 3744)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1056, file: !97, line: 2387, baseType: !1528, size: 32, align: 32, offset: 3776)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1056, file: !97, line: 2394, baseType: !896, size: 32, align: 32, offset: 3808)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1056, file: !97, line: 2401, baseType: !896, size: 32, align: 32, offset: 3840)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1056, file: !97, line: 2408, baseType: !896, size: 32, align: 32, offset: 3872)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1056, file: !97, line: 2415, baseType: !896, size: 32, align: 32, offset: 3904)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1056, file: !97, line: 2422, baseType: !896, size: 32, align: 32, offset: 3936)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1056, file: !97, line: 2423, baseType: !1606, size: 64, align: 64, offset: 3968)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !97, line: 831, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !97, line: 826, size: 128, align: 32, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1613}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1608, file: !97, line: 827, baseType: !896, size: 32, align: 32)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1608, file: !97, line: 828, baseType: !896, size: 32, align: 32, offset: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1608, file: !97, line: 829, baseType: !896, size: 32, align: 32, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1608, file: !97, line: 830, baseType: !1528, size: 32, align: 32, offset: 96)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1056, file: !97, line: 2430, baseType: !1216, size: 64, align: 64, offset: 4032)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1056, file: !97, line: 2437, baseType: !1216, size: 64, align: 64, offset: 4096)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1056, file: !97, line: 2444, baseType: !1528, size: 32, align: 32, offset: 4160)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1056, file: !97, line: 2451, baseType: !1528, size: 32, align: 32, offset: 4192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1056, file: !97, line: 2458, baseType: !896, size: 32, align: 32, offset: 4224)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1056, file: !97, line: 2469, baseType: !896, size: 32, align: 32, offset: 4256)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1056, file: !97, line: 2475, baseType: !896, size: 32, align: 32, offset: 4288)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1056, file: !97, line: 2481, baseType: !896, size: 32, align: 32, offset: 4320)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1056, file: !97, line: 2485, baseType: !896, size: 32, align: 32, offset: 4352)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1056, file: !97, line: 2489, baseType: !896, size: 32, align: 32, offset: 4384)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1056, file: !97, line: 2493, baseType: !896, size: 32, align: 32, offset: 4416)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1056, file: !97, line: 2501, baseType: !896, size: 32, align: 32, offset: 4448)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1056, file: !97, line: 2506, baseType: !896, size: 32, align: 32, offset: 4480)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1056, file: !97, line: 2510, baseType: !896, size: 32, align: 32, offset: 4512)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1056, file: !97, line: 2514, baseType: !1216, size: 64, align: 64, offset: 4544)
