; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msrledec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msrledec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !889, !890, !895, !898, !900, !906}
!888 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!889 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !893, line: 48, baseType: !894)
!893 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!894 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !893, line: 49, baseType: !897)
!897 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !893, line: 51, baseType: !889)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !903, line: 222, size: 16, align: 8, elements: !904)
!903 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !902, file: !903, line: 222, baseType: !896, size: 16, align: 16)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !903, line: 221, size: 32, align: 8, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !908, file: !903, line: 221, baseType: !899, size: 32, align: 32)
!911 = !{i32 2, !"Dwarf Version", i32 4}
!912 = !{i32 2, !"Debug Info Version", i32 3}
!913 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!914 = distinct !DISubprogram(name: "ff_msrle_decode", scope: !915, file: !915, line: 249, type: !916, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1516)
!915 = !DIFile(filename: "libavcodec/msrledec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!916 = !DISubroutineType(types: !917)
!917 = !{!888, !918, !1222, !888, !1508}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !921)
!921 = !{!922, !967, !968, !969, !1234, !1235, !1236, !1237, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1263, !1267, !1268, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1446, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !920, file: !35, line: 1561, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !927)
!927 = !{!928, !932, !937, !941, !942, !943, !944, !948, !954, !956, !960}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !926, file: !4, line: 72, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !926, file: !4, line: 78, baseType: !933, size: 64, align: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!929, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !926, file: !4, line: 85, baseType: !938, size: 64, align: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !926, file: !4, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !926, file: !4, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !926, file: !4, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !926, file: !4, line: 113, baseType: !945, size: 64, align: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!936, !936, !936}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !926, file: !4, line: 123, baseType: !949, size: 64, align: 64, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!952, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !926, file: !4, line: 130, baseType: !955, size: 32, align: 32, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !926, file: !4, line: 136, baseType: !957, size: 64, align: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!955, !936}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !926, file: !4, line: 142, baseType: !961, size: 64, align: 64, offset: 576)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!888, !964, !936, !929, !888}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !920, file: !35, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !920, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !920, file: !35, line: 1565, baseType: !970, size: 64, align: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979, !988, !991, !994, !997, !1002, !1003, !1004, !1012, !1013, !1014, !1016, !1020, !1026, !1031, !1035, !1036, !1084, !1205, !1209, !1210, !1214, !1218, !1223, !1227, !1228, !1229}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !35, line: 3475, baseType: !929, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !972, file: !35, line: 3480, baseType: !929, size: 64, align: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !972, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !972, file: !35, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !972, file: !35, line: 3488, baseType: !980, size: 64, align: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !983, line: 61, baseType: !984)
!983 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !983, line: 58, size: 64, align: 32, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !984, file: !983, line: 59, baseType: !888, size: 32, align: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !984, file: !983, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !972, file: !35, line: 3489, baseType: !989, size: 64, align: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !972, file: !35, line: 3490, baseType: !992, size: 64, align: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !972, file: !35, line: 3491, baseType: !995, size: 64, align: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !972, file: !35, line: 3492, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !893, line: 55, baseType: !1001)
!1001 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !972, file: !35, line: 3493, baseType: !892, size: 8, align: 8, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !972, file: !35, line: 3494, baseType: !923, size: 64, align: 64, offset: 640)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !972, file: !35, line: 3495, baseType: !1005, size: 64, align: 64, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1008, file: !35, line: 3402, baseType: !888, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !35, line: 3403, baseType: !929, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !972, file: !35, line: 3507, baseType: !929, size: 64, align: 64, offset: 768)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !972, file: !35, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !972, file: !35, line: 3517, baseType: !1015, size: 64, align: 64, offset: 896)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !972, file: !35, line: 3527, baseType: !1017, size: 64, align: 64, offset: 960)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!888, !918}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !972, file: !35, line: 3535, baseType: !1021, size: 64, align: 64, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!888, !918, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !972, file: !35, line: 3541, baseType: !1027, size: 64, align: 64, offset: 1088)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1030)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !972, file: !35, line: 3549, baseType: !1032, size: 64, align: 64, offset: 1152)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !1015}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !972, file: !35, line: 3551, baseType: !1017, size: 64, align: 64, offset: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !972, file: !35, line: 3552, baseType: !1037, size: 64, align: 64, offset: 1280)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!888, !918, !1040, !888, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1081}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1043, file: !35, line: 3921, baseType: !896, size: 16, align: 16)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1043, file: !35, line: 3922, baseType: !899, size: 32, align: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1043, file: !35, line: 3923, baseType: !899, size: 32, align: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1043, file: !35, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1043, file: !35, line: 3925, baseType: !1050, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1070, !1074, !1076, !1077, !1079, !1080}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1053, file: !35, line: 3886, baseType: !888, size: 32, align: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1053, file: !35, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1053, file: !35, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1053, file: !35, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1053, file: !35, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1053, file: !35, line: 3897, baseType: !1061, size: 768, align: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1063)
!1063 = !{!1064, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1062, file: !35, line: 3855, baseType: !1065, size: 512, align: 64)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 512, align: 64, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 8)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1062, file: !35, line: 3857, baseType: !1069, size: 256, align: 32, offset: 512)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1066)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !35, line: 3903, baseType: !1071, size: 256, align: 64, offset: 960)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 256, align: 64, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 4)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1053, file: !35, line: 3904, baseType: !1075, size: 128, align: 32, offset: 1216)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1072)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1053, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1053, file: !35, line: 3908, baseType: !1078, size: 64, align: 64, offset: 1408)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1053, file: !35, line: 3915, baseType: !1078, size: 64, align: 64, offset: 1472)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !35, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1043, file: !35, line: 3926, baseType: !1082, size: 64, align: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !893, line: 40, baseType: !1083)
!1083 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !972, file: !35, line: 3564, baseType: !1085, size: 64, align: 64, offset: 1344)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!888, !918, !1088, !1122, !1204}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1091)
!1091 = !{!1092, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1118, !1119, !1120, !1121}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1090, file: !35, line: 1451, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1095, line: 94, baseType: !1096)
!1095 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1095, line: 81, size: 192, align: 64, elements: !1097)
!1097 = !{!1098, !1102, !1103}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1096, file: !1095, line: 82, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1095, line: 73, baseType: !1101)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1095, line: 73, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1096, file: !1095, line: 89, baseType: !1040, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1096, file: !1095, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1090, file: !35, line: 1461, baseType: !1082, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1090, file: !35, line: 1467, baseType: !1082, size: 64, align: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1090, file: !35, line: 1468, baseType: !1040, size: 64, align: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !35, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1090, file: !35, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1090, file: !35, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1090, file: !35, line: 1479, baseType: !1111, size: 64, align: 64, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !35, line: 1412, baseType: !1040, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !35, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1113, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1090, file: !35, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1090, file: !35, line: 1486, baseType: !1082, size: 64, align: 64, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1090, file: !35, line: 1488, baseType: !1082, size: 64, align: 64, offset: 576)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1090, file: !35, line: 1497, baseType: !1082, size: 64, align: 64, offset: 640)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1156, !1158, !1159, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1192, !1193, !1194, !1195, !1196, !1197, !1200, !1201, !1202, !1203}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !758, line: 282, baseType: !1065, size: 512, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1125, file: !758, line: 299, baseType: !1069, size: 256, align: 32, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1125, file: !758, line: 315, baseType: !1130, size: 64, align: 64, offset: 768)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1125, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1125, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1125, file: !758, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1125, file: !758, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1125, file: !758, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1125, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1125, file: !758, line: 356, baseType: !982, size: 64, align: 32, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1125, file: !758, line: 361, baseType: !1082, size: 64, align: 64, offset: 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1125, file: !758, line: 369, baseType: !1082, size: 64, align: 64, offset: 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1125, file: !758, line: 377, baseType: !1082, size: 64, align: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1125, file: !758, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1125, file: !758, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1125, file: !758, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1125, file: !758, line: 396, baseType: !936, size: 64, align: 64, offset: 1408)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1125, file: !758, line: 403, baseType: !1146, size: 512, align: 64, offset: 1472)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 512, align: 64, elements: !1066)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1125, file: !758, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1125, file: !758, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1125, file: !758, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1125, file: !758, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1125, file: !758, line: 435, baseType: !1082, size: 64, align: 64, offset: 2112)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1125, file: !758, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1125, file: !758, line: 445, baseType: !1000, size: 64, align: 64, offset: 2240)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1125, file: !758, line: 459, baseType: !1155, size: 512, align: 64, offset: 2304)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1066)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1125, file: !758, line: 473, baseType: !1157, size: 64, align: 64, offset: 2816)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1125, file: !758, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1125, file: !758, line: 479, baseType: !1160, size: 64, align: 64, offset: 2944)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1173}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1163, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !758, line: 203, baseType: !1040, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1163, file: !758, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1163, file: !758, line: 205, baseType: !1169, size: 64, align: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1171, line: 86, baseType: !1172)
!1171 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1171, line: 86, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1163, file: !758, line: 206, baseType: !1093, size: 64, align: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1125, file: !758, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !758, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1125, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1125, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1125, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1125, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1125, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1125, file: !758, line: 532, baseType: !1082, size: 64, align: 64, offset: 3264)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1125, file: !758, line: 539, baseType: !1082, size: 64, align: 64, offset: 3328)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1125, file: !758, line: 547, baseType: !1082, size: 64, align: 64, offset: 3392)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1125, file: !758, line: 554, baseType: !1169, size: 64, align: 64, offset: 3456)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1125, file: !758, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1125, file: !758, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1125, file: !758, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1125, file: !758, line: 588, baseType: !1189, size: 64, align: 64, offset: 3648)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !893, line: 36, baseType: !1191)
!1191 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1125, file: !758, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1125, file: !758, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1125, file: !758, line: 599, baseType: !1093, size: 64, align: 64, offset: 3776)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1125, file: !758, line: 605, baseType: !1093, size: 64, align: 64, offset: 3840)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1125, file: !758, line: 616, baseType: !1093, size: 64, align: 64, offset: 3904)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1125, file: !758, line: 626, baseType: !1198, size: 64, align: 64, offset: 3968)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1199, line: 216, baseType: !1001)
!1199 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1125, file: !758, line: 627, baseType: !1198, size: 64, align: 64, offset: 4032)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1125, file: !758, line: 628, baseType: !1198, size: 64, align: 64, offset: 4096)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1125, file: !758, line: 629, baseType: !1198, size: 64, align: 64, offset: 4160)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1125, file: !758, line: 645, baseType: !1093, size: 64, align: 64, offset: 4224)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !972, file: !35, line: 3566, baseType: !1206, size: 64, align: 64, offset: 1408)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!888, !918, !936, !1204, !1088}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !972, file: !35, line: 3567, baseType: !1017, size: 64, align: 64, offset: 1472)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !972, file: !35, line: 3576, baseType: !1211, size: 64, align: 64, offset: 1536)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!888, !918, !1122}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !972, file: !35, line: 3577, baseType: !1215, size: 64, align: 64, offset: 1600)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!888, !918, !1088}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !972, file: !35, line: 3584, baseType: !1219, size: 64, align: 64, offset: 1664)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!888, !918, !1222}
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !972, file: !35, line: 3589, baseType: !1224, size: 64, align: 64, offset: 1728)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !918}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !972, file: !35, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !972, file: !35, line: 3600, baseType: !929, size: 64, align: 64, offset: 1856)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !972, file: !35, line: 3609, baseType: !1230, size: 64, align: 64, offset: 1920)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !920, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !920, file: !35, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !920, file: !35, line: 1583, baseType: !936, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !920, file: !35, line: 1591, baseType: !1238, size: 64, align: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !920, file: !35, line: 1598, baseType: !936, size: 64, align: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !920, file: !35, line: 1606, baseType: !1082, size: 64, align: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !920, file: !35, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !920, file: !35, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !920, file: !35, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !920, file: !35, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !920, file: !35, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !920, file: !35, line: 1657, baseType: !1040, size: 64, align: 64, offset: 704)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !920, file: !35, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !920, file: !35, line: 1679, baseType: !982, size: 64, align: 32, offset: 800)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !920, file: !35, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !920, file: !35, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !920, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !920, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !920, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !920, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !920, file: !35, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !920, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !920, file: !35, line: 1791, baseType: !1259, size: 64, align: 64, offset: 1152)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !1262, !1122, !1204, !888, !888, !888}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !920, file: !35, line: 1808, baseType: !1264, size: 64, align: 64, offset: 1216)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!494, !1262, !989}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !920, file: !35, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !920, file: !35, line: 1825, baseType: !1269, size: 32, align: 32, offset: 1312)
!1269 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !920, file: !35, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !920, file: !35, line: 1838, baseType: !1269, size: 32, align: 32, offset: 1376)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !920, file: !35, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !920, file: !35, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !920, file: !35, line: 1861, baseType: !1269, size: 32, align: 32, offset: 1472)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !920, file: !35, line: 1868, baseType: !1269, size: 32, align: 32, offset: 1504)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !920, file: !35, line: 1875, baseType: !1269, size: 32, align: 32, offset: 1536)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !920, file: !35, line: 1882, baseType: !1269, size: 32, align: 32, offset: 1568)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !920, file: !35, line: 1889, baseType: !1269, size: 32, align: 32, offset: 1600)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !920, file: !35, line: 1896, baseType: !1269, size: 32, align: 32, offset: 1632)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !920, file: !35, line: 1903, baseType: !1269, size: 32, align: 32, offset: 1664)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !920, file: !35, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !920, file: !35, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !920, file: !35, line: 1926, baseType: !1204, size: 64, align: 64, offset: 1792)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !920, file: !35, line: 1935, baseType: !982, size: 64, align: 32, offset: 1856)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !920, file: !35, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !920, file: !35, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !920, file: !35, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !920, file: !35, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !920, file: !35, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !920, file: !35, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !920, file: !35, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !920, file: !35, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !920, file: !35, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !920, file: !35, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !920, file: !35, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !920, file: !35, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !920, file: !35, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !920, file: !35, line: 2054, baseType: !895, size: 64, align: 64, offset: 2368)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !920, file: !35, line: 2061, baseType: !895, size: 64, align: 64, offset: 2432)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !920, file: !35, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !920, file: !35, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !920, file: !35, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !920, file: !35, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !920, file: !35, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !920, file: !35, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !920, file: !35, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !920, file: !35, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !920, file: !35, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !920, file: !35, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !920, file: !35, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !920, file: !35, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !920, file: !35, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !920, file: !35, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !920, file: !35, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !920, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !920, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !920, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !920, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !920, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !920, file: !35, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !920, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !920, file: !35, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !920, file: !35, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !920, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !920, file: !35, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !920, file: !35, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !920, file: !35, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !920, file: !35, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !920, file: !35, line: 2263, baseType: !1000, size: 64, align: 64, offset: 3456)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !920, file: !35, line: 2270, baseType: !1000, size: 64, align: 64, offset: 3520)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !920, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !920, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !920, file: !35, line: 2367, baseType: !1334, size: 64, align: 64, offset: 3648)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!888, !1262, !1222, !888}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !920, file: !35, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !920, file: !35, line: 2386, baseType: !1269, size: 32, align: 32, offset: 3744)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !920, file: !35, line: 2387, baseType: !1269, size: 32, align: 32, offset: 3776)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !920, file: !35, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !920, file: !35, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !920, file: !35, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !920, file: !35, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !920, file: !35, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !920, file: !35, line: 2423, baseType: !1346, size: 64, align: 64, offset: 3968)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1353}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1348, file: !35, line: 827, baseType: !888, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1348, file: !35, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1348, file: !35, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1348, file: !35, line: 830, baseType: !1269, size: 32, align: 32, offset: 96)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !920, file: !35, line: 2430, baseType: !1082, size: 64, align: 64, offset: 4032)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !920, file: !35, line: 2437, baseType: !1082, size: 64, align: 64, offset: 4096)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !920, file: !35, line: 2444, baseType: !1269, size: 32, align: 32, offset: 4160)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !920, file: !35, line: 2451, baseType: !1269, size: 32, align: 32, offset: 4192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !920, file: !35, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !920, file: !35, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !920, file: !35, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !920, file: !35, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !920, file: !35, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !920, file: !35, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !920, file: !35, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !920, file: !35, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !920, file: !35, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !920, file: !35, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !920, file: !35, line: 2514, baseType: !1082, size: 64, align: 64, offset: 4544)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !920, file: !35, line: 2528, baseType: !1370, size: 64, align: 64, offset: 4608)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !1262, !936, !888, !888}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !920, file: !35, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !920, file: !35, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !920, file: !35, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !920, file: !35, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !920, file: !35, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !920, file: !35, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !920, file: !35, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !920, file: !35, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !920, file: !35, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !920, file: !35, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !920, file: !35, line: 2571, baseType: !1078, size: 64, align: 64, offset: 4992)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !920, file: !35, line: 2579, baseType: !1078, size: 64, align: 64, offset: 5056)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !920, file: !35, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !920, file: !35, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !920, file: !35, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !920, file: !35, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !920, file: !35, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !920, file: !35, line: 2709, baseType: !1082, size: 64, align: 64, offset: 5312)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !920, file: !35, line: 2716, baseType: !1392, size: 64, align: 64, offset: 5376)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1400, !1401, !1402, !1406, !1410, !1411, !1412, !1413, !1419, !1420, !1421, !1422, !1423}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1394, file: !35, line: 3642, baseType: !929, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1394, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1394, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1394, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1394, file: !35, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1394, file: !35, line: 3682, baseType: !1219, size: 64, align: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1394, file: !35, line: 3698, baseType: !1403, size: 64, align: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!888, !918, !890, !899}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1394, file: !35, line: 3712, baseType: !1407, size: 64, align: 64, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!888, !918, !888, !890, !899}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1394, file: !35, line: 3726, baseType: !1403, size: 64, align: 64, offset: 384)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1394, file: !35, line: 3737, baseType: !1017, size: 64, align: 64, offset: 448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1394, file: !35, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1394, file: !35, line: 3757, baseType: !1414, size: 64, align: 64, offset: 576)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1417}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1394, file: !35, line: 3766, baseType: !1017, size: 64, align: 64, offset: 640)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1394, file: !35, line: 3774, baseType: !1017, size: 64, align: 64, offset: 704)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1394, file: !35, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1394, file: !35, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1394, file: !35, line: 3795, baseType: !1424, size: 64, align: 64, offset: 832)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!888, !918, !1093}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !920, file: !35, line: 2728, baseType: !936, size: 64, align: 64, offset: 5440)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !920, file: !35, line: 2735, baseType: !1146, size: 512, align: 64, offset: 5504)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !920, file: !35, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !920, file: !35, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !920, file: !35, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !920, file: !35, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !920, file: !35, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !920, file: !35, line: 2802, baseType: !1222, size: 64, align: 64, offset: 6208)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !920, file: !35, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !920, file: !35, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !920, file: !35, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !920, file: !35, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !920, file: !35, line: 2851, baseType: !1440, size: 64, align: 64, offset: 6400)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!888, !1262, !1443, !936, !1204, !888, !888}
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!888, !1262, !936}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !920, file: !35, line: 2871, baseType: !1447, size: 64, align: 64, offset: 6464)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!888, !1262, !1450, !936, !1204, !888}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!888, !1262, !936, !888, !888}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !920, file: !35, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !920, file: !35, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !920, file: !35, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !920, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !920, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !920, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !920, file: !35, line: 3037, baseType: !1040, size: 64, align: 64, offset: 6720)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !920, file: !35, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !920, file: !35, line: 3050, baseType: !1000, size: 64, align: 64, offset: 6848)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !920, file: !35, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !920, file: !35, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !920, file: !35, line: 3092, baseType: !982, size: 64, align: 32, offset: 6976)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !920, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !920, file: !35, line: 3106, baseType: !982, size: 64, align: 32, offset: 7072)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !920, file: !35, line: 3113, baseType: !1468, size: 64, align: 64, offset: 7168)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1470)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1472)
!1472 = !{!1473, !1474, !1475, !1476, !1477, !1478, !1481}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1471, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1471, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1471, file: !35, line: 720, baseType: !929, size: 64, align: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1471, file: !35, line: 724, baseType: !929, size: 64, align: 64, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1471, file: !35, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1471, file: !35, line: 734, baseType: !1479, size: 64, align: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1471, file: !35, line: 739, baseType: !1482, size: 64, align: 64, offset: 320)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !920, file: !35, line: 3129, baseType: !1082, size: 64, align: 64, offset: 7232)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !920, file: !35, line: 3130, baseType: !1082, size: 64, align: 64, offset: 7296)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !920, file: !35, line: 3131, baseType: !1082, size: 64, align: 64, offset: 7360)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !920, file: !35, line: 3132, baseType: !1082, size: 64, align: 64, offset: 7424)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !920, file: !35, line: 3139, baseType: !1078, size: 64, align: 64, offset: 7488)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !920, file: !35, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !920, file: !35, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !920, file: !35, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !920, file: !35, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !920, file: !35, line: 3191, baseType: !895, size: 64, align: 64, offset: 7680)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !920, file: !35, line: 3199, baseType: !1040, size: 64, align: 64, offset: 7744)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !920, file: !35, line: 3207, baseType: !1078, size: 64, align: 64, offset: 7808)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !920, file: !35, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !920, file: !35, line: 3224, baseType: !1111, size: 64, align: 64, offset: 7936)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !920, file: !35, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !920, file: !35, line: 3249, baseType: !1093, size: 64, align: 64, offset: 8064)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !920, file: !35, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !920, file: !35, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !920, file: !35, line: 3279, baseType: !1082, size: 64, align: 64, offset: 8192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !920, file: !35, line: 3301, baseType: !1093, size: 64, align: 64, offset: 8256)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !920, file: !35, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !920, file: !35, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !920, file: !35, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !920, file: !35, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !1510, line: 35, baseType: !1511)
!1510 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !1510, line: 33, size: 192, align: 64, elements: !1512)
!1512 = !{!1513, !1514, !1515}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1511, file: !1510, line: 34, baseType: !890, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1511, file: !1510, line: 34, baseType: !890, size: 64, align: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !1511, file: !1510, line: 34, baseType: !890, size: 64, align: 64, offset: 128)
!1516 = !{}
!1517 = !DILocalVariable(name: "avctx", arg: 1, scope: !914, file: !915, line: 249, type: !918)
!1518 = !DIExpression()
!1519 = !DILocation(line: 249, column: 37, scope: !914)
!1520 = !DILocalVariable(name: "pic", arg: 2, scope: !914, file: !915, line: 249, type: !1222)
!1521 = !DILocation(line: 249, column: 53, scope: !914)
!1522 = !DILocalVariable(name: "depth", arg: 3, scope: !914, file: !915, line: 250, type: !888)
!1523 = !DILocation(line: 250, column: 25, scope: !914)
!1524 = !DILocalVariable(name: "gb", arg: 4, scope: !914, file: !915, line: 250, type: !1508)
!1525 = !DILocation(line: 250, column: 48, scope: !914)
!1526 = !DILocation(line: 252, column: 12, scope: !914)
!1527 = !DILocation(line: 252, column: 5, scope: !914)
!1528 = !DILocation(line: 254, column: 34, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !914, file: !915, line: 252, column: 18)
!1530 = !DILocation(line: 254, column: 41, scope: !1529)
!1531 = !DILocation(line: 254, column: 46, scope: !1529)
!1532 = !DILocation(line: 254, column: 16, scope: !1529)
!1533 = !DILocation(line: 254, column: 9, scope: !1529)
!1534 = !DILocation(line: 259, column: 40, scope: !1529)
!1535 = !DILocation(line: 259, column: 47, scope: !1529)
!1536 = !DILocation(line: 259, column: 52, scope: !1529)
!1537 = !DILocation(line: 259, column: 59, scope: !1529)
!1538 = !DILocation(line: 259, column: 16, scope: !1529)
!1539 = !DILocation(line: 259, column: 9, scope: !1529)
!1540 = !DILocation(line: 261, column: 16, scope: !1529)
!1541 = !DILocation(line: 261, column: 49, scope: !1529)
!1542 = !DILocation(line: 261, column: 9, scope: !1529)
!1543 = !DILocation(line: 262, column: 9, scope: !1529)
!1544 = !DILocation(line: 264, column: 1, scope: !914)
!1545 = distinct !DISubprogram(name: "msrle_decode_pal4", scope: !915, file: !915, line: 33, type: !1546, isLocal: true, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1516)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!888, !918, !1222, !1508}
!1548 = !DILocalVariable(name: "b", arg: 1, scope: !1549, file: !1510, line: 95, type: !1552)
!1549 = distinct !DISubprogram(name: "bytestream_get_byte", scope: !1510, file: !1510, line: 95, type: !1550, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1516)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!889, !1552}
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!1553 = !DILocation(line: 95, column: 95, scope: !1549, inlinedAt: !1554)
!1554 = distinct !DILocation(line: 95, column: 855, scope: !1555, inlinedAt: !1558)
!1555 = distinct !DISubprogram(name: "bytestream2_get_byteu", scope: !1510, file: !1510, line: 95, type: !1556, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1516)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!889, !1508}
!1558 = distinct !DILocation(line: 50, column: 34, scope: !1559)
!1559 = distinct !DILexicalBlock(scope: !1545, file: !915, line: 43, column: 52)
!1560 = !DILocalVariable(name: "g", arg: 1, scope: !1555, file: !1510, line: 95, type: !1508)
!1561 = !DILocation(line: 95, column: 843, scope: !1555, inlinedAt: !1558)
!1562 = !DILocation(line: 95, column: 95, scope: !1549, inlinedAt: !1563)
!1563 = distinct !DILocation(line: 95, column: 855, scope: !1555, inlinedAt: !1564)
!1564 = distinct !DILocation(line: 95, column: 1073, scope: !1565, inlinedAt: !1567)
!1565 = !DILexicalBlockFile(scope: !1566, file: !1510, discriminator: 2)
!1566 = distinct !DISubprogram(name: "bytestream2_get_byte", scope: !1510, file: !1510, line: 95, type: !1556, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1516)
