; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--wmv2dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--wmv2dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926, !958, !1137, !2692, !1037}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wmv2Context", file: !928, line: 55, baseType: !929)
!928 = !DIFile(filename: "libavcodec/wmv2.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Wmv2Context", file: !928, line: 35, size: 104704, align: 256, elements: !930)
!930 = !{!931, !2592, !2673, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2689}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !929, file: !928, line: 36, baseType: !932, size: 86208, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !933, line: 582, baseType: !934)
!933 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !933, line: 81, size: 86208, align: 64, elements: !935)
!935 = !{!936, !1022, !1023, !1024, !1025, !1029, !1030, !1044, !1045, !1046, !1047, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1756, !1757, !1812, !1814, !1815, !1816, !1817, !1818, !1829, !1830, !1831, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1847, !1849, !1851, !1852, !1853, !1854, !1855, !1856, !1861, !1863, !1864, !1865, !1866, !1867, !1868, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1895, !1896, !1897, !1898, !1914, !1921, !1933, !1949, !1971, !2011, !2024, !2051, !2066, !2080, !2093, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2114, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2127, !2129, !2130, !2131, !2132, !2133, !2134, !2137, !2139, !2141, !2142, !2145, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2212, !2213, !2215, !2216, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2238, !2239, !2240, !2243, !2244, !2245, !2246, !2248, !2250, !2251, !2252, !2253, !2254, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2336, !2337, !2338, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2467, !2468, !2469, !2470, !2474, !2475, !2479, !2483, !2487, !2488, !2493, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2508, !2509, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2527, !2528, !2529, !2579, !2580, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !934, file: !933, line: 82, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !940)
!940 = !{!941, !945, !950, !981, !982, !983, !984, !988, !994, !996, !1000}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !939, file: !26, line: 72, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !939, file: !26, line: 78, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!942, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !939, file: !26, line: 85, baseType: !951, size: 64, align: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !954)
!954 = !{!955, !956, !957, !959, !960, !977, !978, !979, !980}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !4, line: 247, baseType: !942, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !953, file: !4, line: 253, baseType: !942, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !953, file: !4, line: 259, baseType: !958, size: 32, align: 32, offset: 128)
!958 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !953, file: !4, line: 271, baseType: !961, size: 64, align: 64, offset: 192)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !953, file: !4, line: 265, size: 64, align: 64, elements: !962)
!962 = !{!963, !967, !969, !970}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !961, file: !4, line: 266, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !965, line: 40, baseType: !966)
!965 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !961, file: !4, line: 267, baseType: !968, size: 64, align: 64)
!968 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !961, file: !4, line: 268, baseType: !942, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !961, file: !4, line: 270, baseType: !971, size: 64, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !972, line: 61, baseType: !973)
!972 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !972, line: 58, size: 64, align: 32, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !973, file: !972, line: 59, baseType: !958, size: 32, align: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !973, file: !972, line: 60, baseType: !958, size: 32, align: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !953, file: !4, line: 272, baseType: !968, size: 64, align: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !953, file: !4, line: 273, baseType: !968, size: 64, align: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !4, line: 275, baseType: !958, size: 32, align: 32, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !953, file: !4, line: 300, baseType: !942, size: 64, align: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !939, file: !26, line: 93, baseType: !958, size: 32, align: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !939, file: !26, line: 99, baseType: !958, size: 32, align: 32, offset: 224)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !939, file: !26, line: 108, baseType: !958, size: 32, align: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !939, file: !26, line: 113, baseType: !985, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!949, !949, !949}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !939, file: !26, line: 123, baseType: !989, size: 64, align: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!992, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !939, file: !26, line: 130, baseType: !995, size: 32, align: 32, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !939, file: !26, line: 136, baseType: !997, size: 64, align: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!995, !949}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !939, file: !26, line: 142, baseType: !1001, size: 64, align: 64, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!958, !1004, !949, !942, !958}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1007)
!1007 = !{!1008, !1020, !1021}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1006, file: !4, line: 360, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1012, file: !4, line: 307, baseType: !942, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1012, file: !4, line: 313, baseType: !968, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1012, file: !4, line: 313, baseType: !968, size: 64, align: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1012, file: !4, line: 318, baseType: !968, size: 64, align: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1012, file: !4, line: 318, baseType: !968, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1012, file: !4, line: 323, baseType: !958, size: 32, align: 32, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1006, file: !4, line: 364, baseType: !958, size: 32, align: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1006, file: !4, line: 368, baseType: !958, size: 32, align: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !934, file: !933, line: 84, baseType: !958, size: 32, align: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !934, file: !933, line: 84, baseType: !958, size: 32, align: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !934, file: !933, line: 85, baseType: !958, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !934, file: !933, line: 86, baseType: !1026, size: 384, align: 32, offset: 160)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 384, align: 32, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 12)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !934, file: !933, line: 87, baseType: !958, size: 32, align: 32, offset: 544)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !934, file: !933, line: 90, baseType: !1031, size: 1088, align: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1033)
!1033 = !{!1034, !1039, !1043}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1032, file: !917, line: 32, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !965, line: 48, baseType: !1038)
!1038 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1032, file: !917, line: 33, baseType: !1040, size: 512, align: 8, offset: 64)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 512, align: 8, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1032, file: !917, line: 34, baseType: !1040, size: 512, align: 8, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !934, file: !933, line: 91, baseType: !1031, size: 1088, align: 64, offset: 1664)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !934, file: !933, line: 92, baseType: !1031, size: 1088, align: 64, offset: 2752)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !934, file: !933, line: 93, baseType: !1031, size: 1088, align: 64, offset: 3840)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !934, file: !933, line: 98, baseType: !1048, size: 64, align: 64, offset: 4928)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1050)
!1050 = !{!1051, !1054, !1055, !1056, !1323, !1324, !1325, !1326, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1478, !1482, !1483, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1661, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1049, file: !57, line: 1561, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1049, file: !57, line: 1562, baseType: !958, size: 32, align: 32, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1049, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1049, file: !57, line: 1565, baseType: !1057, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1069, !1072, !1075, !1078, !1083, !1084, !1085, !1093, !1094, !1095, !1097, !1103, !1109, !1118, !1122, !1123, !1173, !1294, !1298, !1299, !1303, !1307, !1312, !1316, !1317, !1318}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !57, line: 3475, baseType: !942, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1059, file: !57, line: 3480, baseType: !942, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1059, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1059, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1059, file: !57, line: 3487, baseType: !958, size: 32, align: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1059, file: !57, line: 3488, baseType: !1067, size: 64, align: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1059, file: !57, line: 3489, baseType: !1070, size: 64, align: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1059, file: !57, line: 3490, baseType: !1073, size: 64, align: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1059, file: !57, line: 3491, baseType: !1076, size: 64, align: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1059, file: !57, line: 3492, baseType: !1079, size: 64, align: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !965, line: 55, baseType: !1082)
!1082 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1059, file: !57, line: 3493, baseType: !1037, size: 8, align: 8, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1059, file: !57, line: 3494, baseType: !1052, size: 64, align: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1059, file: !57, line: 3495, baseType: !1086, size: 64, align: 64, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1089, file: !57, line: 3402, baseType: !958, size: 32, align: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1089, file: !57, line: 3403, baseType: !942, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1059, file: !57, line: 3507, baseType: !942, size: 64, align: 64, offset: 768)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1059, file: !57, line: 3516, baseType: !958, size: 32, align: 32, offset: 832)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1059, file: !57, line: 3517, baseType: !1096, size: 64, align: 64, offset: 896)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1059, file: !57, line: 3527, baseType: !1098, size: 64, align: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!958, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1049)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1059, file: !57, line: 3535, baseType: !1104, size: 64, align: 64, offset: 1024)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!958, !1101, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1059, file: !57, line: 3541, baseType: !1110, size: 64, align: 64, offset: 1088)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1114, line: 223, size: 128, align: 64, elements: !1115)
!1114 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1113, file: !1114, line: 224, baseType: !1035, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1113, file: !1114, line: 225, baseType: !1035, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1059, file: !57, line: 3549, baseType: !1119, size: 64, align: 64, offset: 1152)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{null, !1096}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1059, file: !57, line: 3551, baseType: !1098, size: 64, align: 64, offset: 1216)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1059, file: !57, line: 3552, baseType: !1124, size: 64, align: 64, offset: 1280)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!958, !1101, !1127, !958, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1131)
!1131 = !{!1132, !1135, !1138, !1139, !1140, !1172}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1130, file: !57, line: 3921, baseType: !1133, size: 16, align: 16)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !965, line: 49, baseType: !1134)
!1134 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1130, file: !57, line: 3922, baseType: !1136, size: 32, align: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !965, line: 51, baseType: !1137)
!1137 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1130, file: !57, line: 3923, baseType: !1136, size: 32, align: 32, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1130, file: !57, line: 3924, baseType: !1137, size: 32, align: 32, offset: 96)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1130, file: !57, line: 3925, baseType: !1141, size: 64, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1161, !1165, !1167, !1168, !1170, !1171}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1144, file: !57, line: 3886, baseType: !958, size: 32, align: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1144, file: !57, line: 3887, baseType: !958, size: 32, align: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1144, file: !57, line: 3888, baseType: !958, size: 32, align: 32, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1144, file: !57, line: 3889, baseType: !958, size: 32, align: 32, offset: 96)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1144, file: !57, line: 3890, baseType: !958, size: 32, align: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1144, file: !57, line: 3897, baseType: !1152, size: 768, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1154)
!1154 = !{!1155, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !57, line: 3855, baseType: !1156, size: 512, align: 64)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 512, align: 64, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 8)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1153, file: !57, line: 3857, baseType: !1160, size: 256, align: 32, offset: 512)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, align: 32, elements: !1157)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !57, line: 3903, baseType: !1162, size: 256, align: 64, offset: 960)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 256, align: 64, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 4)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1144, file: !57, line: 3904, baseType: !1166, size: 128, align: 32, offset: 1216)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 128, align: 32, elements: !1163)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1144, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1144, file: !57, line: 3908, baseType: !1169, size: 64, align: 64, offset: 1408)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1144, file: !57, line: 3915, baseType: !1169, size: 64, align: 64, offset: 1472)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !57, line: 3917, baseType: !958, size: 32, align: 32, offset: 1536)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1130, file: !57, line: 3926, baseType: !964, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1059, file: !57, line: 3564, baseType: !1174, size: 64, align: 64, offset: 1344)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!958, !1101, !1177, !1211, !1293}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1180)
!1180 = !{!1181, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1207, !1208, !1209, !1210}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1179, file: !57, line: 1451, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1184, line: 94, baseType: !1185)
!1184 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1184, line: 81, size: 192, align: 64, elements: !1186)
!1186 = !{!1187, !1191, !1192}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1185, file: !1184, line: 82, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1184, line: 73, baseType: !1190)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1184, line: 73, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !1184, line: 89, baseType: !1127, size: 64, align: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !1184, line: 93, baseType: !958, size: 32, align: 32, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1179, file: !57, line: 1461, baseType: !964, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1179, file: !57, line: 1467, baseType: !964, size: 64, align: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !57, line: 1468, baseType: !1127, size: 64, align: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !57, line: 1469, baseType: !958, size: 32, align: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1179, file: !57, line: 1470, baseType: !958, size: 32, align: 32, offset: 288)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1179, file: !57, line: 1474, baseType: !958, size: 32, align: 32, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1179, file: !57, line: 1479, baseType: !1200, size: 64, align: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !57, line: 1412, baseType: !1127, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !57, line: 1413, baseType: !958, size: 32, align: 32, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1202, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1179, file: !57, line: 1480, baseType: !958, size: 32, align: 32, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1179, file: !57, line: 1486, baseType: !964, size: 64, align: 64, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1179, file: !57, line: 1488, baseType: !964, size: 64, align: 64, offset: 576)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1179, file: !57, line: 1497, baseType: !964, size: 64, align: 64, offset: 640)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1245, !1247, !1248, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1283, !1284, !1285, !1286, !1289, !1290, !1291, !1292}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !780, line: 282, baseType: !1156, size: 512, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1214, file: !780, line: 299, baseType: !1160, size: 256, align: 32, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1214, file: !780, line: 315, baseType: !1219, size: 64, align: 64, offset: 768)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1214, file: !780, line: 326, baseType: !958, size: 32, align: 32, offset: 832)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1214, file: !780, line: 326, baseType: !958, size: 32, align: 32, offset: 864)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1214, file: !780, line: 334, baseType: !958, size: 32, align: 32, offset: 896)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1214, file: !780, line: 341, baseType: !958, size: 32, align: 32, offset: 928)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1214, file: !780, line: 346, baseType: !958, size: 32, align: 32, offset: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1214, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1214, file: !780, line: 356, baseType: !971, size: 64, align: 32, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1214, file: !780, line: 361, baseType: !964, size: 64, align: 64, offset: 1088)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1214, file: !780, line: 369, baseType: !964, size: 64, align: 64, offset: 1152)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1214, file: !780, line: 377, baseType: !964, size: 64, align: 64, offset: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1214, file: !780, line: 382, baseType: !958, size: 32, align: 32, offset: 1280)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1214, file: !780, line: 386, baseType: !958, size: 32, align: 32, offset: 1312)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1214, file: !780, line: 391, baseType: !958, size: 32, align: 32, offset: 1344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1214, file: !780, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1214, file: !780, line: 403, baseType: !1235, size: 512, align: 64, offset: 1472)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 512, align: 64, elements: !1157)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1214, file: !780, line: 410, baseType: !958, size: 32, align: 32, offset: 1984)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1214, file: !780, line: 415, baseType: !958, size: 32, align: 32, offset: 2016)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1214, file: !780, line: 420, baseType: !958, size: 32, align: 32, offset: 2048)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1214, file: !780, line: 425, baseType: !958, size: 32, align: 32, offset: 2080)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1214, file: !780, line: 435, baseType: !964, size: 64, align: 64, offset: 2112)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1214, file: !780, line: 440, baseType: !958, size: 32, align: 32, offset: 2176)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1214, file: !780, line: 445, baseType: !1081, size: 64, align: 64, offset: 2240)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1214, file: !780, line: 459, baseType: !1244, size: 512, align: 64, offset: 2304)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 512, align: 64, elements: !1157)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1214, file: !780, line: 473, baseType: !1246, size: 64, align: 64, offset: 2816)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1214, file: !780, line: 477, baseType: !958, size: 32, align: 32, offset: 2880)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1214, file: !780, line: 479, baseType: !1249, size: 64, align: 64, offset: 2944)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1262}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1252, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !780, line: 203, baseType: !1127, size: 64, align: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1252, file: !780, line: 204, baseType: !958, size: 32, align: 32, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1252, file: !780, line: 205, baseType: !1258, size: 64, align: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1260, line: 86, baseType: !1261)
!1260 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1260, line: 86, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1252, file: !780, line: 206, baseType: !1182, size: 64, align: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1214, file: !780, line: 480, baseType: !958, size: 32, align: 32, offset: 3008)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1214, file: !780, line: 505, baseType: !958, size: 32, align: 32, offset: 3040)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1214, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1214, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1214, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1214, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1214, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1214, file: !780, line: 532, baseType: !964, size: 64, align: 64, offset: 3264)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1214, file: !780, line: 539, baseType: !964, size: 64, align: 64, offset: 3328)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1214, file: !780, line: 547, baseType: !964, size: 64, align: 64, offset: 3392)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1214, file: !780, line: 554, baseType: !1258, size: 64, align: 64, offset: 3456)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1214, file: !780, line: 563, baseType: !958, size: 32, align: 32, offset: 3520)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1214, file: !780, line: 572, baseType: !958, size: 32, align: 32, offset: 3552)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1214, file: !780, line: 581, baseType: !958, size: 32, align: 32, offset: 3584)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1214, file: !780, line: 588, baseType: !1278, size: 64, align: 64, offset: 3648)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !965, line: 36, baseType: !1280)
!1280 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1214, file: !780, line: 593, baseType: !958, size: 32, align: 32, offset: 3712)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1214, file: !780, line: 596, baseType: !958, size: 32, align: 32, offset: 3744)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1214, file: !780, line: 599, baseType: !1182, size: 64, align: 64, offset: 3776)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1214, file: !780, line: 605, baseType: !1182, size: 64, align: 64, offset: 3840)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1214, file: !780, line: 616, baseType: !1182, size: 64, align: 64, offset: 3904)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1214, file: !780, line: 626, baseType: !1287, size: 64, align: 64, offset: 3968)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1288, line: 216, baseType: !1082)
!1288 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1214, file: !780, line: 627, baseType: !1287, size: 64, align: 64, offset: 4032)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1214, file: !780, line: 628, baseType: !1287, size: 64, align: 64, offset: 4096)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1214, file: !780, line: 629, baseType: !1287, size: 64, align: 64, offset: 4160)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1214, file: !780, line: 645, baseType: !1182, size: 64, align: 64, offset: 4224)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1059, file: !57, line: 3566, baseType: !1295, size: 64, align: 64, offset: 1408)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!958, !1101, !949, !1293, !1177}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1059, file: !57, line: 3567, baseType: !1098, size: 64, align: 64, offset: 1472)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1059, file: !57, line: 3576, baseType: !1300, size: 64, align: 64, offset: 1536)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!958, !1101, !1211}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1059, file: !57, line: 3577, baseType: !1304, size: 64, align: 64, offset: 1600)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!958, !1101, !1177}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1059, file: !57, line: 3584, baseType: !1308, size: 64, align: 64, offset: 1664)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!958, !1101, !1311}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1059, file: !57, line: 3589, baseType: !1313, size: 64, align: 64, offset: 1728)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{null, !1101}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1059, file: !57, line: 3594, baseType: !958, size: 32, align: 32, offset: 1792)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1059, file: !57, line: 3600, baseType: !942, size: 64, align: 64, offset: 1856)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1059, file: !57, line: 3609, baseType: !1319, size: 64, align: 64, offset: 1920)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1322)
!1322 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1049, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1049, file: !57, line: 1581, baseType: !1137, size: 32, align: 32, offset: 224)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1049, file: !57, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1049, file: !57, line: 1591, baseType: !1327, size: 64, align: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1114, line: 129, size: 1664, align: 64, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334, !1352, !1353, !1359, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1328, file: !1114, line: 136, baseType: !958, size: 32, align: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1328, file: !1114, line: 151, baseType: !958, size: 32, align: 32, offset: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1328, file: !1114, line: 157, baseType: !958, size: 32, align: 32, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1328, file: !1114, line: 159, baseType: !1311, size: 64, align: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1328, file: !1114, line: 161, baseType: !1335, size: 64, align: 64, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1114, line: 117, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1114, line: 100, size: 832, align: 64, elements: !1338)
!1338 = !{!1339, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1337, file: !1114, line: 105, baseType: !1340, size: 256, align: 64)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1341, size: 256, align: 64, elements: !1163)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1184, line: 238, baseType: !1343)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1184, line: 238, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1337, file: !1114, line: 110, baseType: !958, size: 32, align: 32, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1337, file: !1114, line: 111, baseType: !958, size: 32, align: 32, offset: 288)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1337, file: !1114, line: 111, baseType: !958, size: 32, align: 32, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1337, file: !1114, line: 112, baseType: !1160, size: 256, align: 32, offset: 352)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1337, file: !1114, line: 113, baseType: !1166, size: 128, align: 32, offset: 608)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1337, file: !1114, line: 114, baseType: !958, size: 32, align: 32, offset: 736)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1337, file: !1114, line: 115, baseType: !958, size: 32, align: 32, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1337, file: !1114, line: 116, baseType: !958, size: 32, align: 32, offset: 800)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1328, file: !1114, line: 163, baseType: !949, size: 64, align: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1328, file: !1114, line: 165, baseType: !1354, size: 128, align: 64, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1114, line: 122, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1114, line: 119, size: 128, align: 64, elements: !1356)
!1356 = !{!1357, !1358}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1355, file: !1114, line: 120, baseType: !1177, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1355, file: !1114, line: 121, baseType: !1311, size: 64, align: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1328, file: !1114, line: 166, baseType: !1360, size: 128, align: 64, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1114, line: 127, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1114, line: 124, size: 128, align: 64, elements: !1362)
!1362 = !{!1363, !1436}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1361, file: !1114, line: 125, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1394, !1398, !1399, !1433, !1434, !1435}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1367, file: !57, line: 5751, baseType: !1052, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1367, file: !57, line: 5756, baseType: !1371, size: 64, align: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1379, !1380, !1381, !1385, !1389, !1393}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1373, file: !57, line: 5797, baseType: !942, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1373, file: !57, line: 5804, baseType: !1377, size: 64, align: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1373, file: !57, line: 5815, baseType: !1052, size: 64, align: 64, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1373, file: !57, line: 5825, baseType: !958, size: 32, align: 32, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1373, file: !57, line: 5826, baseType: !1382, size: 64, align: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!958, !1365}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1373, file: !57, line: 5827, baseType: !1386, size: 64, align: 64, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!958, !1365, !1177}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1373, file: !57, line: 5828, baseType: !1390, size: 64, align: 64, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{null, !1365}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1373, file: !57, line: 5829, baseType: !1390, size: 64, align: 64, offset: 448)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1367, file: !57, line: 5762, baseType: !1395, size: 64, align: 64, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1397)
!1397 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1367, file: !57, line: 5768, baseType: !949, size: 64, align: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1367, file: !57, line: 5775, baseType: !1400, size: 64, align: 64, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1403)
!1403 = !{!1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1402, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1402, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1402, file: !57, line: 3948, baseType: !1136, size: 32, align: 32, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1402, file: !57, line: 3958, baseType: !1127, size: 64, align: 64, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1402, file: !57, line: 3962, baseType: !958, size: 32, align: 32, offset: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1402, file: !57, line: 3968, baseType: !958, size: 32, align: 32, offset: 224)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1402, file: !57, line: 3973, baseType: !964, size: 64, align: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1402, file: !57, line: 3986, baseType: !958, size: 32, align: 32, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1402, file: !57, line: 3999, baseType: !958, size: 32, align: 32, offset: 352)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1402, file: !57, line: 4004, baseType: !958, size: 32, align: 32, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1402, file: !57, line: 4005, baseType: !958, size: 32, align: 32, offset: 416)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1402, file: !57, line: 4010, baseType: !958, size: 32, align: 32, offset: 448)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1402, file: !57, line: 4011, baseType: !958, size: 32, align: 32, offset: 480)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1402, file: !57, line: 4020, baseType: !971, size: 64, align: 32, offset: 512)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1402, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1402, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1402, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1402, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1402, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1402, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1402, file: !57, line: 4039, baseType: !958, size: 32, align: 32, offset: 768)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1402, file: !57, line: 4046, baseType: !1081, size: 64, align: 64, offset: 832)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1402, file: !57, line: 4050, baseType: !958, size: 32, align: 32, offset: 896)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1402, file: !57, line: 4054, baseType: !958, size: 32, align: 32, offset: 928)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1402, file: !57, line: 4061, baseType: !958, size: 32, align: 32, offset: 960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1402, file: !57, line: 4065, baseType: !958, size: 32, align: 32, offset: 992)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1402, file: !57, line: 4073, baseType: !958, size: 32, align: 32, offset: 1024)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1402, file: !57, line: 4080, baseType: !958, size: 32, align: 32, offset: 1056)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1402, file: !57, line: 4084, baseType: !958, size: 32, align: 32, offset: 1088)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1367, file: !57, line: 5781, baseType: !1400, size: 64, align: 64, offset: 320)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1367, file: !57, line: 5787, baseType: !971, size: 64, align: 32, offset: 384)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1367, file: !57, line: 5793, baseType: !971, size: 64, align: 32, offset: 448)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1361, file: !1114, line: 126, baseType: !958, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1328, file: !1114, line: 172, baseType: !1177, size: 64, align: 64, offset: 576)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1328, file: !1114, line: 177, baseType: !1127, size: 64, align: 64, offset: 640)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1328, file: !1114, line: 178, baseType: !1137, size: 32, align: 32, offset: 704)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1328, file: !1114, line: 180, baseType: !949, size: 64, align: 64, offset: 768)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1328, file: !1114, line: 185, baseType: !958, size: 32, align: 32, offset: 832)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1328, file: !1114, line: 190, baseType: !949, size: 64, align: 64, offset: 896)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1328, file: !1114, line: 195, baseType: !958, size: 32, align: 32, offset: 960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1328, file: !1114, line: 200, baseType: !1177, size: 64, align: 64, offset: 1024)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1328, file: !1114, line: 201, baseType: !958, size: 32, align: 32, offset: 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1328, file: !1114, line: 202, baseType: !1311, size: 64, align: 64, offset: 1152)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1328, file: !1114, line: 203, baseType: !958, size: 32, align: 32, offset: 1216)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1328, file: !1114, line: 205, baseType: !958, size: 32, align: 32, offset: 1248)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1328, file: !1114, line: 206, baseType: !958, size: 32, align: 32, offset: 1280)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1328, file: !1114, line: 209, baseType: !1287, size: 64, align: 64, offset: 1344)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1328, file: !1114, line: 212, baseType: !1287, size: 64, align: 64, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1328, file: !1114, line: 213, baseType: !1311, size: 64, align: 64, offset: 1472)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1328, file: !1114, line: 215, baseType: !958, size: 32, align: 32, offset: 1536)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1328, file: !1114, line: 217, baseType: !958, size: 32, align: 32, offset: 1568)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1328, file: !1114, line: 220, baseType: !958, size: 32, align: 32, offset: 1600)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1049, file: !57, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1049, file: !57, line: 1606, baseType: !964, size: 64, align: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1049, file: !57, line: 1614, baseType: !958, size: 32, align: 32, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1049, file: !57, line: 1622, baseType: !958, size: 32, align: 32, offset: 544)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1049, file: !57, line: 1628, baseType: !958, size: 32, align: 32, offset: 576)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1049, file: !57, line: 1636, baseType: !958, size: 32, align: 32, offset: 608)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1049, file: !57, line: 1643, baseType: !958, size: 32, align: 32, offset: 640)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1049, file: !57, line: 1657, baseType: !1127, size: 64, align: 64, offset: 704)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1049, file: !57, line: 1658, baseType: !958, size: 32, align: 32, offset: 768)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1049, file: !57, line: 1679, baseType: !971, size: 64, align: 32, offset: 800)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1049, file: !57, line: 1688, baseType: !958, size: 32, align: 32, offset: 864)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1049, file: !57, line: 1712, baseType: !958, size: 32, align: 32, offset: 896)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1049, file: !57, line: 1729, baseType: !958, size: 32, align: 32, offset: 928)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1049, file: !57, line: 1729, baseType: !958, size: 32, align: 32, offset: 960)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1049, file: !57, line: 1744, baseType: !958, size: 32, align: 32, offset: 992)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1049, file: !57, line: 1744, baseType: !958, size: 32, align: 32, offset: 1024)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1049, file: !57, line: 1751, baseType: !958, size: 32, align: 32, offset: 1056)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1049, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1049, file: !57, line: 1791, baseType: !1475, size: 64, align: 64, offset: 1152)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{null, !1048, !1211, !1293, !958, !958, !958}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1049, file: !57, line: 1808, baseType: !1479, size: 64, align: 64, offset: 1216)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!516, !1048, !1070}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1049, file: !57, line: 1816, baseType: !958, size: 32, align: 32, offset: 1280)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1049, file: !57, line: 1825, baseType: !1484, size: 32, align: 32, offset: 1312)
!1484 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1049, file: !57, line: 1830, baseType: !958, size: 32, align: 32, offset: 1344)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1049, file: !57, line: 1838, baseType: !1484, size: 32, align: 32, offset: 1376)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1049, file: !57, line: 1846, baseType: !958, size: 32, align: 32, offset: 1408)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1049, file: !57, line: 1851, baseType: !958, size: 32, align: 32, offset: 1440)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1049, file: !57, line: 1861, baseType: !1484, size: 32, align: 32, offset: 1472)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1049, file: !57, line: 1868, baseType: !1484, size: 32, align: 32, offset: 1504)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1049, file: !57, line: 1875, baseType: !1484, size: 32, align: 32, offset: 1536)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1049, file: !57, line: 1882, baseType: !1484, size: 32, align: 32, offset: 1568)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1049, file: !57, line: 1889, baseType: !1484, size: 32, align: 32, offset: 1600)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1049, file: !57, line: 1896, baseType: !1484, size: 32, align: 32, offset: 1632)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1049, file: !57, line: 1903, baseType: !1484, size: 32, align: 32, offset: 1664)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1049, file: !57, line: 1910, baseType: !958, size: 32, align: 32, offset: 1696)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1049, file: !57, line: 1915, baseType: !958, size: 32, align: 32, offset: 1728)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1049, file: !57, line: 1926, baseType: !1293, size: 64, align: 64, offset: 1792)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1049, file: !57, line: 1935, baseType: !971, size: 64, align: 32, offset: 1856)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1049, file: !57, line: 1942, baseType: !958, size: 32, align: 32, offset: 1920)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1049, file: !57, line: 1948, baseType: !958, size: 32, align: 32, offset: 1952)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1049, file: !57, line: 1954, baseType: !958, size: 32, align: 32, offset: 1984)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1049, file: !57, line: 1960, baseType: !958, size: 32, align: 32, offset: 2016)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1049, file: !57, line: 1984, baseType: !958, size: 32, align: 32, offset: 2048)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1049, file: !57, line: 1991, baseType: !958, size: 32, align: 32, offset: 2080)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1049, file: !57, line: 1996, baseType: !958, size: 32, align: 32, offset: 2112)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1049, file: !57, line: 2004, baseType: !958, size: 32, align: 32, offset: 2144)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1049, file: !57, line: 2011, baseType: !958, size: 32, align: 32, offset: 2176)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1049, file: !57, line: 2018, baseType: !958, size: 32, align: 32, offset: 2208)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1049, file: !57, line: 2027, baseType: !958, size: 32, align: 32, offset: 2240)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1049, file: !57, line: 2034, baseType: !958, size: 32, align: 32, offset: 2272)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1049, file: !57, line: 2044, baseType: !958, size: 32, align: 32, offset: 2304)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1049, file: !57, line: 2054, baseType: !1514, size: 64, align: 64, offset: 2368)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1049, file: !57, line: 2061, baseType: !1514, size: 64, align: 64, offset: 2432)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1049, file: !57, line: 2066, baseType: !958, size: 32, align: 32, offset: 2496)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1049, file: !57, line: 2070, baseType: !958, size: 32, align: 32, offset: 2528)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1049, file: !57, line: 2078, baseType: !958, size: 32, align: 32, offset: 2560)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1049, file: !57, line: 2085, baseType: !958, size: 32, align: 32, offset: 2592)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1049, file: !57, line: 2092, baseType: !958, size: 32, align: 32, offset: 2624)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1049, file: !57, line: 2099, baseType: !958, size: 32, align: 32, offset: 2656)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1049, file: !57, line: 2106, baseType: !958, size: 32, align: 32, offset: 2688)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1049, file: !57, line: 2113, baseType: !958, size: 32, align: 32, offset: 2720)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1049, file: !57, line: 2120, baseType: !958, size: 32, align: 32, offset: 2752)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1049, file: !57, line: 2125, baseType: !958, size: 32, align: 32, offset: 2784)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1049, file: !57, line: 2133, baseType: !958, size: 32, align: 32, offset: 2816)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1049, file: !57, line: 2140, baseType: !958, size: 32, align: 32, offset: 2848)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1049, file: !57, line: 2145, baseType: !958, size: 32, align: 32, offset: 2880)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1049, file: !57, line: 2153, baseType: !958, size: 32, align: 32, offset: 2912)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1049, file: !57, line: 2158, baseType: !958, size: 32, align: 32, offset: 2944)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1049, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1049, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1049, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1049, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1049, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1049, file: !57, line: 2203, baseType: !958, size: 32, align: 32, offset: 3136)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1049, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1049, file: !57, line: 2212, baseType: !958, size: 32, align: 32, offset: 3200)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1049, file: !57, line: 2213, baseType: !958, size: 32, align: 32, offset: 3232)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1049, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1049, file: !57, line: 2232, baseType: !958, size: 32, align: 32, offset: 3296)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1049, file: !57, line: 2243, baseType: !958, size: 32, align: 32, offset: 3328)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1049, file: !57, line: 2249, baseType: !958, size: 32, align: 32, offset: 3360)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1049, file: !57, line: 2256, baseType: !958, size: 32, align: 32, offset: 3392)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1049, file: !57, line: 2263, baseType: !1081, size: 64, align: 64, offset: 3456)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1049, file: !57, line: 2270, baseType: !1081, size: 64, align: 64, offset: 3520)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1049, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1049, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1049, file: !57, line: 2367, baseType: !1550, size: 64, align: 64, offset: 3648)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!958, !1048, !1311, !958}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1049, file: !57, line: 2383, baseType: !958, size: 32, align: 32, offset: 3712)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1049, file: !57, line: 2386, baseType: !1484, size: 32, align: 32, offset: 3744)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1049, file: !57, line: 2387, baseType: !1484, size: 32, align: 32, offset: 3776)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1049, file: !57, line: 2394, baseType: !958, size: 32, align: 32, offset: 3808)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1049, file: !57, line: 2401, baseType: !958, size: 32, align: 32, offset: 3840)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1049, file: !57, line: 2408, baseType: !958, size: 32, align: 32, offset: 3872)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1049, file: !57, line: 2415, baseType: !958, size: 32, align: 32, offset: 3904)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1049, file: !57, line: 2422, baseType: !958, size: 32, align: 32, offset: 3936)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1049, file: !57, line: 2423, baseType: !1562, size: 64, align: 64, offset: 3968)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1565)
!1565 = !{!1566, !1567, !1568, !1569}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1564, file: !57, line: 827, baseType: !958, size: 32, align: 32)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1564, file: !57, line: 828, baseType: !958, size: 32, align: 32, offset: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1564, file: !57, line: 829, baseType: !958, size: 32, align: 32, offset: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1564, file: !57, line: 830, baseType: !1484, size: 32, align: 32, offset: 96)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1049, file: !57, line: 2430, baseType: !964, size: 64, align: 64, offset: 4032)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1049, file: !57, line: 2437, baseType: !964, size: 64, align: 64, offset: 4096)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1049, file: !57, line: 2444, baseType: !1484, size: 32, align: 32, offset: 4160)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1049, file: !57, line: 2451, baseType: !1484, size: 32, align: 32, offset: 4192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1049, file: !57, line: 2458, baseType: !958, size: 32, align: 32, offset: 4224)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1049, file: !57, line: 2469, baseType: !958, size: 32, align: 32, offset: 4256)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1049, file: !57, line: 2475, baseType: !958, size: 32, align: 32, offset: 4288)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1049, file: !57, line: 2481, baseType: !958, size: 32, align: 32, offset: 4320)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1049, file: !57, line: 2485, baseType: !958, size: 32, align: 32, offset: 4352)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1049, file: !57, line: 2489, baseType: !958, size: 32, align: 32, offset: 4384)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1049, file: !57, line: 2493, baseType: !958, size: 32, align: 32, offset: 4416)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1049, file: !57, line: 2501, baseType: !958, size: 32, align: 32, offset: 4448)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1049, file: !57, line: 2506, baseType: !958, size: 32, align: 32, offset: 4480)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1049, file: !57, line: 2510, baseType: !958, size: 32, align: 32, offset: 4512)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1049, file: !57, line: 2514, baseType: !964, size: 64, align: 64, offset: 4544)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1049, file: !57, line: 2528, baseType: !1586, size: 64, align: 64, offset: 4608)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{null, !1048, !949, !958, !958}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1049, file: !57, line: 2534, baseType: !958, size: 32, align: 32, offset: 4672)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1049, file: !57, line: 2545, baseType: !958, size: 32, align: 32, offset: 4704)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1049, file: !57, line: 2547, baseType: !958, size: 32, align: 32, offset: 4736)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1049, file: !57, line: 2549, baseType: !958, size: 32, align: 32, offset: 4768)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1049, file: !57, line: 2551, baseType: !958, size: 32, align: 32, offset: 4800)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1049, file: !57, line: 2553, baseType: !958, size: 32, align: 32, offset: 4832)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1049, file: !57, line: 2555, baseType: !958, size: 32, align: 32, offset: 4864)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1049, file: !57, line: 2557, baseType: !958, size: 32, align: 32, offset: 4896)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1049, file: !57, line: 2559, baseType: !958, size: 32, align: 32, offset: 4928)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1049, file: !57, line: 2563, baseType: !958, size: 32, align: 32, offset: 4960)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1049, file: !57, line: 2571, baseType: !1169, size: 64, align: 64, offset: 4992)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1049, file: !57, line: 2579, baseType: !1169, size: 64, align: 64, offset: 5056)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1049, file: !57, line: 2586, baseType: !958, size: 32, align: 32, offset: 5120)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1049, file: !57, line: 2615, baseType: !958, size: 32, align: 32, offset: 5152)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1049, file: !57, line: 2627, baseType: !958, size: 32, align: 32, offset: 5184)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1049, file: !57, line: 2637, baseType: !958, size: 32, align: 32, offset: 5216)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1049, file: !57, line: 2681, baseType: !958, size: 32, align: 32, offset: 5248)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1049, file: !57, line: 2709, baseType: !964, size: 64, align: 64, offset: 5312)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1049, file: !57, line: 2716, baseType: !1608, size: 64, align: 64, offset: 5376)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1611)
!1611 = !{!1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1626, !1627, !1628, !1629, !1634, !1635, !1636, !1637, !1638}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1610, file: !57, line: 3642, baseType: !942, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1610, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1610, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1610, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1610, file: !57, line: 3669, baseType: !958, size: 32, align: 32, offset: 160)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1610, file: !57, line: 3682, baseType: !1308, size: 64, align: 64, offset: 192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1610, file: !57, line: 3698, baseType: !1619, size: 64, align: 64, offset: 256)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!958, !1101, !1035, !1136}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1610, file: !57, line: 3712, baseType: !1623, size: 64, align: 64, offset: 320)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!958, !1101, !958, !1035, !1136}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1610, file: !57, line: 3726, baseType: !1619, size: 64, align: 64, offset: 384)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1610, file: !57, line: 3737, baseType: !1098, size: 64, align: 64, offset: 448)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1610, file: !57, line: 3746, baseType: !958, size: 32, align: 32, offset: 512)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1610, file: !57, line: 3757, baseType: !1630, size: 64, align: 64, offset: 576)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{null, !1633}
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1610, file: !57, line: 3766, baseType: !1098, size: 64, align: 64, offset: 640)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1610, file: !57, line: 3774, baseType: !1098, size: 64, align: 64, offset: 704)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1610, file: !57, line: 3780, baseType: !958, size: 32, align: 32, offset: 768)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1610, file: !57, line: 3785, baseType: !958, size: 32, align: 32, offset: 800)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1610, file: !57, line: 3795, baseType: !1639, size: 64, align: 64, offset: 832)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!958, !1101, !1182}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1049, file: !57, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1049, file: !57, line: 2735, baseType: !1235, size: 512, align: 64, offset: 5504)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1049, file: !57, line: 2742, baseType: !958, size: 32, align: 32, offset: 6016)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1049, file: !57, line: 2755, baseType: !958, size: 32, align: 32, offset: 6048)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1049, file: !57, line: 2776, baseType: !958, size: 32, align: 32, offset: 6080)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1049, file: !57, line: 2783, baseType: !958, size: 32, align: 32, offset: 6112)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1049, file: !57, line: 2791, baseType: !958, size: 32, align: 32, offset: 6144)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1049, file: !57, line: 2802, baseType: !1311, size: 64, align: 64, offset: 6208)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1049, file: !57, line: 2811, baseType: !958, size: 32, align: 32, offset: 6272)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1049, file: !57, line: 2821, baseType: !958, size: 32, align: 32, offset: 6304)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1049, file: !57, line: 2830, baseType: !958, size: 32, align: 32, offset: 6336)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1049, file: !57, line: 2840, baseType: !958, size: 32, align: 32, offset: 6368)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1049, file: !57, line: 2851, baseType: !1655, size: 64, align: 64, offset: 6400)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!958, !1048, !1658, !949, !1293, !958, !958}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!958, !1048, !949}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1049, file: !57, line: 2871, baseType: !1662, size: 64, align: 64, offset: 6464)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!958, !1048, !1665, !949, !1293, !958}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!958, !1048, !949, !958, !958}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1049, file: !57, line: 2878, baseType: !958, size: 32, align: 32, offset: 6528)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1049, file: !57, line: 2885, baseType: !958, size: 32, align: 32, offset: 6560)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1049, file: !57, line: 3005, baseType: !958, size: 32, align: 32, offset: 6592)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1049, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1049, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1049, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1049, file: !57, line: 3037, baseType: !1127, size: 64, align: 64, offset: 6720)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1049, file: !57, line: 3038, baseType: !958, size: 32, align: 32, offset: 6784)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1049, file: !57, line: 3050, baseType: !1081, size: 64, align: 64, offset: 6848)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1049, file: !57, line: 3065, baseType: !958, size: 32, align: 32, offset: 6912)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1049, file: !57, line: 3083, baseType: !958, size: 32, align: 32, offset: 6944)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1049, file: !57, line: 3092, baseType: !971, size: 64, align: 32, offset: 6976)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1049, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
