; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--hevc_filter.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--hevc_filter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HEVCContext = type { %struct.AVClass*, %struct.AVCodecContext*, [16 x %struct.HEVCContext*], [16 x %struct.HEVCLocalContext*], %struct.HEVCLocalContext*, i8, i8, i32, i32, i8*, i8, %struct.AVFrame*, %struct.AVFrame*, [3 x i8*], [3 x i8*], %struct.HEVCParamSets, %struct.HEVCSEI, %struct.AVMD5*, %struct.AVBufferPool*, %struct.AVBufferPool*, [5 x %struct.RefPicList], %struct.SliceHeader, %struct.SAOParams*, %struct.DBParams*, i32, i32, %struct.HEVCFrame*, [32 x %struct.HEVCFrame], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.HEVCPredContext, %struct.HEVCDSPContext, %struct.VideoDSPContext, %struct.BswapDSPContext, i8*, i8*, i8*, i32*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i16, i16, i32, i32, i8*, %struct.H2645Packet, i32, i8, i32, i32, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!990 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !994, line: 220, size: 64, align: 8, elements: !995)
!994 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !993, file: !994, line: 220, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !989, line: 55, baseType: !998)
!998 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v", scope: !1003, file: !1002, line: 69, size: 128, align: 64, elements: !1010)
!1002 = !DIFile(filename: "./libavutil/x86/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1003 = distinct !DISubprogram(name: "AV_COPY128", scope: !1002, file: !1002, line: 67, type: !1004, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1009)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1009 = !{}
!1010 = !{!1011}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1001, file: !1002, line: 69, baseType: !1012, size: 128, align: 64)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 128, align: 64, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 2)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !989, line: 49, baseType: !1019)
!1019 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1020 = !{!1021, !1029, !1033, !2634}
!1021 = distinct !DIGlobalVariable(name: "betatable", scope: !0, file: !1022, line: 43, type: !1023, isLocal: true, isDefinition: true, variable: [52 x i8]* @betatable)
!1022 = !DIFile(filename: "libavcodec/hevc_filter.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 416, align: 8, elements: !1027)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !989, line: 48, baseType: !1026)
!1026 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1027 = !{!1028}
!1028 = !DISubrange(count: 52)
!1029 = distinct !DIGlobalVariable(name: "tctable", scope: !0, file: !1022, line: 37, type: !1030, isLocal: true, isDefinition: true, variable: [54 x i8]* @tctable)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 432, align: 8, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 54)
!1033 = distinct !DIGlobalVariable(name: "qp_c", scope: !1034, file: !1022, line: 51, type: !2631, isLocal: true, isDefinition: true, variable: [14 x i32]* @chroma_tc.qp_c)
!1034 = distinct !DISubprogram(name: "chroma_tc", scope: !1022, file: !1022, line: 49, type: !1035, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1009)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1037, !1038, !1037, !1037, !1037}
!1037 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCContext", file: !888, line: 487, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCContext", file: !888, line: 383, size: 94144, align: 64, elements: !1041)
!1041 = !{!1042, !1086, !1764, !1769, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1900, !1901, !2182, !2249, !2253, !2254, !2255, !2311, !2382, !2398, !2405, !2406, !2407, !2410, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2445, !2542, !2555, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2591, !2592, !2625, !2626, !2627, !2628, !2629, !2630}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1040, file: !888, line: 384, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1047)
!1047 = !{!1048, !1052, !1056, !1060, !1061, !1062, !1063, !1067, !1073, !1075, !1079}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1046, file: !4, line: 72, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1046, file: !4, line: 78, baseType: !1053, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1049, !1006}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1046, file: !4, line: 85, baseType: !1057, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1046, file: !4, line: 93, baseType: !1037, size: 32, align: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1046, file: !4, line: 99, baseType: !1037, size: 32, align: 32, offset: 224)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1046, file: !4, line: 108, baseType: !1037, size: 32, align: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1046, file: !4, line: 113, baseType: !1064, size: 64, align: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!1006, !1006, !1006}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1046, file: !4, line: 123, baseType: !1068, size: 64, align: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!1071, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1046, file: !4, line: 130, baseType: !1074, size: 32, align: 32, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1046, file: !4, line: 136, baseType: !1076, size: 64, align: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1074, !1006}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1046, file: !4, line: 142, baseType: !1080, size: 64, align: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1037, !1083, !1006, !1049, !1037}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1040, file: !888, line: 385, baseType: !1087, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1363, !1364, !1365, !1366, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1519, !1523, !1524, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1702, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1089, file: !35, line: 1561, baseType: !1043, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1089, file: !35, line: 1562, baseType: !1037, size: 32, align: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1089, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1089, file: !35, line: 1565, baseType: !1095, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1113, !1116, !1119, !1122, !1125, !1126, !1127, !1135, !1136, !1137, !1139, !1143, !1149, !1159, !1163, !1164, !1213, !1334, !1338, !1339, !1343, !1347, !1352, !1356, !1357, !1358}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1097, file: !35, line: 3475, baseType: !1049, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1097, file: !35, line: 3480, baseType: !1049, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1097, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1097, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1097, file: !35, line: 3487, baseType: !1037, size: 32, align: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1097, file: !35, line: 3488, baseType: !1105, size: 64, align: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1108, line: 61, baseType: !1109)
!1108 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1108, line: 58, size: 64, align: 32, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1109, file: !1108, line: 59, baseType: !1037, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1109, file: !1108, line: 60, baseType: !1037, size: 32, align: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1097, file: !35, line: 3489, baseType: !1114, size: 64, align: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1097, file: !35, line: 3490, baseType: !1117, size: 64, align: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1097, file: !35, line: 3491, baseType: !1120, size: 64, align: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1097, file: !35, line: 3492, baseType: !1123, size: 64, align: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1097, file: !35, line: 3493, baseType: !1025, size: 8, align: 8, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1097, file: !35, line: 3494, baseType: !1043, size: 64, align: 64, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1097, file: !35, line: 3495, baseType: !1128, size: 64, align: 64, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1131, file: !35, line: 3402, baseType: !1037, size: 32, align: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1131, file: !35, line: 3403, baseType: !1049, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1097, file: !35, line: 3507, baseType: !1049, size: 64, align: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1097, file: !35, line: 3516, baseType: !1037, size: 32, align: 32, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1097, file: !35, line: 3517, baseType: !1138, size: 64, align: 64, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1097, file: !35, line: 3527, baseType: !1140, size: 64, align: 64, offset: 960)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!1037, !1087}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1097, file: !35, line: 3535, baseType: !1144, size: 64, align: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1037, !1087, !1147}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1097, file: !35, line: 3541, baseType: !1150, size: 64, align: 64, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1154, line: 223, size: 128, align: 64, elements: !1155)
!1154 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1155 = !{!1156, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1153, file: !1154, line: 224, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1153, file: !1154, line: 225, baseType: !1157, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1097, file: !35, line: 3549, baseType: !1160, size: 64, align: 64, offset: 1152)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !1138}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1097, file: !35, line: 3551, baseType: !1140, size: 64, align: 64, offset: 1216)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1097, file: !35, line: 3552, baseType: !1165, size: 64, align: 64, offset: 1280)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!1037, !1087, !1168, !1037, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1177, !1178, !1179, !1211}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1171, file: !35, line: 3921, baseType: !1018, size: 16, align: 16)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1171, file: !35, line: 3922, baseType: !1175, size: 32, align: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !989, line: 51, baseType: !1176)
!1176 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1171, file: !35, line: 3923, baseType: !1175, size: 32, align: 32, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1171, file: !35, line: 3924, baseType: !1176, size: 32, align: 32, offset: 96)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1171, file: !35, line: 3925, baseType: !1180, size: 64, align: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1200, !1204, !1206, !1207, !1209, !1210}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1183, file: !35, line: 3886, baseType: !1037, size: 32, align: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1183, file: !35, line: 3887, baseType: !1037, size: 32, align: 32, offset: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1183, file: !35, line: 3888, baseType: !1037, size: 32, align: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1183, file: !35, line: 3889, baseType: !1037, size: 32, align: 32, offset: 96)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1183, file: !35, line: 3890, baseType: !1037, size: 32, align: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1183, file: !35, line: 3897, baseType: !1191, size: 768, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1193)
!1193 = !{!1194, !1198}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !35, line: 3855, baseType: !1195, size: 512, align: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1168, size: 512, align: 64, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 8)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1192, file: !35, line: 3857, baseType: !1199, size: 256, align: 32, offset: 512)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 256, align: 32, elements: !1196)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !35, line: 3903, baseType: !1201, size: 256, align: 64, offset: 960)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1168, size: 256, align: 64, elements: !1202)
!1202 = !{!1203}
!1203 = !DISubrange(count: 4)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1183, file: !35, line: 3904, baseType: !1205, size: 128, align: 32, offset: 1216)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 128, align: 32, elements: !1202)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1183, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1183, file: !35, line: 3908, baseType: !1208, size: 64, align: 64, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1183, file: !35, line: 3915, baseType: !1208, size: 64, align: 64, offset: 1472)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1183, file: !35, line: 3917, baseType: !1037, size: 32, align: 32, offset: 1536)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1171, file: !35, line: 3926, baseType: !1212, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !989, line: 40, baseType: !990)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1097, file: !35, line: 3564, baseType: !1214, size: 64, align: 64, offset: 1344)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1037, !1087, !1217, !1251, !1333}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1220)
!1220 = !{!1221, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1247, !1248, !1249, !1250}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1219, file: !35, line: 1451, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1224, line: 94, baseType: !1225)
!1224 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1224, line: 81, size: 192, align: 64, elements: !1226)
!1226 = !{!1227, !1231, !1232}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1225, file: !1224, line: 82, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1224, line: 73, baseType: !1230)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1224, line: 73, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !1224, line: 89, baseType: !1168, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !1224, line: 93, baseType: !1037, size: 32, align: 32, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1219, file: !35, line: 1461, baseType: !1212, size: 64, align: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1219, file: !35, line: 1467, baseType: !1212, size: 64, align: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1219, file: !35, line: 1468, baseType: !1168, size: 64, align: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1219, file: !35, line: 1469, baseType: !1037, size: 32, align: 32, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1219, file: !35, line: 1470, baseType: !1037, size: 32, align: 32, offset: 288)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1219, file: !35, line: 1474, baseType: !1037, size: 32, align: 32, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1219, file: !35, line: 1479, baseType: !1240, size: 64, align: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1242, file: !35, line: 1412, baseType: !1168, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1242, file: !35, line: 1413, baseType: !1037, size: 32, align: 32, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1242, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1219, file: !35, line: 1480, baseType: !1037, size: 32, align: 32, offset: 448)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1219, file: !35, line: 1486, baseType: !1212, size: 64, align: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1219, file: !35, line: 1488, baseType: !1212, size: 64, align: 64, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1219, file: !35, line: 1497, baseType: !1212, size: 64, align: 64, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1253)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1285, !1287, !1288, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1321, !1322, !1323, !1324, !1325, !1326, !1329, !1330, !1331, !1332}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !758, line: 282, baseType: !1195, size: 512, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1254, file: !758, line: 299, baseType: !1199, size: 256, align: 32, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1254, file: !758, line: 315, baseType: !1259, size: 64, align: 64, offset: 768)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1254, file: !758, line: 326, baseType: !1037, size: 32, align: 32, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1254, file: !758, line: 326, baseType: !1037, size: 32, align: 32, offset: 864)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1254, file: !758, line: 334, baseType: !1037, size: 32, align: 32, offset: 896)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1254, file: !758, line: 341, baseType: !1037, size: 32, align: 32, offset: 928)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1254, file: !758, line: 346, baseType: !1037, size: 32, align: 32, offset: 960)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1254, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1254, file: !758, line: 356, baseType: !1107, size: 64, align: 32, offset: 1024)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1254, file: !758, line: 361, baseType: !1212, size: 64, align: 64, offset: 1088)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1254, file: !758, line: 369, baseType: !1212, size: 64, align: 64, offset: 1152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1254, file: !758, line: 377, baseType: !1212, size: 64, align: 64, offset: 1216)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1254, file: !758, line: 382, baseType: !1037, size: 32, align: 32, offset: 1280)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1254, file: !758, line: 386, baseType: !1037, size: 32, align: 32, offset: 1312)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1254, file: !758, line: 391, baseType: !1037, size: 32, align: 32, offset: 1344)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1254, file: !758, line: 396, baseType: !1006, size: 64, align: 64, offset: 1408)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1254, file: !758, line: 403, baseType: !1275, size: 512, align: 64, offset: 1472)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 512, align: 64, elements: !1196)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1254, file: !758, line: 410, baseType: !1037, size: 32, align: 32, offset: 1984)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1254, file: !758, line: 415, baseType: !1037, size: 32, align: 32, offset: 2016)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1254, file: !758, line: 420, baseType: !1037, size: 32, align: 32, offset: 2048)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1254, file: !758, line: 425, baseType: !1037, size: 32, align: 32, offset: 2080)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1254, file: !758, line: 435, baseType: !1212, size: 64, align: 64, offset: 2112)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1254, file: !758, line: 440, baseType: !1037, size: 32, align: 32, offset: 2176)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1254, file: !758, line: 445, baseType: !997, size: 64, align: 64, offset: 2240)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1254, file: !758, line: 459, baseType: !1284, size: 512, align: 64, offset: 2304)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 512, align: 64, elements: !1196)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1254, file: !758, line: 473, baseType: !1286, size: 64, align: 64, offset: 2816)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1254, file: !758, line: 477, baseType: !1037, size: 32, align: 32, offset: 2880)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1254, file: !758, line: 479, baseType: !1289, size: 64, align: 64, offset: 2944)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1302}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1292, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1292, file: !758, line: 203, baseType: !1168, size: 64, align: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1292, file: !758, line: 204, baseType: !1037, size: 32, align: 32, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1292, file: !758, line: 205, baseType: !1298, size: 64, align: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1300, line: 86, baseType: !1301)
!1300 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1300, line: 86, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1292, file: !758, line: 206, baseType: !1222, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1254, file: !758, line: 480, baseType: !1037, size: 32, align: 32, offset: 3008)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1254, file: !758, line: 505, baseType: !1037, size: 32, align: 32, offset: 3040)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1254, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1254, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1254, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1254, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1254, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1254, file: !758, line: 532, baseType: !1212, size: 64, align: 64, offset: 3264)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1254, file: !758, line: 539, baseType: !1212, size: 64, align: 64, offset: 3328)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1254, file: !758, line: 547, baseType: !1212, size: 64, align: 64, offset: 3392)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1254, file: !758, line: 554, baseType: !1298, size: 64, align: 64, offset: 3456)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1254, file: !758, line: 563, baseType: !1037, size: 32, align: 32, offset: 3520)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1254, file: !758, line: 572, baseType: !1037, size: 32, align: 32, offset: 3552)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1254, file: !758, line: 581, baseType: !1037, size: 32, align: 32, offset: 3584)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1254, file: !758, line: 588, baseType: !1318, size: 64, align: 64, offset: 3648)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !989, line: 36, baseType: !1320)
!1320 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1254, file: !758, line: 593, baseType: !1037, size: 32, align: 32, offset: 3712)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1254, file: !758, line: 596, baseType: !1037, size: 32, align: 32, offset: 3744)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1254, file: !758, line: 599, baseType: !1222, size: 64, align: 64, offset: 3776)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1254, file: !758, line: 605, baseType: !1222, size: 64, align: 64, offset: 3840)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1254, file: !758, line: 616, baseType: !1222, size: 64, align: 64, offset: 3904)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1254, file: !758, line: 626, baseType: !1327, size: 64, align: 64, offset: 3968)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1328, line: 216, baseType: !998)
!1328 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1254, file: !758, line: 627, baseType: !1327, size: 64, align: 64, offset: 4032)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1254, file: !758, line: 628, baseType: !1327, size: 64, align: 64, offset: 4096)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1254, file: !758, line: 629, baseType: !1327, size: 64, align: 64, offset: 4160)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1254, file: !758, line: 645, baseType: !1222, size: 64, align: 64, offset: 4224)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1097, file: !35, line: 3566, baseType: !1335, size: 64, align: 64, offset: 1408)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!1037, !1087, !1006, !1333, !1217}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1097, file: !35, line: 3567, baseType: !1140, size: 64, align: 64, offset: 1472)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1097, file: !35, line: 3576, baseType: !1340, size: 64, align: 64, offset: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1037, !1087, !1251}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1097, file: !35, line: 3577, baseType: !1344, size: 64, align: 64, offset: 1600)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!1037, !1087, !1217}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1097, file: !35, line: 3584, baseType: !1348, size: 64, align: 64, offset: 1664)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!1037, !1087, !1351}
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1097, file: !35, line: 3589, baseType: !1353, size: 64, align: 64, offset: 1728)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{null, !1087}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1097, file: !35, line: 3594, baseType: !1037, size: 32, align: 32, offset: 1792)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1097, file: !35, line: 3600, baseType: !1049, size: 64, align: 64, offset: 1856)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1097, file: !35, line: 3609, baseType: !1359, size: 64, align: 64, offset: 1920)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1362 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1089, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1089, file: !35, line: 1581, baseType: !1176, size: 32, align: 32, offset: 224)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1089, file: !35, line: 1583, baseType: !1006, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1089, file: !35, line: 1591, baseType: !1367, size: 64, align: 64, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1154, line: 129, size: 1664, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374, !1392, !1393, !1399, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1368, file: !1154, line: 136, baseType: !1037, size: 32, align: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1368, file: !1154, line: 151, baseType: !1037, size: 32, align: 32, offset: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1368, file: !1154, line: 157, baseType: !1037, size: 32, align: 32, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1368, file: !1154, line: 159, baseType: !1351, size: 64, align: 64, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1368, file: !1154, line: 161, baseType: !1375, size: 64, align: 64, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1154, line: 117, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1154, line: 100, size: 832, align: 64, elements: !1378)
!1378 = !{!1379, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1377, file: !1154, line: 105, baseType: !1380, size: 256, align: 64)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1381, size: 256, align: 64, elements: !1202)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1224, line: 238, baseType: !1383)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1224, line: 238, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1377, file: !1154, line: 110, baseType: !1037, size: 32, align: 32, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1377, file: !1154, line: 111, baseType: !1037, size: 32, align: 32, offset: 288)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1377, file: !1154, line: 111, baseType: !1037, size: 32, align: 32, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1377, file: !1154, line: 112, baseType: !1199, size: 256, align: 32, offset: 352)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1377, file: !1154, line: 113, baseType: !1205, size: 128, align: 32, offset: 608)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1377, file: !1154, line: 114, baseType: !1037, size: 32, align: 32, offset: 736)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1377, file: !1154, line: 115, baseType: !1037, size: 32, align: 32, offset: 768)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1377, file: !1154, line: 116, baseType: !1037, size: 32, align: 32, offset: 800)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1368, file: !1154, line: 163, baseType: !1006, size: 64, align: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1368, file: !1154, line: 165, baseType: !1394, size: 128, align: 64, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1154, line: 122, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1154, line: 119, size: 128, align: 64, elements: !1396)
!1396 = !{!1397, !1398}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1395, file: !1154, line: 120, baseType: !1217, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1395, file: !1154, line: 121, baseType: !1351, size: 64, align: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1368, file: !1154, line: 166, baseType: !1400, size: 128, align: 64, offset: 448)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1154, line: 127, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1154, line: 124, size: 128, align: 64, elements: !1402)
!1402 = !{!1403, !1476}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1401, file: !1154, line: 125, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1434, !1438, !1439, !1473, !1474, !1475}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1407, file: !35, line: 5751, baseType: !1043, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1407, file: !35, line: 5756, baseType: !1411, size: 64, align: 64, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1414)
!1414 = !{!1415, !1416, !1419, !1420, !1421, !1425, !1429, !1433}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1413, file: !35, line: 5797, baseType: !1049, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1413, file: !35, line: 5804, baseType: !1417, size: 64, align: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1413, file: !35, line: 5815, baseType: !1043, size: 64, align: 64, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1413, file: !35, line: 5825, baseType: !1037, size: 32, align: 32, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1413, file: !35, line: 5826, baseType: !1422, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!1037, !1405}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1413, file: !35, line: 5827, baseType: !1426, size: 64, align: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!1037, !1405, !1217}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1413, file: !35, line: 5828, baseType: !1430, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{null, !1405}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1413, file: !35, line: 5829, baseType: !1430, size: 64, align: 64, offset: 448)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1407, file: !35, line: 5762, baseType: !1435, size: 64, align: 64, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1437)
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1407, file: !35, line: 5768, baseType: !1006, size: 64, align: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1407, file: !35, line: 5775, baseType: !1440, size: 64, align: 64, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1442, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1442, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1442, file: !35, line: 3948, baseType: !1175, size: 32, align: 32, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1442, file: !35, line: 3958, baseType: !1168, size: 64, align: 64, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1442, file: !35, line: 3962, baseType: !1037, size: 32, align: 32, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1442, file: !35, line: 3968, baseType: !1037, size: 32, align: 32, offset: 224)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1442, file: !35, line: 3973, baseType: !1212, size: 64, align: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1442, file: !35, line: 3986, baseType: !1037, size: 32, align: 32, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1442, file: !35, line: 3999, baseType: !1037, size: 32, align: 32, offset: 352)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1442, file: !35, line: 4004, baseType: !1037, size: 32, align: 32, offset: 384)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1442, file: !35, line: 4005, baseType: !1037, size: 32, align: 32, offset: 416)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1442, file: !35, line: 4010, baseType: !1037, size: 32, align: 32, offset: 448)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1442, file: !35, line: 4011, baseType: !1037, size: 32, align: 32, offset: 480)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1442, file: !35, line: 4020, baseType: !1107, size: 64, align: 32, offset: 512)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1442, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1442, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1442, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1442, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1442, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1442, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1442, file: !35, line: 4039, baseType: !1037, size: 32, align: 32, offset: 768)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1442, file: !35, line: 4046, baseType: !997, size: 64, align: 64, offset: 832)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1442, file: !35, line: 4050, baseType: !1037, size: 32, align: 32, offset: 896)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1442, file: !35, line: 4054, baseType: !1037, size: 32, align: 32, offset: 928)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1442, file: !35, line: 4061, baseType: !1037, size: 32, align: 32, offset: 960)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1442, file: !35, line: 4065, baseType: !1037, size: 32, align: 32, offset: 992)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1442, file: !35, line: 4073, baseType: !1037, size: 32, align: 32, offset: 1024)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1442, file: !35, line: 4080, baseType: !1037, size: 32, align: 32, offset: 1056)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1442, file: !35, line: 4084, baseType: !1037, size: 32, align: 32, offset: 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1407, file: !35, line: 5781, baseType: !1440, size: 64, align: 64, offset: 320)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1407, file: !35, line: 5787, baseType: !1107, size: 64, align: 32, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1407, file: !35, line: 5793, baseType: !1107, size: 64, align: 32, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1401, file: !1154, line: 126, baseType: !1037, size: 32, align: 32, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1368, file: !1154, line: 172, baseType: !1217, size: 64, align: 64, offset: 576)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1368, file: !1154, line: 177, baseType: !1168, size: 64, align: 64, offset: 640)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1368, file: !1154, line: 178, baseType: !1176, size: 32, align: 32, offset: 704)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1368, file: !1154, line: 180, baseType: !1006, size: 64, align: 64, offset: 768)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1368, file: !1154, line: 185, baseType: !1037, size: 32, align: 32, offset: 832)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1368, file: !1154, line: 190, baseType: !1006, size: 64, align: 64, offset: 896)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1368, file: !1154, line: 195, baseType: !1037, size: 32, align: 32, offset: 960)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1368, file: !1154, line: 200, baseType: !1217, size: 64, align: 64, offset: 1024)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1368, file: !1154, line: 201, baseType: !1037, size: 32, align: 32, offset: 1088)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1368, file: !1154, line: 202, baseType: !1351, size: 64, align: 64, offset: 1152)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1368, file: !1154, line: 203, baseType: !1037, size: 32, align: 32, offset: 1216)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1368, file: !1154, line: 205, baseType: !1037, size: 32, align: 32, offset: 1248)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1368, file: !1154, line: 206, baseType: !1037, size: 32, align: 32, offset: 1280)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1368, file: !1154, line: 209, baseType: !1327, size: 64, align: 64, offset: 1344)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1368, file: !1154, line: 212, baseType: !1327, size: 64, align: 64, offset: 1408)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1368, file: !1154, line: 213, baseType: !1351, size: 64, align: 64, offset: 1472)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1368, file: !1154, line: 215, baseType: !1037, size: 32, align: 32, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1368, file: !1154, line: 217, baseType: !1037, size: 32, align: 32, offset: 1568)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1368, file: !1154, line: 220, baseType: !1037, size: 32, align: 32, offset: 1600)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1089, file: !35, line: 1598, baseType: !1006, size: 64, align: 64, offset: 384)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1089, file: !35, line: 1606, baseType: !1212, size: 64, align: 64, offset: 448)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1089, file: !35, line: 1614, baseType: !1037, size: 32, align: 32, offset: 512)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1089, file: !35, line: 1622, baseType: !1037, size: 32, align: 32, offset: 544)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1089, file: !35, line: 1628, baseType: !1037, size: 32, align: 32, offset: 576)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !35, line: 1636, baseType: !1037, size: 32, align: 32, offset: 608)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1089, file: !35, line: 1643, baseType: !1037, size: 32, align: 32, offset: 640)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1089, file: !35, line: 1657, baseType: !1168, size: 64, align: 64, offset: 704)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1089, file: !35, line: 1658, baseType: !1037, size: 32, align: 32, offset: 768)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1089, file: !35, line: 1679, baseType: !1107, size: 64, align: 32, offset: 800)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1089, file: !35, line: 1688, baseType: !1037, size: 32, align: 32, offset: 864)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1089, file: !35, line: 1712, baseType: !1037, size: 32, align: 32, offset: 896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1089, file: !35, line: 1729, baseType: !1037, size: 32, align: 32, offset: 928)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1089, file: !35, line: 1729, baseType: !1037, size: 32, align: 32, offset: 960)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1089, file: !35, line: 1744, baseType: !1037, size: 32, align: 32, offset: 992)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1089, file: !35, line: 1744, baseType: !1037, size: 32, align: 32, offset: 1024)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1089, file: !35, line: 1751, baseType: !1037, size: 32, align: 32, offset: 1056)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1089, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1089, file: !35, line: 1791, baseType: !1515, size: 64, align: 64, offset: 1152)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{null, !1518, !1251, !1333, !1037, !1037, !1037}
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1089, file: !35, line: 1808, baseType: !1520, size: 64, align: 64, offset: 1216)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!494, !1518, !1114}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1089, file: !35, line: 1816, baseType: !1037, size: 32, align: 32, offset: 1280)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1089, file: !35, line: 1825, baseType: !1525, size: 32, align: 32, offset: 1312)
!1525 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1089, file: !35, line: 1830, baseType: !1037, size: 32, align: 32, offset: 1344)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1089, file: !35, line: 1838, baseType: !1525, size: 32, align: 32, offset: 1376)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1089, file: !35, line: 1846, baseType: !1037, size: 32, align: 32, offset: 1408)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1089, file: !35, line: 1851, baseType: !1037, size: 32, align: 32, offset: 1440)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1089, file: !35, line: 1861, baseType: !1525, size: 32, align: 32, offset: 1472)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1089, file: !35, line: 1868, baseType: !1525, size: 32, align: 32, offset: 1504)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1089, file: !35, line: 1875, baseType: !1525, size: 32, align: 32, offset: 1536)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1089, file: !35, line: 1882, baseType: !1525, size: 32, align: 32, offset: 1568)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1089, file: !35, line: 1889, baseType: !1525, size: 32, align: 32, offset: 1600)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1089, file: !35, line: 1896, baseType: !1525, size: 32, align: 32, offset: 1632)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1089, file: !35, line: 1903, baseType: !1525, size: 32, align: 32, offset: 1664)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1089, file: !35, line: 1910, baseType: !1037, size: 32, align: 32, offset: 1696)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1089, file: !35, line: 1915, baseType: !1037, size: 32, align: 32, offset: 1728)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1089, file: !35, line: 1926, baseType: !1333, size: 64, align: 64, offset: 1792)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1089, file: !35, line: 1935, baseType: !1107, size: 64, align: 32, offset: 1856)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1089, file: !35, line: 1942, baseType: !1037, size: 32, align: 32, offset: 1920)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1089, file: !35, line: 1948, baseType: !1037, size: 32, align: 32, offset: 1952)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1089, file: !35, line: 1954, baseType: !1037, size: 32, align: 32, offset: 1984)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1089, file: !35, line: 1960, baseType: !1037, size: 32, align: 32, offset: 2016)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1089, file: !35, line: 1984, baseType: !1037, size: 32, align: 32, offset: 2048)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1089, file: !35, line: 1991, baseType: !1037, size: 32, align: 32, offset: 2080)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1089, file: !35, line: 1996, baseType: !1037, size: 32, align: 32, offset: 2112)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1089, file: !35, line: 2004, baseType: !1037, size: 32, align: 32, offset: 2144)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1089, file: !35, line: 2011, baseType: !1037, size: 32, align: 32, offset: 2176)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1089, file: !35, line: 2018, baseType: !1037, size: 32, align: 32, offset: 2208)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1089, file: !35, line: 2027, baseType: !1037, size: 32, align: 32, offset: 2240)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1089, file: !35, line: 2034, baseType: !1037, size: 32, align: 32, offset: 2272)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1089, file: !35, line: 2044, baseType: !1037, size: 32, align: 32, offset: 2304)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1089, file: !35, line: 2054, baseType: !1017, size: 64, align: 64, offset: 2368)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1089, file: !35, line: 2061, baseType: !1017, size: 64, align: 64, offset: 2432)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1089, file: !35, line: 2066, baseType: !1037, size: 32, align: 32, offset: 2496)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1089, file: !35, line: 2070, baseType: !1037, size: 32, align: 32, offset: 2528)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1089, file: !35, line: 2078, baseType: !1037, size: 32, align: 32, offset: 2560)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1089, file: !35, line: 2085, baseType: !1037, size: 32, align: 32, offset: 2592)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1089, file: !35, line: 2092, baseType: !1037, size: 32, align: 32, offset: 2624)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1089, file: !35, line: 2099, baseType: !1037, size: 32, align: 32, offset: 2656)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1089, file: !35, line: 2106, baseType: !1037, size: 32, align: 32, offset: 2688)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1089, file: !35, line: 2113, baseType: !1037, size: 32, align: 32, offset: 2720)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1089, file: !35, line: 2120, baseType: !1037, size: 32, align: 32, offset: 2752)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1089, file: !35, line: 2125, baseType: !1037, size: 32, align: 32, offset: 2784)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1089, file: !35, line: 2133, baseType: !1037, size: 32, align: 32, offset: 2816)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1089, file: !35, line: 2140, baseType: !1037, size: 32, align: 32, offset: 2848)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1089, file: !35, line: 2145, baseType: !1037, size: 32, align: 32, offset: 2880)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1089, file: !35, line: 2153, baseType: !1037, size: 32, align: 32, offset: 2912)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1089, file: !35, line: 2158, baseType: !1037, size: 32, align: 32, offset: 2944)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1089, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1089, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1089, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1089, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1089, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1089, file: !35, line: 2203, baseType: !1037, size: 32, align: 32, offset: 3136)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1089, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1089, file: !35, line: 2212, baseType: !1037, size: 32, align: 32, offset: 3200)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1089, file: !35, line: 2213, baseType: !1037, size: 32, align: 32, offset: 3232)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1089, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1089, file: !35, line: 2232, baseType: !1037, size: 32, align: 32, offset: 3296)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1089, file: !35, line: 2243, baseType: !1037, size: 32, align: 32, offset: 3328)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1089, file: !35, line: 2249, baseType: !1037, size: 32, align: 32, offset: 3360)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1089, file: !35, line: 2256, baseType: !1037, size: 32, align: 32, offset: 3392)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1089, file: !35, line: 2263, baseType: !997, size: 64, align: 64, offset: 3456)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1089, file: !35, line: 2270, baseType: !997, size: 64, align: 64, offset: 3520)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1089, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1089, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1089, file: !35, line: 2367, baseType: !1590, size: 64, align: 64, offset: 3648)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!1037, !1518, !1351, !1037}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1089, file: !35, line: 2383, baseType: !1037, size: 32, align: 32, offset: 3712)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1089, file: !35, line: 2386, baseType: !1525, size: 32, align: 32, offset: 3744)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1089, file: !35, line: 2387, baseType: !1525, size: 32, align: 32, offset: 3776)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1089, file: !35, line: 2394, baseType: !1037, size: 32, align: 32, offset: 3808)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1089, file: !35, line: 2401, baseType: !1037, size: 32, align: 32, offset: 3840)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1089, file: !35, line: 2408, baseType: !1037, size: 32, align: 32, offset: 3872)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1089, file: !35, line: 2415, baseType: !1037, size: 32, align: 32, offset: 3904)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1089, file: !35, line: 2422, baseType: !1037, size: 32, align: 32, offset: 3936)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1089, file: !35, line: 2423, baseType: !1602, size: 64, align: 64, offset: 3968)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1604, file: !35, line: 827, baseType: !1037, size: 32, align: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1604, file: !35, line: 828, baseType: !1037, size: 32, align: 32, offset: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1604, file: !35, line: 829, baseType: !1037, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1604, file: !35, line: 830, baseType: !1525, size: 32, align: 32, offset: 96)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1089, file: !35, line: 2430, baseType: !1212, size: 64, align: 64, offset: 4032)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1089, file: !35, line: 2437, baseType: !1212, size: 64, align: 64, offset: 4096)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1089, file: !35, line: 2444, baseType: !1525, size: 32, align: 32, offset: 4160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1089, file: !35, line: 2451, baseType: !1525, size: 32, align: 32, offset: 4192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1089, file: !35, line: 2458, baseType: !1037, size: 32, align: 32, offset: 4224)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1089, file: !35, line: 2469, baseType: !1037, size: 32, align: 32, offset: 4256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1089, file: !35, line: 2475, baseType: !1037, size: 32, align: 32, offset: 4288)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1089, file: !35, line: 2481, baseType: !1037, size: 32, align: 32, offset: 4320)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1089, file: !35, line: 2485, baseType: !1037, size: 32, align: 32, offset: 4352)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1089, file: !35, line: 2489, baseType: !1037, size: 32, align: 32, offset: 4384)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1089, file: !35, line: 2493, baseType: !1037, size: 32, align: 32, offset: 4416)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1089, file: !35, line: 2501, baseType: !1037, size: 32, align: 32, offset: 4448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1089, file: !35, line: 2506, baseType: !1037, size: 32, align: 32, offset: 4480)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1089, file: !35, line: 2510, baseType: !1037, size: 32, align: 32, offset: 4512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1089, file: !35, line: 2514, baseType: !1212, size: 64, align: 64, offset: 4544)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1089, file: !35, line: 2528, baseType: !1626, size: 64, align: 64, offset: 4608)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1518, !1006, !1037, !1037}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1089, file: !35, line: 2534, baseType: !1037, size: 32, align: 32, offset: 4672)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1089, file: !35, line: 2545, baseType: !1037, size: 32, align: 32, offset: 4704)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1089, file: !35, line: 2547, baseType: !1037, size: 32, align: 32, offset: 4736)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1089, file: !35, line: 2549, baseType: !1037, size: 32, align: 32, offset: 4768)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1089, file: !35, line: 2551, baseType: !1037, size: 32, align: 32, offset: 4800)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1089, file: !35, line: 2553, baseType: !1037, size: 32, align: 32, offset: 4832)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1089, file: !35, line: 2555, baseType: !1037, size: 32, align: 32, offset: 4864)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1089, file: !35, line: 2557, baseType: !1037, size: 32, align: 32, offset: 4896)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1089, file: !35, line: 2559, baseType: !1037, size: 32, align: 32, offset: 4928)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1089, file: !35, line: 2563, baseType: !1037, size: 32, align: 32, offset: 4960)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1089, file: !35, line: 2571, baseType: !1208, size: 64, align: 64, offset: 4992)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1089, file: !35, line: 2579, baseType: !1208, size: 64, align: 64, offset: 5056)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1089, file: !35, line: 2586, baseType: !1037, size: 32, align: 32, offset: 5120)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1089, file: !35, line: 2615, baseType: !1037, size: 32, align: 32, offset: 5152)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1089, file: !35, line: 2627, baseType: !1037, size: 32, align: 32, offset: 5184)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1089, file: !35, line: 2637, baseType: !1037, size: 32, align: 32, offset: 5216)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1089, file: !35, line: 2681, baseType: !1037, size: 32, align: 32, offset: 5248)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1089, file: !35, line: 2709, baseType: !1212, size: 64, align: 64, offset: 5312)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1089, file: !35, line: 2716, baseType: !1648, size: 64, align: 64, offset: 5376)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1658, !1662, !1666, !1667, !1668, !1669, !1675, !1676, !1677, !1678, !1679}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1650, file: !35, line: 3642, baseType: !1049, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1650, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1650, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1650, file: !35, line: 3669, baseType: !1037, size: 32, align: 32, offset: 160)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1650, file: !35, line: 3682, baseType: !1348, size: 64, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1650, file: !35, line: 3698, baseType: !1659, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!1037, !1087, !1157, !1175}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1650, file: !35, line: 3712, baseType: !1663, size: 64, align: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!1037, !1087, !1037, !1157, !1175}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1650, file: !35, line: 3726, baseType: !1659, size: 64, align: 64, offset: 384)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1650, file: !35, line: 3737, baseType: !1140, size: 64, align: 64, offset: 448)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1650, file: !35, line: 3746, baseType: !1037, size: 32, align: 32, offset: 512)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1650, file: !35, line: 3757, baseType: !1670, size: 64, align: 64, offset: 576)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1673}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1650, file: !35, line: 3766, baseType: !1140, size: 64, align: 64, offset: 640)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1650, file: !35, line: 3774, baseType: !1140, size: 64, align: 64, offset: 704)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1650, file: !35, line: 3780, baseType: !1037, size: 32, align: 32, offset: 768)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1650, file: !35, line: 3785, baseType: !1037, size: 32, align: 32, offset: 800)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1650, file: !35, line: 3795, baseType: !1680, size: 64, align: 64, offset: 832)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!1037, !1087, !1222}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1089, file: !35, line: 2728, baseType: !1006, size: 64, align: 64, offset: 5440)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1089, file: !35, line: 2735, baseType: !1275, size: 512, align: 64, offset: 5504)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1089, file: !35, line: 2742, baseType: !1037, size: 32, align: 32, offset: 6016)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1089, file: !35, line: 2755, baseType: !1037, size: 32, align: 32, offset: 6048)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1089, file: !35, line: 2776, baseType: !1037, size: 32, align: 32, offset: 6080)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1089, file: !35, line: 2783, baseType: !1037, size: 32, align: 32, offset: 6112)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1089, file: !35, line: 2791, baseType: !1037, size: 32, align: 32, offset: 6144)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1089, file: !35, line: 2802, baseType: !1351, size: 64, align: 64, offset: 6208)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1089, file: !35, line: 2811, baseType: !1037, size: 32, align: 32, offset: 6272)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1089, file: !35, line: 2821, baseType: !1037, size: 32, align: 32, offset: 6304)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1089, file: !35, line: 2830, baseType: !1037, size: 32, align: 32, offset: 6336)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1089, file: !35, line: 2840, baseType: !1037, size: 32, align: 32, offset: 6368)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1089, file: !35, line: 2851, baseType: !1696, size: 64, align: 64, offset: 6400)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!1037, !1518, !1699, !1006, !1333, !1037, !1037}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!1037, !1518, !1006}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1089, file: !35, line: 2871, baseType: !1703, size: 64, align: 64, offset: 6464)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!1037, !1518, !1706, !1006, !1333, !1037}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!1037, !1518, !1006, !1037, !1037}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1089, file: !35, line: 2878, baseType: !1037, size: 32, align: 32, offset: 6528)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1089, file: !35, line: 2885, baseType: !1037, size: 32, align: 32, offset: 6560)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1089, file: !35, line: 3005, baseType: !1037, size: 32, align: 32, offset: 6592)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1089, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1089, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1089, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1089, file: !35, line: 3037, baseType: !1168, size: 64, align: 64, offset: 6720)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1089, file: !35, line: 3038, baseType: !1037, size: 32, align: 32, offset: 6784)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1089, file: !35, line: 3050, baseType: !997, size: 64, align: 64, offset: 6848)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1089, file: !35, line: 3065, baseType: !1037, size: 32, align: 32, offset: 6912)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1089, file: !35, line: 3083, baseType: !1037, size: 32, align: 32, offset: 6944)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1089, file: !35, line: 3092, baseType: !1107, size: 64, align: 32, offset: 6976)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1089, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1089, file: !35, line: 3106, baseType: !1107, size: 64, align: 32, offset: 7072)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1089, file: !35, line: 3113, baseType: !1724, size: 64, align: 64, offset: 7168)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1726)
!1726 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1727)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1728)
!1728 = !{!1729, !1730, !1731, !1732, !1733, !1734, !1737}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1727, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1727, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1727, file: !35, line: 720, baseType: !1049, size: 64, align: 64, offset: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1727, file: !35, line: 724, baseType: !1049, size: 64, align: 64, offset: 128)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1727, file: !35, line: 728, baseType: !1037, size: 32, align: 32, offset: 192)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1727, file: !35, line: 734, baseType: !1735, size: 64, align: 64, offset: 256)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1727, file: !35, line: 739, baseType: !1738, size: 64, align: 64, offset: 320)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1089, file: !35, line: 3129, baseType: !1212, size: 64, align: 64, offset: 7232)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1089, file: !35, line: 3130, baseType: !1212, size: 64, align: 64, offset: 7296)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1089, file: !35, line: 3131, baseType: !1212, size: 64, align: 64, offset: 7360)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1089, file: !35, line: 3132, baseType: !1212, size: 64, align: 64, offset: 7424)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1089, file: !35, line: 3139, baseType: !1208, size: 64, align: 64, offset: 7488)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1089, file: !35, line: 3147, baseType: !1037, size: 32, align: 32, offset: 7552)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1089, file: !35, line: 3165, baseType: !1037, size: 32, align: 32, offset: 7584)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1089, file: !35, line: 3172, baseType: !1037, size: 32, align: 32, offset: 7616)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1089, file: !35, line: 3180, baseType: !1037, size: 32, align: 32, offset: 7648)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1089, file: !35, line: 3191, baseType: !1017, size: 64, align: 64, offset: 7680)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1089, file: !35, line: 3199, baseType: !1168, size: 64, align: 64, offset: 7744)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1089, file: !35, line: 3207, baseType: !1208, size: 64, align: 64, offset: 7808)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1089, file: !35, line: 3214, baseType: !1176, size: 32, align: 32, offset: 7872)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1089, file: !35, line: 3224, baseType: !1240, size: 64, align: 64, offset: 7936)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1089, file: !35, line: 3225, baseType: !1037, size: 32, align: 32, offset: 8000)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1089, file: !35, line: 3249, baseType: !1222, size: 64, align: 64, offset: 8064)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1089, file: !35, line: 3256, baseType: !1037, size: 32, align: 32, offset: 8128)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1089, file: !35, line: 3271, baseType: !1037, size: 32, align: 32, offset: 8160)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1089, file: !35, line: 3279, baseType: !1212, size: 64, align: 64, offset: 8192)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1089, file: !35, line: 3301, baseType: !1222, size: 64, align: 64, offset: 8256)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1089, file: !35, line: 3310, baseType: !1037, size: 32, align: 32, offset: 8320)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1089, file: !35, line: 3337, baseType: !1037, size: 32, align: 32, offset: 8352)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1089, file: !35, line: 3351, baseType: !1037, size: 32, align: 32, offset: 8384)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1089, file: !35, line: 3359, baseType: !1037, size: 32, align: 32, offset: 8416)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "sList", scope: !1040, file: !888, line: 387, baseType: !1765, size: 1024, align: 64, offset: 128)
!1765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1766, size: 1024, align: 64, elements: !1767)
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1767 = !{!1768}
!1768 = !DISubrange(count: 16)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "HEVClcList", scope: !1040, file: !888, line: 389, baseType: !1770, size: 1024, align: 64, offset: 1152)
!1770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1771, size: 1024, align: 64, elements: !1767)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64, align: 64)
!1772 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCLocalContext", file: !888, line: 381, baseType: !1773)
!1773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCLocalContext", file: !888, line: 340, size: 251136, align: 256, elements: !1774)
!1774 = !{!1775, !1779, !1781, !1782, !1792, !1814, !1815, !1816, !1817, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1841, !1842, !1848, !1849, !1860, !1876, !1886}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_state", scope: !1773, file: !888, line: 341, baseType: !1776, size: 1592, align: 8)
