; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--elsdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--elsdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Ladder = type { i8, i8, i8, i8 }
%struct.ElsDecCtx = type { i8*, i32, i64, i32, i32, i32, i32 }
%union.unaligned_16 = type { i16 }
%struct.ElsUnsignedRung = type { [11 x i8], %struct.ElsRungNode*, i64, i16 }
%struct.ElsRungNode = type { i8, i16 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !21)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--elsdec.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !9, !17, !18, !19, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 48, baseType: !8)
!7 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !12, line: 222, size: 16, align: 8, elements: !13)
!12 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !11, file: !12, line: 222, baseType: !15, size: 16, align: 16)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 49, baseType: !16)
!16 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!21 = !{!22, !29}
!22 = distinct !DIGlobalVariable(name: "els_exp_tab", scope: !0, file: !23, line: 225, type: !24, isLocal: true, isDefinition: true, variable: [145 x i32]* @els_exp_tab)
!23 = !DIFile(filename: "libavcodec/elsdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 4640, align: 32, elements: !27)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 51, baseType: !18)
!27 = !{!28}
!28 = !DISubrange(count: 145)
!29 = distinct !DIGlobalVariable(name: "Ladder", scope: !0, file: !23, line: 48, type: !30, isLocal: true, isDefinition: true, variable: [174 x %struct.Ladder]* @Ladder)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 5568, align: 8, elements: !40)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ladder", file: !23, line: 43, size: 32, align: 8, elements: !33)
!33 = !{!34, !37, !38, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "AMps", scope: !32, file: !23, line: 44, baseType: !35, size: 8, align: 8)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !7, line: 36, baseType: !36)
!36 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ALps", scope: !32, file: !23, line: 45, baseType: !35, size: 8, align: 8, offset: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next0", scope: !32, file: !23, line: 46, baseType: !6, size: 8, align: 8, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next1", scope: !32, file: !23, line: 47, baseType: !6, size: 8, align: 8, offset: 24)
!40 = !{!41}
!41 = !DISubrange(count: 174)
!42 = !{i32 2, !"Dwarf Version", i32 4}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!45 = distinct !DISubprogram(name: "ff_els_decoder_init", scope: !23, file: !23, line: 247, type: !46, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !4, !56}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElsDecCtx", file: !50, line: 41, baseType: !51)
!50 = !DIFile(filename: "libavcodec/elsdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ElsDecCtx", file: !50, line: 36, size: 320, align: 64, elements: !52)
!52 = !{!53, !54, !55, !59, !60, !61, !62}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !51, file: !50, line: 37, baseType: !4, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !50, line: 38, baseType: !18, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !51, file: !50, line: 39, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !57, line: 216, baseType: !58)
!57 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!58 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !51, file: !50, line: 40, baseType: !17, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !51, file: !50, line: 40, baseType: !17, size: 32, align: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "diff", scope: !51, file: !50, line: 40, baseType: !17, size: 32, align: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !51, file: !50, line: 40, baseType: !17, size: 32, align: 32, offset: 288)
!63 = !DILocalVariable(name: "x", arg: 1, scope: !64, file: !65, line: 58, type: !15)
!64 = distinct !DISubprogram(name: "av_bswap16", scope: !65, file: !65, line: 58, type: !66, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!65 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!66 = !DISubroutineType(types: !67)
!67 = !{!15, !15}
!68 = !DIExpression()
!69 = !DILocation(line: 58, column: 98, scope: !64, inlinedAt: !70)
!70 = distinct !DILocation(line: 256, column: 18, scope: !71)
!71 = distinct !DILexicalBlock(scope: !72, file: !23, line: 255, column: 32)
!72 = distinct !DILexicalBlock(scope: !73, file: !23, line: 255, column: 16)
!73 = distinct !DILexicalBlock(scope: !45, file: !23, line: 252, column: 9)
!74 = !DILocalVariable(name: "ctx", arg: 1, scope: !45, file: !23, line: 247, type: !48)
!75 = !DILocation(line: 247, column: 37, scope: !45)
!76 = !DILocalVariable(name: "in", arg: 2, scope: !45, file: !23, line: 247, type: !4)
!77 = !DILocation(line: 247, column: 57, scope: !45)
!78 = !DILocalVariable(name: "data_size", arg: 3, scope: !45, file: !23, line: 247, type: !56)
!79 = !DILocation(line: 247, column: 68, scope: !45)
!80 = !DILocalVariable(name: "nbytes", scope: !45, file: !23, line: 249, type: !17)
!81 = !DILocation(line: 249, column: 9, scope: !45)
!82 = !DILocation(line: 252, column: 9, scope: !73)
!83 = !DILocation(line: 252, column: 19, scope: !73)
!84 = !DILocation(line: 252, column: 9, scope: !45)
!85 = !DILocation(line: 253, column: 38, scope: !86)
!86 = distinct !DILexicalBlock(scope: !73, file: !23, line: 252, column: 25)
!87 = !DILocation(line: 253, column: 20, scope: !86)
!88 = !DILocation(line: 253, column: 46, scope: !86)
!89 = !DILocation(line: 253, column: 74, scope: !86)
!90 = !DILocation(line: 253, column: 56, scope: !86)
!91 = !DILocation(line: 253, column: 82, scope: !86)
!92 = !DILocation(line: 253, column: 53, scope: !86)
!93 = !DILocation(line: 253, column: 108, scope: !86)
!94 = !DILocation(line: 253, column: 90, scope: !86)
!95 = !DILocation(line: 253, column: 88, scope: !86)
!96 = !DILocation(line: 253, column: 9, scope: !86)
!97 = !DILocation(line: 253, column: 14, scope: !86)
!98 = !DILocation(line: 253, column: 16, scope: !86)
!99 = !DILocation(line: 254, column: 16, scope: !86)
!100 = !DILocation(line: 255, column: 5, scope: !86)
!101 = !DILocation(line: 255, column: 16, scope: !102)
!102 = !DILexicalBlockFile(scope: !72, file: !23, discriminator: 1)
!103 = !DILocation(line: 255, column: 26, scope: !102)
!104 = !DILocation(line: 256, column: 61, scope: !71)
!105 = !DILocation(line: 256, column: 67, scope: !71)
!106 = !DILocation(line: 256, column: 18, scope: !71)
!107 = !DILocation(line: 60, column: 9, scope: !64, inlinedAt: !70)
!108 = !DILocation(line: 60, column: 10, scope: !64, inlinedAt: !70)
!109 = !DILocation(line: 60, column: 18, scope: !64, inlinedAt: !70)
!110 = !DILocation(line: 60, column: 19, scope: !64, inlinedAt: !70)
!111 = !DILocation(line: 60, column: 15, scope: !64, inlinedAt: !70)
!112 = !DILocation(line: 60, column: 8, scope: !64, inlinedAt: !70)
!113 = !DILocation(line: 60, column: 6, scope: !64, inlinedAt: !70)
!114 = !DILocation(line: 61, column: 12, scope: !64, inlinedAt: !70)
!115 = !DILocation(line: 256, column: 9, scope: !71)
!116 = !DILocation(line: 256, column: 14, scope: !71)
!117 = !DILocation(line: 256, column: 16, scope: !71)
!118 = !DILocation(line: 257, column: 16, scope: !71)
!119 = !DILocation(line: 258, column: 5, scope: !71)
!120 = !DILocation(line: 259, column: 19, scope: !121)
!121 = distinct !DILexicalBlock(scope: !72, file: !23, line: 258, column: 12)
!122 = !DILocation(line: 259, column: 18, scope: !121)
!123 = !DILocation(line: 259, column: 9, scope: !121)
!124 = !DILocation(line: 259, column: 14, scope: !121)
!125 = !DILocation(line: 259, column: 16, scope: !121)
!126 = !DILocation(line: 260, column: 16, scope: !121)
!127 = !DILocation(line: 263, column: 19, scope: !45)
!128 = !DILocation(line: 263, column: 24, scope: !45)
!129 = !DILocation(line: 263, column: 22, scope: !45)
!130 = !DILocation(line: 263, column: 5, scope: !45)
!131 = !DILocation(line: 263, column: 10, scope: !45)
!132 = !DILocation(line: 263, column: 17, scope: !45)
!133 = !DILocation(line: 264, column: 22, scope: !45)
!134 = !DILocation(line: 264, column: 34, scope: !45)
!135 = !DILocation(line: 264, column: 32, scope: !45)
!136 = !DILocation(line: 264, column: 5, scope: !45)
!137 = !DILocation(line: 264, column: 10, scope: !45)
!138 = !DILocation(line: 264, column: 20, scope: !45)
!139 = !DILocation(line: 265, column: 5, scope: !45)
!140 = !DILocation(line: 265, column: 10, scope: !45)
!141 = !DILocation(line: 265, column: 14, scope: !45)
!142 = !DILocation(line: 266, column: 5, scope: !45)
!143 = !DILocation(line: 266, column: 10, scope: !45)
!144 = !DILocation(line: 266, column: 12, scope: !45)
!145 = !DILocation(line: 267, column: 5, scope: !45)
!146 = !DILocation(line: 267, column: 10, scope: !45)
!147 = !DILocation(line: 267, column: 12, scope: !45)
!148 = !DILocation(line: 268, column: 31, scope: !45)
!149 = !DILocation(line: 268, column: 36, scope: !45)
!150 = !DILocation(line: 268, column: 29, scope: !45)
!151 = !DILocation(line: 268, column: 54, scope: !45)
!152 = !DILocation(line: 268, column: 52, scope: !45)
!153 = !DILocation(line: 268, column: 39, scope: !45)
!154 = !DILocation(line: 268, column: 18, scope: !45)
!155 = !DILocation(line: 268, column: 94, scope: !156)
!156 = !DILexicalBlockFile(scope: !45, file: !23, discriminator: 1)
!157 = !DILocation(line: 268, column: 92, scope: !156)
!158 = !DILocation(line: 268, column: 18, scope: !156)
!159 = !DILocation(line: 268, column: 134, scope: !160)
!160 = !DILexicalBlockFile(scope: !45, file: !23, discriminator: 2)
!161 = !DILocation(line: 268, column: 139, scope: !160)
!162 = !DILocation(line: 268, column: 132, scope: !160)
!163 = !DILocation(line: 268, column: 18, scope: !160)
!164 = !DILocation(line: 268, column: 18, scope: !165)
!165 = !DILexicalBlockFile(scope: !45, file: !23, discriminator: 3)
!166 = !DILocation(line: 268, column: 5, scope: !165)
!167 = !DILocation(line: 268, column: 10, scope: !165)
!168 = !DILocation(line: 268, column: 15, scope: !165)
!169 = !DILocation(line: 270, column: 1, scope: !45)
!170 = distinct !DISubprogram(name: "ff_els_decoder_uninit", scope: !23, file: !23, line: 272, type: !171, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElsUnsignedRung", file: !50, line: 53, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ElsUnsignedRung", file: !50, line: 48, size: 320, align: 64, elements: !176)
!176 = !{!177, !181, !188, !189}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_rung", scope: !175, file: !50, line: 49, baseType: !178, size: 88, align: 8)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 88, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 11)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rem_rung_list", scope: !175, file: !50, line: 50, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElsRungNode", file: !50, line: 46, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ElsRungNode", file: !50, line: 43, size: 32, align: 16, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rung", scope: !184, file: !50, line: 44, baseType: !6, size: 8, align: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next_index", scope: !184, file: !50, line: 45, baseType: !15, size: 16, align: 16, offset: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rung_list_size", scope: !175, file: !50, line: 51, baseType: !56, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "avail_index", scope: !175, file: !50, line: 52, baseType: !15, size: 16, align: 16, offset: 256)
!190 = !DILocalVariable(name: "rung", arg: 1, scope: !170, file: !23, line: 272, type: !173)
!191 = !DILocation(line: 272, column: 45, scope: !170)
!192 = !DILocation(line: 274, column: 15, scope: !170)
!193 = !DILocation(line: 274, column: 21, scope: !170)
!194 = !DILocation(line: 274, column: 14, scope: !170)
!195 = !DILocation(line: 274, column: 5, scope: !170)
!196 = !DILocation(line: 275, column: 1, scope: !170)
!197 = distinct !DISubprogram(name: "ff_els_decode_bit", scope: !23, file: !23, line: 291, type: !198, isLocal: false, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!198 = !DISubroutineType(types: !199)
!199 = !{!17, !48, !20}
!200 = !DILocalVariable(name: "ctx", arg: 1, scope: !197, file: !23, line: 291, type: !48)
!201 = !DILocation(line: 291, column: 34, scope: !197)
!202 = !DILocalVariable(name: "rung", arg: 2, scope: !197, file: !23, line: 291, type: !20)
!203 = !DILocation(line: 291, column: 48, scope: !197)
!204 = !DILocalVariable(name: "z", scope: !197, file: !23, line: 293, type: !17)
!205 = !DILocation(line: 293, column: 9, scope: !197)
!206 = !DILocalVariable(name: "bit", scope: !197, file: !23, line: 293, type: !17)
!207 = !DILocation(line: 293, column: 12, scope: !197)
!208 = !DILocalVariable(name: "ret", scope: !197, file: !23, line: 293, type: !17)
!209 = !DILocation(line: 293, column: 17, scope: !197)
!210 = !DILocalVariable(name: "pAllowable", scope: !197, file: !23, line: 294, type: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!212 = !DILocation(line: 294, column: 21, scope: !197)
!213 = !DILocation(line: 296, column: 9, scope: !214)
!214 = distinct !DILexicalBlock(scope: !197, file: !23, line: 296, column: 9)
!215 = !DILocation(line: 296, column: 14, scope: !214)
!216 = !DILocation(line: 296, column: 9, scope: !197)
!217 = !DILocation(line: 297, column: 9, scope: !214)
!218 = !DILocation(line: 299, column: 20, scope: !197)
!219 = !DILocation(line: 299, column: 25, scope: !197)
!220 = !DILocation(line: 299, column: 37, scope: !197)
!221 = !DILocation(line: 299, column: 36, scope: !197)
!222 = !DILocation(line: 299, column: 29, scope: !197)
!223 = !DILocation(line: 299, column: 43, scope: !197)
!224 = !DILocation(line: 299, column: 27, scope: !197)
!225 = !DILocation(line: 299, column: 9, scope: !197)
!226 = !DILocation(line: 299, column: 7, scope: !197)
!227 = !DILocation(line: 300, column: 15, scope: !197)
!228 = !DILocation(line: 300, column: 5, scope: !197)
!229 = !DILocation(line: 300, column: 10, scope: !197)
!230 = !DILocation(line: 300, column: 12, scope: !197)
!231 = !DILocation(line: 301, column: 18, scope: !197)
!232 = !DILocation(line: 301, column: 5, scope: !197)
!233 = !DILocation(line: 301, column: 10, scope: !197)
!234 = !DILocation(line: 301, column: 15, scope: !197)
!235 = !DILocation(line: 302, column: 9, scope: !236)
!236 = distinct !DILexicalBlock(scope: !197, file: !23, line: 302, column: 9)
!237 = !DILocation(line: 302, column: 14, scope: !236)
!238 = !DILocation(line: 302, column: 19, scope: !236)
!239 = !DILocation(line: 302, column: 9, scope: !197)
!240 = !DILocation(line: 303, column: 17, scope: !236)
!241 = !DILocation(line: 303, column: 16, scope: !236)
!242 = !DILocation(line: 303, column: 22, scope: !236)
!243 = !DILocation(line: 303, column: 9, scope: !236)
!244 = !DILocation(line: 305, column: 9, scope: !245)
!245 = distinct !DILexicalBlock(scope: !197, file: !23, line: 305, column: 9)
!246 = !DILocation(line: 305, column: 14, scope: !245)
!247 = !DILocation(line: 305, column: 18, scope: !245)
!248 = !DILocation(line: 305, column: 23, scope: !245)
!249 = !DILocation(line: 305, column: 16, scope: !245)
!250 = !DILocation(line: 305, column: 9, scope: !197)
!251 = !DILocation(line: 306, column: 27, scope: !252)
