; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dirac_arith.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dirac_arith.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DiracArith = type { i32, i16, i16, i8*, i8*, [22 x i16], i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }


!10 = !DIEnumerator(name: "CTX_ZP_F2", value: 4)
!11 = !DIEnumerator(name: "CTX_ZP_F3", value: 5)
!12 = !DIEnumerator(name: "CTX_ZP_F4", value: 6)
!13 = !DIEnumerator(name: "CTX_ZP_F5", value: 7)
!14 = !DIEnumerator(name: "CTX_ZP_F6", value: 8)
!15 = !DIEnumerator(name: "CTX_NP_F2", value: 9)
!16 = !DIEnumerator(name: "CTX_NP_F3", value: 10)
!17 = !DIEnumerator(name: "CTX_NP_F4", value: 11)
!18 = !DIEnumerator(name: "CTX_NP_F5", value: 12)
!19 = !DIEnumerator(name: "CTX_NP_F6", value: 13)
!20 = !DIEnumerator(name: "CTX_COEFF_DATA", value: 14)
!21 = !DIEnumerator(name: "CTX_SIGN_NEG", value: 15)
!22 = !DIEnumerator(name: "CTX_SIGN_ZERO", value: 16)
!23 = !DIEnumerator(name: "CTX_SIGN_POS", value: 17)
!24 = !DIEnumerator(name: "CTX_ZERO_BLOCK", value: 18)
!25 = !DIEnumerator(name: "CTX_DELTA_Q_F", value: 19)
!26 = !DIEnumerator(name: "CTX_DELTA_Q_DATA", value: 20)
!27 = !DIEnumerator(name: "CTX_DELTA_Q_SIGN", value: 21)
!28 = !DIEnumerator(name: "DIRAC_CTX_COUNT", value: 22)
!29 = !{!30, !39, !46}
!30 = distinct !DIGlobalVariable(name: "ff_dirac_prob", scope: !0, file: !31, line: 31, type: !32, isLocal: false, isDefinition: true, variable: [256 x i16]* @ff_dirac_prob)
!31 = !DIFile(filename: "libavcodec/dirac_arith.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 4096, align: 16, elements: !37)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !35, line: 49, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!36 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!37 = !{!38}
!38 = !DISubrange(count: 256)
!39 = distinct !DIGlobalVariable(name: "ff_dirac_next_ctx", scope: !0, file: !31, line: 66, type: !40, isLocal: false, isDefinition: true, variable: [22 x i8]* @ff_dirac_next_ctx)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 176, align: 8, elements: !44)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 48, baseType: !43)
!43 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!44 = !{!45}
!45 = !DISubrange(count: 22)
!46 = distinct !DIGlobalVariable(name: "ff_dirac_prob_branchless", scope: !0, file: !31, line: 84, type: !47, isLocal: false, isDefinition: true, variable: [256 x [2 x i16]]* @ff_dirac_prob_branchless)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8192, align: 16, elements: !50)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !35, line: 37, baseType: !49)
!49 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!50 = !{!38, !51}
!51 = !DISubrange(count: 2)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!55 = distinct !DISubprogram(name: "ff_dirac_init_arith_tables", scope: !31, file: !31, line: 86, type: !56, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!56 = !DISubroutineType(types: !57)
!57 = !{null}
!58 = !{}
!59 = !DILocalVariable(name: "i", scope: !55, file: !31, line: 88, type: !60)
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIExpression()
!62 = !DILocation(line: 88, column: 9, scope: !55)
!63 = !DILocation(line: 90, column: 12, scope: !64)
!64 = distinct !DILexicalBlock(scope: !55, file: !31, line: 90, column: 5)
!65 = !DILocation(line: 90, column: 10, scope: !64)
!66 = !DILocation(line: 90, column: 17, scope: !67)
!67 = !DILexicalBlockFile(scope: !68, file: !31, discriminator: 1)
!68 = distinct !DILexicalBlock(scope: !64, file: !31, line: 90, column: 5)
!69 = !DILocation(line: 90, column: 19, scope: !67)
!70 = !DILocation(line: 90, column: 5, scope: !67)
!71 = !DILocation(line: 91, column: 60, scope: !72)
!72 = distinct !DILexicalBlock(scope: !68, file: !31, line: 90, column: 31)
!73 = !DILocation(line: 91, column: 59, scope: !72)
!74 = !DILocation(line: 91, column: 42, scope: !72)
!75 = !DILocation(line: 91, column: 34, scope: !72)
!76 = !DILocation(line: 91, column: 9, scope: !72)
!77 = !DILocation(line: 91, column: 40, scope: !72)
!78 = !DILocation(line: 92, column: 57, scope: !72)
!79 = !DILocation(line: 92, column: 43, scope: !72)
!80 = !DILocation(line: 92, column: 42, scope: !72)
!81 = !DILocation(line: 92, column: 34, scope: !72)
!82 = !DILocation(line: 92, column: 9, scope: !72)
!83 = !DILocation(line: 92, column: 40, scope: !72)
!84 = !DILocation(line: 93, column: 5, scope: !72)
!85 = !DILocation(line: 90, column: 27, scope: !86)
!86 = !DILexicalBlockFile(scope: !68, file: !31, discriminator: 2)
!87 = !DILocation(line: 90, column: 5, scope: !86)
!88 = distinct !{!88, !89}
!89 = !DILocation(line: 90, column: 5, scope: !55)
!90 = !DILocation(line: 94, column: 1, scope: !55)
!91 = distinct !DISubprogram(name: "ff_dirac_init_arith_decoder", scope: !31, file: !31, line: 96, type: !92, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !94, !109, !60}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiracArith", file: !4, line: 86, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 75, size: 640, align: 64, elements: !97)
!97 = !{!98, !100, !101, !102, !104, !105, !107, !108}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !96, file: !4, line: 76, baseType: !99, size: 32, align: 32)
!99 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !96, file: !4, line: 77, baseType: !34, size: 16, align: 16, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !96, file: !4, line: 78, baseType: !48, size: 16, align: 16, offset: 48)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream", scope: !96, file: !4, line: 80, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_end", scope: !96, file: !4, line: 81, baseType: !103, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !96, file: !4, line: 83, baseType: !106, size: 352, align: 16, offset: 192)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 352, align: 16, elements: !44)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !96, file: !4, line: 84, baseType: !60, size: 32, align: 32, offset: 544)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "overread", scope: !96, file: !4, line: 85, baseType: !60, size: 32, align: 32, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !111, line: 70, baseType: !112)
!111 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !111, line: 61, size: 256, align: 64, elements: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !112, file: !111, line: 62, baseType: !103, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !112, file: !111, line: 62, baseType: !103, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !112, file: !111, line: 67, baseType: !60, size: 32, align: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !112, file: !111, line: 68, baseType: !60, size: 32, align: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !112, file: !111, line: 69, baseType: !60, size: 32, align: 32, offset: 192)
!119 = !DILocalVariable(name: "c", arg: 1, scope: !91, file: !31, line: 96, type: !94)
!120 = !DILocation(line: 96, column: 46, scope: !91)
!121 = !DILocalVariable(name: "gb", arg: 2, scope: !91, file: !31, line: 96, type: !109)
!122 = !DILocation(line: 96, column: 64, scope: !91)
!123 = !DILocalVariable(name: "length", arg: 3, scope: !91, file: !31, line: 96, type: !60)
!124 = !DILocation(line: 96, column: 72, scope: !91)
!125 = !DILocalVariable(name: "i", scope: !91, file: !31, line: 98, type: !60)
!126 = !DILocation(line: 98, column: 9, scope: !91)
!127 = !DILocation(line: 99, column: 20, scope: !91)
!128 = !DILocation(line: 99, column: 5, scope: !91)
!129 = !DILocation(line: 101, column: 16, scope: !91)
!130 = !DILocation(line: 101, column: 41, scope: !91)
!131 = !DILocation(line: 101, column: 27, scope: !91)
!132 = !DILocation(line: 101, column: 44, scope: !91)
!133 = !DILocation(line: 101, column: 24, scope: !91)
!134 = !DILocation(line: 101, column: 15, scope: !91)
!135 = !DILocation(line: 101, column: 65, scope: !136)
!136 = !DILexicalBlockFile(scope: !91, file: !31, discriminator: 1)
!137 = !DILocation(line: 101, column: 51, scope: !136)
!138 = !DILocation(line: 101, column: 68, scope: !136)
!139 = !DILocation(line: 101, column: 15, scope: !136)
!140 = !DILocation(line: 101, column: 75, scope: !141)
!141 = !DILexicalBlockFile(scope: !91, file: !31, discriminator: 2)
!142 = !DILocation(line: 101, column: 15, scope: !141)
!143 = !DILocation(line: 101, column: 15, scope: !144)
!144 = !DILexicalBlockFile(scope: !91, file: !31, discriminator: 3)
!145 = !DILocation(line: 101, column: 12, scope: !144)
!146 = !DILocation(line: 103, column: 21, scope: !91)
!147 = !DILocation(line: 103, column: 25, scope: !91)
!148 = !DILocation(line: 103, column: 49, scope: !91)
!149 = !DILocation(line: 103, column: 34, scope: !91)
!150 = !DILocation(line: 103, column: 52, scope: !91)
!151 = !DILocation(line: 103, column: 32, scope: !91)
!152 = !DILocation(line: 103, column: 5, scope: !91)
!153 = !DILocation(line: 103, column: 8, scope: !91)
!154 = !DILocation(line: 103, column: 19, scope: !91)
!155 = !DILocation(line: 104, column: 25, scope: !91)
!156 = !DILocation(line: 104, column: 28, scope: !91)
!157 = !DILocation(line: 104, column: 41, scope: !91)
!158 = !DILocation(line: 104, column: 39, scope: !91)
!159 = !DILocation(line: 104, column: 5, scope: !91)
!160 = !DILocation(line: 104, column: 8, scope: !91)
!161 = !DILocation(line: 104, column: 23, scope: !91)
!162 = !DILocation(line: 105, column: 20, scope: !91)
!163 = !DILocation(line: 105, column: 24, scope: !91)
!164 = !DILocation(line: 105, column: 30, scope: !91)
!165 = !DILocation(line: 105, column: 5, scope: !91)
!166 = !DILocation(line: 107, column: 5, scope: !91)
!167 = !DILocation(line: 107, column: 8, scope: !91)
!168 = !DILocation(line: 107, column: 12, scope: !91)
!169 = !DILocation(line: 108, column: 12, scope: !170)
!170 = distinct !DILexicalBlock(scope: !91, file: !31, line: 108, column: 5)
!171 = !DILocation(line: 108, column: 10, scope: !170)
!172 = !DILocation(line: 108, column: 17, scope: !173)
!173 = !DILexicalBlockFile(scope: !174, file: !31, discriminator: 1)
!174 = distinct !DILexicalBlock(scope: !170, file: !31, line: 108, column: 5)
!175 = !DILocation(line: 108, column: 19, scope: !173)
!176 = !DILocation(line: 108, column: 5, scope: !173)
!177 = !DILocation(line: 109, column: 9, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !31, line: 108, column: 29)
!179 = !DILocation(line: 109, column: 12, scope: !178)
!180 = !DILocation(line: 109, column: 16, scope: !178)
!181 = !DILocation(line: 110, column: 13, scope: !182)
!182 = distinct !DILexicalBlock(scope: !178, file: !31, line: 110, column: 13)
!183 = !DILocation(line: 110, column: 16, scope: !182)
!184 = !DILocation(line: 110, column: 29, scope: !182)
