; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vc1.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vc1.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.AVRational = type { i32, i32 }

!991 = distinct !DISubprogram(name: "ff_vc1_init_common", scope: !992, file: !992, line: 1577, type: !993, isLocal: false, isDefinition: true, scopeLine: 1578, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !3002)
!992 = !DIFile(filename: "libavcodec/vc1.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!993 = !DISubroutineType(types: !994)
!994 = !{!976, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "VC1Context", file: !926, line: 403, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VC1Context", file: !926, line: 173, size: 135936, align: 64, elements: !998)
!998 = !{!999, !2653, !2734, !2735, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2883, !2884, !2885, !2886, !2887, !2888, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973, !2974, !2975, !2976, !2977, !2978, !2979, !2980, !2981, !2985, !2986, !2987, !2988, !2989, !2990, !2991, !2992, !2993, !2994, !2995, !2996, !2997, !2998, !2999, !3000, !3001}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !997, file: !926, line: 174, baseType: !1000, size: 86208, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !1001, line: 582, baseType: !1002)
!1001 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1001, line: 81, size: 86208, align: 64, elements: !1003)
!1003 = !{!1004, !1087, !1088, !1089, !1090, !1094, !1095, !1107, !1108, !1109, !1110, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1817, !1818, !1873, !1875, !1876, !1877, !1878, !1879, !1890, !1891, !1892, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1908, !1910, !1912, !1913, !1914, !1915, !1916, !1917, !1922, !1924, !1925, !1926, !1927, !1928, !1929, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1956, !1957, !1958, !1959, !1975, !1982, !1994, !2010, !2032, !2072, !2085, !2112, !2127, !2141, !2154, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2175, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2188, !2190, !2191, !2192, !2193, !2194, !2195, !2198, !2200, !2202, !2203, !2206, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2273, !2274, !2276, !2277, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2299, !2300, !2301, !2304, !2305, !2306, !2307, !2309, !2311, !2312, !2313, !2314, !2315, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2397, !2398, !2399, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2528, !2529, !2530, !2531, !2535, !2536, !2540, !2544, !2548, !2549, !2554, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2569, !2570, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2588, !2589, !2590, !2640, !2641, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1002, file: !1001, line: 82, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1008)
!1008 = !{!1009, !1013, !1017, !1046, !1047, !1048, !1049, !1053, !1059, !1061, !1065}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1007, file: !26, line: 72, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1007, file: !26, line: 78, baseType: !1014, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1010, !978}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1007, file: !26, line: 85, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1042, !1043, !1044, !1045}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !4, line: 247, baseType: !1010, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1020, file: !4, line: 253, baseType: !1010, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1020, file: !4, line: 259, baseType: !976, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1020, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1020, file: !4, line: 271, baseType: !1027, size: 64, align: 64, offset: 192)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !4, line: 265, size: 64, align: 64, elements: !1028)
!1028 = !{!1029, !1032, !1034, !1035}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1027, file: !4, line: 266, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !986, line: 40, baseType: !1031)
!1031 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1027, file: !4, line: 267, baseType: !1033, size: 64, align: 64)
!1033 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1027, file: !4, line: 268, baseType: !1010, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1027, file: !4, line: 270, baseType: !1036, size: 64, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1037, line: 61, baseType: !1038)
!1037 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1037, line: 58, size: 64, align: 32, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1038, file: !1037, line: 59, baseType: !976, size: 32, align: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1038, file: !1037, line: 60, baseType: !976, size: 32, align: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1020, file: !4, line: 272, baseType: !1033, size: 64, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1020, file: !4, line: 273, baseType: !1033, size: 64, align: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !4, line: 275, baseType: !976, size: 32, align: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1020, file: !4, line: 300, baseType: !1010, size: 64, align: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1007, file: !26, line: 93, baseType: !976, size: 32, align: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1007, file: !26, line: 99, baseType: !976, size: 32, align: 32, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1007, file: !26, line: 108, baseType: !976, size: 32, align: 32, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1007, file: !26, line: 113, baseType: !1050, size: 64, align: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!978, !978, !978}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1007, file: !26, line: 123, baseType: !1054, size: 64, align: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1057, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1007, file: !26, line: 130, baseType: !1060, size: 32, align: 32, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1007, file: !26, line: 136, baseType: !1062, size: 64, align: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!1060, !978}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1007, file: !26, line: 142, baseType: !1066, size: 64, align: 64, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!976, !1069, !978, !1010, !976}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1072)
!1072 = !{!1073, !1085, !1086}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1071, file: !4, line: 360, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1077, file: !4, line: 307, baseType: !1010, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1077, file: !4, line: 313, baseType: !1033, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1077, file: !4, line: 313, baseType: !1033, size: 64, align: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1077, file: !4, line: 318, baseType: !1033, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1077, file: !4, line: 318, baseType: !1033, size: 64, align: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1077, file: !4, line: 323, baseType: !976, size: 32, align: 32, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1071, file: !4, line: 364, baseType: !976, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1071, file: !4, line: 368, baseType: !976, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1002, file: !1001, line: 84, baseType: !976, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1002, file: !1001, line: 84, baseType: !976, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1002, file: !1001, line: 85, baseType: !976, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1002, file: !1001, line: 86, baseType: !1091, size: 384, align: 32, offset: 160)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 384, align: 32, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 12)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1002, file: !1001, line: 87, baseType: !976, size: 32, align: 32, offset: 544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1002, file: !1001, line: 90, baseType: !1096, size: 1088, align: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !908, line: 35, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !908, line: 31, size: 1088, align: 64, elements: !1098)
!1098 = !{!1099, !1102, !1106}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1097, file: !908, line: 32, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1097, file: !908, line: 33, baseType: !1103, size: 512, align: 8, offset: 64)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 512, align: 8, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1097, file: !908, line: 34, baseType: !1103, size: 512, align: 8, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1002, file: !1001, line: 91, baseType: !1096, size: 1088, align: 64, offset: 1664)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1002, file: !1001, line: 92, baseType: !1096, size: 1088, align: 64, offset: 2752)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1002, file: !1001, line: 93, baseType: !1096, size: 1088, align: 64, offset: 3840)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1002, file: !1001, line: 98, baseType: !1111, size: 64, align: 64, offset: 4928)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1113)
!1113 = !{!1114, !1117, !1118, !1119, !1384, !1385, !1386, !1387, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1539, !1543, !1544, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1722, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1112, file: !57, line: 1561, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1112, file: !57, line: 1562, baseType: !976, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1112, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1112, file: !57, line: 1565, baseType: !1120, size: 64, align: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1132, !1135, !1138, !1141, !1146, !1147, !1148, !1156, !1157, !1158, !1160, !1166, !1172, !1181, !1185, !1186, !1234, !1355, !1359, !1360, !1364, !1368, !1373, !1377, !1378, !1379}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !57, line: 3475, baseType: !1010, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1122, file: !57, line: 3480, baseType: !1010, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1122, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1122, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1122, file: !57, line: 3487, baseType: !976, size: 32, align: 32, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1122, file: !57, line: 3488, baseType: !1130, size: 64, align: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1122, file: !57, line: 3489, baseType: !1133, size: 64, align: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1122, file: !57, line: 3490, baseType: !1136, size: 64, align: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1122, file: !57, line: 3491, baseType: !1139, size: 64, align: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1122, file: !57, line: 3492, baseType: !1142, size: 64, align: 64, offset: 512)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !986, line: 55, baseType: !1145)
!1145 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1122, file: !57, line: 3493, baseType: !987, size: 8, align: 8, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1122, file: !57, line: 3494, baseType: !1115, size: 64, align: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1122, file: !57, line: 3495, baseType: !1149, size: 64, align: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1152, file: !57, line: 3402, baseType: !976, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !57, line: 3403, baseType: !1010, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1122, file: !57, line: 3507, baseType: !1010, size: 64, align: 64, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1122, file: !57, line: 3516, baseType: !976, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1122, file: !57, line: 3517, baseType: !1159, size: 64, align: 64, offset: 896)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1122, file: !57, line: 3527, baseType: !1161, size: 64, align: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!976, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1112)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1122, file: !57, line: 3535, baseType: !1167, size: 64, align: 64, offset: 1024)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!976, !1164, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1122, file: !57, line: 3541, baseType: !1173, size: 64, align: 64, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1177, line: 223, size: 128, align: 64, elements: !1178)
!1177 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1178 = !{!1179, !1180}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1176, file: !1177, line: 224, baseType: !1100, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1176, file: !1177, line: 225, baseType: !1100, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1122, file: !57, line: 3549, baseType: !1182, size: 64, align: 64, offset: 1152)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{null, !1159}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1122, file: !57, line: 3551, baseType: !1161, size: 64, align: 64, offset: 1216)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1122, file: !57, line: 3552, baseType: !1187, size: 64, align: 64, offset: 1280)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!976, !1164, !1190, !976, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1194)
!1194 = !{!1195, !1198, !1199, !1200, !1201, !1233}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1193, file: !57, line: 3921, baseType: !1196, size: 16, align: 16)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !986, line: 49, baseType: !1197)
!1197 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1193, file: !57, line: 3922, baseType: !985, size: 32, align: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1193, file: !57, line: 3923, baseType: !985, size: 32, align: 32, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1193, file: !57, line: 3924, baseType: !977, size: 32, align: 32, offset: 96)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1193, file: !57, line: 3925, baseType: !1202, size: 64, align: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1222, !1226, !1228, !1229, !1231, !1232}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1205, file: !57, line: 3886, baseType: !976, size: 32, align: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1205, file: !57, line: 3887, baseType: !976, size: 32, align: 32, offset: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1205, file: !57, line: 3888, baseType: !976, size: 32, align: 32, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1205, file: !57, line: 3889, baseType: !976, size: 32, align: 32, offset: 96)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1205, file: !57, line: 3890, baseType: !976, size: 32, align: 32, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1205, file: !57, line: 3897, baseType: !1213, size: 768, align: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1215)
!1215 = !{!1216, !1220}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !57, line: 3855, baseType: !1217, size: 512, align: 64)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1190, size: 512, align: 64, elements: !1218)
!1218 = !{!1219}
!1219 = !DISubrange(count: 8)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1214, file: !57, line: 3857, baseType: !1221, size: 256, align: 32, offset: 512)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 256, align: 32, elements: !1218)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !57, line: 3903, baseType: !1223, size: 256, align: 64, offset: 960)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1190, size: 256, align: 64, elements: !1224)
!1224 = !{!1225}
!1225 = !DISubrange(count: 4)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1205, file: !57, line: 3904, baseType: !1227, size: 128, align: 32, offset: 1216)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 128, align: 32, elements: !1224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1205, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1205, file: !57, line: 3908, baseType: !1230, size: 64, align: 64, offset: 1408)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1205, file: !57, line: 3915, baseType: !1230, size: 64, align: 64, offset: 1472)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1205, file: !57, line: 3917, baseType: !976, size: 32, align: 32, offset: 1536)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1193, file: !57, line: 3926, baseType: !1030, size: 64, align: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1122, file: !57, line: 3564, baseType: !1235, size: 64, align: 64, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!976, !1164, !1238, !1272, !1354}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1241)
!1241 = !{!1242, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1268, !1269, !1270, !1271}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1240, file: !57, line: 1451, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1245, line: 94, baseType: !1246)
!1245 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1245, line: 81, size: 192, align: 64, elements: !1247)
!1247 = !{!1248, !1252, !1253}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1246, file: !1245, line: 82, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1245, line: 73, baseType: !1251)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1245, line: 73, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1246, file: !1245, line: 89, baseType: !1190, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1246, file: !1245, line: 93, baseType: !976, size: 32, align: 32, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1240, file: !57, line: 1461, baseType: !1030, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1240, file: !57, line: 1467, baseType: !1030, size: 64, align: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !57, line: 1468, baseType: !1190, size: 64, align: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !57, line: 1469, baseType: !976, size: 32, align: 32, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1240, file: !57, line: 1470, baseType: !976, size: 32, align: 32, offset: 288)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1240, file: !57, line: 1474, baseType: !976, size: 32, align: 32, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1240, file: !57, line: 1479, baseType: !1261, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1264)
!1264 = !{!1265, !1266, !1267}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1263, file: !57, line: 1412, baseType: !1190, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1263, file: !57, line: 1413, baseType: !976, size: 32, align: 32, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1263, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1240, file: !57, line: 1480, baseType: !976, size: 32, align: 32, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1240, file: !57, line: 1486, baseType: !1030, size: 64, align: 64, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1240, file: !57, line: 1488, baseType: !1030, size: 64, align: 64, offset: 576)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1240, file: !57, line: 1497, baseType: !1030, size: 64, align: 64, offset: 640)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1306, !1308, !1309, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1342, !1343, !1344, !1345, !1346, !1347, !1350, !1351, !1352, !1353}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1275, file: !780, line: 282, baseType: !1217, size: 512, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1275, file: !780, line: 299, baseType: !1221, size: 256, align: 32, offset: 512)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1275, file: !780, line: 315, baseType: !1280, size: 64, align: 64, offset: 768)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1275, file: !780, line: 326, baseType: !976, size: 32, align: 32, offset: 832)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1275, file: !780, line: 326, baseType: !976, size: 32, align: 32, offset: 864)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1275, file: !780, line: 334, baseType: !976, size: 32, align: 32, offset: 896)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1275, file: !780, line: 341, baseType: !976, size: 32, align: 32, offset: 928)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1275, file: !780, line: 346, baseType: !976, size: 32, align: 32, offset: 960)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1275, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1275, file: !780, line: 356, baseType: !1036, size: 64, align: 32, offset: 1024)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1275, file: !780, line: 361, baseType: !1030, size: 64, align: 64, offset: 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1275, file: !780, line: 369, baseType: !1030, size: 64, align: 64, offset: 1152)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1275, file: !780, line: 377, baseType: !1030, size: 64, align: 64, offset: 1216)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1275, file: !780, line: 382, baseType: !976, size: 32, align: 32, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1275, file: !780, line: 386, baseType: !976, size: 32, align: 32, offset: 1312)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1275, file: !780, line: 391, baseType: !976, size: 32, align: 32, offset: 1344)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1275, file: !780, line: 396, baseType: !978, size: 64, align: 64, offset: 1408)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1275, file: !780, line: 403, baseType: !1296, size: 512, align: 64, offset: 1472)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 512, align: 64, elements: !1218)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1275, file: !780, line: 410, baseType: !976, size: 32, align: 32, offset: 1984)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1275, file: !780, line: 415, baseType: !976, size: 32, align: 32, offset: 2016)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1275, file: !780, line: 420, baseType: !976, size: 32, align: 32, offset: 2048)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1275, file: !780, line: 425, baseType: !976, size: 32, align: 32, offset: 2080)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1275, file: !780, line: 435, baseType: !1030, size: 64, align: 64, offset: 2112)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1275, file: !780, line: 440, baseType: !976, size: 32, align: 32, offset: 2176)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1275, file: !780, line: 445, baseType: !1144, size: 64, align: 64, offset: 2240)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1275, file: !780, line: 459, baseType: !1305, size: 512, align: 64, offset: 2304)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1243, size: 512, align: 64, elements: !1218)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1275, file: !780, line: 473, baseType: !1307, size: 64, align: 64, offset: 2816)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1275, file: !780, line: 477, baseType: !976, size: 32, align: 32, offset: 2880)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1275, file: !780, line: 479, baseType: !1310, size: 64, align: 64, offset: 2944)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1323}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1313, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1313, file: !780, line: 203, baseType: !1190, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1313, file: !780, line: 204, baseType: !976, size: 32, align: 32, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1313, file: !780, line: 205, baseType: !1319, size: 64, align: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1321, line: 86, baseType: !1322)
!1321 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1322 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1321, line: 86, flags: DIFlagFwdDecl)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1313, file: !780, line: 206, baseType: !1243, size: 64, align: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1275, file: !780, line: 480, baseType: !976, size: 32, align: 32, offset: 3008)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1275, file: !780, line: 505, baseType: !976, size: 32, align: 32, offset: 3040)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1275, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1275, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1275, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1275, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1275, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1275, file: !780, line: 532, baseType: !1030, size: 64, align: 64, offset: 3264)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1275, file: !780, line: 539, baseType: !1030, size: 64, align: 64, offset: 3328)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1275, file: !780, line: 547, baseType: !1030, size: 64, align: 64, offset: 3392)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1275, file: !780, line: 554, baseType: !1319, size: 64, align: 64, offset: 3456)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1275, file: !780, line: 563, baseType: !976, size: 32, align: 32, offset: 3520)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1275, file: !780, line: 572, baseType: !976, size: 32, align: 32, offset: 3552)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1275, file: !780, line: 581, baseType: !976, size: 32, align: 32, offset: 3584)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1275, file: !780, line: 588, baseType: !1339, size: 64, align: 64, offset: 3648)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !986, line: 36, baseType: !1341)
!1341 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1275, file: !780, line: 593, baseType: !976, size: 32, align: 32, offset: 3712)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1275, file: !780, line: 596, baseType: !976, size: 32, align: 32, offset: 3744)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1275, file: !780, line: 599, baseType: !1243, size: 64, align: 64, offset: 3776)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1275, file: !780, line: 605, baseType: !1243, size: 64, align: 64, offset: 3840)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1275, file: !780, line: 616, baseType: !1243, size: 64, align: 64, offset: 3904)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1275, file: !780, line: 626, baseType: !1348, size: 64, align: 64, offset: 3968)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1349, line: 216, baseType: !1145)
!1349 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1275, file: !780, line: 627, baseType: !1348, size: 64, align: 64, offset: 4032)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1275, file: !780, line: 628, baseType: !1348, size: 64, align: 64, offset: 4096)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1275, file: !780, line: 629, baseType: !1348, size: 64, align: 64, offset: 4160)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1275, file: !780, line: 645, baseType: !1243, size: 64, align: 64, offset: 4224)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1122, file: !57, line: 3566, baseType: !1356, size: 64, align: 64, offset: 1408)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!976, !1164, !978, !1354, !1238}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1122, file: !57, line: 3567, baseType: !1161, size: 64, align: 64, offset: 1472)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1122, file: !57, line: 3576, baseType: !1361, size: 64, align: 64, offset: 1536)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!976, !1164, !1272}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1122, file: !57, line: 3577, baseType: !1365, size: 64, align: 64, offset: 1600)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!976, !1164, !1238}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1122, file: !57, line: 3584, baseType: !1369, size: 64, align: 64, offset: 1664)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!976, !1164, !1372}
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1122, file: !57, line: 3589, baseType: !1374, size: 64, align: 64, offset: 1728)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{null, !1164}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1122, file: !57, line: 3594, baseType: !976, size: 32, align: 32, offset: 1792)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1122, file: !57, line: 3600, baseType: !1010, size: 64, align: 64, offset: 1856)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1122, file: !57, line: 3609, baseType: !1380, size: 64, align: 64, offset: 1920)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1383)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1112, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1112, file: !57, line: 1581, baseType: !977, size: 32, align: 32, offset: 224)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1112, file: !57, line: 1583, baseType: !978, size: 64, align: 64, offset: 256)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1112, file: !57, line: 1591, baseType: !1388, size: 64, align: 64, offset: 320)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1177, line: 129, size: 1664, align: 64, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1394, !1395, !1413, !1414, !1420, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1389, file: !1177, line: 136, baseType: !976, size: 32, align: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1389, file: !1177, line: 151, baseType: !976, size: 32, align: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1389, file: !1177, line: 157, baseType: !976, size: 32, align: 32, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1389, file: !1177, line: 159, baseType: !1372, size: 64, align: 64, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1389, file: !1177, line: 161, baseType: !1396, size: 64, align: 64, offset: 192)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1177, line: 117, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1177, line: 100, size: 832, align: 64, elements: !1399)
!1399 = !{!1400, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1398, file: !1177, line: 105, baseType: !1401, size: 256, align: 64)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1402, size: 256, align: 64, elements: !1224)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1245, line: 238, baseType: !1404)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1245, line: 238, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1398, file: !1177, line: 110, baseType: !976, size: 32, align: 32, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1398, file: !1177, line: 111, baseType: !976, size: 32, align: 32, offset: 288)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1398, file: !1177, line: 111, baseType: !976, size: 32, align: 32, offset: 320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1398, file: !1177, line: 112, baseType: !1221, size: 256, align: 32, offset: 352)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1398, file: !1177, line: 113, baseType: !1227, size: 128, align: 32, offset: 608)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1398, file: !1177, line: 114, baseType: !976, size: 32, align: 32, offset: 736)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1398, file: !1177, line: 115, baseType: !976, size: 32, align: 32, offset: 768)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1398, file: !1177, line: 116, baseType: !976, size: 32, align: 32, offset: 800)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1389, file: !1177, line: 163, baseType: !978, size: 64, align: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1389, file: !1177, line: 165, baseType: !1415, size: 128, align: 64, offset: 320)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1177, line: 122, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1177, line: 119, size: 128, align: 64, elements: !1417)
!1417 = !{!1418, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1416, file: !1177, line: 120, baseType: !1238, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1416, file: !1177, line: 121, baseType: !1372, size: 64, align: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1389, file: !1177, line: 166, baseType: !1421, size: 128, align: 64, offset: 448)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1177, line: 127, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1177, line: 124, size: 128, align: 64, elements: !1423)
!1423 = !{!1424, !1497}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1422, file: !1177, line: 125, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1429)
!1429 = !{!1430, !1431, !1455, !1459, !1460, !1494, !1495, !1496}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1428, file: !57, line: 5751, baseType: !1115, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1428, file: !57, line: 5756, baseType: !1432, size: 64, align: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1435)
!1435 = !{!1436, !1437, !1440, !1441, !1442, !1446, !1450, !1454}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1434, file: !57, line: 5797, baseType: !1010, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1434, file: !57, line: 5804, baseType: !1438, size: 64, align: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1434, file: !57, line: 5815, baseType: !1115, size: 64, align: 64, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1434, file: !57, line: 5825, baseType: !976, size: 32, align: 32, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1434, file: !57, line: 5826, baseType: !1443, size: 64, align: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!976, !1426}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1434, file: !57, line: 5827, baseType: !1447, size: 64, align: 64, offset: 320)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!976, !1426, !1238}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1434, file: !57, line: 5828, baseType: !1451, size: 64, align: 64, offset: 384)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{null, !1426}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1434, file: !57, line: 5829, baseType: !1451, size: 64, align: 64, offset: 448)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1428, file: !57, line: 5762, baseType: !1456, size: 64, align: 64, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1458)
!1458 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1428, file: !57, line: 5768, baseType: !978, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1428, file: !57, line: 5775, baseType: !1461, size: 64, align: 64, offset: 256)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1463, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1463, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1463, file: !57, line: 3948, baseType: !985, size: 32, align: 32, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1463, file: !57, line: 3958, baseType: !1190, size: 64, align: 64, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1463, file: !57, line: 3962, baseType: !976, size: 32, align: 32, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1463, file: !57, line: 3968, baseType: !976, size: 32, align: 32, offset: 224)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1463, file: !57, line: 3973, baseType: !1030, size: 64, align: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1463, file: !57, line: 3986, baseType: !976, size: 32, align: 32, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1463, file: !57, line: 3999, baseType: !976, size: 32, align: 32, offset: 352)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1463, file: !57, line: 4004, baseType: !976, size: 32, align: 32, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1463, file: !57, line: 4005, baseType: !976, size: 32, align: 32, offset: 416)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1463, file: !57, line: 4010, baseType: !976, size: 32, align: 32, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1463, file: !57, line: 4011, baseType: !976, size: 32, align: 32, offset: 480)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1463, file: !57, line: 4020, baseType: !1036, size: 64, align: 32, offset: 512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1463, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1463, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1463, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1463, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1463, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1463, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1463, file: !57, line: 4039, baseType: !976, size: 32, align: 32, offset: 768)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1463, file: !57, line: 4046, baseType: !1144, size: 64, align: 64, offset: 832)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1463, file: !57, line: 4050, baseType: !976, size: 32, align: 32, offset: 896)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1463, file: !57, line: 4054, baseType: !976, size: 32, align: 32, offset: 928)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1463, file: !57, line: 4061, baseType: !976, size: 32, align: 32, offset: 960)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1463, file: !57, line: 4065, baseType: !976, size: 32, align: 32, offset: 992)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1463, file: !57, line: 4073, baseType: !976, size: 32, align: 32, offset: 1024)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1463, file: !57, line: 4080, baseType: !976, size: 32, align: 32, offset: 1056)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1463, file: !57, line: 4084, baseType: !976, size: 32, align: 32, offset: 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1428, file: !57, line: 5781, baseType: !1461, size: 64, align: 64, offset: 320)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1428, file: !57, line: 5787, baseType: !1036, size: 64, align: 32, offset: 384)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1428, file: !57, line: 5793, baseType: !1036, size: 64, align: 32, offset: 448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1422, file: !1177, line: 126, baseType: !976, size: 32, align: 32, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1389, file: !1177, line: 172, baseType: !1238, size: 64, align: 64, offset: 576)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1389, file: !1177, line: 177, baseType: !1190, size: 64, align: 64, offset: 640)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1389, file: !1177, line: 178, baseType: !977, size: 32, align: 32, offset: 704)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1389, file: !1177, line: 180, baseType: !978, size: 64, align: 64, offset: 768)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1389, file: !1177, line: 185, baseType: !976, size: 32, align: 32, offset: 832)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1389, file: !1177, line: 190, baseType: !978, size: 64, align: 64, offset: 896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1389, file: !1177, line: 195, baseType: !976, size: 32, align: 32, offset: 960)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1389, file: !1177, line: 200, baseType: !1238, size: 64, align: 64, offset: 1024)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1389, file: !1177, line: 201, baseType: !976, size: 32, align: 32, offset: 1088)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1389, file: !1177, line: 202, baseType: !1372, size: 64, align: 64, offset: 1152)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1389, file: !1177, line: 203, baseType: !976, size: 32, align: 32, offset: 1216)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1389, file: !1177, line: 205, baseType: !976, size: 32, align: 32, offset: 1248)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1389, file: !1177, line: 206, baseType: !976, size: 32, align: 32, offset: 1280)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1389, file: !1177, line: 209, baseType: !1348, size: 64, align: 64, offset: 1344)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1389, file: !1177, line: 212, baseType: !1348, size: 64, align: 64, offset: 1408)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1389, file: !1177, line: 213, baseType: !1372, size: 64, align: 64, offset: 1472)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1389, file: !1177, line: 215, baseType: !976, size: 32, align: 32, offset: 1536)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1389, file: !1177, line: 217, baseType: !976, size: 32, align: 32, offset: 1568)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1389, file: !1177, line: 220, baseType: !976, size: 32, align: 32, offset: 1600)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1112, file: !57, line: 1598, baseType: !978, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1112, file: !57, line: 1606, baseType: !1030, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1112, file: !57, line: 1614, baseType: !976, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1112, file: !57, line: 1622, baseType: !976, size: 32, align: 32, offset: 544)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1112, file: !57, line: 1628, baseType: !976, size: 32, align: 32, offset: 576)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !57, line: 1636, baseType: !976, size: 32, align: 32, offset: 608)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1112, file: !57, line: 1643, baseType: !976, size: 32, align: 32, offset: 640)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1112, file: !57, line: 1657, baseType: !1190, size: 64, align: 64, offset: 704)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1112, file: !57, line: 1658, baseType: !976, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1112, file: !57, line: 1679, baseType: !1036, size: 64, align: 32, offset: 800)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1112, file: !57, line: 1688, baseType: !976, size: 32, align: 32, offset: 864)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1112, file: !57, line: 1712, baseType: !976, size: 32, align: 32, offset: 896)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1112, file: !57, line: 1729, baseType: !976, size: 32, align: 32, offset: 928)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1112, file: !57, line: 1729, baseType: !976, size: 32, align: 32, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1112, file: !57, line: 1744, baseType: !976, size: 32, align: 32, offset: 992)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1112, file: !57, line: 1744, baseType: !976, size: 32, align: 32, offset: 1024)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1112, file: !57, line: 1751, baseType: !976, size: 32, align: 32, offset: 1056)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1112, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1112, file: !57, line: 1791, baseType: !1536, size: 64, align: 64, offset: 1152)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{null, !1111, !1272, !1354, !976, !976, !976}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1112, file: !57, line: 1808, baseType: !1540, size: 64, align: 64, offset: 1216)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!516, !1111, !1133}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1112, file: !57, line: 1816, baseType: !976, size: 32, align: 32, offset: 1280)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1112, file: !57, line: 1825, baseType: !1545, size: 32, align: 32, offset: 1312)
!1545 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1112, file: !57, line: 1830, baseType: !976, size: 32, align: 32, offset: 1344)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1112, file: !57, line: 1838, baseType: !1545, size: 32, align: 32, offset: 1376)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1112, file: !57, line: 1846, baseType: !976, size: 32, align: 32, offset: 1408)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1112, file: !57, line: 1851, baseType: !976, size: 32, align: 32, offset: 1440)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1112, file: !57, line: 1861, baseType: !1545, size: 32, align: 32, offset: 1472)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1112, file: !57, line: 1868, baseType: !1545, size: 32, align: 32, offset: 1504)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1112, file: !57, line: 1875, baseType: !1545, size: 32, align: 32, offset: 1536)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1112, file: !57, line: 1882, baseType: !1545, size: 32, align: 32, offset: 1568)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1112, file: !57, line: 1889, baseType: !1545, size: 32, align: 32, offset: 1600)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1112, file: !57, line: 1896, baseType: !1545, size: 32, align: 32, offset: 1632)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1112, file: !57, line: 1903, baseType: !1545, size: 32, align: 32, offset: 1664)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1112, file: !57, line: 1910, baseType: !976, size: 32, align: 32, offset: 1696)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1112, file: !57, line: 1915, baseType: !976, size: 32, align: 32, offset: 1728)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1112, file: !57, line: 1926, baseType: !1354, size: 64, align: 64, offset: 1792)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1112, file: !57, line: 1935, baseType: !1036, size: 64, align: 32, offset: 1856)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1112, file: !57, line: 1942, baseType: !976, size: 32, align: 32, offset: 1920)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1112, file: !57, line: 1948, baseType: !976, size: 32, align: 32, offset: 1952)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1112, file: !57, line: 1954, baseType: !976, size: 32, align: 32, offset: 1984)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1112, file: !57, line: 1960, baseType: !976, size: 32, align: 32, offset: 2016)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1112, file: !57, line: 1984, baseType: !976, size: 32, align: 32, offset: 2048)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1112, file: !57, line: 1991, baseType: !976, size: 32, align: 32, offset: 2080)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1112, file: !57, line: 1996, baseType: !976, size: 32, align: 32, offset: 2112)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1112, file: !57, line: 2004, baseType: !976, size: 32, align: 32, offset: 2144)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1112, file: !57, line: 2011, baseType: !976, size: 32, align: 32, offset: 2176)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1112, file: !57, line: 2018, baseType: !976, size: 32, align: 32, offset: 2208)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1112, file: !57, line: 2027, baseType: !976, size: 32, align: 32, offset: 2240)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1112, file: !57, line: 2034, baseType: !976, size: 32, align: 32, offset: 2272)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1112, file: !57, line: 2044, baseType: !976, size: 32, align: 32, offset: 2304)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1112, file: !57, line: 2054, baseType: !1575, size: 64, align: 64, offset: 2368)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1112, file: !57, line: 2061, baseType: !1575, size: 64, align: 64, offset: 2432)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1112, file: !57, line: 2066, baseType: !976, size: 32, align: 32, offset: 2496)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1112, file: !57, line: 2070, baseType: !976, size: 32, align: 32, offset: 2528)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1112, file: !57, line: 2078, baseType: !976, size: 32, align: 32, offset: 2560)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1112, file: !57, line: 2085, baseType: !976, size: 32, align: 32, offset: 2592)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1112, file: !57, line: 2092, baseType: !976, size: 32, align: 32, offset: 2624)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1112, file: !57, line: 2099, baseType: !976, size: 32, align: 32, offset: 2656)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1112, file: !57, line: 2106, baseType: !976, size: 32, align: 32, offset: 2688)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1112, file: !57, line: 2113, baseType: !976, size: 32, align: 32, offset: 2720)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1112, file: !57, line: 2120, baseType: !976, size: 32, align: 32, offset: 2752)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1112, file: !57, line: 2125, baseType: !976, size: 32, align: 32, offset: 2784)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1112, file: !57, line: 2133, baseType: !976, size: 32, align: 32, offset: 2816)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1112, file: !57, line: 2140, baseType: !976, size: 32, align: 32, offset: 2848)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1112, file: !57, line: 2145, baseType: !976, size: 32, align: 32, offset: 2880)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1112, file: !57, line: 2153, baseType: !976, size: 32, align: 32, offset: 2912)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1112, file: !57, line: 2158, baseType: !976, size: 32, align: 32, offset: 2944)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1112, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1112, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1112, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1112, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1112, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1112, file: !57, line: 2203, baseType: !976, size: 32, align: 32, offset: 3136)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1112, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1112, file: !57, line: 2212, baseType: !976, size: 32, align: 32, offset: 3200)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1112, file: !57, line: 2213, baseType: !976, size: 32, align: 32, offset: 3232)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1112, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1112, file: !57, line: 2232, baseType: !976, size: 32, align: 32, offset: 3296)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1112, file: !57, line: 2243, baseType: !976, size: 32, align: 32, offset: 3328)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1112, file: !57, line: 2249, baseType: !976, size: 32, align: 32, offset: 3360)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1112, file: !57, line: 2256, baseType: !976, size: 32, align: 32, offset: 3392)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1112, file: !57, line: 2263, baseType: !1144, size: 64, align: 64, offset: 3456)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1112, file: !57, line: 2270, baseType: !1144, size: 64, align: 64, offset: 3520)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1112, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1112, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1112, file: !57, line: 2367, baseType: !1611, size: 64, align: 64, offset: 3648)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!976, !1111, !1372, !976}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1112, file: !57, line: 2383, baseType: !976, size: 32, align: 32, offset: 3712)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1112, file: !57, line: 2386, baseType: !1545, size: 32, align: 32, offset: 3744)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1112, file: !57, line: 2387, baseType: !1545, size: 32, align: 32, offset: 3776)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1112, file: !57, line: 2394, baseType: !976, size: 32, align: 32, offset: 3808)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1112, file: !57, line: 2401, baseType: !976, size: 32, align: 32, offset: 3840)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1112, file: !57, line: 2408, baseType: !976, size: 32, align: 32, offset: 3872)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1112, file: !57, line: 2415, baseType: !976, size: 32, align: 32, offset: 3904)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1112, file: !57, line: 2422, baseType: !976, size: 32, align: 32, offset: 3936)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1112, file: !57, line: 2423, baseType: !1623, size: 64, align: 64, offset: 3968)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1625, file: !57, line: 827, baseType: !976, size: 32, align: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1625, file: !57, line: 828, baseType: !976, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1625, file: !57, line: 829, baseType: !976, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1625, file: !57, line: 830, baseType: !1545, size: 32, align: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1112, file: !57, line: 2430, baseType: !1030, size: 64, align: 64, offset: 4032)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1112, file: !57, line: 2437, baseType: !1030, size: 64, align: 64, offset: 4096)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1112, file: !57, line: 2444, baseType: !1545, size: 32, align: 32, offset: 4160)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1112, file: !57, line: 2451, baseType: !1545, size: 32, align: 32, offset: 4192)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1112, file: !57, line: 2458, baseType: !976, size: 32, align: 32, offset: 4224)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1112, file: !57, line: 2469, baseType: !976, size: 32, align: 32, offset: 4256)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1112, file: !57, line: 2475, baseType: !976, size: 32, align: 32, offset: 4288)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1112, file: !57, line: 2481, baseType: !976, size: 32, align: 32, offset: 4320)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1112, file: !57, line: 2485, baseType: !976, size: 32, align: 32, offset: 4352)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1112, file: !57, line: 2489, baseType: !976, size: 32, align: 32, offset: 4384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1112, file: !57, line: 2493, baseType: !976, size: 32, align: 32, offset: 4416)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1112, file: !57, line: 2501, baseType: !976, size: 32, align: 32, offset: 4448)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1112, file: !57, line: 2506, baseType: !976, size: 32, align: 32, offset: 4480)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1112, file: !57, line: 2510, baseType: !976, size: 32, align: 32, offset: 4512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1112, file: !57, line: 2514, baseType: !1030, size: 64, align: 64, offset: 4544)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1112, file: !57, line: 2528, baseType: !1647, size: 64, align: 64, offset: 4608)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1111, !978, !976, !976}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1112, file: !57, line: 2534, baseType: !976, size: 32, align: 32, offset: 4672)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1112, file: !57, line: 2545, baseType: !976, size: 32, align: 32, offset: 4704)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1112, file: !57, line: 2547, baseType: !976, size: 32, align: 32, offset: 4736)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1112, file: !57, line: 2549, baseType: !976, size: 32, align: 32, offset: 4768)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1112, file: !57, line: 2551, baseType: !976, size: 32, align: 32, offset: 4800)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1112, file: !57, line: 2553, baseType: !976, size: 32, align: 32, offset: 4832)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1112, file: !57, line: 2555, baseType: !976, size: 32, align: 32, offset: 4864)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1112, file: !57, line: 2557, baseType: !976, size: 32, align: 32, offset: 4896)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1112, file: !57, line: 2559, baseType: !976, size: 32, align: 32, offset: 4928)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1112, file: !57, line: 2563, baseType: !976, size: 32, align: 32, offset: 4960)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1112, file: !57, line: 2571, baseType: !1230, size: 64, align: 64, offset: 4992)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1112, file: !57, line: 2579, baseType: !1230, size: 64, align: 64, offset: 5056)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1112, file: !57, line: 2586, baseType: !976, size: 32, align: 32, offset: 5120)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1112, file: !57, line: 2615, baseType: !976, size: 32, align: 32, offset: 5152)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1112, file: !57, line: 2627, baseType: !976, size: 32, align: 32, offset: 5184)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1112, file: !57, line: 2637, baseType: !976, size: 32, align: 32, offset: 5216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1112, file: !57, line: 2681, baseType: !976, size: 32, align: 32, offset: 5248)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1112, file: !57, line: 2709, baseType: !1030, size: 64, align: 64, offset: 5312)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1112, file: !57, line: 2716, baseType: !1669, size: 64, align: 64, offset: 5376)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1679, !1683, !1687, !1688, !1689, !1690, !1695, !1696, !1697, !1698, !1699}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1671, file: !57, line: 3642, baseType: !1010, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1671, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1671, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1671, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1671, file: !57, line: 3669, baseType: !976, size: 32, align: 32, offset: 160)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1671, file: !57, line: 3682, baseType: !1369, size: 64, align: 64, offset: 192)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1671, file: !57, line: 3698, baseType: !1680, size: 64, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!976, !1164, !1100, !985}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1671, file: !57, line: 3712, baseType: !1684, size: 64, align: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!976, !1164, !976, !1100, !985}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1671, file: !57, line: 3726, baseType: !1680, size: 64, align: 64, offset: 384)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1671, file: !57, line: 3737, baseType: !1161, size: 64, align: 64, offset: 448)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1671, file: !57, line: 3746, baseType: !976, size: 32, align: 32, offset: 512)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1671, file: !57, line: 3757, baseType: !1691, size: 64, align: 64, offset: 576)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{null, !1694}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1671, file: !57, line: 3766, baseType: !1161, size: 64, align: 64, offset: 640)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1671, file: !57, line: 3774, baseType: !1161, size: 64, align: 64, offset: 704)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1671, file: !57, line: 3780, baseType: !976, size: 32, align: 32, offset: 768)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1671, file: !57, line: 3785, baseType: !976, size: 32, align: 32, offset: 800)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1671, file: !57, line: 3795, baseType: !1700, size: 64, align: 64, offset: 832)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!976, !1164, !1243}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1112, file: !57, line: 2728, baseType: !978, size: 64, align: 64, offset: 5440)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1112, file: !57, line: 2735, baseType: !1296, size: 512, align: 64, offset: 5504)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1112, file: !57, line: 2742, baseType: !976, size: 32, align: 32, offset: 6016)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1112, file: !57, line: 2755, baseType: !976, size: 32, align: 32, offset: 6048)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1112, file: !57, line: 2776, baseType: !976, size: 32, align: 32, offset: 6080)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1112, file: !57, line: 2783, baseType: !976, size: 32, align: 32, offset: 6112)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1112, file: !57, line: 2791, baseType: !976, size: 32, align: 32, offset: 6144)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1112, file: !57, line: 2802, baseType: !1372, size: 64, align: 64, offset: 6208)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1112, file: !57, line: 2811, baseType: !976, size: 32, align: 32, offset: 6272)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1112, file: !57, line: 2821, baseType: !976, size: 32, align: 32, offset: 6304)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1112, file: !57, line: 2830, baseType: !976, size: 32, align: 32, offset: 6336)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1112, file: !57, line: 2840, baseType: !976, size: 32, align: 32, offset: 6368)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1112, file: !57, line: 2851, baseType: !1716, size: 64, align: 64, offset: 6400)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!976, !1111, !1719, !978, !1354, !976, !976}
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DISubroutineType(types: !1721)
!1721 = !{!976, !1111, !978}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1112, file: !57, line: 2871, baseType: !1723, size: 64, align: 64, offset: 6464)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{!976, !1111, !1726, !978, !1354, !976}
!1726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1727, size: 64, align: 64)
!1727 = !DISubroutineType(types: !1728)
!1728 = !{!976, !1111, !978, !976, !976}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1112, file: !57, line: 2878, baseType: !976, size: 32, align: 32, offset: 6528)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1112, file: !57, line: 2885, baseType: !976, size: 32, align: 32, offset: 6560)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1112, file: !57, line: 3005, baseType: !976, size: 32, align: 32, offset: 6592)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1112, file: !57, line: 3013, baseType: !916, size: 32, align: 32, offset: 6624)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1112, file: !57, line: 3020, baseType: !916, size: 32, align: 32, offset: 6656)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1112, file: !57, line: 3027, baseType: !916, size: 32, align: 32, offset: 6688)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1112, file: !57, line: 3037, baseType: !1190, size: 64, align: 64, offset: 6720)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1112, file: !57, line: 3038, baseType: !976, size: 32, align: 32, offset: 6784)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1112, file: !57, line: 3050, baseType: !1144, size: 64, align: 64, offset: 6848)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1112, file: !57, line: 3065, baseType: !976, size: 32, align: 32, offset: 6912)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1112, file: !57, line: 3083, baseType: !976, size: 32, align: 32, offset: 6944)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1112, file: !57, line: 3092, baseType: !1036, size: 64, align: 32, offset: 6976)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1112, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1112, file: !57, line: 3106, baseType: !1036, size: 64, align: 32, offset: 7072)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1112, file: !57, line: 3113, baseType: !1744, size: 64, align: 64, offset: 7168)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1746)
!1746 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1747)
!1747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1748)
!1748 = !{!1749, !1750, !1751, !1752, !1753, !1754, !1757}
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1747, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1747, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1747, file: !57, line: 720, baseType: !1010, size: 64, align: 64, offset: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1747, file: !57, line: 724, baseType: !1010, size: 64, align: 64, offset: 128)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1747, file: !57, line: 728, baseType: !976, size: 32, align: 32, offset: 192)
