; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_cavlc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_cavlc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.PMbInfo = type { i16, i8 }
%struct.IMbInfo = type { i16, i8, i8 }

!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v", scope: !970, file: !954, line: 85, size: 128, align: 64, elements: !973)
!970 = distinct !DISubprogram(name: "AV_ZERO128", scope: !954, file: !954, line: 83, type: !971, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !919}
!973 = !{!974}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !969, file: !954, line: 85, baseType: !963, size: 128, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias64", file: !928, line: 34, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !928, line: 27, size: 64, align: 64, elements: !982)
!982 = !{!983, !984, !986, !988, !992, !994}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !981, file: !928, line: 28, baseType: !964, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !981, file: !928, line: 29, baseType: !985, size: 64, align: 32)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 64, align: 32, elements: !943)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !981, file: !928, line: 30, baseType: !987, size: 64, align: 16)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 64, align: 16, elements: !947)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !981, file: !928, line: 31, baseType: !989, size: 64, align: 8)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 64, align: 8, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 8)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "f64", scope: !981, file: !928, line: 32, baseType: !993, size: 64, align: 64)
!993 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !981, file: !928, line: 33, baseType: !995, size: 64, align: 32)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 64, align: 32, elements: !943)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !924, line: 38, baseType: !920)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !924, line: 37, baseType: !1000)
!1000 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1001 = !{!1002, !1007, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1027, !1031, !1032, !1036, !1037, !1041, !1045, !1050, !1051, !1055, !1057, !1062, !1065, !1069, !1070, !1074, !1079, !1080, !1084, !1085, !1087, !1091, !1092, !1095, !1096, !1099, !1100, !1103, !1104, !1107, !1108, !1113, !2736, !2742, !2746, !2748, !2749, !2759}
!1002 = distinct !DIGlobalVariable(name: "done", scope: !1003, file: !1004, line: 328, type: !920, isLocal: true, isDefinition: true, variable: i32* @ff_h264_decode_init_vlc.done)
!1003 = distinct !DISubprogram(name: "ff_h264_decode_init_vlc", scope: !1004, file: !1004, line: 327, type: !1005, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1004 = !DIFile(filename: "libavcodec/h264_cavlc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null}
!1007 = distinct !DIGlobalVariable(name: "chroma_dc_coeff_token_vlc_table_size", scope: !0, file: !1004, line: 245, type: !1008, isLocal: true, isDefinition: true, variable: i32 256)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1009 = distinct !DIGlobalVariable(name: "chroma422_dc_coeff_token_vlc_table_size", scope: !0, file: !1004, line: 249, type: !1008, isLocal: true, isDefinition: true, variable: i32 8192)
!1010 = distinct !DIGlobalVariable(name: "chroma_dc_total_zeros_vlc_tables_size", scope: !0, file: !1004, line: 257, type: !1008, isLocal: true, isDefinition: true, variable: i32 8)
!1011 = distinct !DIGlobalVariable(name: "chroma422_dc_total_zeros_vlc_tables_size", scope: !0, file: !1004, line: 261, type: !1008, isLocal: true, isDefinition: true, variable: i32 32)
!1012 = distinct !DIGlobalVariable(name: "total_zeros_vlc_tables_size", scope: !0, file: !1004, line: 253, type: !1008, isLocal: true, isDefinition: true, variable: i32 512)
!1013 = distinct !DIGlobalVariable(name: "run_vlc_tables_size", scope: !0, file: !1004, line: 265, type: !1008, isLocal: true, isDefinition: true, variable: i32 8)
!1014 = distinct !DIGlobalVariable(name: "run7_vlc_table_size", scope: !0, file: !1004, line: 269, type: !1008, isLocal: true, isDefinition: true, variable: i32 96)
!1015 = distinct !DIGlobalVariable(name: "coeff_token_vlc", scope: !0, file: !1004, line: 239, type: !1016, isLocal: true, isDefinition: true, variable: [4 x %struct.VLC]* @coeff_token_vlc)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 768, align: 64, elements: !947)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !1018, line: 30, baseType: !1019)
!1018 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !1018, line: 26, size: 192, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1025, !1026}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1019, file: !1018, line: 27, baseType: !920, size: 32, align: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1019, file: !1018, line: 28, baseType: !1023, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 32, align: 16, elements: !943)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1019, file: !1018, line: 29, baseType: !920, size: 32, align: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !1019, file: !1018, line: 29, baseType: !920, size: 32, align: 32, offset: 160)
!1027 = distinct !DIGlobalVariable(name: "coeff_token_vlc_tables", scope: !0, file: !1004, line: 240, type: !1028, isLocal: true, isDefinition: true, variable: [1388 x [2 x i16]]* @coeff_token_vlc_tables)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 44416, align: 16, elements: !1029)
!1029 = !{!1030, !944}
!1030 = !DISubrange(count: 1388)
!1031 = distinct !DIGlobalVariable(name: "chroma_dc_coeff_token_vlc", scope: !0, file: !1004, line: 243, type: !1017, isLocal: true, isDefinition: true, variable: %struct.VLC* @chroma_dc_coeff_token_vlc)
!1032 = distinct !DIGlobalVariable(name: "chroma_dc_coeff_token_vlc_table", scope: !0, file: !1004, line: 244, type: !1033, isLocal: true, isDefinition: true, variable: [256 x [2 x i16]]* @chroma_dc_coeff_token_vlc_table)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 8192, align: 16, elements: !1034)
!1034 = !{!1035, !944}
!1035 = !DISubrange(count: 256)
!1036 = distinct !DIGlobalVariable(name: "chroma422_dc_coeff_token_vlc", scope: !0, file: !1004, line: 247, type: !1017, isLocal: true, isDefinition: true, variable: %struct.VLC* @chroma422_dc_coeff_token_vlc)
!1037 = distinct !DIGlobalVariable(name: "chroma422_dc_coeff_token_vlc_table", scope: !0, file: !1004, line: 248, type: !1038, isLocal: true, isDefinition: true, variable: [8192 x [2 x i16]]* @chroma422_dc_coeff_token_vlc_table)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 262144, align: 16, elements: !1039)
!1039 = !{!1040, !944}
!1040 = !DISubrange(count: 8192)
!1041 = distinct !DIGlobalVariable(name: "total_zeros_vlc", scope: !0, file: !1004, line: 251, type: !1042, isLocal: true, isDefinition: true, variable: [16 x %struct.VLC]* @total_zeros_vlc)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 3072, align: 64, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 16)
!1045 = distinct !DIGlobalVariable(name: "total_zeros_vlc_tables", scope: !0, file: !1004, line: 252, type: !1046, isLocal: true, isDefinition: true, variable: [15 x [512 x [2 x i16]]]* @total_zeros_vlc_tables)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 245760, align: 16, elements: !1047)
!1047 = !{!1048, !1049, !944}
!1048 = !DISubrange(count: 15)
!1049 = !DISubrange(count: 512)
!1050 = distinct !DIGlobalVariable(name: "chroma_dc_total_zeros_vlc", scope: !0, file: !1004, line: 255, type: !1016, isLocal: true, isDefinition: true, variable: [4 x %struct.VLC]* @chroma_dc_total_zeros_vlc)
!1051 = distinct !DIGlobalVariable(name: "chroma_dc_total_zeros_vlc_tables", scope: !0, file: !1004, line: 256, type: !1052, isLocal: true, isDefinition: true, variable: [3 x [8 x [2 x i16]]]* @chroma_dc_total_zeros_vlc_tables)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 768, align: 16, elements: !1053)
!1053 = !{!1054, !991, !944}
!1054 = !DISubrange(count: 3)
!1055 = distinct !DIGlobalVariable(name: "chroma422_dc_total_zeros_vlc", scope: !0, file: !1004, line: 259, type: !1056, isLocal: true, isDefinition: true, variable: [8 x %struct.VLC]* @chroma422_dc_total_zeros_vlc)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 1536, align: 64, elements: !990)
!1057 = distinct !DIGlobalVariable(name: "chroma422_dc_total_zeros_vlc_tables", scope: !0, file: !1004, line: 260, type: !1058, isLocal: true, isDefinition: true, variable: [7 x [32 x [2 x i16]]]* @chroma422_dc_total_zeros_vlc_tables)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 7168, align: 16, elements: !1059)
!1059 = !{!1060, !1061, !944}
!1060 = !DISubrange(count: 7)
!1061 = !DISubrange(count: 32)
!1062 = distinct !DIGlobalVariable(name: "run_vlc", scope: !0, file: !1004, line: 263, type: !1063, isLocal: true, isDefinition: true, variable: [7 x %struct.VLC]* @run_vlc)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 1344, align: 64, elements: !1064)
!1064 = !{!1060}
!1065 = distinct !DIGlobalVariable(name: "run_vlc_tables", scope: !0, file: !1004, line: 264, type: !1066, isLocal: true, isDefinition: true, variable: [6 x [8 x [2 x i16]]]* @run_vlc_tables)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 1536, align: 16, elements: !1067)
!1067 = !{!1068, !991, !944}
!1068 = !DISubrange(count: 6)
!1069 = distinct !DIGlobalVariable(name: "run7_vlc", scope: !0, file: !1004, line: 267, type: !1017, isLocal: true, isDefinition: true, variable: %struct.VLC* @run7_vlc)
!1070 = distinct !DIGlobalVariable(name: "run7_vlc_table", scope: !0, file: !1004, line: 268, type: !1071, isLocal: true, isDefinition: true, variable: [96 x [2 x i16]]* @run7_vlc_table)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 3072, align: 16, elements: !1072)
!1072 = !{!1073, !944}
!1073 = !DISubrange(count: 96)
!1074 = distinct !DIGlobalVariable(name: "chroma_dc_coeff_token_len", scope: !0, file: !1004, line: 49, type: !1075, isLocal: true, isDefinition: true, variable: [20 x i8]* @chroma_dc_coeff_token_len)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 160, align: 8, elements: !1077)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1077 = !{!1078}
!1078 = !DISubrange(count: 20)
!1079 = distinct !DIGlobalVariable(name: "chroma_dc_coeff_token_bits", scope: !0, file: !1004, line: 57, type: !1075, isLocal: true, isDefinition: true, variable: [20 x i8]* @chroma_dc_coeff_token_bits)
!1080 = distinct !DIGlobalVariable(name: "chroma422_dc_coeff_token_len", scope: !0, file: !1004, line: 65, type: !1081, isLocal: true, isDefinition: true, variable: [36 x i8]* @chroma422_dc_coeff_token_len)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 288, align: 8, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 36)
!1084 = distinct !DIGlobalVariable(name: "chroma422_dc_coeff_token_bits", scope: !0, file: !1004, line: 77, type: !1081, isLocal: true, isDefinition: true, variable: [36 x i8]* @chroma422_dc_coeff_token_bits)
!1085 = distinct !DIGlobalVariable(name: "coeff_token_vlc_tables_size", scope: !0, file: !1004, line: 241, type: !1086, isLocal: true, isDefinition: true, variable: [4 x i32]* @coeff_token_vlc_tables_size)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 128, align: 32, elements: !947)
!1087 = distinct !DIGlobalVariable(name: "coeff_token_len", scope: !0, file: !1004, line: 89, type: !1088, isLocal: true, isDefinition: true, variable: [4 x [68 x i8]]* @coeff_token_len)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 2176, align: 8, elements: !1089)
!1089 = !{!948, !1090}
!1090 = !DISubrange(count: 68)
!1091 = distinct !DIGlobalVariable(name: "coeff_token_bits", scope: !0, file: !1004, line: 120, type: !1088, isLocal: true, isDefinition: true, variable: [4 x [68 x i8]]* @coeff_token_bits)
!1092 = distinct !DIGlobalVariable(name: "chroma_dc_total_zeros_len", scope: !0, file: !1004, line: 187, type: !1093, isLocal: true, isDefinition: true, variable: [3 x [4 x i8]]* @chroma_dc_total_zeros_len)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 96, align: 8, elements: !1094)
!1094 = !{!1054, !948}
!1095 = distinct !DIGlobalVariable(name: "chroma_dc_total_zeros_bits", scope: !0, file: !1004, line: 193, type: !1093, isLocal: true, isDefinition: true, variable: [3 x [4 x i8]]* @chroma_dc_total_zeros_bits)
!1096 = distinct !DIGlobalVariable(name: "chroma422_dc_total_zeros_len", scope: !0, file: !1004, line: 199, type: !1097, isLocal: true, isDefinition: true, variable: [7 x [8 x i8]]* @chroma422_dc_total_zeros_len)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 448, align: 8, elements: !1098)
!1098 = !{!1060, !991}
!1099 = distinct !DIGlobalVariable(name: "chroma422_dc_total_zeros_bits", scope: !0, file: !1004, line: 209, type: !1097, isLocal: true, isDefinition: true, variable: [7 x [8 x i8]]* @chroma422_dc_total_zeros_bits)
!1100 = distinct !DIGlobalVariable(name: "total_zeros_len", scope: !0, file: !1004, line: 151, type: !1101, isLocal: true, isDefinition: true, variable: [16 x [16 x i8]]* @total_zeros_len)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 2048, align: 8, elements: !1102)
!1102 = !{!1044, !1044}
!1103 = distinct !DIGlobalVariable(name: "total_zeros_bits", scope: !0, file: !1004, line: 169, type: !1101, isLocal: true, isDefinition: true, variable: [16 x [16 x i8]]* @total_zeros_bits)
!1104 = distinct !DIGlobalVariable(name: "run_len", scope: !0, file: !1004, line: 219, type: !1105, isLocal: true, isDefinition: true, variable: [7 x [16 x i8]]* @run_len)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 896, align: 8, elements: !1106)
!1106 = !{!1060, !1044}
!1107 = distinct !DIGlobalVariable(name: "run_bits", scope: !0, file: !1004, line: 229, type: !1105, isLocal: true, isDefinition: true, variable: [7 x [16 x i8]]* @run_bits)
!1108 = distinct !DIGlobalVariable(name: "cavlc_level_tab", scope: !0, file: !1004, line: 272, type: !1109, isLocal: true, isDefinition: true, variable: [7 x [256 x [2 x i8]]]* @cavlc_level_tab)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1110, size: 28672, align: 8, elements: !1112)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1111)
!1111 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1112 = !{!1060, !1035, !944}
!1113 = distinct !DIGlobalVariable(name: "zeromv", scope: !1114, file: !1115, line: 260, type: !2734, isLocal: true, isDefinition: true, variable: [2 x i16]* @pred_pskip_motion.zeromv)
!1114 = distinct !DISubprogram(name: "pred_pskip_motion", scope: !1115, file: !1115, line: 257, type: !1116, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1115 = !DIFile(filename: "libavcodec/h264_mvpred.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !1118, !2008}
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264Context", file: !888, line: 554, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264Context", file: !888, line: 337, size: 416128, align: 64, elements: !1123)
!1123 = !{!1124, !1168, !1836, !1850, !1930, !1942, !1956, !2003, !2005, !2006, !2007, !2315, !2316, !2317, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2411, !2415, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2431, !2432, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2584, !2585, !2599, !2601, !2603, !2604, !2608, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2630, !2631, !2632, !2633, !2727, !2728, !2729, !2730, !2731}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1122, file: !888, line: 338, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1129)
!1129 = !{!1130, !1134, !1138, !1142, !1143, !1144, !1145, !1149, !1155, !1157, !1161}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1128, file: !4, line: 72, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1133 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1128, file: !4, line: 78, baseType: !1135, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!1131, !919}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1128, file: !4, line: 85, baseType: !1139, size: 64, align: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1128, file: !4, line: 93, baseType: !920, size: 32, align: 32, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1128, file: !4, line: 99, baseType: !920, size: 32, align: 32, offset: 224)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1128, file: !4, line: 108, baseType: !920, size: 32, align: 32, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1128, file: !4, line: 113, baseType: !1146, size: 64, align: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!919, !919, !919}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1128, file: !4, line: 123, baseType: !1150, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!1153, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1128, file: !4, line: 130, baseType: !1156, size: 32, align: 32, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1128, file: !4, line: 136, baseType: !1158, size: 64, align: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!1156, !919}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1128, file: !4, line: 142, baseType: !1162, size: 64, align: 64, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!920, !1165, !919, !1131, !920}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1122, file: !888, line: 339, baseType: !1169, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1436, !1437, !1438, !1439, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1592, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1774, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1171, file: !35, line: 1561, baseType: !1125, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1171, file: !35, line: 1562, baseType: !920, size: 32, align: 32, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1171, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1171, file: !35, line: 1565, baseType: !1177, size: 64, align: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1195, !1198, !1200, !1203, !1206, !1207, !1208, !1216, !1217, !1218, !1220, !1224, !1230, !1240, !1244, !1245, !1288, !1407, !1411, !1412, !1416, !1420, !1425, !1429, !1430, !1431}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1179, file: !35, line: 3475, baseType: !1131, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1179, file: !35, line: 3480, baseType: !1131, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1179, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1179, file: !35, line: 3487, baseType: !920, size: 32, align: 32, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1179, file: !35, line: 3488, baseType: !1187, size: 64, align: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1190, line: 61, baseType: !1191)
!1190 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1190, line: 58, size: 64, align: 32, elements: !1192)
!1192 = !{!1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1191, file: !1190, line: 59, baseType: !920, size: 32, align: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1191, file: !1190, line: 60, baseType: !920, size: 32, align: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1179, file: !35, line: 3489, baseType: !1196, size: 64, align: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1179, file: !35, line: 3490, baseType: !1199, size: 64, align: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1179, file: !35, line: 3491, baseType: !1201, size: 64, align: 64, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1179, file: !35, line: 3492, baseType: !1204, size: 64, align: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1179, file: !35, line: 3493, baseType: !931, size: 8, align: 8, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1179, file: !35, line: 3494, baseType: !1125, size: 64, align: 64, offset: 640)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1179, file: !35, line: 3495, baseType: !1209, size: 64, align: 64, offset: 704)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1213)
!1213 = !{!1214, !1215}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1212, file: !35, line: 3402, baseType: !920, size: 32, align: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1212, file: !35, line: 3403, baseType: !1131, size: 64, align: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1179, file: !35, line: 3507, baseType: !1131, size: 64, align: 64, offset: 768)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1179, file: !35, line: 3516, baseType: !920, size: 32, align: 32, offset: 832)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1179, file: !35, line: 3517, baseType: !1219, size: 64, align: 64, offset: 896)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1179, file: !35, line: 3527, baseType: !1221, size: 64, align: 64, offset: 960)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!920, !1169}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1179, file: !35, line: 3535, baseType: !1225, size: 64, align: 64, offset: 1024)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!920, !1169, !1228}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1179, file: !35, line: 3541, baseType: !1231, size: 64, align: 64, offset: 1088)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1235, line: 223, size: 128, align: 64, elements: !1236)
!1235 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1236 = !{!1237, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1234, file: !1235, line: 224, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1234, file: !1235, line: 225, baseType: !1238, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1179, file: !35, line: 3549, baseType: !1241, size: 64, align: 64, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !1219}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1179, file: !35, line: 3551, baseType: !1221, size: 64, align: 64, offset: 1216)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1179, file: !35, line: 3552, baseType: !1246, size: 64, align: 64, offset: 1280)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!920, !1169, !975, !920, !1249}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1285}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1251, file: !35, line: 3921, baseType: !941, size: 16, align: 16)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1251, file: !35, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1251, file: !35, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1251, file: !35, line: 3924, baseType: !921, size: 32, align: 32, offset: 96)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1251, file: !35, line: 3925, baseType: !1258, size: 64, align: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267, !1268, !1276, !1278, !1280, !1281, !1283, !1284}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1261, file: !35, line: 3886, baseType: !920, size: 32, align: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1261, file: !35, line: 3887, baseType: !920, size: 32, align: 32, offset: 32)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1261, file: !35, line: 3888, baseType: !920, size: 32, align: 32, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1261, file: !35, line: 3889, baseType: !920, size: 32, align: 32, offset: 96)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1261, file: !35, line: 3890, baseType: !920, size: 32, align: 32, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1261, file: !35, line: 3897, baseType: !1269, size: 768, align: 64, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1271)
!1271 = !{!1272, !1274}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1270, file: !35, line: 3855, baseType: !1273, size: 512, align: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 512, align: 64, elements: !990)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1270, file: !35, line: 3857, baseType: !1275, size: 256, align: 32, offset: 512)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 256, align: 32, elements: !990)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1261, file: !35, line: 3903, baseType: !1277, size: 256, align: 64, offset: 960)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 256, align: 64, elements: !947)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1261, file: !35, line: 3904, baseType: !1279, size: 128, align: 32, offset: 1216)
!1279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 128, align: 32, elements: !947)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1261, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1261, file: !35, line: 3908, baseType: !1282, size: 64, align: 64, offset: 1408)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1261, file: !35, line: 3915, baseType: !1282, size: 64, align: 64, offset: 1472)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1261, file: !35, line: 3917, baseType: !920, size: 32, align: 32, offset: 1536)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1251, file: !35, line: 3926, baseType: !1286, size: 64, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1287)
!1287 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1179, file: !35, line: 3564, baseType: !1289, size: 64, align: 64, offset: 1344)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!920, !1169, !1292, !1326, !1406}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1295)
!1295 = !{!1296, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1322, !1323, !1324, !1325}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1294, file: !35, line: 1451, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1299, line: 94, baseType: !1300)
!1299 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1299, line: 81, size: 192, align: 64, elements: !1301)
!1301 = !{!1302, !1306, !1307}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1300, file: !1299, line: 82, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1299, line: 73, baseType: !1305)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1299, line: 73, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1300, file: !1299, line: 89, baseType: !975, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1300, file: !1299, line: 93, baseType: !920, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1294, file: !35, line: 1461, baseType: !1286, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1294, file: !35, line: 1467, baseType: !1286, size: 64, align: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1294, file: !35, line: 1468, baseType: !975, size: 64, align: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1294, file: !35, line: 1469, baseType: !920, size: 32, align: 32, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1294, file: !35, line: 1470, baseType: !920, size: 32, align: 32, offset: 288)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1294, file: !35, line: 1474, baseType: !920, size: 32, align: 32, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1294, file: !35, line: 1479, baseType: !1315, size: 64, align: 64, offset: 384)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1317, file: !35, line: 1412, baseType: !975, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1317, file: !35, line: 1413, baseType: !920, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1317, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1294, file: !35, line: 1480, baseType: !920, size: 32, align: 32, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1294, file: !35, line: 1486, baseType: !1286, size: 64, align: 64, offset: 512)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1294, file: !35, line: 1488, baseType: !1286, size: 64, align: 64, offset: 576)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1294, file: !35, line: 1497, baseType: !1286, size: 64, align: 64, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1360, !1362, !1363, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1394, !1395, !1396, !1397, !1398, !1399, !1402, !1403, !1404, !1405}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1329, file: !758, line: 282, baseType: !1273, size: 512, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1329, file: !758, line: 299, baseType: !1275, size: 256, align: 32, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1329, file: !758, line: 315, baseType: !1334, size: 64, align: 64, offset: 768)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1329, file: !758, line: 326, baseType: !920, size: 32, align: 32, offset: 832)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1329, file: !758, line: 326, baseType: !920, size: 32, align: 32, offset: 864)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1329, file: !758, line: 334, baseType: !920, size: 32, align: 32, offset: 896)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1329, file: !758, line: 341, baseType: !920, size: 32, align: 32, offset: 928)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1329, file: !758, line: 346, baseType: !920, size: 32, align: 32, offset: 960)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1329, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1329, file: !758, line: 356, baseType: !1189, size: 64, align: 32, offset: 1024)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1329, file: !758, line: 361, baseType: !1286, size: 64, align: 64, offset: 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1329, file: !758, line: 369, baseType: !1286, size: 64, align: 64, offset: 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1329, file: !758, line: 377, baseType: !1286, size: 64, align: 64, offset: 1216)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1329, file: !758, line: 382, baseType: !920, size: 32, align: 32, offset: 1280)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1329, file: !758, line: 386, baseType: !920, size: 32, align: 32, offset: 1312)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1329, file: !758, line: 391, baseType: !920, size: 32, align: 32, offset: 1344)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1329, file: !758, line: 396, baseType: !919, size: 64, align: 64, offset: 1408)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1329, file: !758, line: 403, baseType: !1350, size: 512, align: 64, offset: 1472)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 512, align: 64, elements: !990)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1329, file: !758, line: 410, baseType: !920, size: 32, align: 32, offset: 1984)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1329, file: !758, line: 415, baseType: !920, size: 32, align: 32, offset: 2016)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1329, file: !758, line: 420, baseType: !920, size: 32, align: 32, offset: 2048)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1329, file: !758, line: 425, baseType: !920, size: 32, align: 32, offset: 2080)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1329, file: !758, line: 435, baseType: !1286, size: 64, align: 64, offset: 2112)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1329, file: !758, line: 440, baseType: !920, size: 32, align: 32, offset: 2176)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1329, file: !758, line: 445, baseType: !964, size: 64, align: 64, offset: 2240)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1329, file: !758, line: 459, baseType: !1359, size: 512, align: 64, offset: 2304)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1297, size: 512, align: 64, elements: !990)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1329, file: !758, line: 473, baseType: !1361, size: 64, align: 64, offset: 2816)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1329, file: !758, line: 477, baseType: !920, size: 32, align: 32, offset: 2880)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1329, file: !758, line: 479, baseType: !1364, size: 64, align: 64, offset: 2944)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1377}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1367, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1367, file: !758, line: 203, baseType: !975, size: 64, align: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1367, file: !758, line: 204, baseType: !920, size: 32, align: 32, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1367, file: !758, line: 205, baseType: !1373, size: 64, align: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1375, line: 86, baseType: !1376)
!1375 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1376 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1375, line: 86, flags: DIFlagFwdDecl)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1367, file: !758, line: 206, baseType: !1297, size: 64, align: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1329, file: !758, line: 480, baseType: !920, size: 32, align: 32, offset: 3008)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1329, file: !758, line: 505, baseType: !920, size: 32, align: 32, offset: 3040)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1329, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1329, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1329, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1329, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1329, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1329, file: !758, line: 532, baseType: !1286, size: 64, align: 64, offset: 3264)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1329, file: !758, line: 539, baseType: !1286, size: 64, align: 64, offset: 3328)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1329, file: !758, line: 547, baseType: !1286, size: 64, align: 64, offset: 3392)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1329, file: !758, line: 554, baseType: !1373, size: 64, align: 64, offset: 3456)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1329, file: !758, line: 563, baseType: !920, size: 32, align: 32, offset: 3520)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1329, file: !758, line: 572, baseType: !920, size: 32, align: 32, offset: 3552)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1329, file: !758, line: 581, baseType: !920, size: 32, align: 32, offset: 3584)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1329, file: !758, line: 588, baseType: !1393, size: 64, align: 64, offset: 3648)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1329, file: !758, line: 593, baseType: !920, size: 32, align: 32, offset: 3712)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1329, file: !758, line: 596, baseType: !920, size: 32, align: 32, offset: 3744)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1329, file: !758, line: 599, baseType: !1297, size: 64, align: 64, offset: 3776)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1329, file: !758, line: 605, baseType: !1297, size: 64, align: 64, offset: 3840)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1329, file: !758, line: 616, baseType: !1297, size: 64, align: 64, offset: 3904)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1329, file: !758, line: 626, baseType: !1400, size: 64, align: 64, offset: 3968)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1401, line: 216, baseType: !965)
!1401 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1329, file: !758, line: 627, baseType: !1400, size: 64, align: 64, offset: 4032)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1329, file: !758, line: 628, baseType: !1400, size: 64, align: 64, offset: 4096)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1329, file: !758, line: 629, baseType: !1400, size: 64, align: 64, offset: 4160)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1329, file: !758, line: 645, baseType: !1297, size: 64, align: 64, offset: 4224)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1179, file: !35, line: 3566, baseType: !1408, size: 64, align: 64, offset: 1408)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!920, !1169, !919, !1406, !1292}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1179, file: !35, line: 3567, baseType: !1221, size: 64, align: 64, offset: 1472)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1179, file: !35, line: 3576, baseType: !1413, size: 64, align: 64, offset: 1536)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!920, !1169, !1326}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1179, file: !35, line: 3577, baseType: !1417, size: 64, align: 64, offset: 1600)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!920, !1169, !1292}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1179, file: !35, line: 3584, baseType: !1421, size: 64, align: 64, offset: 1664)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!920, !1169, !1424}
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1179, file: !35, line: 3589, baseType: !1426, size: 64, align: 64, offset: 1728)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{null, !1169}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1179, file: !35, line: 3594, baseType: !920, size: 32, align: 32, offset: 1792)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1179, file: !35, line: 3600, baseType: !1131, size: 64, align: 64, offset: 1856)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1179, file: !35, line: 3609, baseType: !1432, size: 64, align: 64, offset: 1920)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1435)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1171, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1171, file: !35, line: 1581, baseType: !921, size: 32, align: 32, offset: 224)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1171, file: !35, line: 1583, baseType: !919, size: 64, align: 64, offset: 256)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1171, file: !35, line: 1591, baseType: !1440, size: 64, align: 64, offset: 320)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1235, line: 129, size: 1664, align: 64, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446, !1447, !1465, !1466, !1472, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1441, file: !1235, line: 136, baseType: !920, size: 32, align: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1441, file: !1235, line: 151, baseType: !920, size: 32, align: 32, offset: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1441, file: !1235, line: 157, baseType: !920, size: 32, align: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1441, file: !1235, line: 159, baseType: !1424, size: 64, align: 64, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1441, file: !1235, line: 161, baseType: !1448, size: 64, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1235, line: 117, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1235, line: 100, size: 832, align: 64, elements: !1451)
!1451 = !{!1452, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1450, file: !1235, line: 105, baseType: !1453, size: 256, align: 64)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1454, size: 256, align: 64, elements: !947)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1299, line: 238, baseType: !1456)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1299, line: 238, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1450, file: !1235, line: 110, baseType: !920, size: 32, align: 32, offset: 256)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1450, file: !1235, line: 111, baseType: !920, size: 32, align: 32, offset: 288)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1450, file: !1235, line: 111, baseType: !920, size: 32, align: 32, offset: 320)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1450, file: !1235, line: 112, baseType: !1275, size: 256, align: 32, offset: 352)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1450, file: !1235, line: 113, baseType: !1279, size: 128, align: 32, offset: 608)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1450, file: !1235, line: 114, baseType: !920, size: 32, align: 32, offset: 736)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1450, file: !1235, line: 115, baseType: !920, size: 32, align: 32, offset: 768)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1450, file: !1235, line: 116, baseType: !920, size: 32, align: 32, offset: 800)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1441, file: !1235, line: 163, baseType: !919, size: 64, align: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1441, file: !1235, line: 165, baseType: !1467, size: 128, align: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1235, line: 122, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1235, line: 119, size: 128, align: 64, elements: !1469)
!1469 = !{!1470, !1471}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1468, file: !1235, line: 120, baseType: !1292, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1468, file: !1235, line: 121, baseType: !1424, size: 64, align: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1441, file: !1235, line: 166, baseType: !1473, size: 128, align: 64, offset: 448)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1235, line: 127, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1235, line: 124, size: 128, align: 64, elements: !1475)
!1475 = !{!1476, !1549}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1474, file: !1235, line: 125, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1481)
!1481 = !{!1482, !1483, !1507, !1511, !1512, !1546, !1547, !1548}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1480, file: !35, line: 5751, baseType: !1125, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1480, file: !35, line: 5756, baseType: !1484, size: 64, align: 64, offset: 64)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1487)
!1487 = !{!1488, !1489, !1492, !1493, !1494, !1498, !1502, !1506}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1486, file: !35, line: 5797, baseType: !1131, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1486, file: !35, line: 5804, baseType: !1490, size: 64, align: 64, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1486, file: !35, line: 5815, baseType: !1125, size: 64, align: 64, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1486, file: !35, line: 5825, baseType: !920, size: 32, align: 32, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1486, file: !35, line: 5826, baseType: !1495, size: 64, align: 64, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!920, !1478}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1486, file: !35, line: 5827, baseType: !1499, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!920, !1478, !1292}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1486, file: !35, line: 5828, baseType: !1503, size: 64, align: 64, offset: 384)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{null, !1478}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1486, file: !35, line: 5829, baseType: !1503, size: 64, align: 64, offset: 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1480, file: !35, line: 5762, baseType: !1508, size: 64, align: 64, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1510)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1480, file: !35, line: 5768, baseType: !919, size: 64, align: 64, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1480, file: !35, line: 5775, baseType: !1513, size: 64, align: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1515, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1515, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1515, file: !35, line: 3948, baseType: !923, size: 32, align: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1515, file: !35, line: 3958, baseType: !975, size: 64, align: 64, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1515, file: !35, line: 3962, baseType: !920, size: 32, align: 32, offset: 192)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1515, file: !35, line: 3968, baseType: !920, size: 32, align: 32, offset: 224)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1515, file: !35, line: 3973, baseType: !1286, size: 64, align: 64, offset: 256)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1515, file: !35, line: 3986, baseType: !920, size: 32, align: 32, offset: 320)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1515, file: !35, line: 3999, baseType: !920, size: 32, align: 32, offset: 352)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1515, file: !35, line: 4004, baseType: !920, size: 32, align: 32, offset: 384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1515, file: !35, line: 4005, baseType: !920, size: 32, align: 32, offset: 416)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1515, file: !35, line: 4010, baseType: !920, size: 32, align: 32, offset: 448)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1515, file: !35, line: 4011, baseType: !920, size: 32, align: 32, offset: 480)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1515, file: !35, line: 4020, baseType: !1189, size: 64, align: 32, offset: 512)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1515, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1515, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1515, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1515, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1515, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1515, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1515, file: !35, line: 4039, baseType: !920, size: 32, align: 32, offset: 768)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1515, file: !35, line: 4046, baseType: !964, size: 64, align: 64, offset: 832)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1515, file: !35, line: 4050, baseType: !920, size: 32, align: 32, offset: 896)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1515, file: !35, line: 4054, baseType: !920, size: 32, align: 32, offset: 928)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1515, file: !35, line: 4061, baseType: !920, size: 32, align: 32, offset: 960)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1515, file: !35, line: 4065, baseType: !920, size: 32, align: 32, offset: 992)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1515, file: !35, line: 4073, baseType: !920, size: 32, align: 32, offset: 1024)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1515, file: !35, line: 4080, baseType: !920, size: 32, align: 32, offset: 1056)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1515, file: !35, line: 4084, baseType: !920, size: 32, align: 32, offset: 1088)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1480, file: !35, line: 5781, baseType: !1513, size: 64, align: 64, offset: 320)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1480, file: !35, line: 5787, baseType: !1189, size: 64, align: 32, offset: 384)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1480, file: !35, line: 5793, baseType: !1189, size: 64, align: 32, offset: 448)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1474, file: !1235, line: 126, baseType: !920, size: 32, align: 32, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1441, file: !1235, line: 172, baseType: !1292, size: 64, align: 64, offset: 576)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1441, file: !1235, line: 177, baseType: !975, size: 64, align: 64, offset: 640)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1441, file: !1235, line: 178, baseType: !921, size: 32, align: 32, offset: 704)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1441, file: !1235, line: 180, baseType: !919, size: 64, align: 64, offset: 768)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1441, file: !1235, line: 185, baseType: !920, size: 32, align: 32, offset: 832)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1441, file: !1235, line: 190, baseType: !919, size: 64, align: 64, offset: 896)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1441, file: !1235, line: 195, baseType: !920, size: 32, align: 32, offset: 960)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1441, file: !1235, line: 200, baseType: !1292, size: 64, align: 64, offset: 1024)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1441, file: !1235, line: 201, baseType: !920, size: 32, align: 32, offset: 1088)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1441, file: !1235, line: 202, baseType: !1424, size: 64, align: 64, offset: 1152)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1441, file: !1235, line: 203, baseType: !920, size: 32, align: 32, offset: 1216)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1441, file: !1235, line: 205, baseType: !920, size: 32, align: 32, offset: 1248)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1441, file: !1235, line: 206, baseType: !920, size: 32, align: 32, offset: 1280)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1441, file: !1235, line: 209, baseType: !1400, size: 64, align: 64, offset: 1344)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1441, file: !1235, line: 212, baseType: !1400, size: 64, align: 64, offset: 1408)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1441, file: !1235, line: 213, baseType: !1424, size: 64, align: 64, offset: 1472)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1441, file: !1235, line: 215, baseType: !920, size: 32, align: 32, offset: 1536)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1441, file: !1235, line: 217, baseType: !920, size: 32, align: 32, offset: 1568)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1441, file: !1235, line: 220, baseType: !920, size: 32, align: 32, offset: 1600)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1171, file: !35, line: 1598, baseType: !919, size: 64, align: 64, offset: 384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1171, file: !35, line: 1606, baseType: !1286, size: 64, align: 64, offset: 448)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1171, file: !35, line: 1614, baseType: !920, size: 32, align: 32, offset: 512)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1171, file: !35, line: 1622, baseType: !920, size: 32, align: 32, offset: 544)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1171, file: !35, line: 1628, baseType: !920, size: 32, align: 32, offset: 576)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !35, line: 1636, baseType: !920, size: 32, align: 32, offset: 608)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1171, file: !35, line: 1643, baseType: !920, size: 32, align: 32, offset: 640)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1171, file: !35, line: 1657, baseType: !975, size: 64, align: 64, offset: 704)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1171, file: !35, line: 1658, baseType: !920, size: 32, align: 32, offset: 768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1171, file: !35, line: 1679, baseType: !1189, size: 64, align: 32, offset: 800)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1171, file: !35, line: 1688, baseType: !920, size: 32, align: 32, offset: 864)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1171, file: !35, line: 1712, baseType: !920, size: 32, align: 32, offset: 896)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1171, file: !35, line: 1729, baseType: !920, size: 32, align: 32, offset: 928)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1171, file: !35, line: 1729, baseType: !920, size: 32, align: 32, offset: 960)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1171, file: !35, line: 1744, baseType: !920, size: 32, align: 32, offset: 992)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1171, file: !35, line: 1744, baseType: !920, size: 32, align: 32, offset: 1024)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1171, file: !35, line: 1751, baseType: !920, size: 32, align: 32, offset: 1056)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1171, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1171, file: !35, line: 1791, baseType: !1588, size: 64, align: 64, offset: 1152)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1591, !1326, !1406, !920, !920, !920}
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1171, file: !35, line: 1808, baseType: !1593, size: 64, align: 64, offset: 1216)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!494, !1591, !1196}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1171, file: !35, line: 1816, baseType: !920, size: 32, align: 32, offset: 1280)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1171, file: !35, line: 1825, baseType: !950, size: 32, align: 32, offset: 1312)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1171, file: !35, line: 1830, baseType: !920, size: 32, align: 32, offset: 1344)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1171, file: !35, line: 1838, baseType: !950, size: 32, align: 32, offset: 1376)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1171, file: !35, line: 1846, baseType: !920, size: 32, align: 32, offset: 1408)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1171, file: !35, line: 1851, baseType: !920, size: 32, align: 32, offset: 1440)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1171, file: !35, line: 1861, baseType: !950, size: 32, align: 32, offset: 1472)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1171, file: !35, line: 1868, baseType: !950, size: 32, align: 32, offset: 1504)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1171, file: !35, line: 1875, baseType: !950, size: 32, align: 32, offset: 1536)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1171, file: !35, line: 1882, baseType: !950, size: 32, align: 32, offset: 1568)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1171, file: !35, line: 1889, baseType: !950, size: 32, align: 32, offset: 1600)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1171, file: !35, line: 1896, baseType: !950, size: 32, align: 32, offset: 1632)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1171, file: !35, line: 1903, baseType: !950, size: 32, align: 32, offset: 1664)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1171, file: !35, line: 1910, baseType: !920, size: 32, align: 32, offset: 1696)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1171, file: !35, line: 1915, baseType: !920, size: 32, align: 32, offset: 1728)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1171, file: !35, line: 1926, baseType: !1406, size: 64, align: 64, offset: 1792)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1171, file: !35, line: 1935, baseType: !1189, size: 64, align: 32, offset: 1856)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1171, file: !35, line: 1942, baseType: !920, size: 32, align: 32, offset: 1920)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1171, file: !35, line: 1948, baseType: !920, size: 32, align: 32, offset: 1952)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1171, file: !35, line: 1954, baseType: !920, size: 32, align: 32, offset: 1984)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1171, file: !35, line: 1960, baseType: !920, size: 32, align: 32, offset: 2016)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1171, file: !35, line: 1984, baseType: !920, size: 32, align: 32, offset: 2048)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1171, file: !35, line: 1991, baseType: !920, size: 32, align: 32, offset: 2080)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1171, file: !35, line: 1996, baseType: !920, size: 32, align: 32, offset: 2112)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1171, file: !35, line: 2004, baseType: !920, size: 32, align: 32, offset: 2144)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1171, file: !35, line: 2011, baseType: !920, size: 32, align: 32, offset: 2176)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1171, file: !35, line: 2018, baseType: !920, size: 32, align: 32, offset: 2208)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1171, file: !35, line: 2027, baseType: !920, size: 32, align: 32, offset: 2240)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1171, file: !35, line: 2034, baseType: !920, size: 32, align: 32, offset: 2272)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1171, file: !35, line: 2044, baseType: !920, size: 32, align: 32, offset: 2304)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1171, file: !35, line: 2054, baseType: !976, size: 64, align: 64, offset: 2368)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1171, file: !35, line: 2061, baseType: !976, size: 64, align: 64, offset: 2432)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1171, file: !35, line: 2066, baseType: !920, size: 32, align: 32, offset: 2496)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1171, file: !35, line: 2070, baseType: !920, size: 32, align: 32, offset: 2528)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1171, file: !35, line: 2078, baseType: !920, size: 32, align: 32, offset: 2560)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1171, file: !35, line: 2085, baseType: !920, size: 32, align: 32, offset: 2592)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1171, file: !35, line: 2092, baseType: !920, size: 32, align: 32, offset: 2624)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1171, file: !35, line: 2099, baseType: !920, size: 32, align: 32, offset: 2656)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1171, file: !35, line: 2106, baseType: !920, size: 32, align: 32, offset: 2688)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1171, file: !35, line: 2113, baseType: !920, size: 32, align: 32, offset: 2720)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1171, file: !35, line: 2120, baseType: !920, size: 32, align: 32, offset: 2752)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1171, file: !35, line: 2125, baseType: !920, size: 32, align: 32, offset: 2784)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1171, file: !35, line: 2133, baseType: !920, size: 32, align: 32, offset: 2816)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1171, file: !35, line: 2140, baseType: !920, size: 32, align: 32, offset: 2848)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1171, file: !35, line: 2145, baseType: !920, size: 32, align: 32, offset: 2880)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1171, file: !35, line: 2153, baseType: !920, size: 32, align: 32, offset: 2912)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1171, file: !35, line: 2158, baseType: !920, size: 32, align: 32, offset: 2944)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1171, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1171, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1171, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1171, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1171, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1171, file: !35, line: 2203, baseType: !920, size: 32, align: 32, offset: 3136)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1171, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1171, file: !35, line: 2212, baseType: !920, size: 32, align: 32, offset: 3200)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1171, file: !35, line: 2213, baseType: !920, size: 32, align: 32, offset: 3232)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1171, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1171, file: !35, line: 2232, baseType: !920, size: 32, align: 32, offset: 3296)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1171, file: !35, line: 2243, baseType: !920, size: 32, align: 32, offset: 3328)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1171, file: !35, line: 2249, baseType: !920, size: 32, align: 32, offset: 3360)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1171, file: !35, line: 2256, baseType: !920, size: 32, align: 32, offset: 3392)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1171, file: !35, line: 2263, baseType: !964, size: 64, align: 64, offset: 3456)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1171, file: !35, line: 2270, baseType: !964, size: 64, align: 64, offset: 3520)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1171, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1171, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1171, file: !35, line: 2367, baseType: !1662, size: 64, align: 64, offset: 3648)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!920, !1591, !1424, !920}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1171, file: !35, line: 2383, baseType: !920, size: 32, align: 32, offset: 3712)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1171, file: !35, line: 2386, baseType: !950, size: 32, align: 32, offset: 3744)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1171, file: !35, line: 2387, baseType: !950, size: 32, align: 32, offset: 3776)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1171, file: !35, line: 2394, baseType: !920, size: 32, align: 32, offset: 3808)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1171, file: !35, line: 2401, baseType: !920, size: 32, align: 32, offset: 3840)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1171, file: !35, line: 2408, baseType: !920, size: 32, align: 32, offset: 3872)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1171, file: !35, line: 2415, baseType: !920, size: 32, align: 32, offset: 3904)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1171, file: !35, line: 2422, baseType: !920, size: 32, align: 32, offset: 3936)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1171, file: !35, line: 2423, baseType: !1674, size: 64, align: 64, offset: 3968)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1677)
!1677 = !{!1678, !1679, !1680, !1681}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1676, file: !35, line: 827, baseType: !920, size: 32, align: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1676, file: !35, line: 828, baseType: !920, size: 32, align: 32, offset: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1676, file: !35, line: 829, baseType: !920, size: 32, align: 32, offset: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1676, file: !35, line: 830, baseType: !950, size: 32, align: 32, offset: 96)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1171, file: !35, line: 2430, baseType: !1286, size: 64, align: 64, offset: 4032)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1171, file: !35, line: 2437, baseType: !1286, size: 64, align: 64, offset: 4096)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1171, file: !35, line: 2444, baseType: !950, size: 32, align: 32, offset: 4160)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1171, file: !35, line: 2451, baseType: !950, size: 32, align: 32, offset: 4192)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1171, file: !35, line: 2458, baseType: !920, size: 32, align: 32, offset: 4224)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1171, file: !35, line: 2469, baseType: !920, size: 32, align: 32, offset: 4256)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1171, file: !35, line: 2475, baseType: !920, size: 32, align: 32, offset: 4288)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1171, file: !35, line: 2481, baseType: !920, size: 32, align: 32, offset: 4320)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1171, file: !35, line: 2485, baseType: !920, size: 32, align: 32, offset: 4352)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1171, file: !35, line: 2489, baseType: !920, size: 32, align: 32, offset: 4384)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1171, file: !35, line: 2493, baseType: !920, size: 32, align: 32, offset: 4416)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1171, file: !35, line: 2501, baseType: !920, size: 32, align: 32, offset: 4448)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1171, file: !35, line: 2506, baseType: !920, size: 32, align: 32, offset: 4480)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1171, file: !35, line: 2510, baseType: !920, size: 32, align: 32, offset: 4512)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1171, file: !35, line: 2514, baseType: !1286, size: 64, align: 64, offset: 4544)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1171, file: !35, line: 2528, baseType: !1698, size: 64, align: 64, offset: 4608)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{null, !1591, !919, !920, !920}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1171, file: !35, line: 2534, baseType: !920, size: 32, align: 32, offset: 4672)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1171, file: !35, line: 2545, baseType: !920, size: 32, align: 32, offset: 4704)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1171, file: !35, line: 2547, baseType: !920, size: 32, align: 32, offset: 4736)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1171, file: !35, line: 2549, baseType: !920, size: 32, align: 32, offset: 4768)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1171, file: !35, line: 2551, baseType: !920, size: 32, align: 32, offset: 4800)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1171, file: !35, line: 2553, baseType: !920, size: 32, align: 32, offset: 4832)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1171, file: !35, line: 2555, baseType: !920, size: 32, align: 32, offset: 4864)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1171, file: !35, line: 2557, baseType: !920, size: 32, align: 32, offset: 4896)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1171, file: !35, line: 2559, baseType: !920, size: 32, align: 32, offset: 4928)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1171, file: !35, line: 2563, baseType: !920, size: 32, align: 32, offset: 4960)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1171, file: !35, line: 2571, baseType: !1282, size: 64, align: 64, offset: 4992)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1171, file: !35, line: 2579, baseType: !1282, size: 64, align: 64, offset: 5056)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1171, file: !35, line: 2586, baseType: !920, size: 32, align: 32, offset: 5120)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1171, file: !35, line: 2615, baseType: !920, size: 32, align: 32, offset: 5152)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1171, file: !35, line: 2627, baseType: !920, size: 32, align: 32, offset: 5184)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1171, file: !35, line: 2637, baseType: !920, size: 32, align: 32, offset: 5216)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1171, file: !35, line: 2681, baseType: !920, size: 32, align: 32, offset: 5248)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1171, file: !35, line: 2709, baseType: !1286, size: 64, align: 64, offset: 5312)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1171, file: !35, line: 2716, baseType: !1720, size: 64, align: 64, offset: 5376)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1722)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1723)
!1723 = !{!1724, !1725, !1726, !1727, !1728, !1729, !1730, !1734, !1738, !1739, !1740, !1741, !1747, !1748, !1749, !1750, !1751}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1722, file: !35, line: 3642, baseType: !1131, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1722, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1722, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1722, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1722, file: !35, line: 3669, baseType: !920, size: 32, align: 32, offset: 160)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1722, file: !35, line: 3682, baseType: !1421, size: 64, align: 64, offset: 192)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1722, file: !35, line: 3698, baseType: !1731, size: 64, align: 64, offset: 256)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DISubroutineType(types: !1733)
!1733 = !{!920, !1169, !1238, !923}
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1722, file: !35, line: 3712, baseType: !1735, size: 64, align: 64, offset: 320)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{!920, !1169, !920, !1238, !923}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1722, file: !35, line: 3726, baseType: !1731, size: 64, align: 64, offset: 384)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1722, file: !35, line: 3737, baseType: !1221, size: 64, align: 64, offset: 448)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1722, file: !35, line: 3746, baseType: !920, size: 32, align: 32, offset: 512)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1722, file: !35, line: 3757, baseType: !1742, size: 64, align: 64, offset: 576)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1743 = !DISubroutineType(types: !1744)
!1744 = !{null, !1745}
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1746 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1722, file: !35, line: 3766, baseType: !1221, size: 64, align: 64, offset: 640)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1722, file: !35, line: 3774, baseType: !1221, size: 64, align: 64, offset: 704)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1722, file: !35, line: 3780, baseType: !920, size: 32, align: 32, offset: 768)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1722, file: !35, line: 3785, baseType: !920, size: 32, align: 32, offset: 800)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1722, file: !35, line: 3795, baseType: !1752, size: 64, align: 64, offset: 832)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DISubroutineType(types: !1754)
!1754 = !{!920, !1169, !1297}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1171, file: !35, line: 2728, baseType: !919, size: 64, align: 64, offset: 5440)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1171, file: !35, line: 2735, baseType: !1350, size: 512, align: 64, offset: 5504)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1171, file: !35, line: 2742, baseType: !920, size: 32, align: 32, offset: 6016)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1171, file: !35, line: 2755, baseType: !920, size: 32, align: 32, offset: 6048)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1171, file: !35, line: 2776, baseType: !920, size: 32, align: 32, offset: 6080)
