; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aura.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aura.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!826 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!827 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!828 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!829 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!830 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!831 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!832 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!833 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!834 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!835 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!836 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!837 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!838 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!839 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!840 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!841 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!842 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!843 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!844 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!845 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!846 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!847 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!848 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!849 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!850 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!851 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !893, !894}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !891, line: 36, baseType: !892)
!891 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!892 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!893 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!894 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!895 = !{!896}
!896 = distinct !DIGlobalVariable(name: "ff_aura2_decoder", scope: !0, file: !897, line: 100, type: !898, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aura2_decoder)
!897 = !DIFile(filename: "libavcodec/aura.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !900)
!900 = !{!901, !905, !906, !907, !908, !909, !918, !921, !924, !927, !932, !935, !977, !985, !986, !987, !989, !1541, !1547, !1555, !1559, !1560, !1597, !1601, !1605, !1606, !1610, !1614, !1615, !1619, !1620, !1621}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !899, file: !14, line: 3475, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !899, file: !14, line: 3480, baseType: !902, size: 64, align: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !899, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !899, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !899, file: !14, line: 3487, baseType: !893, size: 32, align: 32, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !899, file: !14, line: 3488, baseType: !910, size: 64, align: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !913, line: 61, baseType: !914)
!913 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !913, line: 58, size: 64, align: 32, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !914, file: !913, line: 59, baseType: !893, size: 32, align: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !914, file: !913, line: 60, baseType: !893, size: 32, align: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !899, file: !14, line: 3489, baseType: !919, size: 64, align: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !899, file: !14, line: 3490, baseType: !922, size: 64, align: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !899, file: !14, line: 3491, baseType: !925, size: 64, align: 64, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !899, file: !14, line: 3492, baseType: !928, size: 64, align: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !891, line: 55, baseType: !931)
!931 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !899, file: !14, line: 3493, baseType: !933, size: 8, align: 8, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !891, line: 48, baseType: !934)
!934 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !899, file: !14, line: 3494, baseType: !936, size: 64, align: 64, offset: 640)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !940)
!940 = !{!941, !942, !947, !951, !952, !953, !954, !958, !964, !966, !970}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !939, file: !691, line: 72, baseType: !902, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !939, file: !691, line: 78, baseType: !943, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!902, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !939, file: !691, line: 85, baseType: !948, size: 64, align: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !939, file: !691, line: 93, baseType: !893, size: 32, align: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !939, file: !691, line: 99, baseType: !893, size: 32, align: 32, offset: 224)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !939, file: !691, line: 108, baseType: !893, size: 32, align: 32, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !939, file: !691, line: 113, baseType: !955, size: 64, align: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!946, !946, !946}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !939, file: !691, line: 123, baseType: !959, size: 64, align: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!962, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !939, file: !691, line: 130, baseType: !965, size: 32, align: 32, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !939, file: !691, line: 136, baseType: !967, size: 64, align: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!965, !946}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !939, file: !691, line: 142, baseType: !971, size: 64, align: 64, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!893, !974, !946, !902, !893}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !899, file: !14, line: 3495, baseType: !978, size: 64, align: 64, offset: 704)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !981, file: !14, line: 3402, baseType: !893, size: 32, align: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !14, line: 3403, baseType: !902, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !899, file: !14, line: 3507, baseType: !902, size: 64, align: 64, offset: 768)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !899, file: !14, line: 3516, baseType: !893, size: 32, align: 32, offset: 832)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !899, file: !14, line: 3517, baseType: !988, size: 64, align: 64, offset: 896)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !899, file: !14, line: 3527, baseType: !990, size: 64, align: 64, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!893, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !996)
!996 = !{!997, !998, !999, !1000, !1003, !1004, !1005, !1006, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1287, !1291, !1292, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1479, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !995, file: !14, line: 1561, baseType: !936, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !995, file: !14, line: 1562, baseType: !893, size: 32, align: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !995, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !995, file: !14, line: 1565, baseType: !1001, size: 64, align: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !995, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !995, file: !14, line: 1581, baseType: !894, size: 32, align: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !995, file: !14, line: 1583, baseType: !946, size: 64, align: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !995, file: !14, line: 1591, baseType: !1007, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1009, line: 129, size: 1664, align: 64, elements: !1010)
!1009 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1010 = !{!1011, !1012, !1013, !1014, !1112, !1133, !1134, !1163, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1008, file: !1009, line: 136, baseType: !893, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1008, file: !1009, line: 151, baseType: !893, size: 32, align: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1008, file: !1009, line: 157, baseType: !893, size: 32, align: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1008, file: !1009, line: 159, baseType: !1015, size: 64, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1018)
!1018 = !{!1019, !1024, !1026, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1066, !1068, !1069, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1100, !1101, !1102, !1103, !1104, !1105, !1108, !1109, !1110, !1111}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1017, file: !722, line: 282, baseType: !1020, size: 512, align: 64)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 512, align: 64, elements: !1022)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1022 = !{!1023}
!1023 = !DISubrange(count: 8)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1017, file: !722, line: 299, baseType: !1025, size: 256, align: 32, offset: 512)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 256, align: 32, elements: !1022)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1017, file: !722, line: 315, baseType: !1027, size: 64, align: 64, offset: 768)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1017, file: !722, line: 326, baseType: !893, size: 32, align: 32, offset: 832)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1017, file: !722, line: 326, baseType: !893, size: 32, align: 32, offset: 864)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1017, file: !722, line: 334, baseType: !893, size: 32, align: 32, offset: 896)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1017, file: !722, line: 341, baseType: !893, size: 32, align: 32, offset: 928)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1017, file: !722, line: 346, baseType: !893, size: 32, align: 32, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1017, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1017, file: !722, line: 356, baseType: !912, size: 64, align: 32, offset: 1024)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1017, file: !722, line: 361, baseType: !1036, size: 64, align: 64, offset: 1088)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !891, line: 40, baseType: !1037)
!1037 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1017, file: !722, line: 369, baseType: !1036, size: 64, align: 64, offset: 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1017, file: !722, line: 377, baseType: !1036, size: 64, align: 64, offset: 1216)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1017, file: !722, line: 382, baseType: !893, size: 32, align: 32, offset: 1280)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1017, file: !722, line: 386, baseType: !893, size: 32, align: 32, offset: 1312)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1017, file: !722, line: 391, baseType: !893, size: 32, align: 32, offset: 1344)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1017, file: !722, line: 396, baseType: !946, size: 64, align: 64, offset: 1408)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1017, file: !722, line: 403, baseType: !1045, size: 512, align: 64, offset: 1472)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 512, align: 64, elements: !1022)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1017, file: !722, line: 410, baseType: !893, size: 32, align: 32, offset: 1984)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1017, file: !722, line: 415, baseType: !893, size: 32, align: 32, offset: 2016)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1017, file: !722, line: 420, baseType: !893, size: 32, align: 32, offset: 2048)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1017, file: !722, line: 425, baseType: !893, size: 32, align: 32, offset: 2080)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1017, file: !722, line: 435, baseType: !1036, size: 64, align: 64, offset: 2112)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1017, file: !722, line: 440, baseType: !893, size: 32, align: 32, offset: 2176)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1017, file: !722, line: 445, baseType: !930, size: 64, align: 64, offset: 2240)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1017, file: !722, line: 459, baseType: !1054, size: 512, align: 64, offset: 2304)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, align: 64, elements: !1022)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1057, line: 94, baseType: !1058)
!1057 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1057, line: 81, size: 192, align: 64, elements: !1059)
!1059 = !{!1060, !1064, !1065}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1058, file: !1057, line: 82, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1057, line: 73, baseType: !1063)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1057, line: 73, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1058, file: !1057, line: 89, baseType: !1021, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1058, file: !1057, line: 93, baseType: !893, size: 32, align: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1017, file: !722, line: 473, baseType: !1067, size: 64, align: 64, offset: 2816)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1017, file: !722, line: 477, baseType: !893, size: 32, align: 32, offset: 2880)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1017, file: !722, line: 479, baseType: !1070, size: 64, align: 64, offset: 2944)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1083}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1073, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1073, file: !722, line: 203, baseType: !1021, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1073, file: !722, line: 204, baseType: !893, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1073, file: !722, line: 205, baseType: !1079, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1081, line: 86, baseType: !1082)
!1081 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1081, line: 86, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1073, file: !722, line: 206, baseType: !1055, size: 64, align: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1017, file: !722, line: 480, baseType: !893, size: 32, align: 32, offset: 3008)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1017, file: !722, line: 505, baseType: !893, size: 32, align: 32, offset: 3040)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1017, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1017, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1017, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1017, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1017, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1017, file: !722, line: 532, baseType: !1036, size: 64, align: 64, offset: 3264)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1017, file: !722, line: 539, baseType: !1036, size: 64, align: 64, offset: 3328)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1017, file: !722, line: 547, baseType: !1036, size: 64, align: 64, offset: 3392)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1017, file: !722, line: 554, baseType: !1079, size: 64, align: 64, offset: 3456)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1017, file: !722, line: 563, baseType: !893, size: 32, align: 32, offset: 3520)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1017, file: !722, line: 572, baseType: !893, size: 32, align: 32, offset: 3552)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1017, file: !722, line: 581, baseType: !893, size: 32, align: 32, offset: 3584)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1017, file: !722, line: 588, baseType: !1099, size: 64, align: 64, offset: 3648)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1017, file: !722, line: 593, baseType: !893, size: 32, align: 32, offset: 3712)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1017, file: !722, line: 596, baseType: !893, size: 32, align: 32, offset: 3744)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1017, file: !722, line: 599, baseType: !1055, size: 64, align: 64, offset: 3776)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1017, file: !722, line: 605, baseType: !1055, size: 64, align: 64, offset: 3840)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1017, file: !722, line: 616, baseType: !1055, size: 64, align: 64, offset: 3904)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1017, file: !722, line: 626, baseType: !1106, size: 64, align: 64, offset: 3968)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1107, line: 216, baseType: !931)
!1107 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1017, file: !722, line: 627, baseType: !1106, size: 64, align: 64, offset: 4032)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1017, file: !722, line: 628, baseType: !1106, size: 64, align: 64, offset: 4096)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1017, file: !722, line: 629, baseType: !1106, size: 64, align: 64, offset: 4160)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1017, file: !722, line: 645, baseType: !1055, size: 64, align: 64, offset: 4224)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1008, file: !1009, line: 161, baseType: !1113, size: 64, align: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1009, line: 117, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1009, line: 100, size: 832, align: 64, elements: !1116)
!1116 = !{!1117, !1124, !1125, !1126, !1127, !1128, !1130, !1131, !1132}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1115, file: !1009, line: 105, baseType: !1118, size: 256, align: 64)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 256, align: 64, elements: !1122)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1057, line: 238, baseType: !1121)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1057, line: 238, flags: DIFlagFwdDecl)
!1122 = !{!1123}
!1123 = !DISubrange(count: 4)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1115, file: !1009, line: 110, baseType: !893, size: 32, align: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1115, file: !1009, line: 111, baseType: !893, size: 32, align: 32, offset: 288)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1115, file: !1009, line: 111, baseType: !893, size: 32, align: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1115, file: !1009, line: 112, baseType: !1025, size: 256, align: 32, offset: 352)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1115, file: !1009, line: 113, baseType: !1129, size: 128, align: 32, offset: 608)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 128, align: 32, elements: !1122)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1115, file: !1009, line: 114, baseType: !893, size: 32, align: 32, offset: 736)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1115, file: !1009, line: 115, baseType: !893, size: 32, align: 32, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1115, file: !1009, line: 116, baseType: !893, size: 32, align: 32, offset: 800)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1008, file: !1009, line: 163, baseType: !946, size: 64, align: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1008, file: !1009, line: 165, baseType: !1135, size: 128, align: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1009, line: 122, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1009, line: 119, size: 128, align: 64, elements: !1137)
!1137 = !{!1138, !1162}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1136, file: !1009, line: 120, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1158, !1159, !1160, !1161}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1141, file: !14, line: 1451, baseType: !1055, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1141, file: !14, line: 1461, baseType: !1036, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1141, file: !14, line: 1467, baseType: !1036, size: 64, align: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !14, line: 1468, baseType: !1021, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !14, line: 1469, baseType: !893, size: 32, align: 32, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1141, file: !14, line: 1470, baseType: !893, size: 32, align: 32, offset: 288)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !14, line: 1474, baseType: !893, size: 32, align: 32, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1141, file: !14, line: 1479, baseType: !1151, size: 64, align: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !14, line: 1412, baseType: !1021, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !14, line: 1413, baseType: !893, size: 32, align: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1153, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1141, file: !14, line: 1480, baseType: !893, size: 32, align: 32, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1141, file: !14, line: 1486, baseType: !1036, size: 64, align: 64, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1141, file: !14, line: 1488, baseType: !1036, size: 64, align: 64, offset: 576)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1141, file: !14, line: 1497, baseType: !1036, size: 64, align: 64, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1136, file: !1009, line: 121, baseType: !1015, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1008, file: !1009, line: 166, baseType: !1164, size: 128, align: 64, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1009, line: 127, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1009, line: 124, size: 128, align: 64, elements: !1166)
!1166 = !{!1167, !1241}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1165, file: !1009, line: 125, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1198, !1202, !1203, !1238, !1239, !1240}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1171, file: !14, line: 5751, baseType: !936, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1171, file: !14, line: 5756, baseType: !1175, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1183, !1184, !1185, !1189, !1193, !1197}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1177, file: !14, line: 5797, baseType: !902, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1177, file: !14, line: 5804, baseType: !1181, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1177, file: !14, line: 5815, baseType: !936, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1177, file: !14, line: 5825, baseType: !893, size: 32, align: 32, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1177, file: !14, line: 5826, baseType: !1186, size: 64, align: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!893, !1169}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1177, file: !14, line: 5827, baseType: !1190, size: 64, align: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!893, !1169, !1139}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1177, file: !14, line: 5828, baseType: !1194, size: 64, align: 64, offset: 384)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{null, !1169}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1177, file: !14, line: 5829, baseType: !1194, size: 64, align: 64, offset: 448)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1171, file: !14, line: 5762, baseType: !1199, size: 64, align: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1201)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1171, file: !14, line: 5768, baseType: !946, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1171, file: !14, line: 5775, baseType: !1204, size: 64, align: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1206, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1206, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1206, file: !14, line: 3948, baseType: !1211, size: 32, align: 32, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !891, line: 51, baseType: !894)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1206, file: !14, line: 3958, baseType: !1021, size: 64, align: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1206, file: !14, line: 3962, baseType: !893, size: 32, align: 32, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1206, file: !14, line: 3968, baseType: !893, size: 32, align: 32, offset: 224)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1206, file: !14, line: 3973, baseType: !1036, size: 64, align: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1206, file: !14, line: 3986, baseType: !893, size: 32, align: 32, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1206, file: !14, line: 3999, baseType: !893, size: 32, align: 32, offset: 352)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1206, file: !14, line: 4004, baseType: !893, size: 32, align: 32, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1206, file: !14, line: 4005, baseType: !893, size: 32, align: 32, offset: 416)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1206, file: !14, line: 4010, baseType: !893, size: 32, align: 32, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1206, file: !14, line: 4011, baseType: !893, size: 32, align: 32, offset: 480)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1206, file: !14, line: 4020, baseType: !912, size: 64, align: 32, offset: 512)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1206, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1206, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1206, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1206, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1206, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1206, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1206, file: !14, line: 4039, baseType: !893, size: 32, align: 32, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1206, file: !14, line: 4046, baseType: !930, size: 64, align: 64, offset: 832)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1206, file: !14, line: 4050, baseType: !893, size: 32, align: 32, offset: 896)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1206, file: !14, line: 4054, baseType: !893, size: 32, align: 32, offset: 928)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1206, file: !14, line: 4061, baseType: !893, size: 32, align: 32, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1206, file: !14, line: 4065, baseType: !893, size: 32, align: 32, offset: 992)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1206, file: !14, line: 4073, baseType: !893, size: 32, align: 32, offset: 1024)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1206, file: !14, line: 4080, baseType: !893, size: 32, align: 32, offset: 1056)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1206, file: !14, line: 4084, baseType: !893, size: 32, align: 32, offset: 1088)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1171, file: !14, line: 5781, baseType: !1204, size: 64, align: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1171, file: !14, line: 5787, baseType: !912, size: 64, align: 32, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1171, file: !14, line: 5793, baseType: !912, size: 64, align: 32, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1165, file: !1009, line: 126, baseType: !893, size: 32, align: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1008, file: !1009, line: 172, baseType: !1139, size: 64, align: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1008, file: !1009, line: 177, baseType: !1021, size: 64, align: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1008, file: !1009, line: 178, baseType: !894, size: 32, align: 32, offset: 704)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1008, file: !1009, line: 180, baseType: !946, size: 64, align: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1008, file: !1009, line: 185, baseType: !893, size: 32, align: 32, offset: 832)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1008, file: !1009, line: 190, baseType: !946, size: 64, align: 64, offset: 896)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1008, file: !1009, line: 195, baseType: !893, size: 32, align: 32, offset: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1008, file: !1009, line: 200, baseType: !1139, size: 64, align: 64, offset: 1024)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1008, file: !1009, line: 201, baseType: !893, size: 32, align: 32, offset: 1088)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1008, file: !1009, line: 202, baseType: !1015, size: 64, align: 64, offset: 1152)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1008, file: !1009, line: 203, baseType: !893, size: 32, align: 32, offset: 1216)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1008, file: !1009, line: 205, baseType: !893, size: 32, align: 32, offset: 1248)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1008, file: !1009, line: 206, baseType: !893, size: 32, align: 32, offset: 1280)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1008, file: !1009, line: 209, baseType: !1106, size: 64, align: 64, offset: 1344)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1008, file: !1009, line: 212, baseType: !1106, size: 64, align: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1008, file: !1009, line: 213, baseType: !1015, size: 64, align: 64, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1008, file: !1009, line: 215, baseType: !893, size: 32, align: 32, offset: 1536)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1008, file: !1009, line: 217, baseType: !893, size: 32, align: 32, offset: 1568)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1008, file: !1009, line: 220, baseType: !893, size: 32, align: 32, offset: 1600)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !995, file: !14, line: 1598, baseType: !946, size: 64, align: 64, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !995, file: !14, line: 1606, baseType: !1036, size: 64, align: 64, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !995, file: !14, line: 1614, baseType: !893, size: 32, align: 32, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !995, file: !14, line: 1622, baseType: !893, size: 32, align: 32, offset: 544)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !995, file: !14, line: 1628, baseType: !893, size: 32, align: 32, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !995, file: !14, line: 1636, baseType: !893, size: 32, align: 32, offset: 608)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !995, file: !14, line: 1643, baseType: !893, size: 32, align: 32, offset: 640)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !995, file: !14, line: 1657, baseType: !1021, size: 64, align: 64, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !995, file: !14, line: 1658, baseType: !893, size: 32, align: 32, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !995, file: !14, line: 1679, baseType: !912, size: 64, align: 32, offset: 800)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !995, file: !14, line: 1688, baseType: !893, size: 32, align: 32, offset: 864)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !995, file: !14, line: 1712, baseType: !893, size: 32, align: 32, offset: 896)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !995, file: !14, line: 1729, baseType: !893, size: 32, align: 32, offset: 928)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !995, file: !14, line: 1729, baseType: !893, size: 32, align: 32, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !995, file: !14, line: 1744, baseType: !893, size: 32, align: 32, offset: 992)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !995, file: !14, line: 1744, baseType: !893, size: 32, align: 32, offset: 1024)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !995, file: !14, line: 1751, baseType: !893, size: 32, align: 32, offset: 1056)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !995, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !995, file: !14, line: 1791, baseType: !1280, size: 64, align: 64, offset: 1152)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !1283, !1284, !1286, !893, !893, !893}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !995, file: !14, line: 1808, baseType: !1288, size: 64, align: 64, offset: 1216)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!473, !1283, !919}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !995, file: !14, line: 1816, baseType: !893, size: 32, align: 32, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !995, file: !14, line: 1825, baseType: !1293, size: 32, align: 32, offset: 1312)
!1293 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !995, file: !14, line: 1830, baseType: !893, size: 32, align: 32, offset: 1344)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !995, file: !14, line: 1838, baseType: !1293, size: 32, align: 32, offset: 1376)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !995, file: !14, line: 1846, baseType: !893, size: 32, align: 32, offset: 1408)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !995, file: !14, line: 1851, baseType: !893, size: 32, align: 32, offset: 1440)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !995, file: !14, line: 1861, baseType: !1293, size: 32, align: 32, offset: 1472)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !995, file: !14, line: 1868, baseType: !1293, size: 32, align: 32, offset: 1504)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !995, file: !14, line: 1875, baseType: !1293, size: 32, align: 32, offset: 1536)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !995, file: !14, line: 1882, baseType: !1293, size: 32, align: 32, offset: 1568)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !995, file: !14, line: 1889, baseType: !1293, size: 32, align: 32, offset: 1600)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !995, file: !14, line: 1896, baseType: !1293, size: 32, align: 32, offset: 1632)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !995, file: !14, line: 1903, baseType: !1293, size: 32, align: 32, offset: 1664)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !995, file: !14, line: 1910, baseType: !893, size: 32, align: 32, offset: 1696)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !995, file: !14, line: 1915, baseType: !893, size: 32, align: 32, offset: 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !995, file: !14, line: 1926, baseType: !1286, size: 64, align: 64, offset: 1792)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !995, file: !14, line: 1935, baseType: !912, size: 64, align: 32, offset: 1856)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !995, file: !14, line: 1942, baseType: !893, size: 32, align: 32, offset: 1920)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !995, file: !14, line: 1948, baseType: !893, size: 32, align: 32, offset: 1952)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !995, file: !14, line: 1954, baseType: !893, size: 32, align: 32, offset: 1984)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !995, file: !14, line: 1960, baseType: !893, size: 32, align: 32, offset: 2016)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !995, file: !14, line: 1984, baseType: !893, size: 32, align: 32, offset: 2048)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !995, file: !14, line: 1991, baseType: !893, size: 32, align: 32, offset: 2080)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !995, file: !14, line: 1996, baseType: !893, size: 32, align: 32, offset: 2112)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !995, file: !14, line: 2004, baseType: !893, size: 32, align: 32, offset: 2144)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !995, file: !14, line: 2011, baseType: !893, size: 32, align: 32, offset: 2176)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !995, file: !14, line: 2018, baseType: !893, size: 32, align: 32, offset: 2208)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !995, file: !14, line: 2027, baseType: !893, size: 32, align: 32, offset: 2240)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !995, file: !14, line: 2034, baseType: !893, size: 32, align: 32, offset: 2272)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !995, file: !14, line: 2044, baseType: !893, size: 32, align: 32, offset: 2304)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !995, file: !14, line: 2054, baseType: !1323, size: 64, align: 64, offset: 2368)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !891, line: 49, baseType: !1325)
!1325 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !995, file: !14, line: 2061, baseType: !1323, size: 64, align: 64, offset: 2432)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !995, file: !14, line: 2066, baseType: !893, size: 32, align: 32, offset: 2496)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !995, file: !14, line: 2070, baseType: !893, size: 32, align: 32, offset: 2528)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !995, file: !14, line: 2078, baseType: !893, size: 32, align: 32, offset: 2560)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !995, file: !14, line: 2085, baseType: !893, size: 32, align: 32, offset: 2592)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !995, file: !14, line: 2092, baseType: !893, size: 32, align: 32, offset: 2624)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !995, file: !14, line: 2099, baseType: !893, size: 32, align: 32, offset: 2656)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !995, file: !14, line: 2106, baseType: !893, size: 32, align: 32, offset: 2688)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !995, file: !14, line: 2113, baseType: !893, size: 32, align: 32, offset: 2720)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !995, file: !14, line: 2120, baseType: !893, size: 32, align: 32, offset: 2752)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !995, file: !14, line: 2125, baseType: !893, size: 32, align: 32, offset: 2784)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !995, file: !14, line: 2133, baseType: !893, size: 32, align: 32, offset: 2816)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !995, file: !14, line: 2140, baseType: !893, size: 32, align: 32, offset: 2848)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !995, file: !14, line: 2145, baseType: !893, size: 32, align: 32, offset: 2880)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !995, file: !14, line: 2153, baseType: !893, size: 32, align: 32, offset: 2912)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !995, file: !14, line: 2158, baseType: !893, size: 32, align: 32, offset: 2944)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !995, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !995, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !995, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !995, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !995, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !995, file: !14, line: 2203, baseType: !893, size: 32, align: 32, offset: 3136)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !995, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !995, file: !14, line: 2212, baseType: !893, size: 32, align: 32, offset: 3200)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !995, file: !14, line: 2213, baseType: !893, size: 32, align: 32, offset: 3232)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !995, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !995, file: !14, line: 2232, baseType: !893, size: 32, align: 32, offset: 3296)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !995, file: !14, line: 2243, baseType: !893, size: 32, align: 32, offset: 3328)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !995, file: !14, line: 2249, baseType: !893, size: 32, align: 32, offset: 3360)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !995, file: !14, line: 2256, baseType: !893, size: 32, align: 32, offset: 3392)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !995, file: !14, line: 2263, baseType: !930, size: 64, align: 64, offset: 3456)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !995, file: !14, line: 2270, baseType: !930, size: 64, align: 64, offset: 3520)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !995, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !995, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !995, file: !14, line: 2367, baseType: !1361, size: 64, align: 64, offset: 3648)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!893, !1283, !1015, !893}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !995, file: !14, line: 2383, baseType: !893, size: 32, align: 32, offset: 3712)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !995, file: !14, line: 2386, baseType: !1293, size: 32, align: 32, offset: 3744)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !995, file: !14, line: 2387, baseType: !1293, size: 32, align: 32, offset: 3776)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !995, file: !14, line: 2394, baseType: !893, size: 32, align: 32, offset: 3808)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !995, file: !14, line: 2401, baseType: !893, size: 32, align: 32, offset: 3840)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !995, file: !14, line: 2408, baseType: !893, size: 32, align: 32, offset: 3872)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !995, file: !14, line: 2415, baseType: !893, size: 32, align: 32, offset: 3904)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !995, file: !14, line: 2422, baseType: !893, size: 32, align: 32, offset: 3936)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !995, file: !14, line: 2423, baseType: !1373, size: 64, align: 64, offset: 3968)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1375, file: !14, line: 827, baseType: !893, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1375, file: !14, line: 828, baseType: !893, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1375, file: !14, line: 829, baseType: !893, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1375, file: !14, line: 830, baseType: !1293, size: 32, align: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !995, file: !14, line: 2430, baseType: !1036, size: 64, align: 64, offset: 4032)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !995, file: !14, line: 2437, baseType: !1036, size: 64, align: 64, offset: 4096)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !995, file: !14, line: 2444, baseType: !1293, size: 32, align: 32, offset: 4160)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !995, file: !14, line: 2451, baseType: !1293, size: 32, align: 32, offset: 4192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !995, file: !14, line: 2458, baseType: !893, size: 32, align: 32, offset: 4224)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !995, file: !14, line: 2469, baseType: !893, size: 32, align: 32, offset: 4256)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !995, file: !14, line: 2475, baseType: !893, size: 32, align: 32, offset: 4288)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !995, file: !14, line: 2481, baseType: !893, size: 32, align: 32, offset: 4320)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !995, file: !14, line: 2485, baseType: !893, size: 32, align: 32, offset: 4352)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !995, file: !14, line: 2489, baseType: !893, size: 32, align: 32, offset: 4384)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !995, file: !14, line: 2493, baseType: !893, size: 32, align: 32, offset: 4416)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !995, file: !14, line: 2501, baseType: !893, size: 32, align: 32, offset: 4448)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !995, file: !14, line: 2506, baseType: !893, size: 32, align: 32, offset: 4480)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !995, file: !14, line: 2510, baseType: !893, size: 32, align: 32, offset: 4512)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !995, file: !14, line: 2514, baseType: !1036, size: 64, align: 64, offset: 4544)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !995, file: !14, line: 2528, baseType: !1397, size: 64, align: 64, offset: 4608)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{null, !1283, !946, !893, !893}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !995, file: !14, line: 2534, baseType: !893, size: 32, align: 32, offset: 4672)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !995, file: !14, line: 2545, baseType: !893, size: 32, align: 32, offset: 4704)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !995, file: !14, line: 2547, baseType: !893, size: 32, align: 32, offset: 4736)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !995, file: !14, line: 2549, baseType: !893, size: 32, align: 32, offset: 4768)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !995, file: !14, line: 2551, baseType: !893, size: 32, align: 32, offset: 4800)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !995, file: !14, line: 2553, baseType: !893, size: 32, align: 32, offset: 4832)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !995, file: !14, line: 2555, baseType: !893, size: 32, align: 32, offset: 4864)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !995, file: !14, line: 2557, baseType: !893, size: 32, align: 32, offset: 4896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !995, file: !14, line: 2559, baseType: !893, size: 32, align: 32, offset: 4928)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !995, file: !14, line: 2563, baseType: !893, size: 32, align: 32, offset: 4960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !995, file: !14, line: 2571, baseType: !1411, size: 64, align: 64, offset: 4992)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !995, file: !14, line: 2579, baseType: !1411, size: 64, align: 64, offset: 5056)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !995, file: !14, line: 2586, baseType: !893, size: 32, align: 32, offset: 5120)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !995, file: !14, line: 2615, baseType: !893, size: 32, align: 32, offset: 5152)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !995, file: !14, line: 2627, baseType: !893, size: 32, align: 32, offset: 5184)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !995, file: !14, line: 2637, baseType: !893, size: 32, align: 32, offset: 5216)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !995, file: !14, line: 2681, baseType: !893, size: 32, align: 32, offset: 5248)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !995, file: !14, line: 2709, baseType: !1036, size: 64, align: 64, offset: 5312)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !995, file: !14, line: 2716, baseType: !1420, size: 64, align: 64, offset: 5376)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1423)
!1423 = !{!1424, !1425, !1426, !1427, !1428, !1429, !1433, !1439, !1443, !1444, !1445, !1446, !1452, !1453, !1454, !1455, !1456}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1422, file: !14, line: 3642, baseType: !902, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1422, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1422, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1422, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1422, file: !14, line: 3669, baseType: !893, size: 32, align: 32, offset: 160)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1422, file: !14, line: 3682, baseType: !1430, size: 64, align: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!893, !993, !1015}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1422, file: !14, line: 3698, baseType: !1434, size: 64, align: 64, offset: 256)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!893, !993, !1437, !1211}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1422, file: !14, line: 3712, baseType: !1440, size: 64, align: 64, offset: 320)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!893, !993, !893, !1437, !1211}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1422, file: !14, line: 3726, baseType: !1434, size: 64, align: 64, offset: 384)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1422, file: !14, line: 3737, baseType: !990, size: 64, align: 64, offset: 448)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1422, file: !14, line: 3746, baseType: !893, size: 32, align: 32, offset: 512)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1422, file: !14, line: 3757, baseType: !1447, size: 64, align: 64, offset: 576)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{null, !1450}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1422, file: !14, line: 3766, baseType: !990, size: 64, align: 64, offset: 640)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1422, file: !14, line: 3774, baseType: !990, size: 64, align: 64, offset: 704)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1422, file: !14, line: 3780, baseType: !893, size: 32, align: 32, offset: 768)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1422, file: !14, line: 3785, baseType: !893, size: 32, align: 32, offset: 800)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1422, file: !14, line: 3795, baseType: !1457, size: 64, align: 64, offset: 832)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!893, !993, !1055}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !995, file: !14, line: 2728, baseType: !946, size: 64, align: 64, offset: 5440)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !995, file: !14, line: 2735, baseType: !1045, size: 512, align: 64, offset: 5504)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !995, file: !14, line: 2742, baseType: !893, size: 32, align: 32, offset: 6016)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !995, file: !14, line: 2755, baseType: !893, size: 32, align: 32, offset: 6048)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !995, file: !14, line: 2776, baseType: !893, size: 32, align: 32, offset: 6080)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !995, file: !14, line: 2783, baseType: !893, size: 32, align: 32, offset: 6112)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !995, file: !14, line: 2791, baseType: !893, size: 32, align: 32, offset: 6144)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !995, file: !14, line: 2802, baseType: !1015, size: 64, align: 64, offset: 6208)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !995, file: !14, line: 2811, baseType: !893, size: 32, align: 32, offset: 6272)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !995, file: !14, line: 2821, baseType: !893, size: 32, align: 32, offset: 6304)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !995, file: !14, line: 2830, baseType: !893, size: 32, align: 32, offset: 6336)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !995, file: !14, line: 2840, baseType: !893, size: 32, align: 32, offset: 6368)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !995, file: !14, line: 2851, baseType: !1473, size: 64, align: 64, offset: 6400)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!893, !1283, !1476, !946, !1286, !893, !893}
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!893, !1283, !946}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !995, file: !14, line: 2871, baseType: !1480, size: 64, align: 64, offset: 6464)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!893, !1283, !1483, !946, !1286, !893}
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!893, !1283, !946, !893, !893}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !995, file: !14, line: 2878, baseType: !893, size: 32, align: 32, offset: 6528)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !995, file: !14, line: 2885, baseType: !893, size: 32, align: 32, offset: 6560)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !995, file: !14, line: 3005, baseType: !893, size: 32, align: 32, offset: 6592)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !995, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !995, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !995, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !995, file: !14, line: 3037, baseType: !1021, size: 64, align: 64, offset: 6720)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !995, file: !14, line: 3038, baseType: !893, size: 32, align: 32, offset: 6784)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !995, file: !14, line: 3050, baseType: !930, size: 64, align: 64, offset: 6848)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !995, file: !14, line: 3065, baseType: !893, size: 32, align: 32, offset: 6912)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !995, file: !14, line: 3083, baseType: !893, size: 32, align: 32, offset: 6944)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !995, file: !14, line: 3092, baseType: !912, size: 64, align: 32, offset: 6976)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !995, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !995, file: !14, line: 3106, baseType: !912, size: 64, align: 32, offset: 7072)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !995, file: !14, line: 3113, baseType: !1501, size: 64, align: 64, offset: 7168)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1503)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1504)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1509, !1510, !1511, !1514}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1504, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1504, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1504, file: !14, line: 720, baseType: !902, size: 64, align: 64, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1504, file: !14, line: 724, baseType: !902, size: 64, align: 64, offset: 128)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1504, file: !14, line: 728, baseType: !893, size: 32, align: 32, offset: 192)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1504, file: !14, line: 734, baseType: !1512, size: 64, align: 64, offset: 256)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1504, file: !14, line: 739, baseType: !1515, size: 64, align: 64, offset: 320)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !995, file: !14, line: 3129, baseType: !1036, size: 64, align: 64, offset: 7232)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !995, file: !14, line: 3130, baseType: !1036, size: 64, align: 64, offset: 7296)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !995, file: !14, line: 3131, baseType: !1036, size: 64, align: 64, offset: 7360)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !995, file: !14, line: 3132, baseType: !1036, size: 64, align: 64, offset: 7424)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !995, file: !14, line: 3139, baseType: !1411, size: 64, align: 64, offset: 7488)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !995, file: !14, line: 3147, baseType: !893, size: 32, align: 32, offset: 7552)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !995, file: !14, line: 3165, baseType: !893, size: 32, align: 32, offset: 7584)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !995, file: !14, line: 3172, baseType: !893, size: 32, align: 32, offset: 7616)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !995, file: !14, line: 3180, baseType: !893, size: 32, align: 32, offset: 7648)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !995, file: !14, line: 3191, baseType: !1323, size: 64, align: 64, offset: 7680)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !995, file: !14, line: 3199, baseType: !1021, size: 64, align: 64, offset: 7744)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !995, file: !14, line: 3207, baseType: !1411, size: 64, align: 64, offset: 7808)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !995, file: !14, line: 3214, baseType: !894, size: 32, align: 32, offset: 7872)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !995, file: !14, line: 3224, baseType: !1151, size: 64, align: 64, offset: 7936)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !995, file: !14, line: 3225, baseType: !893, size: 32, align: 32, offset: 8000)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !995, file: !14, line: 3249, baseType: !1055, size: 64, align: 64, offset: 8064)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !995, file: !14, line: 3256, baseType: !893, size: 32, align: 32, offset: 8128)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !995, file: !14, line: 3271, baseType: !893, size: 32, align: 32, offset: 8160)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !995, file: !14, line: 3279, baseType: !1036, size: 64, align: 64, offset: 8192)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !995, file: !14, line: 3301, baseType: !1055, size: 64, align: 64, offset: 8256)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !995, file: !14, line: 3310, baseType: !893, size: 32, align: 32, offset: 8320)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !995, file: !14, line: 3337, baseType: !893, size: 32, align: 32, offset: 8352)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !995, file: !14, line: 3351, baseType: !893, size: 32, align: 32, offset: 8384)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !995, file: !14, line: 3359, baseType: !893, size: 32, align: 32, offset: 8416)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !899, file: !14, line: 3535, baseType: !1542, size: 64, align: 64, offset: 1024)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!893, !993, !1545}
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !899, file: !14, line: 3541, baseType: !1548, size: 64, align: 64, offset: 1088)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1550)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1551)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1009, line: 223, size: 128, align: 64, elements: !1552)
!1552 = !{!1553, !1554}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1551, file: !1009, line: 224, baseType: !1437, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1551, file: !1009, line: 225, baseType: !1437, size: 64, align: 64, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !899, file: !14, line: 3549, baseType: !1556, size: 64, align: 64, offset: 1152)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{null, !988}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !899, file: !14, line: 3551, baseType: !990, size: 64, align: 64, offset: 1216)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !899, file: !14, line: 3552, baseType: !1561, size: 64, align: 64, offset: 1280)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!893, !993, !1021, !893, !1564}
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571, !1572, !1596}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1566, file: !14, line: 3921, baseType: !1324, size: 16, align: 16)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1566, file: !14, line: 3922, baseType: !1211, size: 32, align: 32, offset: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1566, file: !14, line: 3923, baseType: !1211, size: 32, align: 32, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1566, file: !14, line: 3924, baseType: !894, size: 32, align: 32, offset: 96)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1566, file: !14, line: 3925, baseType: !1573, size: 64, align: 64, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1577)
!1577 = !{!1578, !1579, !1580, !1581, !1582, !1583, !1589, !1591, !1592, !1593, !1594, !1595}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1576, file: !14, line: 3886, baseType: !893, size: 32, align: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1576, file: !14, line: 3887, baseType: !893, size: 32, align: 32, offset: 32)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1576, file: !14, line: 3888, baseType: !893, size: 32, align: 32, offset: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1576, file: !14, line: 3889, baseType: !893, size: 32, align: 32, offset: 96)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1576, file: !14, line: 3890, baseType: !893, size: 32, align: 32, offset: 128)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1576, file: !14, line: 3897, baseType: !1584, size: 768, align: 64, offset: 192)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1586)
!1586 = !{!1587, !1588}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1585, file: !14, line: 3855, baseType: !1020, size: 512, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1585, file: !14, line: 3857, baseType: !1025, size: 256, align: 32, offset: 512)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1576, file: !14, line: 3903, baseType: !1590, size: 256, align: 64, offset: 960)
!1590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 256, align: 64, elements: !1122)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1576, file: !14, line: 3904, baseType: !1129, size: 128, align: 32, offset: 1216)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1576, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1576, file: !14, line: 3908, baseType: !1411, size: 64, align: 64, offset: 1408)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1576, file: !14, line: 3915, baseType: !1411, size: 64, align: 64, offset: 1472)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1576, file: !14, line: 3917, baseType: !893, size: 32, align: 32, offset: 1536)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1566, file: !14, line: 3926, baseType: !1036, size: 64, align: 64, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !899, file: !14, line: 3564, baseType: !1598, size: 64, align: 64, offset: 1344)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!893, !993, !1139, !1284, !1286}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !899, file: !14, line: 3566, baseType: !1602, size: 64, align: 64, offset: 1408)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{!893, !993, !946, !1286, !1139}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !899, file: !14, line: 3567, baseType: !990, size: 64, align: 64, offset: 1472)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !899, file: !14, line: 3576, baseType: !1607, size: 64, align: 64, offset: 1536)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!893, !993, !1284}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !899, file: !14, line: 3577, baseType: !1611, size: 64, align: 64, offset: 1600)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!893, !993, !1139}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !899, file: !14, line: 3584, baseType: !1430, size: 64, align: 64, offset: 1664)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !899, file: !14, line: 3589, baseType: !1616, size: 64, align: 64, offset: 1728)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !993}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !899, file: !14, line: 3594, baseType: !893, size: 32, align: 32, offset: 1792)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !899, file: !14, line: 3600, baseType: !902, size: 64, align: 64, offset: 1856)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !899, file: !14, line: 3609, baseType: !1622, size: 64, align: 64, offset: 1920)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1625)
!1625 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1626 = !{i32 2, !"Dwarf Version", i32 4}
!1627 = !{i32 2, !"Debug Info Version", i32 3}
!1628 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1629 = distinct !DISubprogram(name: "aura_decode_init", scope: !897, file: !897, line: 30, type: !991, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1630)
!1630 = !{}
!1631 = !DILocalVariable(name: "avctx", arg: 1, scope: !1629, file: !897, line: 30, type: !993)
!1632 = !DIExpression()
!1633 = !DILocation(line: 30, column: 67, scope: !1629)
!1634 = !DILocation(line: 33, column: 9, scope: !1635)
!1635 = distinct !DILexicalBlock(scope: !1629, file: !897, line: 33, column: 9)
!1636 = !DILocation(line: 33, column: 16, scope: !1635)
!1637 = !DILocation(line: 33, column: 22, scope: !1635)
!1638 = !DILocation(line: 33, column: 9, scope: !1629)
!1639 = !DILocation(line: 34, column: 9, scope: !1635)
!1640 = !DILocation(line: 35, column: 5, scope: !1629)
!1641 = !DILocation(line: 35, column: 12, scope: !1629)
!1642 = !DILocation(line: 35, column: 20, scope: !1629)
!1643 = !DILocation(line: 37, column: 5, scope: !1629)
!1644 = !DILocation(line: 38, column: 1, scope: !1629)
!1645 = distinct !DISubprogram(name: "aura_decode_frame", scope: !897, file: !897, line: 40, type: !1603, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1630)
