; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dec_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dec_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!991 = !DIEnumerator(name: "AC3_DMIXMOD_NOTINDICATED", value: 0)
!992 = !DIEnumerator(name: "AC3_DMIXMOD_LTRT", value: 1)
!993 = !DIEnumerator(name: "AC3_DMIXMOD_LORO", value: 2)
!994 = !DIEnumerator(name: "AC3_DMIXMOD_DPLII", value: 3)
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AC3DolbySurroundEXMode", file: !961, line: 143, size: 32, align: 32, elements: !996)
!996 = !{!997, !998, !999, !1000}
!997 = !DIEnumerator(name: "AC3_DSUREXMOD_NOTINDICATED", value: 0)
!998 = !DIEnumerator(name: "AC3_DSUREXMOD_OFF", value: 1)
!999 = !DIEnumerator(name: "AC3_DSUREXMOD_ON", value: 2)
!1000 = !DIEnumerator(name: "AC3_DSUREXMOD_PLIIZ", value: 3)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !961, line: 115, size: 32, align: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006}
!1003 = !DIEnumerator(name: "DBA_REUSE", value: 0)
!1004 = !DIEnumerator(name: "DBA_NEW", value: 1)
!1005 = !DIEnumerator(name: "DBA_NONE", value: 2)
!1006 = !DIEnumerator(name: "DBA_RESERVED", value: 3)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 50, size: 32, align: 32, elements: !1009)
!1008 = !DIFile(filename: "libavcodec/eac3dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1009 = !{!1010, !1011, !1012, !1013}
!1010 = !DIEnumerator(name: "EAC3_GAQ_NO", value: 0)
!1011 = !DIEnumerator(name: "EAC3_GAQ_12", value: 1)
!1012 = !DIEnumerator(name: "EAC3_GAQ_14", value: 2)
!1013 = !DIEnumerator(name: "EAC3_GAQ_124", value: 3)
!1014 = !{!1015, !1016, !1017, !1026, !1027, !1029, !1030, !1034, !1035, !1041, !1040, !1043, !1045, !1047}
!1015 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1016 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1020, line: 222, size: 16, align: 8, elements: !1021)
!1020 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1019, file: !1020, line: 222, baseType: !1023, size: 16, align: 16)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1024, line: 49, baseType: !1025)
!1024 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1025 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORTFLOAT", file: !961, line: 78, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1024, line: 37, baseType: !1033)
!1033 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1034 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1020, line: 221, size: 32, align: 8, elements: !1038)
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1037, file: !1020, line: 221, baseType: !1040, size: 32, align: 32)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1024, line: 51, baseType: !1016)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1024, line: 48, baseType: !1042)
!1042 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1024, line: 40, baseType: !1044)
!1044 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1024, line: 55, baseType: !1046)
!1046 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1024, line: 38, baseType: !1015)
!1048 = !{!1049, !1801, !1802, !1806, !1812, !1816, !1818, !1822, !1823, !1827, !1832, !1836, !1838, !1840}
!1049 = distinct !DIGlobalVariable(name: "ff_ac3_fixed_decoder", scope: !0, file: !1050, line: 184, type: !1051, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_ac3_fixed_decoder)
!1050 = !DIFile(filename: "libavcodec/ac3dec_fixed.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1053)
!1053 = !{!1054, !1058, !1059, !1060, !1061, !1062, !1071, !1074, !1077, !1080, !1083, !1084, !1157, !1165, !1166, !1167, !1169, !1716, !1722, !1730, !1734, !1735, !1772, !1776, !1780, !1781, !1785, !1789, !1790, !1794, !1795, !1796}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1052, file: !14, line: 3475, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1052, file: !14, line: 3480, baseType: !1055, size: 64, align: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1052, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1052, file: !14, line: 3487, baseType: !1015, size: 32, align: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1052, file: !14, line: 3488, baseType: !1063, size: 64, align: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1066, line: 61, baseType: !1067)
!1066 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1066, line: 58, size: 64, align: 32, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1067, file: !1066, line: 59, baseType: !1015, size: 32, align: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1067, file: !1066, line: 60, baseType: !1015, size: 32, align: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1052, file: !14, line: 3489, baseType: !1072, size: 64, align: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1052, file: !14, line: 3490, baseType: !1075, size: 64, align: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1052, file: !14, line: 3491, baseType: !1078, size: 64, align: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1052, file: !14, line: 3492, baseType: !1081, size: 64, align: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1052, file: !14, line: 3493, baseType: !1041, size: 8, align: 8, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1052, file: !14, line: 3494, baseType: !1085, size: 64, align: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1095, !1116, !1117, !1118, !1119, !1123, !1129, !1131, !1135}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1088, file: !713, line: 72, baseType: !1055, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1088, file: !713, line: 78, baseType: !1092, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!1055, !1029}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1088, file: !713, line: 85, baseType: !1096, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1112, !1113, !1114, !1115}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1098, file: !691, line: 247, baseType: !1055, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1098, file: !691, line: 253, baseType: !1055, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1098, file: !691, line: 259, baseType: !1015, size: 32, align: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1098, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1098, file: !691, line: 271, baseType: !1105, size: 64, align: 64, offset: 192)
!1105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1098, file: !691, line: 265, size: 64, align: 64, elements: !1106)
!1106 = !{!1107, !1108, !1110, !1111}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1105, file: !691, line: 266, baseType: !1043, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1105, file: !691, line: 267, baseType: !1109, size: 64, align: 64)
!1109 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1105, file: !691, line: 268, baseType: !1055, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1105, file: !691, line: 270, baseType: !1065, size: 64, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1098, file: !691, line: 272, baseType: !1109, size: 64, align: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1098, file: !691, line: 273, baseType: !1109, size: 64, align: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1098, file: !691, line: 275, baseType: !1015, size: 32, align: 32, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1098, file: !691, line: 300, baseType: !1055, size: 64, align: 64, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1088, file: !713, line: 93, baseType: !1015, size: 32, align: 32, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1088, file: !713, line: 99, baseType: !1015, size: 32, align: 32, offset: 224)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1088, file: !713, line: 108, baseType: !1015, size: 32, align: 32, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1088, file: !713, line: 113, baseType: !1120, size: 64, align: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!1029, !1029, !1029}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1088, file: !713, line: 123, baseType: !1124, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!1127, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1088, file: !713, line: 130, baseType: !1130, size: 32, align: 32, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1088, file: !713, line: 136, baseType: !1132, size: 64, align: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!1130, !1029}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1088, file: !713, line: 142, baseType: !1136, size: 64, align: 64, offset: 576)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!1015, !1139, !1029, !1055, !1015}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1142)
!1142 = !{!1143, !1155, !1156}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1141, file: !691, line: 360, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1147, file: !691, line: 307, baseType: !1055, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1147, file: !691, line: 313, baseType: !1109, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1147, file: !691, line: 313, baseType: !1109, size: 64, align: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1147, file: !691, line: 318, baseType: !1109, size: 64, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1147, file: !691, line: 318, baseType: !1109, size: 64, align: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1147, file: !691, line: 323, baseType: !1015, size: 32, align: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1141, file: !691, line: 364, baseType: !1015, size: 32, align: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1141, file: !691, line: 368, baseType: !1015, size: 32, align: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1052, file: !14, line: 3495, baseType: !1158, size: 64, align: 64, offset: 704)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1162)
!1162 = !{!1163, !1164}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1161, file: !14, line: 3402, baseType: !1015, size: 32, align: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1161, file: !14, line: 3403, baseType: !1055, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1052, file: !14, line: 3507, baseType: !1055, size: 64, align: 64, offset: 768)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1052, file: !14, line: 3516, baseType: !1015, size: 32, align: 32, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !14, line: 3517, baseType: !1168, size: 64, align: 64, offset: 896)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1052, file: !14, line: 3527, baseType: !1170, size: 64, align: 64, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!1015, !1173}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1183, !1184, !1185, !1186, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1466, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1654, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1175, file: !14, line: 1561, baseType: !1085, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1175, file: !14, line: 1562, baseType: !1015, size: 32, align: 32, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1175, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1175, file: !14, line: 1565, baseType: !1181, size: 64, align: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1175, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1175, file: !14, line: 1581, baseType: !1016, size: 32, align: 32, offset: 224)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1175, file: !14, line: 1583, baseType: !1029, size: 64, align: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1175, file: !14, line: 1591, baseType: !1187, size: 64, align: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1189, line: 129, size: 1664, align: 64, elements: !1190)
!1189 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1190 = !{!1191, !1192, !1193, !1194, !1292, !1313, !1314, !1343, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1188, file: !1189, line: 136, baseType: !1015, size: 32, align: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1188, file: !1189, line: 151, baseType: !1015, size: 32, align: 32, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1188, file: !1189, line: 157, baseType: !1015, size: 32, align: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1188, file: !1189, line: 159, baseType: !1195, size: 64, align: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1198)
!1198 = !{!1199, !1204, !1206, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1244, !1246, !1247, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1280, !1281, !1282, !1283, !1284, !1285, !1288, !1289, !1290, !1291}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !744, line: 282, baseType: !1200, size: 512, align: 64)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 512, align: 64, elements: !1202)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1202 = !{!1203}
!1203 = !DISubrange(count: 8)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1197, file: !744, line: 299, baseType: !1205, size: 256, align: 32, offset: 512)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 256, align: 32, elements: !1202)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1197, file: !744, line: 315, baseType: !1207, size: 64, align: 64, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1197, file: !744, line: 326, baseType: !1015, size: 32, align: 32, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1197, file: !744, line: 326, baseType: !1015, size: 32, align: 32, offset: 864)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1197, file: !744, line: 334, baseType: !1015, size: 32, align: 32, offset: 896)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1197, file: !744, line: 341, baseType: !1015, size: 32, align: 32, offset: 928)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1197, file: !744, line: 346, baseType: !1015, size: 32, align: 32, offset: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1197, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1197, file: !744, line: 356, baseType: !1065, size: 64, align: 32, offset: 1024)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1197, file: !744, line: 361, baseType: !1043, size: 64, align: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1197, file: !744, line: 369, baseType: !1043, size: 64, align: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1197, file: !744, line: 377, baseType: !1043, size: 64, align: 64, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1197, file: !744, line: 382, baseType: !1015, size: 32, align: 32, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1197, file: !744, line: 386, baseType: !1015, size: 32, align: 32, offset: 1312)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1197, file: !744, line: 391, baseType: !1015, size: 32, align: 32, offset: 1344)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1197, file: !744, line: 396, baseType: !1029, size: 64, align: 64, offset: 1408)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1197, file: !744, line: 403, baseType: !1223, size: 512, align: 64, offset: 1472)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 512, align: 64, elements: !1202)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1197, file: !744, line: 410, baseType: !1015, size: 32, align: 32, offset: 1984)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1197, file: !744, line: 415, baseType: !1015, size: 32, align: 32, offset: 2016)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1197, file: !744, line: 420, baseType: !1015, size: 32, align: 32, offset: 2048)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1197, file: !744, line: 425, baseType: !1015, size: 32, align: 32, offset: 2080)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1197, file: !744, line: 435, baseType: !1043, size: 64, align: 64, offset: 2112)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1197, file: !744, line: 440, baseType: !1015, size: 32, align: 32, offset: 2176)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1197, file: !744, line: 445, baseType: !1045, size: 64, align: 64, offset: 2240)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1197, file: !744, line: 459, baseType: !1232, size: 512, align: 64, offset: 2304)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 512, align: 64, elements: !1202)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1235, line: 94, baseType: !1236)
!1235 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1235, line: 81, size: 192, align: 64, elements: !1237)
!1237 = !{!1238, !1242, !1243}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1236, file: !1235, line: 82, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1235, line: 73, baseType: !1241)
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1235, line: 73, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1236, file: !1235, line: 89, baseType: !1201, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1236, file: !1235, line: 93, baseType: !1015, size: 32, align: 32, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1197, file: !744, line: 473, baseType: !1245, size: 64, align: 64, offset: 2816)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1197, file: !744, line: 477, baseType: !1015, size: 32, align: 32, offset: 2880)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1197, file: !744, line: 479, baseType: !1248, size: 64, align: 64, offset: 2944)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1261}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1251, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !744, line: 203, baseType: !1201, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !744, line: 204, baseType: !1015, size: 32, align: 32, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1251, file: !744, line: 205, baseType: !1257, size: 64, align: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1259, line: 86, baseType: !1260)
!1259 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1259, line: 86, flags: DIFlagFwdDecl)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1251, file: !744, line: 206, baseType: !1233, size: 64, align: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1197, file: !744, line: 480, baseType: !1015, size: 32, align: 32, offset: 3008)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1197, file: !744, line: 505, baseType: !1015, size: 32, align: 32, offset: 3040)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1197, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1197, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1197, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1197, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1197, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1197, file: !744, line: 532, baseType: !1043, size: 64, align: 64, offset: 3264)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1197, file: !744, line: 539, baseType: !1043, size: 64, align: 64, offset: 3328)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1197, file: !744, line: 547, baseType: !1043, size: 64, align: 64, offset: 3392)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1197, file: !744, line: 554, baseType: !1257, size: 64, align: 64, offset: 3456)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1197, file: !744, line: 563, baseType: !1015, size: 32, align: 32, offset: 3520)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1197, file: !744, line: 572, baseType: !1015, size: 32, align: 32, offset: 3552)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1197, file: !744, line: 581, baseType: !1015, size: 32, align: 32, offset: 3584)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1197, file: !744, line: 588, baseType: !1277, size: 64, align: 64, offset: 3648)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1024, line: 36, baseType: !1279)
!1279 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1197, file: !744, line: 593, baseType: !1015, size: 32, align: 32, offset: 3712)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1197, file: !744, line: 596, baseType: !1015, size: 32, align: 32, offset: 3744)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1197, file: !744, line: 599, baseType: !1233, size: 64, align: 64, offset: 3776)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1197, file: !744, line: 605, baseType: !1233, size: 64, align: 64, offset: 3840)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1197, file: !744, line: 616, baseType: !1233, size: 64, align: 64, offset: 3904)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1197, file: !744, line: 626, baseType: !1286, size: 64, align: 64, offset: 3968)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1287, line: 216, baseType: !1046)
!1287 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1197, file: !744, line: 627, baseType: !1286, size: 64, align: 64, offset: 4032)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1197, file: !744, line: 628, baseType: !1286, size: 64, align: 64, offset: 4096)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1197, file: !744, line: 629, baseType: !1286, size: 64, align: 64, offset: 4160)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1197, file: !744, line: 645, baseType: !1233, size: 64, align: 64, offset: 4224)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1188, file: !1189, line: 161, baseType: !1293, size: 64, align: 64, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1189, line: 117, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1189, line: 100, size: 832, align: 64, elements: !1296)
!1296 = !{!1297, !1304, !1305, !1306, !1307, !1308, !1310, !1311, !1312}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1295, file: !1189, line: 105, baseType: !1298, size: 256, align: 64)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1299, size: 256, align: 64, elements: !1302)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1235, line: 238, baseType: !1301)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1235, line: 238, flags: DIFlagFwdDecl)
!1302 = !{!1303}
!1303 = !DISubrange(count: 4)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1295, file: !1189, line: 110, baseType: !1015, size: 32, align: 32, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1295, file: !1189, line: 111, baseType: !1015, size: 32, align: 32, offset: 288)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1295, file: !1189, line: 111, baseType: !1015, size: 32, align: 32, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1295, file: !1189, line: 112, baseType: !1205, size: 256, align: 32, offset: 352)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1295, file: !1189, line: 113, baseType: !1309, size: 128, align: 32, offset: 608)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 128, align: 32, elements: !1302)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1295, file: !1189, line: 114, baseType: !1015, size: 32, align: 32, offset: 736)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1295, file: !1189, line: 115, baseType: !1015, size: 32, align: 32, offset: 768)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1295, file: !1189, line: 116, baseType: !1015, size: 32, align: 32, offset: 800)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1188, file: !1189, line: 163, baseType: !1029, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1188, file: !1189, line: 165, baseType: !1315, size: 128, align: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1189, line: 122, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1189, line: 119, size: 128, align: 64, elements: !1317)
!1317 = !{!1318, !1342}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1316, file: !1189, line: 120, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1338, !1339, !1340, !1341}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1321, file: !14, line: 1451, baseType: !1233, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1321, file: !14, line: 1461, baseType: !1043, size: 64, align: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1321, file: !14, line: 1467, baseType: !1043, size: 64, align: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1321, file: !14, line: 1468, baseType: !1201, size: 64, align: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1321, file: !14, line: 1469, baseType: !1015, size: 32, align: 32, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1321, file: !14, line: 1470, baseType: !1015, size: 32, align: 32, offset: 288)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1321, file: !14, line: 1474, baseType: !1015, size: 32, align: 32, offset: 320)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1321, file: !14, line: 1479, baseType: !1331, size: 64, align: 64, offset: 384)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1333, file: !14, line: 1412, baseType: !1201, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1333, file: !14, line: 1413, baseType: !1015, size: 32, align: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1333, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1321, file: !14, line: 1480, baseType: !1015, size: 32, align: 32, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1321, file: !14, line: 1486, baseType: !1043, size: 64, align: 64, offset: 512)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1321, file: !14, line: 1488, baseType: !1043, size: 64, align: 64, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1321, file: !14, line: 1497, baseType: !1043, size: 64, align: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1316, file: !1189, line: 121, baseType: !1195, size: 64, align: 64, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1188, file: !1189, line: 166, baseType: !1344, size: 128, align: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1189, line: 127, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1189, line: 124, size: 128, align: 64, elements: !1346)
!1346 = !{!1347, !1420}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1345, file: !1189, line: 125, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1378, !1382, !1383, !1417, !1418, !1419}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1351, file: !14, line: 5751, baseType: !1085, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1351, file: !14, line: 5756, baseType: !1355, size: 64, align: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1363, !1364, !1365, !1369, !1373, !1377}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1357, file: !14, line: 5797, baseType: !1055, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1357, file: !14, line: 5804, baseType: !1361, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1357, file: !14, line: 5815, baseType: !1085, size: 64, align: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1357, file: !14, line: 5825, baseType: !1015, size: 32, align: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1357, file: !14, line: 5826, baseType: !1366, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!1015, !1349}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1357, file: !14, line: 5827, baseType: !1370, size: 64, align: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!1015, !1349, !1319}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1357, file: !14, line: 5828, baseType: !1374, size: 64, align: 64, offset: 384)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{null, !1349}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1357, file: !14, line: 5829, baseType: !1374, size: 64, align: 64, offset: 448)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1351, file: !14, line: 5762, baseType: !1379, size: 64, align: 64, offset: 128)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1381)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1351, file: !14, line: 5768, baseType: !1029, size: 64, align: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1351, file: !14, line: 5775, baseType: !1384, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1386, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1386, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1386, file: !14, line: 3948, baseType: !1040, size: 32, align: 32, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1386, file: !14, line: 3958, baseType: !1201, size: 64, align: 64, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1386, file: !14, line: 3962, baseType: !1015, size: 32, align: 32, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1386, file: !14, line: 3968, baseType: !1015, size: 32, align: 32, offset: 224)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1386, file: !14, line: 3973, baseType: !1043, size: 64, align: 64, offset: 256)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1386, file: !14, line: 3986, baseType: !1015, size: 32, align: 32, offset: 320)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1386, file: !14, line: 3999, baseType: !1015, size: 32, align: 32, offset: 352)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1386, file: !14, line: 4004, baseType: !1015, size: 32, align: 32, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1386, file: !14, line: 4005, baseType: !1015, size: 32, align: 32, offset: 416)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1386, file: !14, line: 4010, baseType: !1015, size: 32, align: 32, offset: 448)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1386, file: !14, line: 4011, baseType: !1015, size: 32, align: 32, offset: 480)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1386, file: !14, line: 4020, baseType: !1065, size: 64, align: 32, offset: 512)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1386, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1386, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1386, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1386, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1386, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1386, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1386, file: !14, line: 4039, baseType: !1015, size: 32, align: 32, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1386, file: !14, line: 4046, baseType: !1045, size: 64, align: 64, offset: 832)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1386, file: !14, line: 4050, baseType: !1015, size: 32, align: 32, offset: 896)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1386, file: !14, line: 4054, baseType: !1015, size: 32, align: 32, offset: 928)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1386, file: !14, line: 4061, baseType: !1015, size: 32, align: 32, offset: 960)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1386, file: !14, line: 4065, baseType: !1015, size: 32, align: 32, offset: 992)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1386, file: !14, line: 4073, baseType: !1015, size: 32, align: 32, offset: 1024)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1386, file: !14, line: 4080, baseType: !1015, size: 32, align: 32, offset: 1056)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1386, file: !14, line: 4084, baseType: !1015, size: 32, align: 32, offset: 1088)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1351, file: !14, line: 5781, baseType: !1384, size: 64, align: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1351, file: !14, line: 5787, baseType: !1065, size: 64, align: 32, offset: 384)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1351, file: !14, line: 5793, baseType: !1065, size: 64, align: 32, offset: 448)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1345, file: !1189, line: 126, baseType: !1015, size: 32, align: 32, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1188, file: !1189, line: 172, baseType: !1319, size: 64, align: 64, offset: 576)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1188, file: !1189, line: 177, baseType: !1201, size: 64, align: 64, offset: 640)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1188, file: !1189, line: 178, baseType: !1016, size: 32, align: 32, offset: 704)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1188, file: !1189, line: 180, baseType: !1029, size: 64, align: 64, offset: 768)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1188, file: !1189, line: 185, baseType: !1015, size: 32, align: 32, offset: 832)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1188, file: !1189, line: 190, baseType: !1029, size: 64, align: 64, offset: 896)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1188, file: !1189, line: 195, baseType: !1015, size: 32, align: 32, offset: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1188, file: !1189, line: 200, baseType: !1319, size: 64, align: 64, offset: 1024)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1188, file: !1189, line: 201, baseType: !1015, size: 32, align: 32, offset: 1088)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1188, file: !1189, line: 202, baseType: !1195, size: 64, align: 64, offset: 1152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1188, file: !1189, line: 203, baseType: !1015, size: 32, align: 32, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1188, file: !1189, line: 205, baseType: !1015, size: 32, align: 32, offset: 1248)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1188, file: !1189, line: 206, baseType: !1015, size: 32, align: 32, offset: 1280)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1188, file: !1189, line: 209, baseType: !1286, size: 64, align: 64, offset: 1344)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1188, file: !1189, line: 212, baseType: !1286, size: 64, align: 64, offset: 1408)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1188, file: !1189, line: 213, baseType: !1195, size: 64, align: 64, offset: 1472)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1188, file: !1189, line: 215, baseType: !1015, size: 32, align: 32, offset: 1536)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1188, file: !1189, line: 217, baseType: !1015, size: 32, align: 32, offset: 1568)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1188, file: !1189, line: 220, baseType: !1015, size: 32, align: 32, offset: 1600)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1175, file: !14, line: 1598, baseType: !1029, size: 64, align: 64, offset: 384)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1175, file: !14, line: 1606, baseType: !1043, size: 64, align: 64, offset: 448)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1175, file: !14, line: 1614, baseType: !1015, size: 32, align: 32, offset: 512)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1175, file: !14, line: 1622, baseType: !1015, size: 32, align: 32, offset: 544)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1175, file: !14, line: 1628, baseType: !1015, size: 32, align: 32, offset: 576)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1175, file: !14, line: 1636, baseType: !1015, size: 32, align: 32, offset: 608)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1175, file: !14, line: 1643, baseType: !1015, size: 32, align: 32, offset: 640)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1175, file: !14, line: 1657, baseType: !1201, size: 64, align: 64, offset: 704)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1175, file: !14, line: 1658, baseType: !1015, size: 32, align: 32, offset: 768)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1175, file: !14, line: 1679, baseType: !1065, size: 64, align: 32, offset: 800)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1175, file: !14, line: 1688, baseType: !1015, size: 32, align: 32, offset: 864)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1175, file: !14, line: 1712, baseType: !1015, size: 32, align: 32, offset: 896)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1175, file: !14, line: 1729, baseType: !1015, size: 32, align: 32, offset: 928)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1175, file: !14, line: 1729, baseType: !1015, size: 32, align: 32, offset: 960)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1175, file: !14, line: 1744, baseType: !1015, size: 32, align: 32, offset: 992)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1175, file: !14, line: 1744, baseType: !1015, size: 32, align: 32, offset: 1024)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1175, file: !14, line: 1751, baseType: !1015, size: 32, align: 32, offset: 1056)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1175, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1175, file: !14, line: 1791, baseType: !1459, size: 64, align: 64, offset: 1152)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{null, !1462, !1463, !1465, !1015, !1015, !1015}
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1175, file: !14, line: 1808, baseType: !1467, size: 64, align: 64, offset: 1216)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{!473, !1462, !1072}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1175, file: !14, line: 1816, baseType: !1015, size: 32, align: 32, offset: 1280)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1175, file: !14, line: 1825, baseType: !1034, size: 32, align: 32, offset: 1312)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1175, file: !14, line: 1830, baseType: !1015, size: 32, align: 32, offset: 1344)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1175, file: !14, line: 1838, baseType: !1034, size: 32, align: 32, offset: 1376)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1175, file: !14, line: 1846, baseType: !1015, size: 32, align: 32, offset: 1408)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1175, file: !14, line: 1851, baseType: !1015, size: 32, align: 32, offset: 1440)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1175, file: !14, line: 1861, baseType: !1034, size: 32, align: 32, offset: 1472)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1175, file: !14, line: 1868, baseType: !1034, size: 32, align: 32, offset: 1504)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1175, file: !14, line: 1875, baseType: !1034, size: 32, align: 32, offset: 1536)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1175, file: !14, line: 1882, baseType: !1034, size: 32, align: 32, offset: 1568)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1175, file: !14, line: 1889, baseType: !1034, size: 32, align: 32, offset: 1600)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1175, file: !14, line: 1896, baseType: !1034, size: 32, align: 32, offset: 1632)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1175, file: !14, line: 1903, baseType: !1034, size: 32, align: 32, offset: 1664)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1175, file: !14, line: 1910, baseType: !1015, size: 32, align: 32, offset: 1696)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1175, file: !14, line: 1915, baseType: !1015, size: 32, align: 32, offset: 1728)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1175, file: !14, line: 1926, baseType: !1465, size: 64, align: 64, offset: 1792)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1175, file: !14, line: 1935, baseType: !1065, size: 64, align: 32, offset: 1856)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1175, file: !14, line: 1942, baseType: !1015, size: 32, align: 32, offset: 1920)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1175, file: !14, line: 1948, baseType: !1015, size: 32, align: 32, offset: 1952)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1175, file: !14, line: 1954, baseType: !1015, size: 32, align: 32, offset: 1984)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1175, file: !14, line: 1960, baseType: !1015, size: 32, align: 32, offset: 2016)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1175, file: !14, line: 1984, baseType: !1015, size: 32, align: 32, offset: 2048)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1175, file: !14, line: 1991, baseType: !1015, size: 32, align: 32, offset: 2080)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1175, file: !14, line: 1996, baseType: !1015, size: 32, align: 32, offset: 2112)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1175, file: !14, line: 2004, baseType: !1015, size: 32, align: 32, offset: 2144)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1175, file: !14, line: 2011, baseType: !1015, size: 32, align: 32, offset: 2176)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1175, file: !14, line: 2018, baseType: !1015, size: 32, align: 32, offset: 2208)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1175, file: !14, line: 2027, baseType: !1015, size: 32, align: 32, offset: 2240)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1175, file: !14, line: 2034, baseType: !1015, size: 32, align: 32, offset: 2272)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1175, file: !14, line: 2044, baseType: !1015, size: 32, align: 32, offset: 2304)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1175, file: !14, line: 2054, baseType: !1026, size: 64, align: 64, offset: 2368)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1175, file: !14, line: 2061, baseType: !1026, size: 64, align: 64, offset: 2432)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1175, file: !14, line: 2066, baseType: !1015, size: 32, align: 32, offset: 2496)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1175, file: !14, line: 2070, baseType: !1015, size: 32, align: 32, offset: 2528)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1175, file: !14, line: 2078, baseType: !1015, size: 32, align: 32, offset: 2560)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1175, file: !14, line: 2085, baseType: !1015, size: 32, align: 32, offset: 2592)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1175, file: !14, line: 2092, baseType: !1015, size: 32, align: 32, offset: 2624)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1175, file: !14, line: 2099, baseType: !1015, size: 32, align: 32, offset: 2656)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1175, file: !14, line: 2106, baseType: !1015, size: 32, align: 32, offset: 2688)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1175, file: !14, line: 2113, baseType: !1015, size: 32, align: 32, offset: 2720)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1175, file: !14, line: 2120, baseType: !1015, size: 32, align: 32, offset: 2752)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1175, file: !14, line: 2125, baseType: !1015, size: 32, align: 32, offset: 2784)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1175, file: !14, line: 2133, baseType: !1015, size: 32, align: 32, offset: 2816)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1175, file: !14, line: 2140, baseType: !1015, size: 32, align: 32, offset: 2848)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1175, file: !14, line: 2145, baseType: !1015, size: 32, align: 32, offset: 2880)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1175, file: !14, line: 2153, baseType: !1015, size: 32, align: 32, offset: 2912)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1175, file: !14, line: 2158, baseType: !1015, size: 32, align: 32, offset: 2944)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1175, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1175, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1175, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1175, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1175, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1175, file: !14, line: 2203, baseType: !1015, size: 32, align: 32, offset: 3136)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1175, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1175, file: !14, line: 2212, baseType: !1015, size: 32, align: 32, offset: 3200)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !14, line: 2213, baseType: !1015, size: 32, align: 32, offset: 3232)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1175, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1175, file: !14, line: 2232, baseType: !1015, size: 32, align: 32, offset: 3296)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1175, file: !14, line: 2243, baseType: !1015, size: 32, align: 32, offset: 3328)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1175, file: !14, line: 2249, baseType: !1015, size: 32, align: 32, offset: 3360)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1175, file: !14, line: 2256, baseType: !1015, size: 32, align: 32, offset: 3392)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1175, file: !14, line: 2263, baseType: !1045, size: 64, align: 64, offset: 3456)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1175, file: !14, line: 2270, baseType: !1045, size: 64, align: 64, offset: 3520)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1175, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1175, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1175, file: !14, line: 2367, baseType: !1536, size: 64, align: 64, offset: 3648)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!1015, !1462, !1195, !1015}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1175, file: !14, line: 2383, baseType: !1015, size: 32, align: 32, offset: 3712)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1175, file: !14, line: 2386, baseType: !1034, size: 32, align: 32, offset: 3744)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1175, file: !14, line: 2387, baseType: !1034, size: 32, align: 32, offset: 3776)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1175, file: !14, line: 2394, baseType: !1015, size: 32, align: 32, offset: 3808)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1175, file: !14, line: 2401, baseType: !1015, size: 32, align: 32, offset: 3840)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1175, file: !14, line: 2408, baseType: !1015, size: 32, align: 32, offset: 3872)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1175, file: !14, line: 2415, baseType: !1015, size: 32, align: 32, offset: 3904)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1175, file: !14, line: 2422, baseType: !1015, size: 32, align: 32, offset: 3936)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1175, file: !14, line: 2423, baseType: !1548, size: 64, align: 64, offset: 3968)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1551)
!1551 = !{!1552, !1553, !1554, !1555}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1550, file: !14, line: 827, baseType: !1015, size: 32, align: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1550, file: !14, line: 828, baseType: !1015, size: 32, align: 32, offset: 32)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1550, file: !14, line: 829, baseType: !1015, size: 32, align: 32, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1550, file: !14, line: 830, baseType: !1034, size: 32, align: 32, offset: 96)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1175, file: !14, line: 2430, baseType: !1043, size: 64, align: 64, offset: 4032)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1175, file: !14, line: 2437, baseType: !1043, size: 64, align: 64, offset: 4096)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1175, file: !14, line: 2444, baseType: !1034, size: 32, align: 32, offset: 4160)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1175, file: !14, line: 2451, baseType: !1034, size: 32, align: 32, offset: 4192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1175, file: !14, line: 2458, baseType: !1015, size: 32, align: 32, offset: 4224)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1175, file: !14, line: 2469, baseType: !1015, size: 32, align: 32, offset: 4256)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1175, file: !14, line: 2475, baseType: !1015, size: 32, align: 32, offset: 4288)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1175, file: !14, line: 2481, baseType: !1015, size: 32, align: 32, offset: 4320)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1175, file: !14, line: 2485, baseType: !1015, size: 32, align: 32, offset: 4352)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1175, file: !14, line: 2489, baseType: !1015, size: 32, align: 32, offset: 4384)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1175, file: !14, line: 2493, baseType: !1015, size: 32, align: 32, offset: 4416)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1175, file: !14, line: 2501, baseType: !1015, size: 32, align: 32, offset: 4448)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1175, file: !14, line: 2506, baseType: !1015, size: 32, align: 32, offset: 4480)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1175, file: !14, line: 2510, baseType: !1015, size: 32, align: 32, offset: 4512)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1175, file: !14, line: 2514, baseType: !1043, size: 64, align: 64, offset: 4544)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1175, file: !14, line: 2528, baseType: !1572, size: 64, align: 64, offset: 4608)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{null, !1462, !1029, !1015, !1015}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1175, file: !14, line: 2534, baseType: !1015, size: 32, align: 32, offset: 4672)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1175, file: !14, line: 2545, baseType: !1015, size: 32, align: 32, offset: 4704)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1175, file: !14, line: 2547, baseType: !1015, size: 32, align: 32, offset: 4736)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1175, file: !14, line: 2549, baseType: !1015, size: 32, align: 32, offset: 4768)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1175, file: !14, line: 2551, baseType: !1015, size: 32, align: 32, offset: 4800)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1175, file: !14, line: 2553, baseType: !1015, size: 32, align: 32, offset: 4832)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1175, file: !14, line: 2555, baseType: !1015, size: 32, align: 32, offset: 4864)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1175, file: !14, line: 2557, baseType: !1015, size: 32, align: 32, offset: 4896)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1175, file: !14, line: 2559, baseType: !1015, size: 32, align: 32, offset: 4928)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1175, file: !14, line: 2563, baseType: !1015, size: 32, align: 32, offset: 4960)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1175, file: !14, line: 2571, baseType: !1586, size: 64, align: 64, offset: 4992)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1175, file: !14, line: 2579, baseType: !1586, size: 64, align: 64, offset: 5056)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1175, file: !14, line: 2586, baseType: !1015, size: 32, align: 32, offset: 5120)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1175, file: !14, line: 2615, baseType: !1015, size: 32, align: 32, offset: 5152)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1175, file: !14, line: 2627, baseType: !1015, size: 32, align: 32, offset: 5184)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1175, file: !14, line: 2637, baseType: !1015, size: 32, align: 32, offset: 5216)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1175, file: !14, line: 2681, baseType: !1015, size: 32, align: 32, offset: 5248)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1175, file: !14, line: 2709, baseType: !1043, size: 64, align: 64, offset: 5312)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1175, file: !14, line: 2716, baseType: !1595, size: 64, align: 64, offset: 5376)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602, !1603, !1604, !1608, !1614, !1618, !1619, !1620, !1621, !1627, !1628, !1629, !1630, !1631}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1597, file: !14, line: 3642, baseType: !1055, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1597, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1597, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1597, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1597, file: !14, line: 3669, baseType: !1015, size: 32, align: 32, offset: 160)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1597, file: !14, line: 3682, baseType: !1605, size: 64, align: 64, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!1015, !1173, !1195}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1597, file: !14, line: 3698, baseType: !1609, size: 64, align: 64, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!1015, !1173, !1612, !1040}
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1597, file: !14, line: 3712, baseType: !1615, size: 64, align: 64, offset: 320)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!1015, !1173, !1015, !1612, !1040}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1597, file: !14, line: 3726, baseType: !1609, size: 64, align: 64, offset: 384)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1597, file: !14, line: 3737, baseType: !1170, size: 64, align: 64, offset: 448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1597, file: !14, line: 3746, baseType: !1015, size: 32, align: 32, offset: 512)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1597, file: !14, line: 3757, baseType: !1622, size: 64, align: 64, offset: 576)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{null, !1625}
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1597, file: !14, line: 3766, baseType: !1170, size: 64, align: 64, offset: 640)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1597, file: !14, line: 3774, baseType: !1170, size: 64, align: 64, offset: 704)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1597, file: !14, line: 3780, baseType: !1015, size: 32, align: 32, offset: 768)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1597, file: !14, line: 3785, baseType: !1015, size: 32, align: 32, offset: 800)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1597, file: !14, line: 3795, baseType: !1632, size: 64, align: 64, offset: 832)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!1015, !1173, !1233}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1175, file: !14, line: 2728, baseType: !1029, size: 64, align: 64, offset: 5440)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1175, file: !14, line: 2735, baseType: !1223, size: 512, align: 64, offset: 5504)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1175, file: !14, line: 2742, baseType: !1015, size: 32, align: 32, offset: 6016)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1175, file: !14, line: 2755, baseType: !1015, size: 32, align: 32, offset: 6048)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1175, file: !14, line: 2776, baseType: !1015, size: 32, align: 32, offset: 6080)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1175, file: !14, line: 2783, baseType: !1015, size: 32, align: 32, offset: 6112)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1175, file: !14, line: 2791, baseType: !1015, size: 32, align: 32, offset: 6144)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1175, file: !14, line: 2802, baseType: !1195, size: 64, align: 64, offset: 6208)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1175, file: !14, line: 2811, baseType: !1015, size: 32, align: 32, offset: 6272)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1175, file: !14, line: 2821, baseType: !1015, size: 32, align: 32, offset: 6304)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1175, file: !14, line: 2830, baseType: !1015, size: 32, align: 32, offset: 6336)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1175, file: !14, line: 2840, baseType: !1015, size: 32, align: 32, offset: 6368)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1175, file: !14, line: 2851, baseType: !1648, size: 64, align: 64, offset: 6400)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!1015, !1462, !1651, !1029, !1465, !1015, !1015}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!1015, !1462, !1029}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1175, file: !14, line: 2871, baseType: !1655, size: 64, align: 64, offset: 6464)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!1015, !1462, !1658, !1029, !1465, !1015}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!1015, !1462, !1029, !1015, !1015}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1175, file: !14, line: 2878, baseType: !1015, size: 32, align: 32, offset: 6528)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1175, file: !14, line: 2885, baseType: !1015, size: 32, align: 32, offset: 6560)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1175, file: !14, line: 3005, baseType: !1015, size: 32, align: 32, offset: 6592)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1175, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1175, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1175, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1175, file: !14, line: 3037, baseType: !1201, size: 64, align: 64, offset: 6720)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1175, file: !14, line: 3038, baseType: !1015, size: 32, align: 32, offset: 6784)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1175, file: !14, line: 3050, baseType: !1045, size: 64, align: 64, offset: 6848)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1175, file: !14, line: 3065, baseType: !1015, size: 32, align: 32, offset: 6912)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1175, file: !14, line: 3083, baseType: !1015, size: 32, align: 32, offset: 6944)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1175, file: !14, line: 3092, baseType: !1065, size: 64, align: 32, offset: 6976)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1175, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1175, file: !14, line: 3106, baseType: !1065, size: 64, align: 32, offset: 7072)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1175, file: !14, line: 3113, baseType: !1676, size: 64, align: 64, offset: 7168)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1678)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685, !1686, !1689}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1679, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1679, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1679, file: !14, line: 720, baseType: !1055, size: 64, align: 64, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1679, file: !14, line: 724, baseType: !1055, size: 64, align: 64, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1679, file: !14, line: 728, baseType: !1015, size: 32, align: 32, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1679, file: !14, line: 734, baseType: !1687, size: 64, align: 64, offset: 256)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1679, file: !14, line: 739, baseType: !1690, size: 64, align: 64, offset: 320)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1161)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1175, file: !14, line: 3129, baseType: !1043, size: 64, align: 64, offset: 7232)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1175, file: !14, line: 3130, baseType: !1043, size: 64, align: 64, offset: 7296)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1175, file: !14, line: 3131, baseType: !1043, size: 64, align: 64, offset: 7360)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1175, file: !14, line: 3132, baseType: !1043, size: 64, align: 64, offset: 7424)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1175, file: !14, line: 3139, baseType: !1586, size: 64, align: 64, offset: 7488)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1175, file: !14, line: 3147, baseType: !1015, size: 32, align: 32, offset: 7552)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1175, file: !14, line: 3165, baseType: !1015, size: 32, align: 32, offset: 7584)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1175, file: !14, line: 3172, baseType: !1015, size: 32, align: 32, offset: 7616)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1175, file: !14, line: 3180, baseType: !1015, size: 32, align: 32, offset: 7648)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1175, file: !14, line: 3191, baseType: !1026, size: 64, align: 64, offset: 7680)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1175, file: !14, line: 3199, baseType: !1201, size: 64, align: 64, offset: 7744)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1175, file: !14, line: 3207, baseType: !1586, size: 64, align: 64, offset: 7808)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1175, file: !14, line: 3214, baseType: !1016, size: 32, align: 32, offset: 7872)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1175, file: !14, line: 3224, baseType: !1331, size: 64, align: 64, offset: 7936)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1175, file: !14, line: 3225, baseType: !1015, size: 32, align: 32, offset: 8000)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1175, file: !14, line: 3249, baseType: !1233, size: 64, align: 64, offset: 8064)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1175, file: !14, line: 3256, baseType: !1015, size: 32, align: 32, offset: 8128)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1175, file: !14, line: 3271, baseType: !1015, size: 32, align: 32, offset: 8160)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1175, file: !14, line: 3279, baseType: !1043, size: 64, align: 64, offset: 8192)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1175, file: !14, line: 3301, baseType: !1233, size: 64, align: 64, offset: 8256)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1175, file: !14, line: 3310, baseType: !1015, size: 32, align: 32, offset: 8320)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1175, file: !14, line: 3337, baseType: !1015, size: 32, align: 32, offset: 8352)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1175, file: !14, line: 3351, baseType: !1015, size: 32, align: 32, offset: 8384)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1175, file: !14, line: 3359, baseType: !1015, size: 32, align: 32, offset: 8416)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1052, file: !14, line: 3535, baseType: !1717, size: 64, align: 64, offset: 1024)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DISubroutineType(types: !1719)
!1719 = !{!1015, !1173, !1720}
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1052, file: !14, line: 3541, baseType: !1723, size: 64, align: 64, offset: 1088)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1725)
!1725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1726)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1189, line: 223, size: 128, align: 64, elements: !1727)
!1727 = !{!1728, !1729}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1726, file: !1189, line: 224, baseType: !1612, size: 64, align: 64)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1726, file: !1189, line: 225, baseType: !1612, size: 64, align: 64, offset: 64)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1052, file: !14, line: 3549, baseType: !1731, size: 64, align: 64, offset: 1152)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DISubroutineType(types: !1733)
!1733 = !{null, !1168}
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1052, file: !14, line: 3551, baseType: !1170, size: 64, align: 64, offset: 1216)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1052, file: !14, line: 3552, baseType: !1736, size: 64, align: 64, offset: 1280)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64, align: 64)
!1737 = !DISubroutineType(types: !1738)
!1738 = !{!1015, !1173, !1201, !1015, !1739}
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64, align: 64)
!1740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1741)
!1741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1742)
!1742 = !{!1743, !1744, !1745, !1746, !1747, !1771}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1741, file: !14, line: 3921, baseType: !1023, size: 16, align: 16)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1741, file: !14, line: 3922, baseType: !1040, size: 32, align: 32, offset: 32)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1741, file: !14, line: 3923, baseType: !1040, size: 32, align: 32, offset: 64)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1741, file: !14, line: 3924, baseType: !1016, size: 32, align: 32, offset: 96)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1741, file: !14, line: 3925, baseType: !1748, size: 64, align: 64, offset: 128)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1749, size: 64, align: 64)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64, align: 64)
!1750 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1751)
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1752)
!1752 = !{!1753, !1754, !1755, !1756, !1757, !1758, !1764, !1766, !1767, !1768, !1769, !1770}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1751, file: !14, line: 3886, baseType: !1015, size: 32, align: 32)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1751, file: !14, line: 3887, baseType: !1015, size: 32, align: 32, offset: 32)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1751, file: !14, line: 3888, baseType: !1015, size: 32, align: 32, offset: 64)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1751, file: !14, line: 3889, baseType: !1015, size: 32, align: 32, offset: 96)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1751, file: !14, line: 3890, baseType: !1015, size: 32, align: 32, offset: 128)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1751, file: !14, line: 3897, baseType: !1759, size: 768, align: 64, offset: 192)
!1759 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1760)
!1760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1761)
!1761 = !{!1762, !1763}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1760, file: !14, line: 3855, baseType: !1200, size: 512, align: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1760, file: !14, line: 3857, baseType: !1205, size: 256, align: 32, offset: 512)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1751, file: !14, line: 3903, baseType: !1765, size: 256, align: 64, offset: 960)
!1765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 256, align: 64, elements: !1302)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1751, file: !14, line: 3904, baseType: !1309, size: 128, align: 32, offset: 1216)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1751, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1751, file: !14, line: 3908, baseType: !1586, size: 64, align: 64, offset: 1408)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1751, file: !14, line: 3915, baseType: !1586, size: 64, align: 64, offset: 1472)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1751, file: !14, line: 3917, baseType: !1015, size: 32, align: 32, offset: 1536)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1741, file: !14, line: 3926, baseType: !1043, size: 64, align: 64, offset: 192)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1052, file: !14, line: 3564, baseType: !1773, size: 64, align: 64, offset: 1344)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64, align: 64)
!1774 = !DISubroutineType(types: !1775)
!1775 = !{!1015, !1173, !1319, !1463, !1465}
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1052, file: !14, line: 3566, baseType: !1777, size: 64, align: 64, offset: 1408)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{!1015, !1173, !1029, !1465, !1319}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1052, file: !14, line: 3567, baseType: !1170, size: 64, align: 64, offset: 1472)
