; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_core_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_core_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }

!561 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!562 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!563 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!564 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!565 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!566 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!567 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !612, !621}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !615, line: 221, size: 32, align: 8, elements: !616)
!615 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !614, file: !615, line: 221, baseType: !618, size: 32, align: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !619, line: 51, baseType: !620)
!619 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!620 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !619, line: 48, baseType: !624)
!624 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!625 = !{!626, !790}
!626 = distinct !DIGlobalVariable(name: "ff_dca_core_bsf", scope: !0, file: !627, line: 58, type: !628, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_dca_core_bsf)
!627 = !DIFile(filename: "libavcodec/dca_core_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !631)
!631 = !{!632, !636, !639, !681, !682, !747, !785, !789}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !4, line: 5797, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !630, file: !4, line: 5804, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !630, file: !4, line: 5815, baseType: !640, size: 64, align: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !644)
!644 = !{!645, !646, !650, !654, !656, !657, !658, !662, !668, !670, !674}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !643, file: !464, line: 72, baseType: !633, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !643, file: !464, line: 78, baseType: !647, size: 64, align: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!633, !611}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !643, file: !464, line: 85, baseType: !651, size: 64, align: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !643, file: !464, line: 93, baseType: !655, size: 32, align: 32, offset: 192)
!655 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !643, file: !464, line: 99, baseType: !655, size: 32, align: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !643, file: !464, line: 108, baseType: !655, size: 32, align: 32, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !643, file: !464, line: 113, baseType: !659, size: 64, align: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!611, !611, !611}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !643, file: !464, line: 123, baseType: !663, size: 64, align: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !643, file: !464, line: 130, baseType: !669, size: 32, align: 32, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !643, file: !464, line: 136, baseType: !671, size: 64, align: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!669, !611}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !643, file: !464, line: 142, baseType: !675, size: 64, align: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!655, !678, !611, !633, !655}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !630, file: !4, line: 5825, baseType: !655, size: 32, align: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !630, file: !4, line: 5826, baseType: !683, size: 64, align: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!655, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !689)
!689 = !{!690, !691, !694, !698, !699, !744, !745, !746}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !688, file: !4, line: 5751, baseType: !640, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !688, file: !4, line: 5756, baseType: !692, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !688, file: !4, line: 5762, baseType: !695, size: 64, align: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !697)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !688, file: !4, line: 5768, baseType: !611, size: 64, align: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !688, file: !4, line: 5775, baseType: !700, size: 64, align: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !703)
!703 = !{!704, !705, !706, !707, !709, !710, !711, !714, !715, !716, !717, !718, !719, !720, !727, !728, !729, !730, !731, !732, !733, !734, !737, !738, !739, !740, !741, !742, !743}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !702, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !702, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !702, file: !4, line: 3948, baseType: !618, size: 32, align: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !702, file: !4, line: 3958, baseType: !708, size: 64, align: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !702, file: !4, line: 3962, baseType: !655, size: 32, align: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !702, file: !4, line: 3968, baseType: !655, size: 32, align: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !702, file: !4, line: 3973, baseType: !712, size: 64, align: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !619, line: 40, baseType: !713)
!713 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !702, file: !4, line: 3986, baseType: !655, size: 32, align: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !702, file: !4, line: 3999, baseType: !655, size: 32, align: 32, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !702, file: !4, line: 4004, baseType: !655, size: 32, align: 32, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !702, file: !4, line: 4005, baseType: !655, size: 32, align: 32, offset: 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !702, file: !4, line: 4010, baseType: !655, size: 32, align: 32, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !702, file: !4, line: 4011, baseType: !655, size: 32, align: 32, offset: 480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !702, file: !4, line: 4020, baseType: !721, size: 64, align: 32, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !722, line: 61, baseType: !723)
!722 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !722, line: 58, size: 64, align: 32, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !723, file: !722, line: 59, baseType: !655, size: 32, align: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !723, file: !722, line: 60, baseType: !655, size: 32, align: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !702, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !702, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !702, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !702, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !702, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !702, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !702, file: !4, line: 4039, baseType: !655, size: 32, align: 32, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !702, file: !4, line: 4046, baseType: !735, size: 64, align: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !619, line: 55, baseType: !736)
!736 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !702, file: !4, line: 4050, baseType: !655, size: 32, align: 32, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !702, file: !4, line: 4054, baseType: !655, size: 32, align: 32, offset: 928)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !702, file: !4, line: 4061, baseType: !655, size: 32, align: 32, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !702, file: !4, line: 4065, baseType: !655, size: 32, align: 32, offset: 992)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !702, file: !4, line: 4073, baseType: !655, size: 32, align: 32, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !702, file: !4, line: 4080, baseType: !655, size: 32, align: 32, offset: 1056)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !702, file: !4, line: 4084, baseType: !655, size: 32, align: 32, offset: 1088)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !688, file: !4, line: 5781, baseType: !700, size: 64, align: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !688, file: !4, line: 5787, baseType: !721, size: 64, align: 32, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !688, file: !4, line: 5793, baseType: !721, size: 64, align: 32, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !630, file: !4, line: 5827, baseType: !748, size: 64, align: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!655, !686, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !754)
!754 = !{!755, !767, !768, !769, !770, !771, !772, !773, !781, !782, !783, !784}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !753, file: !4, line: 1451, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !758, line: 94, baseType: !759)
!758 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !758, line: 81, size: 192, align: 64, elements: !760)
!760 = !{!761, !765, !766}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !759, file: !758, line: 82, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !758, line: 73, baseType: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !758, line: 73, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !758, line: 89, baseType: !708, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !758, line: 93, baseType: !655, size: 32, align: 32, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !753, file: !4, line: 1461, baseType: !712, size: 64, align: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !753, file: !4, line: 1467, baseType: !712, size: 64, align: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !4, line: 1468, baseType: !708, size: 64, align: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !4, line: 1469, baseType: !655, size: 32, align: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !753, file: !4, line: 1470, baseType: !655, size: 32, align: 32, offset: 288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !4, line: 1474, baseType: !655, size: 32, align: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !753, file: !4, line: 1479, baseType: !774, size: 64, align: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !776, file: !4, line: 1412, baseType: !708, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !776, file: !4, line: 1413, baseType: !655, size: 32, align: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !753, file: !4, line: 1480, baseType: !655, size: 32, align: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !753, file: !4, line: 1486, baseType: !712, size: 64, align: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !753, file: !4, line: 1488, baseType: !712, size: 64, align: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !753, file: !4, line: 1497, baseType: !712, size: 64, align: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !630, file: !4, line: 5828, baseType: !786, size: 64, align: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !686}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !630, file: !4, line: 5829, baseType: !786, size: 64, align: 64, offset: 448)
!790 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !627, line: 54, type: !791, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 64, align: 32, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 2)
!794 = !{i32 2, !"Dwarf Version", i32 4}
!795 = !{i32 2, !"Debug Info Version", i32 3}
!796 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!797 = distinct !DISubprogram(name: "dca_core_filter", scope: !627, file: !627, line: 27, type: !749, isLocal: true, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!798 = !{}
!799 = !DILocalVariable(name: "b", arg: 1, scope: !800, file: !801, line: 93, type: !804)
!800 = distinct !DISubprogram(name: "bytestream_get_be24", scope: !801, file: !801, line: 93, type: !802, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!801 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!802 = !DISubroutineType(types: !803)
!803 = !{!620, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!805 = !DIExpression()
!806 = !DILocation(line: 93, column: 95, scope: !800, inlinedAt: !807)
!807 = distinct !DILocation(line: 93, column: 1086, scope: !808, inlinedAt: !818)
!808 = distinct !DISubprogram(name: "bytestream2_get_be24u", scope: !801, file: !801, line: 93, type: !809, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!809 = !DISubroutineType(types: !810)
!810 = !{!620, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !801, line: 35, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !801, line: 33, size: 192, align: 64, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !813, file: !801, line: 34, baseType: !621, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !813, file: !801, line: 34, baseType: !621, size: 64, align: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !813, file: !801, line: 34, baseType: !621, size: 64, align: 64, offset: 128)
!818 = distinct !DILocation(line: 93, column: 1304, scope: !819, inlinedAt: !821)
!819 = !DILexicalBlockFile(scope: !820, file: !801, discriminator: 2)
!820 = distinct !DISubprogram(name: "bytestream2_get_be24", scope: !801, file: !801, line: 93, type: !809, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!821 = distinct !DILocation(line: 43, column: 23, scope: !822)
!822 = distinct !DILexicalBlock(scope: !797, file: !627, line: 41, column: 23)
!823 = !DILocalVariable(name: "g", arg: 1, scope: !808, file: !801, line: 93, type: !811)
!824 = !DILocation(line: 93, column: 1074, scope: !808, inlinedAt: !818)
!825 = !DILocalVariable(name: "g", arg: 1, scope: !820, file: !801, line: 93, type: !811)
!826 = !DILocation(line: 93, column: 1216, scope: !820, inlinedAt: !821)
!827 = !DILocalVariable(name: "g", arg: 1, scope: !828, file: !801, line: 164, type: !811)
!828 = distinct !DISubprogram(name: "bytestream2_skip", scope: !801, file: !801, line: 164, type: !829, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !811, !620}
!831 = !DILocation(line: 164, column: 84, scope: !828, inlinedAt: !832)
!832 = distinct !DILocation(line: 39, column: 5, scope: !797)
!833 = !DILocalVariable(name: "size", arg: 2, scope: !828, file: !801, line: 165, type: !620)
!834 = !DILocation(line: 165, column: 60, scope: !828, inlinedAt: !832)
!835 = !DILocalVariable(name: "x", arg: 1, scope: !836, file: !837, line: 66, type: !618)
!836 = distinct !DISubprogram(name: "av_bswap32", scope: !837, file: !837, line: 66, type: !838, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!837 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!838 = !DISubroutineType(types: !839)
!839 = !{!618, !618}
!840 = !DILocation(line: 66, column: 98, scope: !836, inlinedAt: !841)
!841 = distinct !DILocation(line: 92, column: 118, scope: !842, inlinedAt: !843)
!842 = distinct !DISubprogram(name: "bytestream_get_be32", scope: !801, file: !801, line: 92, type: !802, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!843 = distinct !DILocation(line: 92, column: 904, scope: !844, inlinedAt: !845)
!844 = distinct !DISubprogram(name: "bytestream2_get_be32u", scope: !801, file: !801, line: 92, type: !809, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!845 = distinct !DILocation(line: 92, column: 1122, scope: !846, inlinedAt: !848)
!846 = !DILexicalBlockFile(scope: !847, file: !801, discriminator: 2)
!847 = distinct !DISubprogram(name: "bytestream2_get_be32", scope: !801, file: !801, line: 92, type: !809, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !798)
!848 = distinct !DILocation(line: 38, column: 16, scope: !797)
!849 = !DILocalVariable(name: "b", arg: 1, scope: !842, file: !801, line: 92, type: !804)
!850 = !DILocation(line: 92, column: 95, scope: !842, inlinedAt: !843)
!851 = !DILocalVariable(name: "g", arg: 1, scope: !844, file: !801, line: 92, type: !811)
!852 = !DILocation(line: 92, column: 892, scope: !844, inlinedAt: !845)
!853 = !DILocalVariable(name: "g", arg: 1, scope: !847, file: !801, line: 92, type: !811)
!854 = !DILocation(line: 92, column: 1034, scope: !847, inlinedAt: !848)
!855 = !DILocalVariable(name: "g", arg: 1, scope: !856, file: !801, line: 133, type: !811)
