; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct15.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct15.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MDCT15Context = type { i32, i32, i32, i32, i32*, i32*, %struct.FFTContext, %struct.FFTComplex*, %struct.FFTComplex*, [64 x %struct.FFTComplex], void (%struct.FFTComplex*, %struct.FFTComplex*, %struct.FFTComplex*, i64)*, void (%struct.FFTComplex*, %struct.FFTComplex*, %struct.FFTComplex*, i32*, i64)*, void (%struct.MDCT15Context*, float*, float*, i64)*, void (%struct.MDCT15Context*, float*, float*, i64)* }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }
%struct.FFTComplex = type { float, float }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_mdct15_uninit(%struct.MDCT15Context** %ps) #0 !dbg !26 {
entry:
  %ps.addr = alloca %struct.MDCT15Context**, align 8
  %s = alloca %struct.MDCT15Context*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct15.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !16, line: 39, baseType: !17)
!16 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !16, line: 37, size: 64, align: 32, elements: !18)
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !17, file: !16, line: 38, baseType: !20, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !16, line: 35, baseType: !21)
!21 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !17, file: !16, line: 38, baseType: !20, size: 32, align: 32, offset: 32)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!26 = distinct !DISubprogram(name: "ff_mdct15_uninit", scope: !27, file: !27, line: 43, type: !28, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !113)
!27 = !DIFile(filename: "libavcodec/mdct15.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDCT15Context", file: !33, line: 54, baseType: !34)
!33 = !DIFile(filename: "libavcodec/mdct15.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDCT15Context", file: !33, line: 28, size: 5632, align: 256, elements: !35)
!35 = !{!36, !38, !39, !40, !41, !43, !44, !87, !88, !89, !93, !100, !104, !112}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fft_n", scope: !34, file: !33, line: 29, baseType: !37, size: 32, align: 32)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len2", scope: !34, file: !33, line: 30, baseType: !37, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "len4", scope: !34, file: !33, line: 31, baseType: !37, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !34, file: !33, line: 32, baseType: !37, size: 32, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_prereindex", scope: !34, file: !33, line: 33, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_postreindex", scope: !34, file: !33, line: 34, baseType: !42, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptwo_fft", scope: !34, file: !33, line: 36, baseType: !45, size: 896, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !16, line: 41, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !47)
!47 = !{!48, !49, !50, !55, !56, !57, !58, !60, !61, !66, !67, !73, !74, !75, !81, !82, !83}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !46, file: !4, line: 89, baseType: !37, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !46, file: !4, line: 90, baseType: !37, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !46, file: !4, line: 91, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !53, line: 49, baseType: !54)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!54 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !46, file: !4, line: 92, baseType: !14, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !46, file: !4, line: 93, baseType: !37, size: 32, align: 32, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !46, file: !4, line: 94, baseType: !37, size: 32, align: 32, offset: 224)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !46, file: !4, line: 96, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !46, file: !4, line: 97, baseType: !59, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !46, file: !4, line: 101, baseType: !62, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !14}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !46, file: !4, line: 106, baseType: !62, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !46, file: !4, line: 107, baseType: !68, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !65, !59, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !46, file: !4, line: 108, baseType: !68, size: 64, align: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !46, file: !4, line: 109, baseType: !68, size: 64, align: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !46, file: !4, line: 110, baseType: !76, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !65, !79, !71}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !21)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !46, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !46, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !46, file: !4, line: 113, baseType: !84, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 51, baseType: !86)
!86 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !34, file: !33, line: 37, baseType: !14, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "twiddle_exptab", scope: !34, file: !33, line: 38, baseType: !14, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "exptab", scope: !34, file: !33, line: 40, baseType: !90, size: 4096, align: 32, offset: 1280)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4096, align: 32, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fft15", scope: !34, file: !33, line: 43, baseType: !94, size: 64, align: 64, offset: 5376)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !14, !14, !14, !97}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !98, line: 149, baseType: !99)
!98 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!99 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "postreindex", scope: !34, file: !33, line: 46, baseType: !101, size: 64, align: 64, offset: 5440)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !14, !14, !14, !42, !97}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !34, file: !33, line: 49, baseType: !105, size: 64, align: 64, offset: 5504)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108, !109, !110, !97}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !34, file: !33, line: 52, baseType: !105, size: 64, align: 64, offset: 5568)
!113 = !{}
!114 = !DILocalVariable(name: "ps", arg: 1, scope: !26, file: !27, line: 43, type: !30)
!115 = !DIExpression()
!116 = !DILocation(line: 43, column: 61, scope: !26)
!117 = !DILocalVariable(name: "s", scope: !26, file: !27, line: 45, type: !31)
!118 = !DILocation(line: 45, column: 20, scope: !26)
!119 = !DILocation(line: 45, column: 25, scope: !26)
!120 = !DILocation(line: 45, column: 24, scope: !26)
!121 = !DILocation(line: 47, column: 10, scope: !122)
!122 = distinct !DILexicalBlock(scope: !26, file: !27, line: 47, column: 9)
!123 = !DILocation(line: 47, column: 9, scope: !26)
!124 = !DILocation(line: 48, column: 9, scope: !122)
!125 = !DILocation(line: 50, column: 17, scope: !26)
!126 = !DILocation(line: 50, column: 20, scope: !26)
!127 = !DILocation(line: 50, column: 5, scope: !26)
!128 = !DILocation(line: 52, column: 15, scope: !26)
!129 = !DILocation(line: 52, column: 18, scope: !26)
!130 = !DILocation(line: 52, column: 14, scope: !26)
!131 = !DILocation(line: 52, column: 5, scope: !26)
!132 = !DILocation(line: 53, column: 15, scope: !26)
!133 = !DILocation(line: 53, column: 18, scope: !26)
!134 = !DILocation(line: 53, column: 14, scope: !26)
!135 = !DILocation(line: 53, column: 5, scope: !26)
!136 = !DILocation(line: 54, column: 15, scope: !26)
!137 = !DILocation(line: 54, column: 18, scope: !26)
!138 = !DILocation(line: 54, column: 14, scope: !26)
!139 = !DILocation(line: 54, column: 5, scope: !26)
!140 = !DILocation(line: 55, column: 15, scope: !26)
!141 = !DILocation(line: 55, column: 18, scope: !26)
!142 = !DILocation(line: 55, column: 14, scope: !26)
!143 = !DILocation(line: 55, column: 5, scope: !26)
!144 = !DILocation(line: 57, column: 14, scope: !26)
!145 = !DILocation(line: 57, column: 5, scope: !26)
!146 = !DILocation(line: 58, column: 1, scope: !26)
!147 = !DILocation(line: 58, column: 1, scope: !148)
!148 = !DILexicalBlockFile(scope: !26, file: !27, discriminator: 1)
!149 = distinct !DISubprogram(name: "ff_mdct15_init", scope: !27, file: !27, line: 247, type: !150, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !113)
!150 = !DISubroutineType(types: !151)
!151 = !{!37, !30, !37, !37, !152}
!152 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!153 = !DILocalVariable(name: "ps", arg: 1, scope: !149, file: !27, line: 247, type: !30)
!154 = !DILocation(line: 247, column: 58, scope: !149)
!155 = !DILocalVariable(name: "inverse", arg: 2, scope: !149, file: !27, line: 247, type: !37)
!156 = !DILocation(line: 247, column: 66, scope: !149)
!157 = !DILocalVariable(name: "N", arg: 3, scope: !149, file: !27, line: 247, type: !37)
!158 = !DILocation(line: 247, column: 79, scope: !149)
!159 = !DILocalVariable(name: "scale", arg: 4, scope: !149, file: !27, line: 247, type: !152)
!160 = !DILocation(line: 247, column: 89, scope: !149)
!161 = !DILocalVariable(name: "s", scope: !149, file: !27, line: 249, type: !31)
!162 = !DILocation(line: 249, column: 20, scope: !149)
!163 = !DILocalVariable(name: "alpha", scope: !149, file: !27, line: 250, type: !152)
!164 = !DILocation(line: 250, column: 12, scope: !149)
!165 = !DILocalVariable(name: "theta", scope: !149, file: !27, line: 250, type: !152)
!166 = !DILocation(line: 250, column: 19, scope: !149)
!167 = !DILocalVariable(name: "len2", scope: !149, file: !27, line: 251, type: !37)
!168 = !DILocation(line: 251, column: 9, scope: !149)
!169 = !DILocation(line: 251, column: 27, scope: !149)
!170 = !DILocation(line: 251, column: 24, scope: !149)
!171 = !DILocation(line: 251, column: 19, scope: !149)
!172 = !DILocalVariable(name: "len", scope: !149, file: !27, line: 252, type: !37)
!173 = !DILocation(line: 252, column: 9, scope: !149)
!174 = !DILocation(line: 252, column: 19, scope: !149)
!175 = !DILocation(line: 252, column: 17, scope: !149)
