; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--xsubdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--xsubdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889, !892, !893, !895, !903, !907, !905}
!888 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !890, line: 40, baseType: !891)
!890 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!891 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!892 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !890, line: 51, baseType: !888)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !898, line: 222, size: 16, align: 8, elements: !899)
!898 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !897, file: !898, line: 222, baseType: !901, size: 16, align: 16)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !890, line: 49, baseType: !902)
!902 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !890, line: 48, baseType: !906)
!906 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !898, line: 221, size: 32, align: 8, elements: !910)
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !909, file: !898, line: 221, baseType: !894, size: 32, align: 32)
!912 = !{!913, !1505, !1509}
!913 = distinct !DIGlobalVariable(name: "ff_xsub_decoder", scope: !0, file: !914, line: 176, type: !915, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_xsub_decoder)
!914 = !DIFile(filename: "libavcodec/xsubdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !917)
!917 = !{!918, !922, !923, !924, !925, !926, !935, !938, !941, !944, !949, !950, !992, !1000, !1001, !1002, !1004, !1404, !1410, !1415, !1419, !1420, !1460, !1480, !1484, !1485, !1489, !1493, !1494, !1498, !1499, !1500}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !916, file: !14, line: 3475, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !916, file: !14, line: 3480, baseType: !919, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !916, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !916, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !916, file: !14, line: 3487, baseType: !892, size: 32, align: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !916, file: !14, line: 3488, baseType: !927, size: 64, align: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !930, line: 61, baseType: !931)
!930 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !930, line: 58, size: 64, align: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !931, file: !930, line: 59, baseType: !892, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !931, file: !930, line: 60, baseType: !892, size: 32, align: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !916, file: !14, line: 3489, baseType: !936, size: 64, align: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !916, file: !14, line: 3490, baseType: !939, size: 64, align: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !916, file: !14, line: 3491, baseType: !942, size: 64, align: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !916, file: !14, line: 3492, baseType: !945, size: 64, align: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !890, line: 55, baseType: !948)
!948 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !916, file: !14, line: 3493, baseType: !905, size: 8, align: 8, offset: 576)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !916, file: !14, line: 3494, baseType: !951, size: 64, align: 64, offset: 640)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !955)
!955 = !{!956, !957, !962, !966, !967, !968, !969, !973, !979, !981, !985}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !954, file: !691, line: 72, baseType: !919, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !954, file: !691, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!919, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !954, file: !691, line: 85, baseType: !963, size: 64, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !954, file: !691, line: 93, baseType: !892, size: 32, align: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !954, file: !691, line: 99, baseType: !892, size: 32, align: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !954, file: !691, line: 108, baseType: !892, size: 32, align: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !954, file: !691, line: 113, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!961, !961, !961}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !954, file: !691, line: 123, baseType: !974, size: 64, align: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!977, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !954, file: !691, line: 130, baseType: !980, size: 32, align: 32, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !954, file: !691, line: 136, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!980, !961}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !954, file: !691, line: 142, baseType: !986, size: 64, align: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!892, !989, !961, !919, !892}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !916, file: !14, line: 3495, baseType: !993, size: 64, align: 64, offset: 704)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !996, file: !14, line: 3402, baseType: !892, size: 32, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !14, line: 3403, baseType: !919, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !916, file: !14, line: 3507, baseType: !919, size: 64, align: 64, offset: 768)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !916, file: !14, line: 3516, baseType: !892, size: 32, align: 32, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !916, file: !14, line: 3517, baseType: !1003, size: 64, align: 64, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !916, file: !14, line: 3527, baseType: !1005, size: 64, align: 64, offset: 960)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!892, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1018, !1019, !1020, !1021, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1146, !1150, !1151, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1335, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1010, file: !14, line: 1561, baseType: !951, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1010, file: !14, line: 1562, baseType: !892, size: 32, align: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1010, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1010, file: !14, line: 1565, baseType: !1016, size: 64, align: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1010, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1010, file: !14, line: 1581, baseType: !888, size: 32, align: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1010, file: !14, line: 1583, baseType: !961, size: 64, align: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1010, file: !14, line: 1591, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1010, file: !14, line: 1598, baseType: !961, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1010, file: !14, line: 1606, baseType: !889, size: 64, align: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1010, file: !14, line: 1614, baseType: !892, size: 32, align: 32, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1010, file: !14, line: 1622, baseType: !892, size: 32, align: 32, offset: 544)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1010, file: !14, line: 1628, baseType: !892, size: 32, align: 32, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !14, line: 1636, baseType: !892, size: 32, align: 32, offset: 608)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1010, file: !14, line: 1643, baseType: !892, size: 32, align: 32, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1010, file: !14, line: 1657, baseType: !1032, size: 64, align: 64, offset: 704)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1010, file: !14, line: 1658, baseType: !892, size: 32, align: 32, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1010, file: !14, line: 1679, baseType: !929, size: 64, align: 32, offset: 800)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1010, file: !14, line: 1688, baseType: !892, size: 32, align: 32, offset: 864)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1010, file: !14, line: 1712, baseType: !892, size: 32, align: 32, offset: 896)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1010, file: !14, line: 1729, baseType: !892, size: 32, align: 32, offset: 928)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1010, file: !14, line: 1729, baseType: !892, size: 32, align: 32, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1010, file: !14, line: 1744, baseType: !892, size: 32, align: 32, offset: 992)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1010, file: !14, line: 1744, baseType: !892, size: 32, align: 32, offset: 1024)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1010, file: !14, line: 1751, baseType: !892, size: 32, align: 32, offset: 1056)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1010, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1010, file: !14, line: 1791, baseType: !1044, size: 64, align: 64, offset: 1152)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !1047, !1048, !1145, !892, !892, !892}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1052)
!1052 = !{!1053, !1057, !1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1097, !1099, !1100, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1133, !1134, !1135, !1136, !1137, !1138, !1141, !1142, !1143, !1144}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !722, line: 282, baseType: !1054, size: 512, align: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 512, align: 64, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 8)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1051, file: !722, line: 299, baseType: !1058, size: 256, align: 32, offset: 512)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 256, align: 32, elements: !1055)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1051, file: !722, line: 315, baseType: !1060, size: 64, align: 64, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1051, file: !722, line: 326, baseType: !892, size: 32, align: 32, offset: 832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1051, file: !722, line: 326, baseType: !892, size: 32, align: 32, offset: 864)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1051, file: !722, line: 334, baseType: !892, size: 32, align: 32, offset: 896)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1051, file: !722, line: 341, baseType: !892, size: 32, align: 32, offset: 928)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1051, file: !722, line: 346, baseType: !892, size: 32, align: 32, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1051, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1051, file: !722, line: 356, baseType: !929, size: 64, align: 32, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1051, file: !722, line: 361, baseType: !889, size: 64, align: 64, offset: 1088)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1051, file: !722, line: 369, baseType: !889, size: 64, align: 64, offset: 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1051, file: !722, line: 377, baseType: !889, size: 64, align: 64, offset: 1216)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1051, file: !722, line: 382, baseType: !892, size: 32, align: 32, offset: 1280)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1051, file: !722, line: 386, baseType: !892, size: 32, align: 32, offset: 1312)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1051, file: !722, line: 391, baseType: !892, size: 32, align: 32, offset: 1344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1051, file: !722, line: 396, baseType: !961, size: 64, align: 64, offset: 1408)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1051, file: !722, line: 403, baseType: !1076, size: 512, align: 64, offset: 1472)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, align: 64, elements: !1055)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1051, file: !722, line: 410, baseType: !892, size: 32, align: 32, offset: 1984)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1051, file: !722, line: 415, baseType: !892, size: 32, align: 32, offset: 2016)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1051, file: !722, line: 420, baseType: !892, size: 32, align: 32, offset: 2048)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1051, file: !722, line: 425, baseType: !892, size: 32, align: 32, offset: 2080)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1051, file: !722, line: 435, baseType: !889, size: 64, align: 64, offset: 2112)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1051, file: !722, line: 440, baseType: !892, size: 32, align: 32, offset: 2176)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1051, file: !722, line: 445, baseType: !947, size: 64, align: 64, offset: 2240)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1051, file: !722, line: 459, baseType: !1085, size: 512, align: 64, offset: 2304)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 512, align: 64, elements: !1055)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1088, line: 94, baseType: !1089)
!1088 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1088, line: 81, size: 192, align: 64, elements: !1090)
!1090 = !{!1091, !1095, !1096}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1089, file: !1088, line: 82, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1088, line: 73, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1088, line: 73, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !1088, line: 89, baseType: !1032, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !1088, line: 93, baseType: !892, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1051, file: !722, line: 473, baseType: !1098, size: 64, align: 64, offset: 2816)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1051, file: !722, line: 477, baseType: !892, size: 32, align: 32, offset: 2880)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1051, file: !722, line: 479, baseType: !1101, size: 64, align: 64, offset: 2944)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1114}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1104, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !722, line: 203, baseType: !1032, size: 64, align: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !722, line: 204, baseType: !892, size: 32, align: 32, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1104, file: !722, line: 205, baseType: !1110, size: 64, align: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1112, line: 86, baseType: !1113)
!1112 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1112, line: 86, flags: DIFlagFwdDecl)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1104, file: !722, line: 206, baseType: !1086, size: 64, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1051, file: !722, line: 480, baseType: !892, size: 32, align: 32, offset: 3008)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1051, file: !722, line: 505, baseType: !892, size: 32, align: 32, offset: 3040)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1051, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1051, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1051, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1051, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1051, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1051, file: !722, line: 532, baseType: !889, size: 64, align: 64, offset: 3264)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1051, file: !722, line: 539, baseType: !889, size: 64, align: 64, offset: 3328)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1051, file: !722, line: 547, baseType: !889, size: 64, align: 64, offset: 3392)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1051, file: !722, line: 554, baseType: !1110, size: 64, align: 64, offset: 3456)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1051, file: !722, line: 563, baseType: !892, size: 32, align: 32, offset: 3520)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1051, file: !722, line: 572, baseType: !892, size: 32, align: 32, offset: 3552)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1051, file: !722, line: 581, baseType: !892, size: 32, align: 32, offset: 3584)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1051, file: !722, line: 588, baseType: !1130, size: 64, align: 64, offset: 3648)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !890, line: 36, baseType: !1132)
!1132 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1051, file: !722, line: 593, baseType: !892, size: 32, align: 32, offset: 3712)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1051, file: !722, line: 596, baseType: !892, size: 32, align: 32, offset: 3744)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1051, file: !722, line: 599, baseType: !1086, size: 64, align: 64, offset: 3776)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1051, file: !722, line: 605, baseType: !1086, size: 64, align: 64, offset: 3840)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1051, file: !722, line: 616, baseType: !1086, size: 64, align: 64, offset: 3904)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1051, file: !722, line: 626, baseType: !1139, size: 64, align: 64, offset: 3968)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1140, line: 216, baseType: !948)
!1140 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1051, file: !722, line: 627, baseType: !1139, size: 64, align: 64, offset: 4032)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1051, file: !722, line: 628, baseType: !1139, size: 64, align: 64, offset: 4096)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1051, file: !722, line: 629, baseType: !1139, size: 64, align: 64, offset: 4160)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1051, file: !722, line: 645, baseType: !1086, size: 64, align: 64, offset: 4224)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1010, file: !14, line: 1808, baseType: !1147, size: 64, align: 64, offset: 1216)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!473, !1047, !936}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1010, file: !14, line: 1816, baseType: !892, size: 32, align: 32, offset: 1280)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1010, file: !14, line: 1825, baseType: !1152, size: 32, align: 32, offset: 1312)
!1152 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1010, file: !14, line: 1830, baseType: !892, size: 32, align: 32, offset: 1344)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1010, file: !14, line: 1838, baseType: !1152, size: 32, align: 32, offset: 1376)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1010, file: !14, line: 1846, baseType: !892, size: 32, align: 32, offset: 1408)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1010, file: !14, line: 1851, baseType: !892, size: 32, align: 32, offset: 1440)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1010, file: !14, line: 1861, baseType: !1152, size: 32, align: 32, offset: 1472)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1010, file: !14, line: 1868, baseType: !1152, size: 32, align: 32, offset: 1504)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1010, file: !14, line: 1875, baseType: !1152, size: 32, align: 32, offset: 1536)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1010, file: !14, line: 1882, baseType: !1152, size: 32, align: 32, offset: 1568)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1010, file: !14, line: 1889, baseType: !1152, size: 32, align: 32, offset: 1600)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1010, file: !14, line: 1896, baseType: !1152, size: 32, align: 32, offset: 1632)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1010, file: !14, line: 1903, baseType: !1152, size: 32, align: 32, offset: 1664)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1010, file: !14, line: 1910, baseType: !892, size: 32, align: 32, offset: 1696)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1010, file: !14, line: 1915, baseType: !892, size: 32, align: 32, offset: 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1010, file: !14, line: 1926, baseType: !1145, size: 64, align: 64, offset: 1792)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1010, file: !14, line: 1935, baseType: !929, size: 64, align: 32, offset: 1856)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1010, file: !14, line: 1942, baseType: !892, size: 32, align: 32, offset: 1920)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1010, file: !14, line: 1948, baseType: !892, size: 32, align: 32, offset: 1952)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1010, file: !14, line: 1954, baseType: !892, size: 32, align: 32, offset: 1984)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1010, file: !14, line: 1960, baseType: !892, size: 32, align: 32, offset: 2016)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1010, file: !14, line: 1984, baseType: !892, size: 32, align: 32, offset: 2048)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1010, file: !14, line: 1991, baseType: !892, size: 32, align: 32, offset: 2080)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1010, file: !14, line: 1996, baseType: !892, size: 32, align: 32, offset: 2112)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1010, file: !14, line: 2004, baseType: !892, size: 32, align: 32, offset: 2144)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1010, file: !14, line: 2011, baseType: !892, size: 32, align: 32, offset: 2176)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1010, file: !14, line: 2018, baseType: !892, size: 32, align: 32, offset: 2208)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1010, file: !14, line: 2027, baseType: !892, size: 32, align: 32, offset: 2240)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1010, file: !14, line: 2034, baseType: !892, size: 32, align: 32, offset: 2272)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1010, file: !14, line: 2044, baseType: !892, size: 32, align: 32, offset: 2304)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1010, file: !14, line: 2054, baseType: !1182, size: 64, align: 64, offset: 2368)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1010, file: !14, line: 2061, baseType: !1182, size: 64, align: 64, offset: 2432)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1010, file: !14, line: 2066, baseType: !892, size: 32, align: 32, offset: 2496)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1010, file: !14, line: 2070, baseType: !892, size: 32, align: 32, offset: 2528)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1010, file: !14, line: 2078, baseType: !892, size: 32, align: 32, offset: 2560)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1010, file: !14, line: 2085, baseType: !892, size: 32, align: 32, offset: 2592)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1010, file: !14, line: 2092, baseType: !892, size: 32, align: 32, offset: 2624)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1010, file: !14, line: 2099, baseType: !892, size: 32, align: 32, offset: 2656)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1010, file: !14, line: 2106, baseType: !892, size: 32, align: 32, offset: 2688)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1010, file: !14, line: 2113, baseType: !892, size: 32, align: 32, offset: 2720)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1010, file: !14, line: 2120, baseType: !892, size: 32, align: 32, offset: 2752)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1010, file: !14, line: 2125, baseType: !892, size: 32, align: 32, offset: 2784)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1010, file: !14, line: 2133, baseType: !892, size: 32, align: 32, offset: 2816)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1010, file: !14, line: 2140, baseType: !892, size: 32, align: 32, offset: 2848)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1010, file: !14, line: 2145, baseType: !892, size: 32, align: 32, offset: 2880)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1010, file: !14, line: 2153, baseType: !892, size: 32, align: 32, offset: 2912)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1010, file: !14, line: 2158, baseType: !892, size: 32, align: 32, offset: 2944)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1010, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1010, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1010, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1010, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1010, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1010, file: !14, line: 2203, baseType: !892, size: 32, align: 32, offset: 3136)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1010, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1010, file: !14, line: 2212, baseType: !892, size: 32, align: 32, offset: 3200)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1010, file: !14, line: 2213, baseType: !892, size: 32, align: 32, offset: 3232)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1010, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1010, file: !14, line: 2232, baseType: !892, size: 32, align: 32, offset: 3296)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1010, file: !14, line: 2243, baseType: !892, size: 32, align: 32, offset: 3328)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1010, file: !14, line: 2249, baseType: !892, size: 32, align: 32, offset: 3360)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1010, file: !14, line: 2256, baseType: !892, size: 32, align: 32, offset: 3392)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1010, file: !14, line: 2263, baseType: !947, size: 64, align: 64, offset: 3456)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1010, file: !14, line: 2270, baseType: !947, size: 64, align: 64, offset: 3520)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1010, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1010, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1010, file: !14, line: 2367, baseType: !1218, size: 64, align: 64, offset: 3648)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!892, !1047, !1221, !892}
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1010, file: !14, line: 2383, baseType: !892, size: 32, align: 32, offset: 3712)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1010, file: !14, line: 2386, baseType: !1152, size: 32, align: 32, offset: 3744)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1010, file: !14, line: 2387, baseType: !1152, size: 32, align: 32, offset: 3776)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1010, file: !14, line: 2394, baseType: !892, size: 32, align: 32, offset: 3808)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1010, file: !14, line: 2401, baseType: !892, size: 32, align: 32, offset: 3840)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1010, file: !14, line: 2408, baseType: !892, size: 32, align: 32, offset: 3872)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1010, file: !14, line: 2415, baseType: !892, size: 32, align: 32, offset: 3904)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1010, file: !14, line: 2422, baseType: !892, size: 32, align: 32, offset: 3936)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1010, file: !14, line: 2423, baseType: !1231, size: 64, align: 64, offset: 3968)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1233, file: !14, line: 827, baseType: !892, size: 32, align: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1233, file: !14, line: 828, baseType: !892, size: 32, align: 32, offset: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1233, file: !14, line: 829, baseType: !892, size: 32, align: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1233, file: !14, line: 830, baseType: !1152, size: 32, align: 32, offset: 96)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1010, file: !14, line: 2430, baseType: !889, size: 64, align: 64, offset: 4032)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1010, file: !14, line: 2437, baseType: !889, size: 64, align: 64, offset: 4096)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1010, file: !14, line: 2444, baseType: !1152, size: 32, align: 32, offset: 4160)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1010, file: !14, line: 2451, baseType: !1152, size: 32, align: 32, offset: 4192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1010, file: !14, line: 2458, baseType: !892, size: 32, align: 32, offset: 4224)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1010, file: !14, line: 2469, baseType: !892, size: 32, align: 32, offset: 4256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1010, file: !14, line: 2475, baseType: !892, size: 32, align: 32, offset: 4288)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1010, file: !14, line: 2481, baseType: !892, size: 32, align: 32, offset: 4320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1010, file: !14, line: 2485, baseType: !892, size: 32, align: 32, offset: 4352)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1010, file: !14, line: 2489, baseType: !892, size: 32, align: 32, offset: 4384)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1010, file: !14, line: 2493, baseType: !892, size: 32, align: 32, offset: 4416)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1010, file: !14, line: 2501, baseType: !892, size: 32, align: 32, offset: 4448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1010, file: !14, line: 2506, baseType: !892, size: 32, align: 32, offset: 4480)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1010, file: !14, line: 2510, baseType: !892, size: 32, align: 32, offset: 4512)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1010, file: !14, line: 2514, baseType: !889, size: 64, align: 64, offset: 4544)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1010, file: !14, line: 2528, baseType: !1255, size: 64, align: 64, offset: 4608)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{null, !1047, !961, !892, !892}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1010, file: !14, line: 2534, baseType: !892, size: 32, align: 32, offset: 4672)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1010, file: !14, line: 2545, baseType: !892, size: 32, align: 32, offset: 4704)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1010, file: !14, line: 2547, baseType: !892, size: 32, align: 32, offset: 4736)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1010, file: !14, line: 2549, baseType: !892, size: 32, align: 32, offset: 4768)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1010, file: !14, line: 2551, baseType: !892, size: 32, align: 32, offset: 4800)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1010, file: !14, line: 2553, baseType: !892, size: 32, align: 32, offset: 4832)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1010, file: !14, line: 2555, baseType: !892, size: 32, align: 32, offset: 4864)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1010, file: !14, line: 2557, baseType: !892, size: 32, align: 32, offset: 4896)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1010, file: !14, line: 2559, baseType: !892, size: 32, align: 32, offset: 4928)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1010, file: !14, line: 2563, baseType: !892, size: 32, align: 32, offset: 4960)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1010, file: !14, line: 2571, baseType: !1269, size: 64, align: 64, offset: 4992)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1010, file: !14, line: 2579, baseType: !1269, size: 64, align: 64, offset: 5056)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1010, file: !14, line: 2586, baseType: !892, size: 32, align: 32, offset: 5120)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1010, file: !14, line: 2615, baseType: !892, size: 32, align: 32, offset: 5152)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1010, file: !14, line: 2627, baseType: !892, size: 32, align: 32, offset: 5184)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1010, file: !14, line: 2637, baseType: !892, size: 32, align: 32, offset: 5216)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1010, file: !14, line: 2681, baseType: !892, size: 32, align: 32, offset: 5248)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1010, file: !14, line: 2709, baseType: !889, size: 64, align: 64, offset: 5312)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1010, file: !14, line: 2716, baseType: !1278, size: 64, align: 64, offset: 5376)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1291, !1295, !1299, !1300, !1301, !1302, !1308, !1309, !1310, !1311, !1312}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1280, file: !14, line: 3642, baseType: !919, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1280, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1280, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1280, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1280, file: !14, line: 3669, baseType: !892, size: 32, align: 32, offset: 160)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1280, file: !14, line: 3682, baseType: !1288, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!892, !1008, !1221}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1280, file: !14, line: 3698, baseType: !1292, size: 64, align: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!892, !1008, !903, !894}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1280, file: !14, line: 3712, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!892, !1008, !892, !903, !894}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1280, file: !14, line: 3726, baseType: !1292, size: 64, align: 64, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1280, file: !14, line: 3737, baseType: !1005, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1280, file: !14, line: 3746, baseType: !892, size: 32, align: 32, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1280, file: !14, line: 3757, baseType: !1303, size: 64, align: 64, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !1306}
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1280, file: !14, line: 3766, baseType: !1005, size: 64, align: 64, offset: 640)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1280, file: !14, line: 3774, baseType: !1005, size: 64, align: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1280, file: !14, line: 3780, baseType: !892, size: 32, align: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1280, file: !14, line: 3785, baseType: !892, size: 32, align: 32, offset: 800)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1280, file: !14, line: 3795, baseType: !1313, size: 64, align: 64, offset: 832)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!892, !1008, !1086}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1010, file: !14, line: 2728, baseType: !961, size: 64, align: 64, offset: 5440)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1010, file: !14, line: 2735, baseType: !1076, size: 512, align: 64, offset: 5504)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1010, file: !14, line: 2742, baseType: !892, size: 32, align: 32, offset: 6016)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1010, file: !14, line: 2755, baseType: !892, size: 32, align: 32, offset: 6048)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1010, file: !14, line: 2776, baseType: !892, size: 32, align: 32, offset: 6080)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1010, file: !14, line: 2783, baseType: !892, size: 32, align: 32, offset: 6112)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1010, file: !14, line: 2791, baseType: !892, size: 32, align: 32, offset: 6144)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1010, file: !14, line: 2802, baseType: !1221, size: 64, align: 64, offset: 6208)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1010, file: !14, line: 2811, baseType: !892, size: 32, align: 32, offset: 6272)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1010, file: !14, line: 2821, baseType: !892, size: 32, align: 32, offset: 6304)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1010, file: !14, line: 2830, baseType: !892, size: 32, align: 32, offset: 6336)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1010, file: !14, line: 2840, baseType: !892, size: 32, align: 32, offset: 6368)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1010, file: !14, line: 2851, baseType: !1329, size: 64, align: 64, offset: 6400)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!892, !1047, !1332, !961, !1145, !892, !892}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!892, !1047, !961}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1010, file: !14, line: 2871, baseType: !1336, size: 64, align: 64, offset: 6464)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!892, !1047, !1339, !961, !1145, !892}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!892, !1047, !961, !892, !892}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1010, file: !14, line: 2878, baseType: !892, size: 32, align: 32, offset: 6528)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1010, file: !14, line: 2885, baseType: !892, size: 32, align: 32, offset: 6560)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1010, file: !14, line: 3005, baseType: !892, size: 32, align: 32, offset: 6592)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1010, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1010, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1010, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1010, file: !14, line: 3037, baseType: !1032, size: 64, align: 64, offset: 6720)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1010, file: !14, line: 3038, baseType: !892, size: 32, align: 32, offset: 6784)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1010, file: !14, line: 3050, baseType: !947, size: 64, align: 64, offset: 6848)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1010, file: !14, line: 3065, baseType: !892, size: 32, align: 32, offset: 6912)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1010, file: !14, line: 3083, baseType: !892, size: 32, align: 32, offset: 6944)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1010, file: !14, line: 3092, baseType: !929, size: 64, align: 32, offset: 6976)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1010, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1010, file: !14, line: 3106, baseType: !929, size: 64, align: 32, offset: 7072)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1010, file: !14, line: 3113, baseType: !1357, size: 64, align: 64, offset: 7168)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1367, !1370}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1360, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1360, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1360, file: !14, line: 720, baseType: !919, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1360, file: !14, line: 724, baseType: !919, size: 64, align: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1360, file: !14, line: 728, baseType: !892, size: 32, align: 32, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1360, file: !14, line: 734, baseType: !1368, size: 64, align: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1360, file: !14, line: 739, baseType: !1371, size: 64, align: 64, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1010, file: !14, line: 3129, baseType: !889, size: 64, align: 64, offset: 7232)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1010, file: !14, line: 3130, baseType: !889, size: 64, align: 64, offset: 7296)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1010, file: !14, line: 3131, baseType: !889, size: 64, align: 64, offset: 7360)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1010, file: !14, line: 3132, baseType: !889, size: 64, align: 64, offset: 7424)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1010, file: !14, line: 3139, baseType: !1269, size: 64, align: 64, offset: 7488)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1010, file: !14, line: 3147, baseType: !892, size: 32, align: 32, offset: 7552)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1010, file: !14, line: 3165, baseType: !892, size: 32, align: 32, offset: 7584)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1010, file: !14, line: 3172, baseType: !892, size: 32, align: 32, offset: 7616)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1010, file: !14, line: 3180, baseType: !892, size: 32, align: 32, offset: 7648)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1010, file: !14, line: 3191, baseType: !1182, size: 64, align: 64, offset: 7680)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1010, file: !14, line: 3199, baseType: !1032, size: 64, align: 64, offset: 7744)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1010, file: !14, line: 3207, baseType: !1269, size: 64, align: 64, offset: 7808)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1010, file: !14, line: 3214, baseType: !888, size: 32, align: 32, offset: 7872)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1010, file: !14, line: 3224, baseType: !1387, size: 64, align: 64, offset: 7936)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1390)
!1390 = !{!1391, !1392, !1393}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1389, file: !14, line: 1412, baseType: !1032, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1389, file: !14, line: 1413, baseType: !892, size: 32, align: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1389, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1010, file: !14, line: 3225, baseType: !892, size: 32, align: 32, offset: 8000)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1010, file: !14, line: 3249, baseType: !1086, size: 64, align: 64, offset: 8064)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1010, file: !14, line: 3256, baseType: !892, size: 32, align: 32, offset: 8128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1010, file: !14, line: 3271, baseType: !892, size: 32, align: 32, offset: 8160)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1010, file: !14, line: 3279, baseType: !889, size: 64, align: 64, offset: 8192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1010, file: !14, line: 3301, baseType: !1086, size: 64, align: 64, offset: 8256)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1010, file: !14, line: 3310, baseType: !892, size: 32, align: 32, offset: 8320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1010, file: !14, line: 3337, baseType: !892, size: 32, align: 32, offset: 8352)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1010, file: !14, line: 3351, baseType: !892, size: 32, align: 32, offset: 8384)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1010, file: !14, line: 3359, baseType: !892, size: 32, align: 32, offset: 8416)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !916, file: !14, line: 3535, baseType: !1405, size: 64, align: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!892, !1008, !1408}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !916, file: !14, line: 3541, baseType: !1411, size: 64, align: 64, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1414)
!1414 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !916, file: !14, line: 3549, baseType: !1416, size: 64, align: 64, offset: 1152)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{null, !1003}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !916, file: !14, line: 3551, baseType: !1005, size: 64, align: 64, offset: 1216)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !916, file: !14, line: 3552, baseType: !1421, size: 64, align: 64, offset: 1280)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!892, !1008, !1032, !892, !1424}
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431, !1432, !1459}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1426, file: !14, line: 3921, baseType: !901, size: 16, align: 16)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1426, file: !14, line: 3922, baseType: !894, size: 32, align: 32, offset: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1426, file: !14, line: 3923, baseType: !894, size: 32, align: 32, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1426, file: !14, line: 3924, baseType: !888, size: 32, align: 32, offset: 96)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1426, file: !14, line: 3925, baseType: !1433, size: 64, align: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441, !1442, !1443, !1449, !1453, !1455, !1456, !1457, !1458}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1436, file: !14, line: 3886, baseType: !892, size: 32, align: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1436, file: !14, line: 3887, baseType: !892, size: 32, align: 32, offset: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1436, file: !14, line: 3888, baseType: !892, size: 32, align: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1436, file: !14, line: 3889, baseType: !892, size: 32, align: 32, offset: 96)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1436, file: !14, line: 3890, baseType: !892, size: 32, align: 32, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1436, file: !14, line: 3897, baseType: !1444, size: 768, align: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1446)
!1446 = !{!1447, !1448}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1445, file: !14, line: 3855, baseType: !1054, size: 512, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1445, file: !14, line: 3857, baseType: !1058, size: 256, align: 32, offset: 512)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1436, file: !14, line: 3903, baseType: !1450, size: 256, align: 64, offset: 960)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 256, align: 64, elements: !1451)
!1451 = !{!1452}
!1452 = !DISubrange(count: 4)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1436, file: !14, line: 3904, baseType: !1454, size: 128, align: 32, offset: 1216)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 128, align: 32, elements: !1451)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1436, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1436, file: !14, line: 3908, baseType: !1269, size: 64, align: 64, offset: 1408)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1436, file: !14, line: 3915, baseType: !1269, size: 64, align: 64, offset: 1472)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1436, file: !14, line: 3917, baseType: !892, size: 32, align: 32, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1426, file: !14, line: 3926, baseType: !889, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !916, file: !14, line: 3564, baseType: !1461, size: 64, align: 64, offset: 1344)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!892, !1008, !1464, !1048, !1145}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1467)
!1467 = !{!1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1466, file: !14, line: 1451, baseType: !1086, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1466, file: !14, line: 1461, baseType: !889, size: 64, align: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1466, file: !14, line: 1467, baseType: !889, size: 64, align: 64, offset: 128)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1466, file: !14, line: 1468, baseType: !1032, size: 64, align: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1466, file: !14, line: 1469, baseType: !892, size: 32, align: 32, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1466, file: !14, line: 1470, baseType: !892, size: 32, align: 32, offset: 288)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1466, file: !14, line: 1474, baseType: !892, size: 32, align: 32, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1466, file: !14, line: 1479, baseType: !1387, size: 64, align: 64, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1466, file: !14, line: 1480, baseType: !892, size: 32, align: 32, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1466, file: !14, line: 1486, baseType: !889, size: 64, align: 64, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1466, file: !14, line: 1488, baseType: !889, size: 64, align: 64, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1466, file: !14, line: 1497, baseType: !889, size: 64, align: 64, offset: 640)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !916, file: !14, line: 3566, baseType: !1481, size: 64, align: 64, offset: 1408)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!892, !1008, !961, !1145, !1464}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !916, file: !14, line: 3567, baseType: !1005, size: 64, align: 64, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !916, file: !14, line: 3576, baseType: !1486, size: 64, align: 64, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!892, !1008, !1048}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !916, file: !14, line: 3577, baseType: !1490, size: 64, align: 64, offset: 1600)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!892, !1008, !1464}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !916, file: !14, line: 3584, baseType: !1288, size: 64, align: 64, offset: 1664)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !916, file: !14, line: 3589, baseType: !1495, size: 64, align: 64, offset: 1728)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1008}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !916, file: !14, line: 3594, baseType: !892, size: 32, align: 32, offset: 1792)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !916, file: !14, line: 3600, baseType: !919, size: 64, align: 64, offset: 1856)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !916, file: !14, line: 3609, baseType: !1501, size: 64, align: 64, offset: 1920)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1504)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1505 = distinct !DIGlobalVariable(name: "tc_offsets", scope: !0, file: !914, line: 33, type: !1506, isLocal: true, isDefinition: true, variable: [9 x i8]* @tc_offsets)
!1506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 72, align: 8, elements: !1507)
!1507 = !{!1508}
!1508 = !DISubrange(count: 9)
!1509 = distinct !DIGlobalVariable(name: "tc_muls", scope: !0, file: !914, line: 34, type: !1506, isLocal: true, isDefinition: true, variable: [9 x i8]* @tc_muls)
!1510 = !{i32 2, !"Dwarf Version", i32 4}
!1511 = !{i32 2, !"Debug Info Version", i32 3}
!1512 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1513 = distinct !DISubprogram(name: "decode_init", scope: !914, file: !914, line: 28, type: !1006, isLocal: true, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1514)
!1514 = !{}
!1515 = !DILocalVariable(name: "avctx", arg: 1, scope: !1513, file: !914, line: 28, type: !1008)
!1516 = !DIExpression()
!1517 = !DILocation(line: 28, column: 62, scope: !1513)
!1518 = !DILocation(line: 29, column: 5, scope: !1513)
!1519 = !DILocation(line: 29, column: 12, scope: !1513)
!1520 = !DILocation(line: 29, column: 20, scope: !1513)
!1521 = !DILocation(line: 30, column: 5, scope: !1513)
!1522 = distinct !DISubprogram(name: "decode_frame", scope: !914, file: !914, line: 49, type: !1482, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1514)
!1523 = !DILocalVariable(name: "b", arg: 1, scope: !1524, file: !1525, line: 90, type: !1528)
!1524 = distinct !DISubprogram(name: "bytestream_get_le16", scope: !1525, file: !1525, line: 90, type: !1526, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1514)
!1525 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!888, !1528}
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!1529 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1530)
!1530 = distinct !DILocation(line: 92, column: 5, scope: !1522)
!1531 = !DILocalVariable(name: "b", arg: 1, scope: !1532, file: !1525, line: 93, type: !1528)
!1532 = distinct !DISubprogram(name: "bytestream_get_be24", scope: !1525, file: !1525, line: 93, type: !1526, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1514)
!1533 = !DILocation(line: 93, column: 95, scope: !1532, inlinedAt: !1534)
!1534 = distinct !DILocation(line: 125, column: 50, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1536, file: !914, line: 124, column: 5)
!1536 = distinct !DILexicalBlock(scope: !1522, file: !914, line: 124, column: 5)
!1537 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1538)
!1538 = distinct !DILocation(line: 87, column: 5, scope: !1522)
!1539 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1540)
!1540 = distinct !DILocation(line: 86, column: 5, scope: !1522)
!1541 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1542)
!1542 = distinct !DILocation(line: 84, column: 9, scope: !1522)
!1543 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1544)
!1544 = distinct !DILocation(line: 83, column: 9, scope: !1522)
!1545 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1546)
!1546 = distinct !DILocation(line: 80, column: 9, scope: !1522)
!1547 = !DILocation(line: 90, column: 95, scope: !1524, inlinedAt: !1548)
!1548 = distinct !DILocation(line: 79, column: 9, scope: !1522)
!1549 = !DILocalVariable(name: "avctx", arg: 1, scope: !1522, file: !914, line: 49, type: !1008)
!1550 = !DILocation(line: 49, column: 41, scope: !1522)
!1551 = !DILocalVariable(name: "data", arg: 2, scope: !1522, file: !914, line: 49, type: !961)
!1552 = !DILocation(line: 49, column: 54, scope: !1522)
!1553 = !DILocalVariable(name: "data_size", arg: 3, scope: !1522, file: !914, line: 49, type: !1145)
!1554 = !DILocation(line: 49, column: 65, scope: !1522)
!1555 = !DILocalVariable(name: "avpkt", arg: 4, scope: !1522, file: !914, line: 50, type: !1464)
!1556 = !DILocation(line: 50, column: 35, scope: !1522)
!1557 = !DILocalVariable(name: "buf", scope: !1522, file: !914, line: 51, type: !903)
!1558 = !DILocation(line: 51, column: 20, scope: !1522)
!1559 = !DILocation(line: 51, column: 26, scope: !1522)
!1560 = !DILocation(line: 51, column: 33, scope: !1522)
!1561 = !DILocalVariable(name: "buf_size", scope: !1522, file: !914, line: 52, type: !892)
!1562 = !DILocation(line: 52, column: 9, scope: !1522)
!1563 = !DILocation(line: 52, column: 20, scope: !1522)
!1564 = !DILocation(line: 52, column: 27, scope: !1522)
!1565 = !DILocalVariable(name: "sub", scope: !1522, file: !914, line: 53, type: !1566)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1426)
!1568 = !DILocation(line: 53, column: 17, scope: !1522)
!1569 = !DILocation(line: 53, column: 23, scope: !1522)
!1570 = !DILocalVariable(name: "buf_end", scope: !1522, file: !914, line: 54, type: !903)
!1571 = !DILocation(line: 54, column: 20, scope: !1522)
!1572 = !DILocation(line: 54, column: 30, scope: !1522)
!1573 = !DILocation(line: 54, column: 36, scope: !1522)
!1574 = !DILocation(line: 54, column: 34, scope: !1522)
!1575 = !DILocalVariable(name: "bitmap", scope: !1522, file: !914, line: 55, type: !1032)
!1576 = !DILocation(line: 55, column: 14, scope: !1522)
!1577 = !DILocalVariable(name: "w", scope: !1522, file: !914, line: 56, type: !892)
!1578 = !DILocation(line: 56, column: 9, scope: !1522)
!1579 = !DILocalVariable(name: "h", scope: !1522, file: !914, line: 56, type: !892)
!1580 = !DILocation(line: 56, column: 12, scope: !1522)
!1581 = !DILocalVariable(name: "x", scope: !1522, file: !914, line: 56, type: !892)
!1582 = !DILocation(line: 56, column: 15, scope: !1522)
!1583 = !DILocalVariable(name: "y", scope: !1522, file: !914, line: 56, type: !892)
!1584 = !DILocation(line: 56, column: 18, scope: !1522)
!1585 = !DILocalVariable(name: "i", scope: !1522, file: !914, line: 56, type: !892)
!1586 = !DILocation(line: 56, column: 21, scope: !1522)
!1587 = !DILocalVariable(name: "ret", scope: !1522, file: !914, line: 56, type: !892)
!1588 = !DILocation(line: 56, column: 24, scope: !1522)
!1589 = !DILocalVariable(name: "packet_time", scope: !1522, file: !914, line: 57, type: !889)
!1590 = !DILocation(line: 57, column: 13, scope: !1522)
!1591 = !DILocalVariable(name: "gb", scope: !1522, file: !914, line: 58, type: !1592)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1593, line: 70, baseType: !1594)
!1593 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1593, line: 61, size: 256, align: 64, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599, !1600}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1594, file: !1593, line: 62, baseType: !903, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1594, file: !1593, line: 62, baseType: !903, size: 64, align: 64, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1594, file: !1593, line: 67, baseType: !892, size: 32, align: 32, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1594, file: !1593, line: 68, baseType: !892, size: 32, align: 32, offset: 160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1594, file: !1593, line: 69, baseType: !892, size: 32, align: 32, offset: 192)
!1601 = !DILocation(line: 58, column: 19, scope: !1522)
!1602 = !DILocalVariable(name: "has_alpha", scope: !1522, file: !914, line: 59, type: !892)
!1603 = !DILocation(line: 59, column: 9, scope: !1522)
!1604 = !DILocation(line: 59, column: 21, scope: !1522)
!1605 = !DILocation(line: 59, column: 28, scope: !1522)
!1606 = !DILocation(line: 59, column: 38, scope: !1522)
!1607 = !DILocation(line: 62, column: 9, scope: !1608)
!1608 = distinct !DILexicalBlock(scope: !1522, file: !914, line: 62, column: 9)
!1609 = !DILocation(line: 62, column: 42, scope: !1608)
!1610 = !DILocation(line: 62, column: 40, scope: !1608)
!1611 = !DILocation(line: 62, column: 35, scope: !1608)
!1612 = !DILocation(line: 62, column: 31, scope: !1608)
!1613 = !DILocation(line: 62, column: 18, scope: !1608)
!1614 = !DILocation(line: 62, column: 9, scope: !1522)
!1615 = !DILocation(line: 63, column: 16, scope: !1616)
!1616 = distinct !DILexicalBlock(scope: !1608, file: !914, line: 62, column: 54)
!1617 = !DILocation(line: 63, column: 62, scope: !1616)
!1618 = !DILocation(line: 63, column: 9, scope: !1616)
!1619 = !DILocation(line: 64, column: 9, scope: !1616)
!1620 = !DILocation(line: 68, column: 9, scope: !1621)
!1621 = distinct !DILexicalBlock(scope: !1522, file: !914, line: 68, column: 9)
!1622 = !DILocation(line: 68, column: 16, scope: !1621)
!1623 = !DILocation(line: 68, column: 23, scope: !1621)
!1624 = !DILocation(line: 68, column: 26, scope: !1625)
!1625 = !DILexicalBlockFile(scope: !1621, file: !914, discriminator: 1)
!1626 = !DILocation(line: 68, column: 34, scope: !1625)
!1627 = !DILocation(line: 68, column: 41, scope: !1625)
!1628 = !DILocation(line: 68, column: 44, scope: !1629)
!1629 = !DILexicalBlockFile(scope: !1621, file: !914, discriminator: 2)
!1630 = !DILocation(line: 68, column: 52, scope: !1629)
!1631 = !DILocation(line: 68, column: 9, scope: !1629)
!1632 = !DILocation(line: 69, column: 16, scope: !1633)
!1633 = distinct !DILexicalBlock(scope: !1621, file: !914, line: 68, column: 60)
!1634 = !DILocation(line: 69, column: 9, scope: !1633)
!1635 = !DILocation(line: 70, column: 9, scope: !1633)
!1636 = !DILocation(line: 72, column: 9, scope: !1637)
!1637 = distinct !DILexicalBlock(scope: !1522, file: !914, line: 72, column: 9)
!1638 = !DILocation(line: 72, column: 16, scope: !1637)
!1639 = !DILocation(line: 72, column: 20, scope: !1637)
!1640 = !DILocation(line: 72, column: 9, scope: !1522)
!1641 = !DILocation(line: 73, column: 36, scope: !1637)
!1642 = !DILocation(line: 73, column: 43, scope: !1637)
!1643 = !DILocation(line: 73, column: 60, scope: !1637)
!1644 = !DILocation(line: 73, column: 86, scope: !1637)
!1645 = !DILocation(line: 73, column: 23, scope: !1637)
!1646 = !DILocation(line: 73, column: 21, scope: !1637)
!1647 = !DILocation(line: 73, column: 9, scope: !1637)
!1648 = !DILocation(line: 74, column: 46, scope: !1522)
!1649 = !DILocation(line: 74, column: 50, scope: !1522)
!1650 = !DILocation(line: 74, column: 55, scope: !1522)
!1651 = !DILocation(line: 74, column: 31, scope: !1522)
!1652 = !DILocation(line: 74, column: 5, scope: !1522)
!1653 = !DILocation(line: 74, column: 10, scope: !1522)
!1654 = !DILocation(line: 74, column: 29, scope: !1522)
!1655 = !DILocation(line: 75, column: 44, scope: !1522)
!1656 = !DILocation(line: 75, column: 48, scope: !1522)
!1657 = !DILocation(line: 75, column: 54, scope: !1522)
!1658 = !DILocation(line: 75, column: 29, scope: !1522)
!1659 = !DILocation(line: 75, column: 5, scope: !1522)
!1660 = !DILocation(line: 75, column: 10, scope: !1522)
!1661 = !DILocation(line: 75, column: 27, scope: !1522)
!1662 = !DILocation(line: 76, column: 9, scope: !1522)
!1663 = !DILocation(line: 79, column: 9, scope: !1522)
!1664 = !DILocation(line: 90, column: 102, scope: !1524, inlinedAt: !1548)
!1665 = !DILocation(line: 90, column: 105, scope: !1524, inlinedAt: !1548)
