; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbcdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbcdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sbc_dsp_context = type { i32, i8, [11 x i8], [2 x [328 x i16]], void (i16*, i32*, i16*)*, void (i16*, i32*, i16*)*, void (%struct.sbc_dsp_context*, i16*, i32*, i32)*, void (%struct.sbc_dsp_context*, i16*, i32*, i32)*, i32 (i32, i8*, [328 x i16]*, i32, i32)*, i32 (i32, i8*, [328 x i16]*, i32, i32)*, void ([2 x [8 x i32]]*, [8 x i32]*, i32, i32, i32)*, i32 ([2 x [8 x i32]]*, [8 x i32]*, i32, i32)* }
%union.unaligned_16 = type { i16 }

@ff_sbcdsp_analysis_consts_fixed4_simd_odd = external constant [0 x i16], align 2
@ff_sbcdsp_analysis_consts_fixed4_simd_even = external constant [0 x i16], align 2
@ff_sbcdsp_analysis_consts_fixed8_simd_odd = external constant [0 x i16], align 2
@ff_sbcdsp_analysis_consts_fixed8_simd_even = external constant [0 x i16], align 2

; Function Attrs: cold nounwind optsize uwtable
define void @ff_sbcdsp_init(%struct.sbc_dsp_context* %s) #0 !dbg !16 {
entry:
  %s.addr = alloca %struct.sbc_dsp_context*, align 8
  store %struct.sbc_dsp_context* %s, %struct.sbc_dsp_context** %s.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--sbcdsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !7, line: 222, size: 16, align: 8, elements: !8)
!7 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !6, file: !7, line: 222, baseType: !10, size: 16, align: 16)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!12 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "ff_sbcdsp_init", scope: !17, file: !17, line: 364, type: !18, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DIFile(filename: "libavcodec/sbcdsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBCDSPContext", file: !22, line: 41, baseType: !23)
!22 = !DIFile(filename: "libavcodec/sbcdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sbc_dsp_context", file: !22, line: 43, size: 11136, align: 128, elements: !24)
!24 = !{!25, !27, !30, !37, !45, !46, !51, !52, !61, !62, !75}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !23, file: !22, line: 44, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "increment", scope: !23, file: !22, line: 46, baseType: !28, size: 8, align: 8, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 48, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !23, file: !22, line: 47, baseType: !31, size: 10496, align: 16, offset: 128)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 10496, align: 16, elements: !34)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !11, line: 37, baseType: !33)
!33 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!34 = !{!35, !36}
!35 = !DISubrange(count: 2)
!36 = !DISubrange(count: 328)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_analyze_4", scope: !23, file: !22, line: 48, baseType: !38, size: 64, align: 64, offset: 10624)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !43, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !11, line: 38, baseType: !26)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_analyze_8", scope: !23, file: !22, line: 49, baseType: !38, size: 64, align: 64, offset: 10688)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_analyze_4s", scope: !23, file: !22, line: 52, baseType: !47, size: 64, align: 64, offset: 10752)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !20, !50, !43, !26}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_analyze_8s", scope: !23, file: !22, line: 56, baseType: !47, size: 64, align: 64, offset: 10816)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_enc_process_input_4s", scope: !23, file: !22, line: 60, baseType: !53, size: 64, align: 64, offset: 10880)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!26, !26, !56, !58, !26, !26}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 5248, align: 16, elements: !60)
!60 = !{!36}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_enc_process_input_8s", scope: !23, file: !22, line: 63, baseType: !53, size: 64, align: 64, offset: 10944)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_calc_scalefactors", scope: !23, file: !22, line: 67, baseType: !63, size: 64, align: 64, offset: 11008)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !70, !26, !26, !26}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 512, align: 32, elements: !68)
!68 = !{!35, !69}
!69 = !DISubrange(count: 8)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, align: 32, elements: !74)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 51, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !{!69}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_calc_scalefactors_j", scope: !23, file: !22, line: 71, baseType: !76, size: 64, align: 64, offset: 11072)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!26, !66, !70, !26, !26}
!79 = !DILocalVariable(name: "s", arg: 1, scope: !16, file: !17, line: 364, type: !20)
!80 = !DIExpression()
!81 = !DILocation(line: 364, column: 58, scope: !16)
!82 = !DILocation(line: 367, column: 5, scope: !16)
!83 = !DILocation(line: 367, column: 8, scope: !16)
!84 = !DILocation(line: 367, column: 22, scope: !16)
!85 = !DILocation(line: 368, column: 5, scope: !16)
!86 = !DILocation(line: 368, column: 8, scope: !16)
!87 = !DILocation(line: 368, column: 22, scope: !16)
!88 = !DILocation(line: 369, column: 5, scope: !16)
!89 = !DILocation(line: 369, column: 8, scope: !16)
!90 = !DILocation(line: 369, column: 23, scope: !16)
!91 = !DILocation(line: 370, column: 9, scope: !92)
!92 = distinct !DILexicalBlock(scope: !16, file: !17, line: 370, column: 9)
!93 = !DILocation(line: 370, column: 12, scope: !92)
!94 = !DILocation(line: 370, column: 22, scope: !92)
!95 = !DILocation(line: 370, column: 9, scope: !16)
!96 = !DILocation(line: 371, column: 9, scope: !92)
!97 = !DILocation(line: 371, column: 12, scope: !92)
!98 = !DILocation(line: 371, column: 27, scope: !92)
!99 = !DILocation(line: 373, column: 9, scope: !92)
!100 = !DILocation(line: 373, column: 12, scope: !92)
!101 = !DILocation(line: 373, column: 27, scope: !92)
!102 = !DILocation(line: 376, column: 5, scope: !16)
!103 = !DILocation(line: 376, column: 8, scope: !16)
!104 = !DILocation(line: 376, column: 33, scope: !16)
!105 = !DILocation(line: 377, column: 5, scope: !16)
!106 = !DILocation(line: 377, column: 8, scope: !16)
!107 = !DILocation(line: 377, column: 33, scope: !16)
!108 = !DILocation(line: 380, column: 5, scope: !16)
!109 = !DILocation(line: 380, column: 8, scope: !16)
!110 = !DILocation(line: 380, column: 30, scope: !16)
!111 = !DILocation(line: 381, column: 5, scope: !16)
!112 = !DILocation(line: 381, column: 8, scope: !16)
!113 = !DILocation(line: 381, column: 32, scope: !16)
!114 = !DILocation(line: 386, column: 28, scope: !115)
!115 = distinct !DILexicalBlock(scope: !16, file: !17, line: 385, column: 9)
!116 = !DILocation(line: 386, column: 9, scope: !115)
!117 = !DILocation(line: 387, column: 1, scope: !16)
!118 = distinct !DISubprogram(name: "sbc_analyze_4_simd", scope: !17, file: !17, line: 94, type: !39, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!119 = !DILocalVariable(name: "in", arg: 1, scope: !120, file: !17, line: 62, type: !41)
!120 = distinct !DISubprogram(name: "sbc_analyze_simd", scope: !17, file: !17, line: 62, type: !121, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !41, !43, !41, !73}
!123 = !DILocation(line: 62, column: 83, scope: !120, inlinedAt: !124)
!124 = distinct !DILocation(line: 97, column: 5, scope: !118)
!125 = !DILocalVariable(name: "out", arg: 2, scope: !120, file: !17, line: 62, type: !43)
!126 = !DILocation(line: 62, column: 96, scope: !120, inlinedAt: !124)
!127 = !DILocalVariable(name: "consts", arg: 3, scope: !120, file: !17, line: 63, type: !41)
!128 = !DILocation(line: 63, column: 62, scope: !120, inlinedAt: !124)
!129 = !DILocalVariable(name: "subbands", arg: 4, scope: !120, file: !17, line: 64, type: !73)
!130 = !DILocation(line: 64, column: 56, scope: !120, inlinedAt: !124)
!131 = !DILocalVariable(name: "t1", scope: !120, file: !17, line: 66, type: !132)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, align: 32, elements: !74)
!133 = !DILocation(line: 66, column: 13, scope: !120, inlinedAt: !124)
!134 = !DILocalVariable(name: "t2", scope: !120, file: !17, line: 67, type: !135)
