; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vorbis.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vorbis.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!1115 = !DILocation(line: 93, column: 14, scope: !1112)
!1116 = !DILocation(line: 93, column: 25, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1118, file: !894, discriminator: 1)
!1118 = distinct !DILexicalBlock(scope: !1112, file: !894, line: 93, column: 9)
!1119 = !DILocation(line: 93, column: 35, scope: !1117)
!1120 = !DILocation(line: 93, column: 30, scope: !1117)
!1121 = !DILocation(line: 93, column: 27, scope: !1117)
!1122 = !DILocation(line: 93, column: 9, scope: !1117)
!1123 = !DILocation(line: 94, column: 32, scope: !1118)
!1124 = !DILocation(line: 94, column: 47, scope: !1118)
!1125 = !DILocation(line: 94, column: 49, scope: !1118)
!1126 = !DILocation(line: 94, column: 43, scope: !1118)
!1127 = !DILocation(line: 94, column: 37, scope: !1118)
!1128 = !DILocation(line: 94, column: 27, scope: !1118)
!1129 = !DILocation(line: 94, column: 13, scope: !1118)
!1130 = !DILocation(line: 94, column: 30, scope: !1118)
!1131 = !DILocation(line: 93, column: 39, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1118, file: !894, discriminator: 2)
!1133 = !DILocation(line: 93, column: 9, scope: !1132)
!1134 = distinct !{!1134, !1135}
!1135 = !DILocation(line: 93, column: 9, scope: !1068)
!1136 = !DILocation(line: 95, column: 20, scope: !1068)
!1137 = !DILocation(line: 95, column: 15, scope: !1068)
!1138 = !DILocation(line: 95, column: 9, scope: !1068)
!1139 = !DILocation(line: 95, column: 18, scope: !1068)
!1140 = !DILocation(line: 96, column: 5, scope: !1068)
!1141 = !DILocation(line: 79, column: 21, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1061, file: !894, discriminator: 2)
!1143 = !DILocation(line: 79, column: 5, scope: !1142)
!1144 = distinct !{!1144, !1058}
!1145 = !DILocation(line: 99, column: 12, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !942, file: !894, line: 99, column: 5)
!1147 = !DILocation(line: 99, column: 10, scope: !1146)
!1148 = !DILocation(line: 99, column: 17, scope: !1149)
!1149 = !DILexicalBlockFile(scope: !1150, file: !894, discriminator: 1)
!1150 = distinct !DILexicalBlock(scope: !1146, file: !894, line: 99, column: 5)
!1151 = !DILocation(line: 99, column: 19, scope: !1149)
!1152 = !DILocation(line: 99, column: 5, scope: !1149)
!1153 = !DILocation(line: 100, column: 27, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1150, file: !894, line: 100, column: 13)
!1155 = !DILocation(line: 100, column: 13, scope: !1154)
!1156 = !DILocation(line: 100, column: 13, scope: !1150)
!1157 = !DILocation(line: 101, column: 13, scope: !1154)
!1158 = !DILocation(line: 100, column: 28, scope: !1159)
!1159 = !DILexicalBlockFile(scope: !1154, file: !894, discriminator: 1)
!1160 = !DILocation(line: 99, column: 26, scope: !1161)
!1161 = !DILexicalBlockFile(scope: !1150, file: !894, discriminator: 2)
!1162 = !DILocation(line: 99, column: 5, scope: !1161)
!1163 = distinct !{!1163, !1164}
!1164 = !DILocation(line: 99, column: 5, scope: !942)
!1165 = !DILocation(line: 103, column: 5, scope: !942)
!1166 = !DILocation(line: 104, column: 1, scope: !942)
!1167 = distinct !DISubprogram(name: "ff_vorbis_ready_floor1_list", scope: !894, file: !894, line: 106, type: !1168, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !897)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!888, !1170, !1764, !888}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1173)
!1173 = !{!1174, !1219, !1220, !1221, !1487, !1488, !1489, !1490, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1516, !1520, !1521, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1702, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1172, file: !35, line: 1561, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1179)
!1179 = !{!1180, !1184, !1189, !1193, !1194, !1195, !1196, !1200, !1206, !1208, !1212}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1178, file: !4, line: 72, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1183 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1178, file: !4, line: 78, baseType: !1185, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!1181, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1178, file: !4, line: 85, baseType: !1190, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1178, file: !4, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1178, file: !4, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1178, file: !4, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1178, file: !4, line: 113, baseType: !1197, size: 64, align: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!1188, !1188, !1188}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1178, file: !4, line: 123, baseType: !1201, size: 64, align: 64, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!1204, !1204}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1178)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1178, file: !4, line: 130, baseType: !1207, size: 32, align: 32, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1178, file: !4, line: 136, baseType: !1209, size: 64, align: 64, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1207, !1188}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1178, file: !4, line: 142, baseType: !1213, size: 64, align: 64, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!888, !1216, !1188, !1181, !888}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1172, file: !35, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1172, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1172, file: !35, line: 1565, baseType: !1222, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231, !1240, !1243, !1246, !1249, !1254, !1255, !1256, !1264, !1265, !1266, !1268, !1272, !1278, !1283, !1287, !1288, !1337, !1458, !1462, !1463, !1467, !1471, !1476, !1480, !1481, !1482}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1224, file: !35, line: 3475, baseType: !1181, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1224, file: !35, line: 3480, baseType: !1181, size: 64, align: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1224, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1224, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1224, file: !35, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1224, file: !35, line: 3488, baseType: !1232, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1235, line: 61, baseType: !1236)
!1235 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1235, line: 58, size: 64, align: 32, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1236, file: !1235, line: 59, baseType: !888, size: 32, align: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1236, file: !1235, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1224, file: !35, line: 3489, baseType: !1241, size: 64, align: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1224, file: !35, line: 3490, baseType: !1244, size: 64, align: 64, offset: 384)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1224, file: !35, line: 3491, baseType: !1247, size: 64, align: 64, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1224, file: !35, line: 3492, baseType: !1250, size: 64, align: 64, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !947, line: 55, baseType: !1253)
!1253 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1224, file: !35, line: 3493, baseType: !946, size: 8, align: 8, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1224, file: !35, line: 3494, baseType: !1175, size: 64, align: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1224, file: !35, line: 3495, baseType: !1257, size: 64, align: 64, offset: 704)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1260, file: !35, line: 3402, baseType: !888, size: 32, align: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1260, file: !35, line: 3403, baseType: !1181, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1224, file: !35, line: 3507, baseType: !1181, size: 64, align: 64, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1224, file: !35, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1224, file: !35, line: 3517, baseType: !1267, size: 64, align: 64, offset: 896)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1224, file: !35, line: 3527, baseType: !1269, size: 64, align: 64, offset: 960)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!888, !1170}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1224, file: !35, line: 3535, baseType: !1273, size: 64, align: 64, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!888, !1170, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1171)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1224, file: !35, line: 3541, baseType: !1279, size: 64, align: 64, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1282)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1224, file: !35, line: 3549, baseType: !1284, size: 64, align: 64, offset: 1152)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !1267}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1224, file: !35, line: 3551, baseType: !1269, size: 64, align: 64, offset: 1216)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1224, file: !35, line: 3552, baseType: !1289, size: 64, align: 64, offset: 1280)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!888, !1170, !945, !888, !1292}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1295)
!1295 = !{!1296, !1299, !1300, !1301, !1302, !1334}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1294, file: !35, line: 3921, baseType: !1297, size: 16, align: 16)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !947, line: 49, baseType: !1298)
!1298 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1294, file: !35, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1294, file: !35, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1294, file: !35, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1294, file: !35, line: 3925, baseType: !1303, size: 64, align: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !1312, !1313, !1323, !1327, !1329, !1330, !1332, !1333}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1306, file: !35, line: 3886, baseType: !888, size: 32, align: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1306, file: !35, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1306, file: !35, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1306, file: !35, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1306, file: !35, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1306, file: !35, line: 3897, baseType: !1314, size: 768, align: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1316)
!1316 = !{!1317, !1321}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1315, file: !35, line: 3855, baseType: !1318, size: 512, align: 64)
!1318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 64, elements: !1319)
!1319 = !{!1320}
!1320 = !DISubrange(count: 8)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1315, file: !35, line: 3857, baseType: !1322, size: 256, align: 32, offset: 512)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1319)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1306, file: !35, line: 3903, baseType: !1324, size: 256, align: 64, offset: 960)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 64, elements: !1325)
!1325 = !{!1326}
!1326 = !DISubrange(count: 4)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1306, file: !35, line: 3904, baseType: !1328, size: 128, align: 32, offset: 1216)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1325)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1306, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1306, file: !35, line: 3908, baseType: !1331, size: 64, align: 64, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1306, file: !35, line: 3915, baseType: !1331, size: 64, align: 64, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1306, file: !35, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1294, file: !35, line: 3926, baseType: !1335, size: 64, align: 64, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !947, line: 40, baseType: !1336)
!1336 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1224, file: !35, line: 3564, baseType: !1338, size: 64, align: 64, offset: 1344)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!888, !1170, !1341, !1375, !1457}
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1344)
!1344 = !{!1345, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1371, !1372, !1373, !1374}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1343, file: !35, line: 1451, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1348, line: 94, baseType: !1349)
!1348 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1348, line: 81, size: 192, align: 64, elements: !1350)
!1350 = !{!1351, !1355, !1356}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1349, file: !1348, line: 82, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1348, line: 73, baseType: !1354)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1348, line: 73, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1349, file: !1348, line: 89, baseType: !945, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1349, file: !1348, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1343, file: !35, line: 1461, baseType: !1335, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1343, file: !35, line: 1467, baseType: !1335, size: 64, align: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1343, file: !35, line: 1468, baseType: !945, size: 64, align: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1343, file: !35, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1343, file: !35, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1343, file: !35, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1343, file: !35, line: 1479, baseType: !1364, size: 64, align: 64, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1367)
!1367 = !{!1368, !1369, !1370}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1366, file: !35, line: 1412, baseType: !945, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1366, file: !35, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1366, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1343, file: !35, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1343, file: !35, line: 1486, baseType: !1335, size: 64, align: 64, offset: 512)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1343, file: !35, line: 1488, baseType: !1335, size: 64, align: 64, offset: 576)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1343, file: !35, line: 1497, baseType: !1335, size: 64, align: 64, offset: 640)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1409, !1411, !1412, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1445, !1446, !1447, !1448, !1449, !1450, !1453, !1454, !1455, !1456}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1378, file: !758, line: 282, baseType: !1318, size: 512, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1378, file: !758, line: 299, baseType: !1322, size: 256, align: 32, offset: 512)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1378, file: !758, line: 315, baseType: !1383, size: 64, align: 64, offset: 768)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1378, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1378, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1378, file: !758, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1378, file: !758, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1378, file: !758, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1378, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1378, file: !758, line: 356, baseType: !1234, size: 64, align: 32, offset: 1024)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1378, file: !758, line: 361, baseType: !1335, size: 64, align: 64, offset: 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1378, file: !758, line: 369, baseType: !1335, size: 64, align: 64, offset: 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1378, file: !758, line: 377, baseType: !1335, size: 64, align: 64, offset: 1216)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1378, file: !758, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1378, file: !758, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1378, file: !758, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1378, file: !758, line: 396, baseType: !1188, size: 64, align: 64, offset: 1408)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1378, file: !758, line: 403, baseType: !1399, size: 512, align: 64, offset: 1472)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 512, align: 64, elements: !1319)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1378, file: !758, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1378, file: !758, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1378, file: !758, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1378, file: !758, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1378, file: !758, line: 435, baseType: !1335, size: 64, align: 64, offset: 2112)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1378, file: !758, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1378, file: !758, line: 445, baseType: !1252, size: 64, align: 64, offset: 2240)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1378, file: !758, line: 459, baseType: !1408, size: 512, align: 64, offset: 2304)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1346, size: 512, align: 64, elements: !1319)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1378, file: !758, line: 473, baseType: !1410, size: 64, align: 64, offset: 2816)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1378, file: !758, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1378, file: !758, line: 479, baseType: !1413, size: 64, align: 64, offset: 2944)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1417)
!1417 = !{!1418, !1419, !1420, !1421, !1426}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1416, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1416, file: !758, line: 203, baseType: !945, size: 64, align: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1416, file: !758, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1416, file: !758, line: 205, baseType: !1422, size: 64, align: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1424, line: 86, baseType: !1425)
!1424 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1424, line: 86, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1416, file: !758, line: 206, baseType: !1346, size: 64, align: 64, offset: 256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1378, file: !758, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1378, file: !758, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1378, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1378, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1378, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1378, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1378, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1378, file: !758, line: 532, baseType: !1335, size: 64, align: 64, offset: 3264)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1378, file: !758, line: 539, baseType: !1335, size: 64, align: 64, offset: 3328)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1378, file: !758, line: 547, baseType: !1335, size: 64, align: 64, offset: 3392)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1378, file: !758, line: 554, baseType: !1422, size: 64, align: 64, offset: 3456)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1378, file: !758, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1378, file: !758, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1378, file: !758, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1378, file: !758, line: 588, baseType: !1442, size: 64, align: 64, offset: 3648)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !947, line: 36, baseType: !1444)
!1444 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1378, file: !758, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1378, file: !758, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1378, file: !758, line: 599, baseType: !1346, size: 64, align: 64, offset: 3776)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1378, file: !758, line: 605, baseType: !1346, size: 64, align: 64, offset: 3840)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1378, file: !758, line: 616, baseType: !1346, size: 64, align: 64, offset: 3904)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1378, file: !758, line: 626, baseType: !1451, size: 64, align: 64, offset: 3968)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1452, line: 216, baseType: !1253)
!1452 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1378, file: !758, line: 627, baseType: !1451, size: 64, align: 64, offset: 4032)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1378, file: !758, line: 628, baseType: !1451, size: 64, align: 64, offset: 4096)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1378, file: !758, line: 629, baseType: !1451, size: 64, align: 64, offset: 4160)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1378, file: !758, line: 645, baseType: !1346, size: 64, align: 64, offset: 4224)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1224, file: !35, line: 3566, baseType: !1459, size: 64, align: 64, offset: 1408)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!888, !1170, !1188, !1457, !1341}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1224, file: !35, line: 3567, baseType: !1269, size: 64, align: 64, offset: 1472)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1224, file: !35, line: 3576, baseType: !1464, size: 64, align: 64, offset: 1536)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!888, !1170, !1375}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1224, file: !35, line: 3577, baseType: !1468, size: 64, align: 64, offset: 1600)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!888, !1170, !1341}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1224, file: !35, line: 3584, baseType: !1472, size: 64, align: 64, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!888, !1170, !1475}
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1224, file: !35, line: 3589, baseType: !1477, size: 64, align: 64, offset: 1728)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{null, !1170}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1224, file: !35, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1224, file: !35, line: 3600, baseType: !1181, size: 64, align: 64, offset: 1856)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1224, file: !35, line: 3609, baseType: !1483, size: 64, align: 64, offset: 1920)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1172, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1172, file: !35, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1172, file: !35, line: 1583, baseType: !1188, size: 64, align: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1172, file: !35, line: 1591, baseType: !1491, size: 64, align: 64, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1172, file: !35, line: 1598, baseType: !1188, size: 64, align: 64, offset: 384)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1172, file: !35, line: 1606, baseType: !1335, size: 64, align: 64, offset: 448)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1172, file: !35, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1172, file: !35, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1172, file: !35, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1172, file: !35, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1172, file: !35, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1172, file: !35, line: 1657, baseType: !945, size: 64, align: 64, offset: 704)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1172, file: !35, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1172, file: !35, line: 1679, baseType: !1234, size: 64, align: 32, offset: 800)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1172, file: !35, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1172, file: !35, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1172, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1172, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1172, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1172, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1172, file: !35, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1172, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1172, file: !35, line: 1791, baseType: !1512, size: 64, align: 64, offset: 1152)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{null, !1515, !1375, !1457, !888, !888, !888}
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1172, file: !35, line: 1808, baseType: !1517, size: 64, align: 64, offset: 1216)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!494, !1515, !1241}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1172, file: !35, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1172, file: !35, line: 1825, baseType: !1522, size: 32, align: 32, offset: 1312)
!1522 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1172, file: !35, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1172, file: !35, line: 1838, baseType: !1522, size: 32, align: 32, offset: 1376)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1172, file: !35, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1172, file: !35, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1172, file: !35, line: 1861, baseType: !1522, size: 32, align: 32, offset: 1472)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1172, file: !35, line: 1868, baseType: !1522, size: 32, align: 32, offset: 1504)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1172, file: !35, line: 1875, baseType: !1522, size: 32, align: 32, offset: 1536)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1172, file: !35, line: 1882, baseType: !1522, size: 32, align: 32, offset: 1568)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1172, file: !35, line: 1889, baseType: !1522, size: 32, align: 32, offset: 1600)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1172, file: !35, line: 1896, baseType: !1522, size: 32, align: 32, offset: 1632)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1172, file: !35, line: 1903, baseType: !1522, size: 32, align: 32, offset: 1664)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1172, file: !35, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1172, file: !35, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1172, file: !35, line: 1926, baseType: !1457, size: 64, align: 64, offset: 1792)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1172, file: !35, line: 1935, baseType: !1234, size: 64, align: 32, offset: 1856)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1172, file: !35, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1172, file: !35, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1172, file: !35, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1172, file: !35, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1172, file: !35, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1172, file: !35, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1172, file: !35, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1172, file: !35, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1172, file: !35, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1172, file: !35, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1172, file: !35, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1172, file: !35, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1172, file: !35, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1172, file: !35, line: 2054, baseType: !1552, size: 64, align: 64, offset: 2368)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1172, file: !35, line: 2061, baseType: !1552, size: 64, align: 64, offset: 2432)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1172, file: !35, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1172, file: !35, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1172, file: !35, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1172, file: !35, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1172, file: !35, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1172, file: !35, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1172, file: !35, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1172, file: !35, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1172, file: !35, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1172, file: !35, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1172, file: !35, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1172, file: !35, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1172, file: !35, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1172, file: !35, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1172, file: !35, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1172, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1172, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1172, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1172, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1172, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1172, file: !35, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1172, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1172, file: !35, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1172, file: !35, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1172, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1172, file: !35, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1172, file: !35, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1172, file: !35, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1172, file: !35, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1172, file: !35, line: 2263, baseType: !1252, size: 64, align: 64, offset: 3456)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1172, file: !35, line: 2270, baseType: !1252, size: 64, align: 64, offset: 3520)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1172, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1172, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1172, file: !35, line: 2367, baseType: !1588, size: 64, align: 64, offset: 3648)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!888, !1515, !1475, !888}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1172, file: !35, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1172, file: !35, line: 2386, baseType: !1522, size: 32, align: 32, offset: 3744)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1172, file: !35, line: 2387, baseType: !1522, size: 32, align: 32, offset: 3776)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1172, file: !35, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1172, file: !35, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1172, file: !35, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1172, file: !35, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1172, file: !35, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1172, file: !35, line: 2423, baseType: !1600, size: 64, align: 64, offset: 3968)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1607}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1602, file: !35, line: 827, baseType: !888, size: 32, align: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1602, file: !35, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1602, file: !35, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1602, file: !35, line: 830, baseType: !1522, size: 32, align: 32, offset: 96)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1172, file: !35, line: 2430, baseType: !1335, size: 64, align: 64, offset: 4032)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1172, file: !35, line: 2437, baseType: !1335, size: 64, align: 64, offset: 4096)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1172, file: !35, line: 2444, baseType: !1522, size: 32, align: 32, offset: 4160)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1172, file: !35, line: 2451, baseType: !1522, size: 32, align: 32, offset: 4192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1172, file: !35, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1172, file: !35, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1172, file: !35, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1172, file: !35, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1172, file: !35, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1172, file: !35, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1172, file: !35, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1172, file: !35, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1172, file: !35, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1172, file: !35, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1172, file: !35, line: 2514, baseType: !1335, size: 64, align: 64, offset: 4544)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1172, file: !35, line: 2528, baseType: !1624, size: 64, align: 64, offset: 4608)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{null, !1515, !1188, !888, !888}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1172, file: !35, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1172, file: !35, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1172, file: !35, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1172, file: !35, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1172, file: !35, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1172, file: !35, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1172, file: !35, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1172, file: !35, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1172, file: !35, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1172, file: !35, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1172, file: !35, line: 2571, baseType: !1331, size: 64, align: 64, offset: 4992)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1172, file: !35, line: 2579, baseType: !1331, size: 64, align: 64, offset: 5056)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1172, file: !35, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1172, file: !35, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1172, file: !35, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1172, file: !35, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1172, file: !35, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1172, file: !35, line: 2709, baseType: !1335, size: 64, align: 64, offset: 5312)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1172, file: !35, line: 2716, baseType: !1646, size: 64, align: 64, offset: 5376)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653, !1654, !1655, !1656, !1662, !1666, !1667, !1668, !1669, !1675, !1676, !1677, !1678, !1679}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1648, file: !35, line: 3642, baseType: !1181, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1648, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1648, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1648, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1648, file: !35, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1648, file: !35, line: 3682, baseType: !1472, size: 64, align: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1648, file: !35, line: 3698, baseType: !1657, size: 64, align: 64, offset: 256)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!888, !1170, !1660, !950}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1648, file: !35, line: 3712, baseType: !1663, size: 64, align: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!888, !1170, !888, !1660, !950}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1648, file: !35, line: 3726, baseType: !1657, size: 64, align: 64, offset: 384)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1648, file: !35, line: 3737, baseType: !1269, size: 64, align: 64, offset: 448)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1648, file: !35, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1648, file: !35, line: 3757, baseType: !1670, size: 64, align: 64, offset: 576)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1673}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1648, file: !35, line: 3766, baseType: !1269, size: 64, align: 64, offset: 640)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1648, file: !35, line: 3774, baseType: !1269, size: 64, align: 64, offset: 704)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1648, file: !35, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1648, file: !35, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1648, file: !35, line: 3795, baseType: !1680, size: 64, align: 64, offset: 832)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!888, !1170, !1346}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1172, file: !35, line: 2728, baseType: !1188, size: 64, align: 64, offset: 5440)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1172, file: !35, line: 2735, baseType: !1399, size: 512, align: 64, offset: 5504)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1172, file: !35, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1172, file: !35, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1172, file: !35, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1172, file: !35, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1172, file: !35, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1172, file: !35, line: 2802, baseType: !1475, size: 64, align: 64, offset: 6208)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1172, file: !35, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1172, file: !35, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1172, file: !35, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1172, file: !35, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1172, file: !35, line: 2851, baseType: !1696, size: 64, align: 64, offset: 6400)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!888, !1515, !1699, !1188, !1457, !888, !888}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!888, !1515, !1188}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1172, file: !35, line: 2871, baseType: !1703, size: 64, align: 64, offset: 6464)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!888, !1515, !1706, !1188, !1457, !888}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!888, !1515, !1188, !888, !888}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1172, file: !35, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1172, file: !35, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1172, file: !35, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1172, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1172, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1172, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1172, file: !35, line: 3037, baseType: !945, size: 64, align: 64, offset: 6720)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1172, file: !35, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1172, file: !35, line: 3050, baseType: !1252, size: 64, align: 64, offset: 6848)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1172, file: !35, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1172, file: !35, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1172, file: !35, line: 3092, baseType: !1234, size: 64, align: 32, offset: 6976)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1172, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1172, file: !35, line: 3106, baseType: !1234, size: 64, align: 32, offset: 7072)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1172, file: !35, line: 3113, baseType: !1724, size: 64, align: 64, offset: 7168)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1726)
!1726 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1727)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1728)
!1728 = !{!1729, !1730, !1731, !1732, !1733, !1734, !1737}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1727, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1727, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1727, file: !35, line: 720, baseType: !1181, size: 64, align: 64, offset: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1727, file: !35, line: 724, baseType: !1181, size: 64, align: 64, offset: 128)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1727, file: !35, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1727, file: !35, line: 734, baseType: !1735, size: 64, align: 64, offset: 256)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1727, file: !35, line: 739, baseType: !1738, size: 64, align: 64, offset: 320)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1172, file: !35, line: 3129, baseType: !1335, size: 64, align: 64, offset: 7232)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1172, file: !35, line: 3130, baseType: !1335, size: 64, align: 64, offset: 7296)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1172, file: !35, line: 3131, baseType: !1335, size: 64, align: 64, offset: 7360)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1172, file: !35, line: 3132, baseType: !1335, size: 64, align: 64, offset: 7424)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1172, file: !35, line: 3139, baseType: !1331, size: 64, align: 64, offset: 7488)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1172, file: !35, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1172, file: !35, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1172, file: !35, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1172, file: !35, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1172, file: !35, line: 3191, baseType: !1552, size: 64, align: 64, offset: 7680)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1172, file: !35, line: 3199, baseType: !945, size: 64, align: 64, offset: 7744)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1172, file: !35, line: 3207, baseType: !1331, size: 64, align: 64, offset: 7808)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1172, file: !35, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1172, file: !35, line: 3224, baseType: !1364, size: 64, align: 64, offset: 7936)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1172, file: !35, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1172, file: !35, line: 3249, baseType: !1346, size: 64, align: 64, offset: 8064)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1172, file: !35, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1172, file: !35, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1172, file: !35, line: 3279, baseType: !1335, size: 64, align: 64, offset: 8192)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1172, file: !35, line: 3301, baseType: !1346, size: 64, align: 64, offset: 8256)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1172, file: !35, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1172, file: !35, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1172, file: !35, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1172, file: !35, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DIDerivedType(tag: DW_TAG_typedef, name: "vorbis_floor1_entry", file: !1766, line: 37, baseType: !1767)
!1766 = !DIFile(filename: "libavcodec/vorbis.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vorbis_floor1_entry", file: !1766, line: 32, size: 64, align: 16, elements: !1768)
!1768 = !{!1769, !1770, !1771, !1772}
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1767, file: !1766, line: 33, baseType: !1297, size: 16, align: 16)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !1767, file: !1766, line: 34, baseType: !1297, size: 16, align: 16, offset: 16)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1767, file: !1766, line: 35, baseType: !1297, size: 16, align: 16, offset: 32)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1767, file: !1766, line: 36, baseType: !1297, size: 16, align: 16, offset: 48)
!1773 = !DILocalVariable(name: "avctx", arg: 1, scope: !1167, file: !894, line: 106, type: !1170)
!1774 = !DILocation(line: 106, column: 49, scope: !1167)
!1775 = !DILocalVariable(name: "list", arg: 2, scope: !1167, file: !894, line: 107, type: !1764)
!1776 = !DILocation(line: 107, column: 54, scope: !1167)
!1777 = !DILocalVariable(name: "values", arg: 3, scope: !1167, file: !894, line: 107, type: !888)
!1778 = !DILocation(line: 107, column: 64, scope: !1167)
!1779 = !DILocalVariable(name: "i", scope: !1167, file: !894, line: 109, type: !888)
!1780 = !DILocation(line: 109, column: 9, scope: !1167)
!1781 = !DILocation(line: 110, column: 5, scope: !1167)
!1782 = !DILocation(line: 110, column: 13, scope: !1167)
!1783 = !DILocation(line: 110, column: 18, scope: !1167)
!1784 = !DILocation(line: 111, column: 5, scope: !1167)
!1785 = !DILocation(line: 111, column: 13, scope: !1167)
!1786 = !DILocation(line: 111, column: 18, scope: !1167)
!1787 = !DILocation(line: 112, column: 12, scope: !1788)
!1788 = distinct !DILexicalBlock(scope: !1167, file: !894, line: 112, column: 5)
!1789 = !DILocation(line: 112, column: 10, scope: !1788)
!1790 = !DILocation(line: 112, column: 17, scope: !1791)
!1791 = !DILexicalBlockFile(scope: !1792, file: !894, discriminator: 1)
!1792 = distinct !DILexicalBlock(scope: !1788, file: !894, line: 112, column: 5)
!1793 = !DILocation(line: 112, column: 21, scope: !1791)
!1794 = !DILocation(line: 112, column: 19, scope: !1791)
!1795 = !DILocation(line: 112, column: 5, scope: !1791)
!1796 = !DILocalVariable(name: "j", scope: !1797, file: !894, line: 113, type: !888)
!1797 = distinct !DILexicalBlock(scope: !1792, file: !894, line: 112, column: 34)
!1798 = !DILocation(line: 113, column: 13, scope: !1797)
!1799 = !DILocation(line: 114, column: 14, scope: !1797)
!1800 = !DILocation(line: 114, column: 9, scope: !1797)
!1801 = !DILocation(line: 114, column: 17, scope: !1797)
!1802 = !DILocation(line: 114, column: 21, scope: !1797)
!1803 = !DILocation(line: 115, column: 14, scope: !1797)
!1804 = !DILocation(line: 115, column: 9, scope: !1797)
!1805 = !DILocation(line: 115, column: 17, scope: !1797)
!1806 = !DILocation(line: 115, column: 22, scope: !1797)
!1807 = !DILocation(line: 116, column: 24, scope: !1797)
!1808 = !DILocation(line: 116, column: 14, scope: !1797)
!1809 = !DILocation(line: 116, column: 9, scope: !1797)
!1810 = !DILocation(line: 116, column: 17, scope: !1797)
!1811 = !DILocation(line: 116, column: 22, scope: !1797)
!1812 = !DILocation(line: 117, column: 16, scope: !1813)
!1813 = distinct !DILexicalBlock(scope: !1797, file: !894, line: 117, column: 9)
!1814 = !DILocation(line: 117, column: 14, scope: !1813)
!1815 = !DILocation(line: 117, column: 21, scope: !1816)
!1816 = !DILexicalBlockFile(scope: !1817, file: !894, discriminator: 1)
!1817 = distinct !DILexicalBlock(scope: !1813, file: !894, line: 117, column: 9)
!1818 = !DILocation(line: 117, column: 25, scope: !1816)
!1819 = !DILocation(line: 117, column: 23, scope: !1816)
!1820 = !DILocation(line: 117, column: 9, scope: !1816)
!1821 = !DILocalVariable(name: "tmp", scope: !1822, file: !894, line: 118, type: !888)
!1822 = distinct !DILexicalBlock(scope: !1817, file: !894, line: 117, column: 33)
!1823 = !DILocation(line: 118, column: 17, scope: !1822)
!1824 = !DILocation(line: 118, column: 28, scope: !1822)
!1825 = !DILocation(line: 118, column: 23, scope: !1822)
!1826 = !DILocation(line: 118, column: 31, scope: !1822)
!1827 = !DILocation(line: 119, column: 17, scope: !1828)
!1828 = distinct !DILexicalBlock(scope: !1822, file: !894, line: 119, column: 17)
!1829 = !DILocation(line: 119, column: 28, scope: !1828)
!1830 = !DILocation(line: 119, column: 23, scope: !1828)
!1831 = !DILocation(line: 119, column: 31, scope: !1828)
!1832 = !DILocation(line: 119, column: 21, scope: !1828)
!1833 = !DILocation(line: 119, column: 17, scope: !1822)
