; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--pnm.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--pnm.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !889}
!888 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!889 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!890 = !{i32 2, !"Dwarf Version", i32 4}
!891 = !{i32 2, !"Debug Info Version", i32 3}
!892 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!893 = distinct !DISubprogram(name: "ff_pnm_decode_header", scope: !894, file: !894, line: 61, type: !895, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1639)
!894 = !DIFile(filename: "libavcodec/pnm.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!895 = !DISubroutineType(types: !896)
!896 = !{!888, !897, !1628}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !900)
!900 = !{!901, !946, !947, !948, !1226, !1227, !1228, !1229, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1382, !1386, !1387, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1566, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !899, file: !35, line: 1561, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !906)
!906 = !{!907, !911, !916, !920, !921, !922, !923, !927, !933, !935, !939}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !905, file: !4, line: 72, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !905, file: !4, line: 78, baseType: !912, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!908, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !905, file: !4, line: 85, baseType: !917, size: 64, align: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !905, file: !4, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !905, file: !4, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !905, file: !4, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !905, file: !4, line: 113, baseType: !924, size: 64, align: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!915, !915, !915}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !905, file: !4, line: 123, baseType: !928, size: 64, align: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !905, file: !4, line: 130, baseType: !934, size: 32, align: 32, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !905, file: !4, line: 136, baseType: !936, size: 64, align: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!934, !915}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !905, file: !4, line: 142, baseType: !940, size: 64, align: 64, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!888, !943, !915, !908, !888}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !899, file: !35, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !899, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !899, file: !35, line: 1565, baseType: !949, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !952)
!952 = !{!953, !954, !955, !956, !957, !958, !967, !970, !973, !976, !982, !985, !986, !994, !995, !996, !998, !1002, !1008, !1019, !1023, !1024, !1076, !1197, !1201, !1202, !1206, !1210, !1215, !1219, !1220, !1221}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !35, line: 3475, baseType: !908, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !951, file: !35, line: 3480, baseType: !908, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !951, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !951, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !951, file: !35, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !951, file: !35, line: 3488, baseType: !959, size: 64, align: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !962, line: 61, baseType: !963)
!962 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !962, line: 58, size: 64, align: 32, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !963, file: !962, line: 59, baseType: !888, size: 32, align: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !963, file: !962, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !951, file: !35, line: 3489, baseType: !968, size: 64, align: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !951, file: !35, line: 3490, baseType: !971, size: 64, align: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !951, file: !35, line: 3491, baseType: !974, size: 64, align: 64, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !951, file: !35, line: 3492, baseType: !977, size: 64, align: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !980, line: 55, baseType: !981)
!980 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!981 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !951, file: !35, line: 3493, baseType: !983, size: 8, align: 8, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !980, line: 48, baseType: !984)
!984 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !951, file: !35, line: 3494, baseType: !902, size: 64, align: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !951, file: !35, line: 3495, baseType: !987, size: 64, align: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !990, file: !35, line: 3402, baseType: !888, size: 32, align: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !35, line: 3403, baseType: !908, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !951, file: !35, line: 3507, baseType: !908, size: 64, align: 64, offset: 768)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !951, file: !35, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !951, file: !35, line: 3517, baseType: !997, size: 64, align: 64, offset: 896)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !951, file: !35, line: 3527, baseType: !999, size: 64, align: 64, offset: 960)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!888, !897}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !951, file: !35, line: 3535, baseType: !1003, size: 64, align: 64, offset: 1024)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!888, !897, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !951, file: !35, line: 3541, baseType: !1009, size: 64, align: 64, offset: 1088)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1013, line: 223, size: 128, align: 64, elements: !1014)
!1013 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1014 = !{!1015, !1018}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1012, file: !1013, line: 224, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1012, file: !1013, line: 225, baseType: !1016, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !951, file: !35, line: 3549, baseType: !1020, size: 64, align: 64, offset: 1152)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !997}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !951, file: !35, line: 3551, baseType: !999, size: 64, align: 64, offset: 1216)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !951, file: !35, line: 3552, baseType: !1025, size: 64, align: 64, offset: 1280)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!888, !897, !1028, !888, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1032)
!1032 = !{!1033, !1036, !1038, !1039, !1040, !1072}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1031, file: !35, line: 3921, baseType: !1034, size: 16, align: 16)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !980, line: 49, baseType: !1035)
!1035 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1031, file: !35, line: 3922, baseType: !1037, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !980, line: 51, baseType: !889)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1031, file: !35, line: 3923, baseType: !1037, size: 32, align: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1031, file: !35, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1031, file: !35, line: 3925, baseType: !1041, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1061, !1065, !1067, !1068, !1070, !1071}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1044, file: !35, line: 3886, baseType: !888, size: 32, align: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1044, file: !35, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1044, file: !35, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1044, file: !35, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1044, file: !35, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1044, file: !35, line: 3897, baseType: !1052, size: 768, align: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1054)
!1054 = !{!1055, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !35, line: 3855, baseType: !1056, size: 512, align: 64)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 512, align: 64, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 8)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1053, file: !35, line: 3857, baseType: !1060, size: 256, align: 32, offset: 512)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1057)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1044, file: !35, line: 3903, baseType: !1062, size: 256, align: 64, offset: 960)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 256, align: 64, elements: !1063)
!1063 = !{!1064}
!1064 = !DISubrange(count: 4)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1044, file: !35, line: 3904, baseType: !1066, size: 128, align: 32, offset: 1216)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1063)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1044, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1044, file: !35, line: 3908, baseType: !1069, size: 64, align: 64, offset: 1408)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1044, file: !35, line: 3915, baseType: !1069, size: 64, align: 64, offset: 1472)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1044, file: !35, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1031, file: !35, line: 3926, baseType: !1073, size: 64, align: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1074, line: 197, baseType: !1075)
!1074 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1075 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !951, file: !35, line: 3564, baseType: !1077, size: 64, align: 64, offset: 1344)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!888, !897, !1080, !1114, !1196}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1083)
!1083 = !{!1084, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1110, !1111, !1112, !1113}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1082, file: !35, line: 1451, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1087, line: 94, baseType: !1088)
!1087 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1087, line: 81, size: 192, align: 64, elements: !1089)
!1089 = !{!1090, !1094, !1095}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1088, file: !1087, line: 82, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1087, line: 73, baseType: !1093)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1087, line: 73, flags: DIFlagFwdDecl)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1088, file: !1087, line: 89, baseType: !1028, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1088, file: !1087, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1082, file: !35, line: 1461, baseType: !1073, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1082, file: !35, line: 1467, baseType: !1073, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1082, file: !35, line: 1468, baseType: !1028, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1082, file: !35, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1082, file: !35, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !35, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1082, file: !35, line: 1479, baseType: !1103, size: 64, align: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1106)
!1106 = !{!1107, !1108, !1109}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1105, file: !35, line: 1412, baseType: !1028, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !35, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1105, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1082, file: !35, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1082, file: !35, line: 1486, baseType: !1073, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1082, file: !35, line: 1488, baseType: !1073, size: 64, align: 64, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1082, file: !35, line: 1497, baseType: !1073, size: 64, align: 64, offset: 640)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1148, !1150, !1151, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1184, !1185, !1186, !1187, !1188, !1189, !1192, !1193, !1194, !1195}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !758, line: 282, baseType: !1056, size: 512, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1117, file: !758, line: 299, baseType: !1060, size: 256, align: 32, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1117, file: !758, line: 315, baseType: !1122, size: 64, align: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1117, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1117, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1117, file: !758, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1117, file: !758, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1117, file: !758, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1117, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1117, file: !758, line: 356, baseType: !961, size: 64, align: 32, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1117, file: !758, line: 361, baseType: !1073, size: 64, align: 64, offset: 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1117, file: !758, line: 369, baseType: !1073, size: 64, align: 64, offset: 1152)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1117, file: !758, line: 377, baseType: !1073, size: 64, align: 64, offset: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1117, file: !758, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1117, file: !758, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1117, file: !758, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1117, file: !758, line: 396, baseType: !915, size: 64, align: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1117, file: !758, line: 403, baseType: !1138, size: 512, align: 64, offset: 1472)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 512, align: 64, elements: !1057)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1117, file: !758, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1117, file: !758, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1117, file: !758, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1117, file: !758, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1117, file: !758, line: 435, baseType: !1073, size: 64, align: 64, offset: 2112)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1117, file: !758, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1117, file: !758, line: 445, baseType: !979, size: 64, align: 64, offset: 2240)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1117, file: !758, line: 459, baseType: !1147, size: 512, align: 64, offset: 2304)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 512, align: 64, elements: !1057)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1117, file: !758, line: 473, baseType: !1149, size: 64, align: 64, offset: 2816)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1117, file: !758, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1117, file: !758, line: 479, baseType: !1152, size: 64, align: 64, offset: 2944)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1165}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1155, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !758, line: 203, baseType: !1028, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1155, file: !758, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1155, file: !758, line: 205, baseType: !1161, size: 64, align: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1163, line: 86, baseType: !1164)
!1163 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1163, line: 86, flags: DIFlagFwdDecl)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1155, file: !758, line: 206, baseType: !1085, size: 64, align: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1117, file: !758, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1117, file: !758, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1117, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1117, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1117, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1117, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1117, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1117, file: !758, line: 532, baseType: !1073, size: 64, align: 64, offset: 3264)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1117, file: !758, line: 539, baseType: !1073, size: 64, align: 64, offset: 3328)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1117, file: !758, line: 547, baseType: !1073, size: 64, align: 64, offset: 3392)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1117, file: !758, line: 554, baseType: !1161, size: 64, align: 64, offset: 3456)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1117, file: !758, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1117, file: !758, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1117, file: !758, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1117, file: !758, line: 588, baseType: !1181, size: 64, align: 64, offset: 3648)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1074, line: 194, baseType: !1183)
!1183 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1117, file: !758, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1117, file: !758, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1117, file: !758, line: 599, baseType: !1085, size: 64, align: 64, offset: 3776)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1117, file: !758, line: 605, baseType: !1085, size: 64, align: 64, offset: 3840)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1117, file: !758, line: 616, baseType: !1085, size: 64, align: 64, offset: 3904)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1117, file: !758, line: 626, baseType: !1190, size: 64, align: 64, offset: 3968)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1191, line: 216, baseType: !981)
!1191 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1117, file: !758, line: 627, baseType: !1190, size: 64, align: 64, offset: 4032)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1117, file: !758, line: 628, baseType: !1190, size: 64, align: 64, offset: 4096)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1117, file: !758, line: 629, baseType: !1190, size: 64, align: 64, offset: 4160)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1117, file: !758, line: 645, baseType: !1085, size: 64, align: 64, offset: 4224)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !951, file: !35, line: 3566, baseType: !1198, size: 64, align: 64, offset: 1408)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!888, !897, !915, !1196, !1080}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !951, file: !35, line: 3567, baseType: !999, size: 64, align: 64, offset: 1472)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !951, file: !35, line: 3576, baseType: !1203, size: 64, align: 64, offset: 1536)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!888, !897, !1114}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !951, file: !35, line: 3577, baseType: !1207, size: 64, align: 64, offset: 1600)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!888, !897, !1080}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !951, file: !35, line: 3584, baseType: !1211, size: 64, align: 64, offset: 1664)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!888, !897, !1214}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !951, file: !35, line: 3589, baseType: !1216, size: 64, align: 64, offset: 1728)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{null, !897}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !951, file: !35, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !951, file: !35, line: 3600, baseType: !908, size: 64, align: 64, offset: 1856)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !951, file: !35, line: 3609, baseType: !1222, size: 64, align: 64, offset: 1920)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1225)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !899, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !899, file: !35, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !899, file: !35, line: 1583, baseType: !915, size: 64, align: 64, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !899, file: !35, line: 1591, baseType: !1230, size: 64, align: 64, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1013, line: 129, size: 1664, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1255, !1256, !1262, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1231, file: !1013, line: 136, baseType: !888, size: 32, align: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1231, file: !1013, line: 151, baseType: !888, size: 32, align: 32, offset: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1231, file: !1013, line: 157, baseType: !888, size: 32, align: 32, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1231, file: !1013, line: 159, baseType: !1214, size: 64, align: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1231, file: !1013, line: 161, baseType: !1238, size: 64, align: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1013, line: 117, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1013, line: 100, size: 832, align: 64, elements: !1241)
!1241 = !{!1242, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1240, file: !1013, line: 105, baseType: !1243, size: 256, align: 64)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1244, size: 256, align: 64, elements: !1063)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1087, line: 238, baseType: !1246)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1087, line: 238, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1240, file: !1013, line: 110, baseType: !888, size: 32, align: 32, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1240, file: !1013, line: 111, baseType: !888, size: 32, align: 32, offset: 288)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1240, file: !1013, line: 111, baseType: !888, size: 32, align: 32, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1240, file: !1013, line: 112, baseType: !1060, size: 256, align: 32, offset: 352)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1240, file: !1013, line: 113, baseType: !1066, size: 128, align: 32, offset: 608)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1240, file: !1013, line: 114, baseType: !888, size: 32, align: 32, offset: 736)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1240, file: !1013, line: 115, baseType: !888, size: 32, align: 32, offset: 768)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1240, file: !1013, line: 116, baseType: !888, size: 32, align: 32, offset: 800)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1231, file: !1013, line: 163, baseType: !915, size: 64, align: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1231, file: !1013, line: 165, baseType: !1257, size: 128, align: 64, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1013, line: 122, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1013, line: 119, size: 128, align: 64, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1258, file: !1013, line: 120, baseType: !1080, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1258, file: !1013, line: 121, baseType: !1214, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1231, file: !1013, line: 166, baseType: !1263, size: 128, align: 64, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1013, line: 127, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1013, line: 124, size: 128, align: 64, elements: !1265)
!1265 = !{!1266, !1339}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1264, file: !1013, line: 125, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1297, !1301, !1302, !1336, !1337, !1338}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1270, file: !35, line: 5751, baseType: !902, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1270, file: !35, line: 5756, baseType: !1274, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1282, !1283, !1284, !1288, !1292, !1296}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !35, line: 5797, baseType: !908, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1276, file: !35, line: 5804, baseType: !1280, size: 64, align: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1276, file: !35, line: 5815, baseType: !902, size: 64, align: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1276, file: !35, line: 5825, baseType: !888, size: 32, align: 32, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1276, file: !35, line: 5826, baseType: !1285, size: 64, align: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!888, !1268}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1276, file: !35, line: 5827, baseType: !1289, size: 64, align: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!888, !1268, !1080}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1276, file: !35, line: 5828, baseType: !1293, size: 64, align: 64, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{null, !1268}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1276, file: !35, line: 5829, baseType: !1293, size: 64, align: 64, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1270, file: !35, line: 5762, baseType: !1298, size: 64, align: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1300)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1270, file: !35, line: 5768, baseType: !915, size: 64, align: 64, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1270, file: !35, line: 5775, baseType: !1303, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1305, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1305, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1305, file: !35, line: 3948, baseType: !1037, size: 32, align: 32, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1305, file: !35, line: 3958, baseType: !1028, size: 64, align: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1305, file: !35, line: 3962, baseType: !888, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1305, file: !35, line: 3968, baseType: !888, size: 32, align: 32, offset: 224)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1305, file: !35, line: 3973, baseType: !1073, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1305, file: !35, line: 3986, baseType: !888, size: 32, align: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1305, file: !35, line: 3999, baseType: !888, size: 32, align: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1305, file: !35, line: 4004, baseType: !888, size: 32, align: 32, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1305, file: !35, line: 4005, baseType: !888, size: 32, align: 32, offset: 416)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1305, file: !35, line: 4010, baseType: !888, size: 32, align: 32, offset: 448)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1305, file: !35, line: 4011, baseType: !888, size: 32, align: 32, offset: 480)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1305, file: !35, line: 4020, baseType: !961, size: 64, align: 32, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1305, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1305, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1305, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1305, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1305, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1305, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1305, file: !35, line: 4039, baseType: !888, size: 32, align: 32, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1305, file: !35, line: 4046, baseType: !979, size: 64, align: 64, offset: 832)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1305, file: !35, line: 4050, baseType: !888, size: 32, align: 32, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1305, file: !35, line: 4054, baseType: !888, size: 32, align: 32, offset: 928)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1305, file: !35, line: 4061, baseType: !888, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1305, file: !35, line: 4065, baseType: !888, size: 32, align: 32, offset: 992)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1305, file: !35, line: 4073, baseType: !888, size: 32, align: 32, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1305, file: !35, line: 4080, baseType: !888, size: 32, align: 32, offset: 1056)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1305, file: !35, line: 4084, baseType: !888, size: 32, align: 32, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1270, file: !35, line: 5781, baseType: !1303, size: 64, align: 64, offset: 320)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1270, file: !35, line: 5787, baseType: !961, size: 64, align: 32, offset: 384)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1270, file: !35, line: 5793, baseType: !961, size: 64, align: 32, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1264, file: !1013, line: 126, baseType: !888, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1231, file: !1013, line: 172, baseType: !1080, size: 64, align: 64, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1231, file: !1013, line: 177, baseType: !1028, size: 64, align: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1231, file: !1013, line: 178, baseType: !889, size: 32, align: 32, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1231, file: !1013, line: 180, baseType: !915, size: 64, align: 64, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1231, file: !1013, line: 185, baseType: !888, size: 32, align: 32, offset: 832)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1231, file: !1013, line: 190, baseType: !915, size: 64, align: 64, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1231, file: !1013, line: 195, baseType: !888, size: 32, align: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1231, file: !1013, line: 200, baseType: !1080, size: 64, align: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1231, file: !1013, line: 201, baseType: !888, size: 32, align: 32, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1231, file: !1013, line: 202, baseType: !1214, size: 64, align: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1231, file: !1013, line: 203, baseType: !888, size: 32, align: 32, offset: 1216)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1231, file: !1013, line: 205, baseType: !888, size: 32, align: 32, offset: 1248)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1231, file: !1013, line: 206, baseType: !888, size: 32, align: 32, offset: 1280)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1231, file: !1013, line: 209, baseType: !1190, size: 64, align: 64, offset: 1344)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1231, file: !1013, line: 212, baseType: !1190, size: 64, align: 64, offset: 1408)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1231, file: !1013, line: 213, baseType: !1214, size: 64, align: 64, offset: 1472)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1231, file: !1013, line: 215, baseType: !888, size: 32, align: 32, offset: 1536)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1231, file: !1013, line: 217, baseType: !888, size: 32, align: 32, offset: 1568)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1231, file: !1013, line: 220, baseType: !888, size: 32, align: 32, offset: 1600)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !899, file: !35, line: 1598, baseType: !915, size: 64, align: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !899, file: !35, line: 1606, baseType: !1073, size: 64, align: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !899, file: !35, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !899, file: !35, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !899, file: !35, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !899, file: !35, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !899, file: !35, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !899, file: !35, line: 1657, baseType: !1028, size: 64, align: 64, offset: 704)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !899, file: !35, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !899, file: !35, line: 1679, baseType: !961, size: 64, align: 32, offset: 800)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !899, file: !35, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !899, file: !35, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !899, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !899, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !899, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !899, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !899, file: !35, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !899, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !899, file: !35, line: 1791, baseType: !1378, size: 64, align: 64, offset: 1152)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1381, !1114, !1196, !888, !888, !888}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !899, file: !35, line: 1808, baseType: !1383, size: 64, align: 64, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!494, !1381, !968}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !899, file: !35, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !899, file: !35, line: 1825, baseType: !1388, size: 32, align: 32, offset: 1312)
!1388 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !899, file: !35, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !899, file: !35, line: 1838, baseType: !1388, size: 32, align: 32, offset: 1376)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !899, file: !35, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !899, file: !35, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !899, file: !35, line: 1861, baseType: !1388, size: 32, align: 32, offset: 1472)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !899, file: !35, line: 1868, baseType: !1388, size: 32, align: 32, offset: 1504)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !899, file: !35, line: 1875, baseType: !1388, size: 32, align: 32, offset: 1536)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !899, file: !35, line: 1882, baseType: !1388, size: 32, align: 32, offset: 1568)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !899, file: !35, line: 1889, baseType: !1388, size: 32, align: 32, offset: 1600)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !899, file: !35, line: 1896, baseType: !1388, size: 32, align: 32, offset: 1632)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !899, file: !35, line: 1903, baseType: !1388, size: 32, align: 32, offset: 1664)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !899, file: !35, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !899, file: !35, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !899, file: !35, line: 1926, baseType: !1196, size: 64, align: 64, offset: 1792)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !899, file: !35, line: 1935, baseType: !961, size: 64, align: 32, offset: 1856)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !899, file: !35, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !899, file: !35, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !899, file: !35, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !899, file: !35, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !899, file: !35, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !899, file: !35, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !899, file: !35, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !899, file: !35, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !899, file: !35, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !899, file: !35, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !899, file: !35, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !899, file: !35, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !899, file: !35, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !899, file: !35, line: 2054, baseType: !1418, size: 64, align: 64, offset: 2368)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !899, file: !35, line: 2061, baseType: !1418, size: 64, align: 64, offset: 2432)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !899, file: !35, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !899, file: !35, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !899, file: !35, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !899, file: !35, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !899, file: !35, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !899, file: !35, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !899, file: !35, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !899, file: !35, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !899, file: !35, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !899, file: !35, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !899, file: !35, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !899, file: !35, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !899, file: !35, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !899, file: !35, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !899, file: !35, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !899, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !899, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !899, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !899, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !899, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !899, file: !35, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !899, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !899, file: !35, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !899, file: !35, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !899, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !899, file: !35, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !899, file: !35, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !899, file: !35, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !899, file: !35, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !899, file: !35, line: 2263, baseType: !979, size: 64, align: 64, offset: 3456)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !899, file: !35, line: 2270, baseType: !979, size: 64, align: 64, offset: 3520)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !899, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !899, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !899, file: !35, line: 2367, baseType: !1454, size: 64, align: 64, offset: 3648)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!888, !1381, !1214, !888}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !899, file: !35, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !899, file: !35, line: 2386, baseType: !1388, size: 32, align: 32, offset: 3744)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !899, file: !35, line: 2387, baseType: !1388, size: 32, align: 32, offset: 3776)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !899, file: !35, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !899, file: !35, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !899, file: !35, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !899, file: !35, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !899, file: !35, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !899, file: !35, line: 2423, baseType: !1466, size: 64, align: 64, offset: 3968)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1468, file: !35, line: 827, baseType: !888, size: 32, align: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1468, file: !35, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1468, file: !35, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1468, file: !35, line: 830, baseType: !1388, size: 32, align: 32, offset: 96)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !899, file: !35, line: 2430, baseType: !1073, size: 64, align: 64, offset: 4032)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !899, file: !35, line: 2437, baseType: !1073, size: 64, align: 64, offset: 4096)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !899, file: !35, line: 2444, baseType: !1388, size: 32, align: 32, offset: 4160)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !899, file: !35, line: 2451, baseType: !1388, size: 32, align: 32, offset: 4192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !899, file: !35, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !899, file: !35, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !899, file: !35, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !899, file: !35, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !899, file: !35, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !899, file: !35, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !899, file: !35, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !899, file: !35, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !899, file: !35, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !899, file: !35, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !899, file: !35, line: 2514, baseType: !1073, size: 64, align: 64, offset: 4544)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !899, file: !35, line: 2528, baseType: !1490, size: 64, align: 64, offset: 4608)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !1381, !915, !888, !888}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !899, file: !35, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !899, file: !35, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !899, file: !35, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !899, file: !35, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !899, file: !35, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !899, file: !35, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !899, file: !35, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !899, file: !35, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !899, file: !35, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !899, file: !35, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !899, file: !35, line: 2571, baseType: !1069, size: 64, align: 64, offset: 4992)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !899, file: !35, line: 2579, baseType: !1069, size: 64, align: 64, offset: 5056)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !899, file: !35, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !899, file: !35, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !899, file: !35, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !899, file: !35, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !899, file: !35, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !899, file: !35, line: 2709, baseType: !1073, size: 64, align: 64, offset: 5312)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !899, file: !35, line: 2716, baseType: !1512, size: 64, align: 64, offset: 5376)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1514)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1515)
!1515 = !{!1516, !1517, !1518, !1519, !1520, !1521, !1522, !1526, !1530, !1531, !1532, !1533, !1539, !1540, !1541, !1542, !1543}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1514, file: !35, line: 3642, baseType: !908, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1514, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1514, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1514, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1514, file: !35, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1514, file: !35, line: 3682, baseType: !1211, size: 64, align: 64, offset: 192)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1514, file: !35, line: 3698, baseType: !1523, size: 64, align: 64, offset: 256)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!888, !897, !1016, !1037}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1514, file: !35, line: 3712, baseType: !1527, size: 64, align: 64, offset: 320)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!888, !897, !888, !1016, !1037}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1514, file: !35, line: 3726, baseType: !1523, size: 64, align: 64, offset: 384)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1514, file: !35, line: 3737, baseType: !999, size: 64, align: 64, offset: 448)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1514, file: !35, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1514, file: !35, line: 3757, baseType: !1534, size: 64, align: 64, offset: 576)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{null, !1537}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1514, file: !35, line: 3766, baseType: !999, size: 64, align: 64, offset: 640)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1514, file: !35, line: 3774, baseType: !999, size: 64, align: 64, offset: 704)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1514, file: !35, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1514, file: !35, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1514, file: !35, line: 3795, baseType: !1544, size: 64, align: 64, offset: 832)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!888, !897, !1085}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !899, file: !35, line: 2728, baseType: !915, size: 64, align: 64, offset: 5440)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !899, file: !35, line: 2735, baseType: !1138, size: 512, align: 64, offset: 5504)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !899, file: !35, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !899, file: !35, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !899, file: !35, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !899, file: !35, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !899, file: !35, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !899, file: !35, line: 2802, baseType: !1214, size: 64, align: 64, offset: 6208)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !899, file: !35, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !899, file: !35, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !899, file: !35, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !899, file: !35, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !899, file: !35, line: 2851, baseType: !1560, size: 64, align: 64, offset: 6400)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!888, !1381, !1563, !915, !1196, !888, !888}
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!888, !1381, !915}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !899, file: !35, line: 2871, baseType: !1567, size: 64, align: 64, offset: 6464)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!888, !1381, !1570, !915, !1196, !888}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!888, !1381, !915, !888, !888}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !899, file: !35, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !899, file: !35, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !899, file: !35, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !899, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !899, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !899, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !899, file: !35, line: 3037, baseType: !1028, size: 64, align: 64, offset: 6720)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !899, file: !35, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !899, file: !35, line: 3050, baseType: !979, size: 64, align: 64, offset: 6848)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !899, file: !35, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !899, file: !35, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !899, file: !35, line: 3092, baseType: !961, size: 64, align: 32, offset: 6976)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !899, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !899, file: !35, line: 3106, baseType: !961, size: 64, align: 32, offset: 7072)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !899, file: !35, line: 3113, baseType: !1588, size: 64, align: 64, offset: 7168)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1590)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596, !1597, !1598, !1601}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1591, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1591, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1591, file: !35, line: 720, baseType: !908, size: 64, align: 64, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1591, file: !35, line: 724, baseType: !908, size: 64, align: 64, offset: 128)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1591, file: !35, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1591, file: !35, line: 734, baseType: !1599, size: 64, align: 64, offset: 256)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1591, file: !35, line: 739, baseType: !1602, size: 64, align: 64, offset: 320)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !899, file: !35, line: 3129, baseType: !1073, size: 64, align: 64, offset: 7232)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !899, file: !35, line: 3130, baseType: !1073, size: 64, align: 64, offset: 7296)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !899, file: !35, line: 3131, baseType: !1073, size: 64, align: 64, offset: 7360)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !899, file: !35, line: 3132, baseType: !1073, size: 64, align: 64, offset: 7424)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !899, file: !35, line: 3139, baseType: !1069, size: 64, align: 64, offset: 7488)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !899, file: !35, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !899, file: !35, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !899, file: !35, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !899, file: !35, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !899, file: !35, line: 3191, baseType: !1418, size: 64, align: 64, offset: 7680)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !899, file: !35, line: 3199, baseType: !1028, size: 64, align: 64, offset: 7744)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !899, file: !35, line: 3207, baseType: !1069, size: 64, align: 64, offset: 7808)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !899, file: !35, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !899, file: !35, line: 3224, baseType: !1103, size: 64, align: 64, offset: 7936)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !899, file: !35, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !899, file: !35, line: 3249, baseType: !1085, size: 64, align: 64, offset: 8064)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !899, file: !35, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !899, file: !35, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !899, file: !35, line: 3279, baseType: !1073, size: 64, align: 64, offset: 8192)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !899, file: !35, line: 3301, baseType: !1085, size: 64, align: 64, offset: 8256)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !899, file: !35, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !899, file: !35, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !899, file: !35, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !899, file: !35, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1629)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PNMContext", file: !1631, line: 33, baseType: !1632)
!1631 = !DIFile(filename: "libavcodec/pnm.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PNMContext", file: !1631, line: 27, size: 256, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream", scope: !1632, file: !1631, line: 28, baseType: !1028, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_start", scope: !1632, file: !1631, line: 29, baseType: !1028, size: 64, align: 64, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_end", scope: !1632, file: !1631, line: 30, baseType: !1028, size: 64, align: 64, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1632, file: !1631, line: 31, baseType: !888, size: 32, align: 32, offset: 192)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1632, file: !1631, line: 32, baseType: !888, size: 32, align: 32, offset: 224)
!1639 = !{}
!1640 = !DILocalVariable(name: "avctx", arg: 1, scope: !893, file: !894, line: 61, type: !897)
!1641 = !DIExpression()
!1642 = !DILocation(line: 61, column: 42, scope: !893)
!1643 = !DILocalVariable(name: "s", arg: 2, scope: !893, file: !894, line: 61, type: !1628)
!1644 = !DILocation(line: 61, column: 68, scope: !893)
!1645 = !DILocalVariable(name: "buf1", scope: !893, file: !894, line: 63, type: !1646)
!1646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 256, align: 8, elements: !1647)
!1647 = !{!1648}
!1648 = !DISubrange(count: 32)
!1649 = !DILocation(line: 63, column: 10, scope: !893)
!1650 = !DILocalVariable(name: "tuple_type", scope: !893, file: !894, line: 63, type: !1646)
!1651 = !DILocation(line: 63, column: 20, scope: !893)
!1652 = !DILocalVariable(name: "h", scope: !893, file: !894, line: 64, type: !888)
!1653 = !DILocation(line: 64, column: 9, scope: !893)
!1654 = !DILocalVariable(name: "w", scope: !893, file: !894, line: 64, type: !888)
!1655 = !DILocation(line: 64, column: 12, scope: !893)
!1656 = !DILocalVariable(name: "depth", scope: !893, file: !894, line: 64, type: !888)
!1657 = !DILocation(line: 64, column: 15, scope: !893)
!1658 = !DILocalVariable(name: "maxval", scope: !893, file: !894, line: 64, type: !888)
!1659 = !DILocation(line: 64, column: 22, scope: !893)
!1660 = !DILocalVariable(name: "ret", scope: !893, file: !894, line: 65, type: !888)
!1661 = !DILocation(line: 65, column: 9, scope: !893)
!1662 = !DILocation(line: 67, column: 13, scope: !893)
!1663 = !DILocation(line: 67, column: 16, scope: !893)
!1664 = !DILocation(line: 67, column: 5, scope: !893)
!1665 = !DILocation(line: 68, column: 8, scope: !1666)
!1666 = distinct !DILexicalBlock(scope: !893, file: !894, line: 68, column: 8)
!1667 = !DILocation(line: 68, column: 16, scope: !1666)
!1668 = !DILocation(line: 68, column: 8, scope: !893)
!1669 = !DILocation(line: 69, column: 9, scope: !1666)
!1670 = !DILocation(line: 70, column: 14, scope: !893)
!1671 = !DILocation(line: 70, column: 21, scope: !893)
!1672 = !DILocation(line: 70, column: 5, scope: !893)
!1673 = !DILocation(line: 70, column: 8, scope: !893)
!1674 = !DILocation(line: 70, column: 12, scope: !893)
!1675 = !DILocation(line: 72, column: 9, scope: !1676)
!1676 = distinct !DILexicalBlock(scope: !893, file: !894, line: 72, column: 9)
!1677 = !DILocation(line: 72, column: 12, scope: !1676)
!1678 = !DILocation(line: 72, column: 16, scope: !1676)
!1679 = !DILocation(line: 72, column: 20, scope: !1676)
!1680 = !DILocation(line: 72, column: 23, scope: !1681)
