; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ivi.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ivi.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.IVIHuffDesc = type { i32, [16 x i8] }
%struct.RVMapDesc = type { i8, i8, [256 x i8], [256 x i8] }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.IVIHuffTab = type { i32, %struct.VLC*, %struct.IVIHuffDesc, %struct.VLC }

!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 39, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/ivi.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTRA", value: 0)
!891 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTRA1", value: 1)
!892 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTER", value: 2)
!893 = !DIEnumerator(name: "IVI4_FRAMETYPE_BIDIR", value: 3)
!894 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTER_NOREF", value: 4)
!895 = !DIEnumerator(name: "IVI4_FRAMETYPE_NULL_FIRST", value: 5)
!896 = !DIEnumerator(name: "IVI4_FRAMETYPE_NULL_LAST", value: 6)
!897 = !{!898, !899, !900, !908}
!898 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!899 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !903, line: 221, size: 32, align: 8, elements: !904)
!903 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !902, file: !903, line: 221, baseType: !906, size: 32, align: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !907, line: 51, baseType: !899)
!907 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!909 = !{!910, !922, !923, !930, !931, !935, !953, !968, !969, !979}
!910 = distinct !DIGlobalVariable(name: "table_data", scope: !911, file: !912, line: 182, type: !916, isLocal: true, isDefinition: true, variable: [131072 x [2 x i16]]* @ff_ivi_init_static_vlc.table_data)
!911 = distinct !DISubprogram(name: "ff_ivi_init_static_vlc", scope: !912, file: !912, line: 179, type: !913, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !915)
!912 = !DIFile(filename: "libavcodec/ivi.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!913 = !DISubroutineType(types: !914)
!914 = !{null}
!915 = !{}
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 4194304, align: 16, elements: !919)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !907, line: 37, baseType: !918)
!918 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!919 = !{!920, !921}
!920 = !DISubrange(count: 131072)
!921 = !DISubrange(count: 2)
!922 = distinct !DIGlobalVariable(name: "initialized_vlcs", scope: !911, file: !912, line: 183, type: !898, isLocal: true, isDefinition: true, variable: i32* @ff_ivi_init_static_vlc.initialized_vlcs)
!923 = distinct !DIGlobalVariable(name: "ff_ivi_vertical_scan_8x8", scope: !0, file: !912, line: 1237, type: !924, isLocal: false, isDefinition: true, variable: [64 x i8]* @ff_ivi_vertical_scan_8x8)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 512, align: 8, elements: !928)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !907, line: 48, baseType: !927)
!927 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!928 = !{!929}
!929 = !DISubrange(count: 64)
!930 = distinct !DIGlobalVariable(name: "ff_ivi_horizontal_scan_8x8", scope: !0, file: !912, line: 1248, type: !924, isLocal: false, isDefinition: true, variable: [64 x i8]* @ff_ivi_horizontal_scan_8x8)
!931 = distinct !DIGlobalVariable(name: "ff_ivi_direct_scan_4x4", scope: !0, file: !912, line: 1259, type: !932, isLocal: false, isDefinition: true, variable: [16 x i8]* @ff_ivi_direct_scan_4x4)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 128, align: 8, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 16)
!935 = distinct !DIGlobalVariable(name: "ff_ivi_rvmap_tabs", scope: !0, file: !912, line: 1267, type: !936, isLocal: false, isDefinition: true, variable: [9 x %struct.RVMapDesc]* @ff_ivi_rvmap_tabs)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 37008, align: 8, elements: !951)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "RVMapDesc", file: !888, line: 102, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RVMapDesc", file: !888, line: 97, size: 4112, align: 8, elements: !940)
!940 = !{!941, !942, !943, !947}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "eob_sym", scope: !939, file: !888, line: 98, baseType: !926, size: 8, align: 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "esc_sym", scope: !939, file: !888, line: 99, baseType: !926, size: 8, align: 8, offset: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "runtab", scope: !939, file: !888, line: 100, baseType: !944, size: 2048, align: 8, offset: 16)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 2048, align: 8, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "valtab", scope: !939, file: !888, line: 101, baseType: !948, size: 2048, align: 8, offset: 2064)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 2048, align: 8, elements: !945)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !907, line: 36, baseType: !950)
!950 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!951 = !{!952}
!952 = !DISubrange(count: 9)
!953 = distinct !DIGlobalVariable(name: "ivi_mb_vlc_tabs", scope: !0, file: !912, line: 73, type: !954, isLocal: true, isDefinition: true, variable: [8 x %struct.VLC]* @ivi_mb_vlc_tabs)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 1536, align: 64, elements: !966)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !956, line: 30, baseType: !957)
!956 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !956, line: 26, size: 192, align: 64, elements: !958)
!958 = !{!959, !960, !964, !965}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !957, file: !956, line: 27, baseType: !898, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !957, file: !956, line: 28, baseType: !961, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 32, align: 16, elements: !963)
!963 = !{!921}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !957, file: !956, line: 29, baseType: !898, size: 32, align: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !957, file: !956, line: 29, baseType: !898, size: 32, align: 32, offset: 160)
!966 = !{!967}
!967 = !DISubrange(count: 8)
!968 = distinct !DIGlobalVariable(name: "ivi_blk_vlc_tabs", scope: !0, file: !912, line: 74, type: !954, isLocal: true, isDefinition: true, variable: [8 x %struct.VLC]* @ivi_blk_vlc_tabs)
!969 = distinct !DIGlobalVariable(name: "ivi_mb_huff_desc", scope: !0, file: !912, line: 50, type: !970, isLocal: true, isDefinition: true, variable: [8 x %struct.IVIHuffDesc]* @ivi_mb_huff_desc)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 1280, align: 32, elements: !966)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIHuffDesc", file: !888, line: 58, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIHuffDesc", file: !888, line: 55, size: 160, align: 32, elements: !974)
!974 = !{!975, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !973, file: !888, line: 56, baseType: !976, size: 32, align: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !907, line: 38, baseType: !898)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "xbits", scope: !973, file: !888, line: 57, baseType: !978, size: 128, align: 8, offset: 32)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 8, elements: !933)
!979 = distinct !DIGlobalVariable(name: "ivi_blk_huff_desc", scope: !0, file: !912, line: 62, type: !970, isLocal: true, isDefinition: true, variable: [8 x %struct.IVIHuffDesc]* @ivi_blk_huff_desc)
!980 = !{i32 2, !"Dwarf Version", i32 4}
!981 = !{i32 2, !"Debug Info Version", i32 3}
!982 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!983 = !DILocalVariable(name: "i", scope: !911, file: !912, line: 181, type: !898)
!984 = !DIExpression()
!985 = !DILocation(line: 181, column: 9, scope: !911)
!986 = !DILocation(line: 185, column: 9, scope: !987)
!987 = distinct !DILexicalBlock(scope: !911, file: !912, line: 185, column: 9)
!988 = !DILocation(line: 185, column: 9, scope: !911)
!989 = !DILocation(line: 186, column: 9, scope: !987)
!990 = !DILocation(line: 187, column: 12, scope: !991)
!991 = distinct !DILexicalBlock(scope: !911, file: !912, line: 187, column: 5)
!992 = !DILocation(line: 187, column: 10, scope: !991)
!993 = !DILocation(line: 187, column: 17, scope: !994)
!994 = !DILexicalBlockFile(scope: !995, file: !912, discriminator: 1)
!995 = distinct !DILexicalBlock(scope: !991, file: !912, line: 187, column: 5)
!996 = !DILocation(line: 187, column: 19, scope: !994)
!997 = !DILocation(line: 187, column: 5, scope: !994)
!998 = !DILocation(line: 188, column: 49, scope: !999)
!999 = distinct !DILexicalBlock(scope: !995, file: !912, line: 187, column: 29)
!1000 = !DILocation(line: 188, column: 51, scope: !999)
!1001 = !DILocation(line: 188, column: 55, scope: !999)
!1002 = !DILocation(line: 188, column: 47, scope: !999)
!1003 = !DILocation(line: 188, column: 25, scope: !999)
!1004 = !DILocation(line: 188, column: 9, scope: !999)
!1005 = !DILocation(line: 188, column: 28, scope: !999)
!1006 = !DILocation(line: 188, column: 34, scope: !999)
!1007 = !DILocation(line: 189, column: 25, scope: !999)
!1008 = !DILocation(line: 189, column: 9, scope: !999)
!1009 = !DILocation(line: 189, column: 28, scope: !999)
!1010 = !DILocation(line: 189, column: 44, scope: !999)
!1011 = !DILocation(line: 190, column: 53, scope: !999)
!1012 = !DILocation(line: 190, column: 36, scope: !999)
!1013 = !DILocation(line: 191, column: 52, scope: !999)
!1014 = !DILocation(line: 191, column: 36, scope: !999)
!1015 = !DILocation(line: 190, column: 9, scope: !999)
!1016 = !DILocation(line: 192, column: 51, scope: !999)
!1017 = !DILocation(line: 192, column: 53, scope: !999)
!1018 = !DILocation(line: 192, column: 57, scope: !999)
!1019 = !DILocation(line: 192, column: 62, scope: !999)
!1020 = !DILocation(line: 192, column: 48, scope: !999)
!1021 = !DILocation(line: 192, column: 26, scope: !999)
!1022 = !DILocation(line: 192, column: 9, scope: !999)
!1023 = !DILocation(line: 192, column: 29, scope: !999)
!1024 = !DILocation(line: 192, column: 35, scope: !999)
!1025 = !DILocation(line: 193, column: 26, scope: !999)
!1026 = !DILocation(line: 193, column: 9, scope: !999)
!1027 = !DILocation(line: 193, column: 29, scope: !999)
!1028 = !DILocation(line: 193, column: 45, scope: !999)
!1029 = !DILocation(line: 194, column: 54, scope: !999)
!1030 = !DILocation(line: 194, column: 36, scope: !999)
!1031 = !DILocation(line: 195, column: 53, scope: !999)
!1032 = !DILocation(line: 195, column: 36, scope: !999)
!1033 = !DILocation(line: 194, column: 9, scope: !999)
!1034 = !DILocation(line: 196, column: 5, scope: !999)
!1035 = !DILocation(line: 187, column: 25, scope: !1036)
!1036 = !DILexicalBlockFile(scope: !995, file: !912, discriminator: 2)
!1037 = !DILocation(line: 187, column: 5, scope: !1036)
!1038 = distinct !{!1038, !1039}
!1039 = !DILocation(line: 187, column: 5, scope: !911)
!1040 = !DILocation(line: 197, column: 22, scope: !911)
!1041 = !DILocation(line: 198, column: 1, scope: !911)
!1042 = !DILocation(line: 198, column: 1, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !911, file: !912, discriminator: 1)
!1044 = distinct !DISubprogram(name: "ivi_create_huff_from_desc", scope: !912, file: !912, line: 145, type: !1045, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !915)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!898, !1047, !1048, !898}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1049 = !DILocalVariable(name: "cb", arg: 1, scope: !1044, file: !912, line: 145, type: !1047)
!1050 = !DILocation(line: 145, column: 57, scope: !1044)
!1051 = !DILocalVariable(name: "vlc", arg: 2, scope: !1044, file: !912, line: 145, type: !1048)
!1052 = !DILocation(line: 145, column: 66, scope: !1044)
!1053 = !DILocalVariable(name: "flag", arg: 3, scope: !1044, file: !912, line: 145, type: !898)
!1054 = !DILocation(line: 145, column: 75, scope: !1044)
!1055 = !DILocalVariable(name: "pos", scope: !1044, file: !912, line: 147, type: !898)
!1056 = !DILocation(line: 147, column: 9, scope: !1044)
!1057 = !DILocalVariable(name: "i", scope: !1044, file: !912, line: 147, type: !898)
!1058 = !DILocation(line: 147, column: 14, scope: !1044)
!1059 = !DILocalVariable(name: "j", scope: !1044, file: !912, line: 147, type: !898)
!1060 = !DILocation(line: 147, column: 17, scope: !1044)
!1061 = !DILocalVariable(name: "codes_per_row", scope: !1044, file: !912, line: 147, type: !898)
!1062 = !DILocation(line: 147, column: 20, scope: !1044)
!1063 = !DILocalVariable(name: "prefix", scope: !1044, file: !912, line: 147, type: !898)
!1064 = !DILocation(line: 147, column: 35, scope: !1044)
!1065 = !DILocalVariable(name: "not_last_row", scope: !1044, file: !912, line: 147, type: !898)
!1066 = !DILocation(line: 147, column: 43, scope: !1044)
!1067 = !DILocalVariable(name: "codewords", scope: !1044, file: !912, line: 148, type: !1068)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 4096, align: 16, elements: !945)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !907, line: 49, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1071 = !DILocation(line: 148, column: 14, scope: !1044)
!1072 = !DILocalVariable(name: "bits", scope: !1044, file: !912, line: 149, type: !944)
!1073 = !DILocation(line: 149, column: 13, scope: !1044)
!1074 = !DILocation(line: 151, column: 9, scope: !1044)
!1075 = !DILocation(line: 153, column: 12, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1044, file: !912, line: 153, column: 5)
!1077 = !DILocation(line: 153, column: 10, scope: !1076)
!1078 = !DILocation(line: 153, column: 17, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1080, file: !912, discriminator: 1)
!1080 = distinct !DILexicalBlock(scope: !1076, file: !912, line: 153, column: 5)
!1081 = !DILocation(line: 153, column: 21, scope: !1079)
!1082 = !DILocation(line: 153, column: 25, scope: !1079)
!1083 = !DILocation(line: 153, column: 19, scope: !1079)
!1084 = !DILocation(line: 153, column: 5, scope: !1079)
!1085 = !DILocation(line: 154, column: 40, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1080, file: !912, line: 153, column: 40)
!1087 = !DILocation(line: 154, column: 30, scope: !1086)
!1088 = !DILocation(line: 154, column: 34, scope: !1086)
!1089 = !DILocation(line: 154, column: 27, scope: !1086)
!1090 = !DILocation(line: 154, column: 23, scope: !1086)
!1091 = !DILocation(line: 155, column: 25, scope: !1086)
!1092 = !DILocation(line: 155, column: 30, scope: !1086)
!1093 = !DILocation(line: 155, column: 34, scope: !1086)
!1094 = !DILocation(line: 155, column: 43, scope: !1086)
!1095 = !DILocation(line: 155, column: 27, scope: !1086)
!1096 = !DILocation(line: 155, column: 22, scope: !1086)
!1097 = !DILocation(line: 156, column: 25, scope: !1086)
!1098 = !DILocation(line: 156, column: 22, scope: !1086)
!1099 = !DILocation(line: 156, column: 28, scope: !1086)
!1100 = !DILocation(line: 156, column: 47, scope: !1086)
!1101 = !DILocation(line: 156, column: 37, scope: !1086)
!1102 = !DILocation(line: 156, column: 41, scope: !1086)
!1103 = !DILocation(line: 156, column: 52, scope: !1086)
!1104 = !DILocation(line: 156, column: 50, scope: !1086)
!1105 = !DILocation(line: 156, column: 33, scope: !1086)
!1106 = !DILocation(line: 156, column: 16, scope: !1086)
!1107 = !DILocation(line: 158, column: 16, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1086, file: !912, line: 158, column: 9)
!1109 = !DILocation(line: 158, column: 14, scope: !1108)
!1110 = !DILocation(line: 158, column: 21, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1112, file: !912, discriminator: 1)
!1112 = distinct !DILexicalBlock(scope: !1108, file: !912, line: 158, column: 9)
!1113 = !DILocation(line: 158, column: 25, scope: !1111)
!1114 = !DILocation(line: 158, column: 23, scope: !1111)
!1115 = !DILocation(line: 158, column: 9, scope: !1111)
!1116 = !DILocation(line: 159, column: 17, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !912, line: 159, column: 17)
!1118 = distinct !DILexicalBlock(scope: !1112, file: !912, line: 158, column: 45)
!1119 = !DILocation(line: 159, column: 21, scope: !1117)
!1120 = !DILocation(line: 159, column: 17, scope: !1118)
!1121 = !DILocation(line: 160, column: 17, scope: !1117)
!1122 = !DILocation(line: 162, column: 25, scope: !1118)
!1123 = !DILocation(line: 162, column: 39, scope: !1118)
!1124 = !DILocation(line: 162, column: 29, scope: !1118)
!1125 = !DILocation(line: 162, column: 33, scope: !1118)
!1126 = !DILocation(line: 162, column: 27, scope: !1118)
!1127 = !DILocation(line: 162, column: 44, scope: !1118)
!1128 = !DILocation(line: 162, column: 42, scope: !1118)
!1129 = !DILocation(line: 162, column: 18, scope: !1118)
!1130 = !DILocation(line: 162, column: 13, scope: !1118)
!1131 = !DILocation(line: 162, column: 23, scope: !1118)
!1132 = !DILocation(line: 163, column: 22, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1118, file: !912, line: 163, column: 17)
!1134 = !DILocation(line: 163, column: 17, scope: !1133)
!1135 = !DILocation(line: 163, column: 27, scope: !1133)
!1136 = !DILocation(line: 163, column: 17, scope: !1118)
!1137 = !DILocation(line: 164, column: 17, scope: !1133)
!1138 = !DILocation(line: 166, column: 40, scope: !1118)
!1139 = !DILocation(line: 166, column: 49, scope: !1118)
!1140 = !DILocation(line: 166, column: 47, scope: !1118)
!1141 = !DILocation(line: 166, column: 39, scope: !1118)
!1142 = !DILocation(line: 166, column: 58, scope: !1118)
!1143 = !DILocation(line: 166, column: 53, scope: !1118)
!1144 = !DILocation(line: 166, column: 30, scope: !1118)
!1145 = !DILocation(line: 166, column: 23, scope: !1118)
!1146 = !DILocation(line: 166, column: 13, scope: !1118)
!1147 = !DILocation(line: 166, column: 28, scope: !1118)
!1148 = !DILocation(line: 167, column: 23, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1118, file: !912, line: 167, column: 17)
!1150 = !DILocation(line: 167, column: 18, scope: !1149)
!1151 = !DILocation(line: 167, column: 17, scope: !1118)
!1152 = !DILocation(line: 168, column: 22, scope: !1149)
!1153 = !DILocation(line: 168, column: 17, scope: !1149)
!1154 = !DILocation(line: 168, column: 27, scope: !1149)
!1155 = !DILocation(line: 170, column: 16, scope: !1118)
!1156 = !DILocation(line: 171, column: 9, scope: !1118)
!1157 = !DILocation(line: 158, column: 41, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1112, file: !912, discriminator: 2)
!1159 = !DILocation(line: 158, column: 9, scope: !1158)
!1160 = distinct !{!1160, !1161}
!1161 = !DILocation(line: 158, column: 9, scope: !1086)
!1162 = !DILocation(line: 172, column: 5, scope: !1086)
!1163 = !DILocation(line: 153, column: 36, scope: !1164)
!1164 = !DILexicalBlockFile(scope: !1080, file: !912, discriminator: 2)
!1165 = !DILocation(line: 153, column: 5, scope: !1164)
!1166 = distinct !{!1166, !1167}
!1167 = !DILocation(line: 153, column: 5, scope: !1044)
!1168 = !DILocation(line: 175, column: 31, scope: !1044)
!1169 = !DILocation(line: 175, column: 40, scope: !1044)
!1170 = !DILocation(line: 175, column: 45, scope: !1044)
!1171 = !DILocation(line: 175, column: 57, scope: !1044)
!1172 = !DILocation(line: 175, column: 20, scope: !1044)
!1173 = !DILocation(line: 175, column: 34, scope: !1044)
!1174 = !DILocation(line: 175, column: 12, scope: !1044)
!1175 = !DILocation(line: 175, column: 5, scope: !1044)
!1176 = !DILocation(line: 177, column: 1, scope: !1044)
!1177 = distinct !DISubprogram(name: "ff_ivi_dec_huff_desc", scope: !912, file: !912, line: 226, type: !1178, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !915)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!898, !1180, !898, !898, !1191, !1199}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1182, line: 70, baseType: !1183)
!1182 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1182, line: 61, size: 256, align: 64, elements: !1184)
!1184 = !{!1185, !1187, !1188, !1189, !1190}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1183, file: !1182, line: 62, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1183, file: !1182, line: 62, baseType: !1186, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1183, file: !1182, line: 67, baseType: !898, size: 32, align: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1183, file: !1182, line: 68, baseType: !898, size: 32, align: 32, offset: 160)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1183, file: !1182, line: 69, baseType: !898, size: 32, align: 32, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVIHuffTab", file: !888, line: 71, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IVIHuffTab", file: !888, line: 63, size: 512, align: 64, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "tab_sel", scope: !1193, file: !888, line: 64, baseType: !976, size: 32, align: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !1193, file: !888, line: 66, baseType: !1048, size: 64, align: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "cust_desc", scope: !1193, file: !888, line: 69, baseType: !972, size: 160, align: 32, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "cust_tab", scope: !1193, file: !888, line: 70, baseType: !955, size: 192, align: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1202)
!1202 = !{!1203, !1247, !1248, !1249, !1514, !1515, !1516, !1517, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1670, !1674, !1675, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1854, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1201, file: !35, line: 1561, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1208)
!1208 = !{!1209, !1213, !1217, !1221, !1222, !1223, !1224, !1228, !1234, !1236, !1240}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1207, file: !4, line: 72, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1212)
!1212 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1207, file: !4, line: 78, baseType: !1214, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1210, !908}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1207, file: !4, line: 85, baseType: !1218, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1220)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1207, file: !4, line: 93, baseType: !898, size: 32, align: 32, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1207, file: !4, line: 99, baseType: !898, size: 32, align: 32, offset: 224)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1207, file: !4, line: 108, baseType: !898, size: 32, align: 32, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1207, file: !4, line: 113, baseType: !1225, size: 64, align: 64, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!908, !908, !908}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1207, file: !4, line: 123, baseType: !1229, size: 64, align: 64, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!1232, !1232}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1207, file: !4, line: 130, baseType: !1235, size: 32, align: 32, offset: 448)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1207, file: !4, line: 136, baseType: !1237, size: 64, align: 64, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!1235, !908}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1207, file: !4, line: 142, baseType: !1241, size: 64, align: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!898, !1244, !908, !1210, !898}
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1201, file: !35, line: 1562, baseType: !898, size: 32, align: 32, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1201, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1201, file: !35, line: 1565, baseType: !1250, size: 64, align: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1268, !1271, !1274, !1277, !1282, !1283, !1284, !1292, !1293, !1294, !1296, !1300, !1306, !1315, !1319, !1320, !1366, !1485, !1489, !1490, !1494, !1498, !1503, !1507, !1508, !1509}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1252, file: !35, line: 3475, baseType: !1210, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1252, file: !35, line: 3480, baseType: !1210, size: 64, align: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1252, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1252, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1252, file: !35, line: 3487, baseType: !898, size: 32, align: 32, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1252, file: !35, line: 3488, baseType: !1260, size: 64, align: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1263, line: 61, baseType: !1264)
!1263 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1263, line: 58, size: 64, align: 32, elements: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1264, file: !1263, line: 59, baseType: !898, size: 32, align: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1264, file: !1263, line: 60, baseType: !898, size: 32, align: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1252, file: !35, line: 3489, baseType: !1269, size: 64, align: 64, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1252, file: !35, line: 3490, baseType: !1272, size: 64, align: 64, offset: 384)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1252, file: !35, line: 3491, baseType: !1275, size: 64, align: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1252, file: !35, line: 3492, baseType: !1278, size: 64, align: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !907, line: 55, baseType: !1281)
!1281 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1252, file: !35, line: 3493, baseType: !926, size: 8, align: 8, offset: 576)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1252, file: !35, line: 3494, baseType: !1204, size: 64, align: 64, offset: 640)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1252, file: !35, line: 3495, baseType: !1285, size: 64, align: 64, offset: 704)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1289)
!1289 = !{!1290, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1288, file: !35, line: 3402, baseType: !898, size: 32, align: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1288, file: !35, line: 3403, baseType: !1210, size: 64, align: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1252, file: !35, line: 3507, baseType: !1210, size: 64, align: 64, offset: 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1252, file: !35, line: 3516, baseType: !898, size: 32, align: 32, offset: 832)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1252, file: !35, line: 3517, baseType: !1295, size: 64, align: 64, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1252, file: !35, line: 3527, baseType: !1297, size: 64, align: 64, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!898, !1199}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1252, file: !35, line: 3535, baseType: !1301, size: 64, align: 64, offset: 1024)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!898, !1199, !1304}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1252, file: !35, line: 3541, baseType: !1307, size: 64, align: 64, offset: 1088)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1311, line: 223, size: 128, align: 64, elements: !1312)
!1311 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1312 = !{!1313, !1314}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1310, file: !1311, line: 224, baseType: !1186, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1310, file: !1311, line: 225, baseType: !1186, size: 64, align: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1252, file: !35, line: 3549, baseType: !1316, size: 64, align: 64, offset: 1152)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !1295}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1252, file: !35, line: 3551, baseType: !1297, size: 64, align: 64, offset: 1216)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1252, file: !35, line: 3552, baseType: !1321, size: 64, align: 64, offset: 1280)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!898, !1199, !1324, !898, !1325}
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1363}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1327, file: !35, line: 3921, baseType: !1069, size: 16, align: 16)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1327, file: !35, line: 3922, baseType: !906, size: 32, align: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1327, file: !35, line: 3923, baseType: !906, size: 32, align: 32, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1327, file: !35, line: 3924, baseType: !899, size: 32, align: 32, offset: 96)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1327, file: !35, line: 3925, baseType: !1334, size: 64, align: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1342, !1343, !1344, !1352, !1356, !1358, !1359, !1361, !1362}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1337, file: !35, line: 3886, baseType: !898, size: 32, align: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1337, file: !35, line: 3887, baseType: !898, size: 32, align: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1337, file: !35, line: 3888, baseType: !898, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1337, file: !35, line: 3889, baseType: !898, size: 32, align: 32, offset: 96)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1337, file: !35, line: 3890, baseType: !898, size: 32, align: 32, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1337, file: !35, line: 3897, baseType: !1345, size: 768, align: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1347)
!1347 = !{!1348, !1350}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1346, file: !35, line: 3855, baseType: !1349, size: 512, align: 64)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1324, size: 512, align: 64, elements: !966)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1346, file: !35, line: 3857, baseType: !1351, size: 256, align: 32, offset: 512)
!1351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, align: 32, elements: !966)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1337, file: !35, line: 3903, baseType: !1353, size: 256, align: 64, offset: 960)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1324, size: 256, align: 64, elements: !1354)
!1354 = !{!1355}
!1355 = !DISubrange(count: 4)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1337, file: !35, line: 3904, baseType: !1357, size: 128, align: 32, offset: 1216)
!1357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 128, align: 32, elements: !1354)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1337, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1337, file: !35, line: 3908, baseType: !1360, size: 64, align: 64, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1337, file: !35, line: 3915, baseType: !1360, size: 64, align: 64, offset: 1472)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1337, file: !35, line: 3917, baseType: !898, size: 32, align: 32, offset: 1536)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1327, file: !35, line: 3926, baseType: !1364, size: 64, align: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !907, line: 40, baseType: !1365)
!1365 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1252, file: !35, line: 3564, baseType: !1367, size: 64, align: 64, offset: 1344)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!898, !1199, !1370, !1404, !1484}
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1373)
!1373 = !{!1374, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1400, !1401, !1402, !1403}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1372, file: !35, line: 1451, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1377, line: 94, baseType: !1378)
!1377 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1377, line: 81, size: 192, align: 64, elements: !1379)
!1379 = !{!1380, !1384, !1385}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1378, file: !1377, line: 82, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1377, line: 73, baseType: !1383)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1377, line: 73, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1378, file: !1377, line: 89, baseType: !1324, size: 64, align: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1378, file: !1377, line: 93, baseType: !898, size: 32, align: 32, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1372, file: !35, line: 1461, baseType: !1364, size: 64, align: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1372, file: !35, line: 1467, baseType: !1364, size: 64, align: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1372, file: !35, line: 1468, baseType: !1324, size: 64, align: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1372, file: !35, line: 1469, baseType: !898, size: 32, align: 32, offset: 256)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1372, file: !35, line: 1470, baseType: !898, size: 32, align: 32, offset: 288)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1372, file: !35, line: 1474, baseType: !898, size: 32, align: 32, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1372, file: !35, line: 1479, baseType: !1393, size: 64, align: 64, offset: 384)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1396)
!1396 = !{!1397, !1398, !1399}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1395, file: !35, line: 1412, baseType: !1324, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1395, file: !35, line: 1413, baseType: !898, size: 32, align: 32, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1395, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1372, file: !35, line: 1480, baseType: !898, size: 32, align: 32, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1372, file: !35, line: 1486, baseType: !1364, size: 64, align: 64, offset: 512)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1372, file: !35, line: 1488, baseType: !1364, size: 64, align: 64, offset: 576)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1372, file: !35, line: 1497, baseType: !1364, size: 64, align: 64, offset: 640)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1438, !1440, !1441, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1472, !1473, !1474, !1475, !1476, !1477, !1480, !1481, !1482, !1483}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1407, file: !758, line: 282, baseType: !1349, size: 512, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1407, file: !758, line: 299, baseType: !1351, size: 256, align: 32, offset: 512)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1407, file: !758, line: 315, baseType: !1412, size: 64, align: 64, offset: 768)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1407, file: !758, line: 326, baseType: !898, size: 32, align: 32, offset: 832)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1407, file: !758, line: 326, baseType: !898, size: 32, align: 32, offset: 864)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1407, file: !758, line: 334, baseType: !898, size: 32, align: 32, offset: 896)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1407, file: !758, line: 341, baseType: !898, size: 32, align: 32, offset: 928)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1407, file: !758, line: 346, baseType: !898, size: 32, align: 32, offset: 960)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1407, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1407, file: !758, line: 356, baseType: !1262, size: 64, align: 32, offset: 1024)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1407, file: !758, line: 361, baseType: !1364, size: 64, align: 64, offset: 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1407, file: !758, line: 369, baseType: !1364, size: 64, align: 64, offset: 1152)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1407, file: !758, line: 377, baseType: !1364, size: 64, align: 64, offset: 1216)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1407, file: !758, line: 382, baseType: !898, size: 32, align: 32, offset: 1280)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1407, file: !758, line: 386, baseType: !898, size: 32, align: 32, offset: 1312)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1407, file: !758, line: 391, baseType: !898, size: 32, align: 32, offset: 1344)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1407, file: !758, line: 396, baseType: !908, size: 64, align: 64, offset: 1408)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1407, file: !758, line: 403, baseType: !1428, size: 512, align: 64, offset: 1472)
!1428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1280, size: 512, align: 64, elements: !966)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1407, file: !758, line: 410, baseType: !898, size: 32, align: 32, offset: 1984)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1407, file: !758, line: 415, baseType: !898, size: 32, align: 32, offset: 2016)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1407, file: !758, line: 420, baseType: !898, size: 32, align: 32, offset: 2048)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1407, file: !758, line: 425, baseType: !898, size: 32, align: 32, offset: 2080)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1407, file: !758, line: 435, baseType: !1364, size: 64, align: 64, offset: 2112)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1407, file: !758, line: 440, baseType: !898, size: 32, align: 32, offset: 2176)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1407, file: !758, line: 445, baseType: !1280, size: 64, align: 64, offset: 2240)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1407, file: !758, line: 459, baseType: !1437, size: 512, align: 64, offset: 2304)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 512, align: 64, elements: !966)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1407, file: !758, line: 473, baseType: !1439, size: 64, align: 64, offset: 2816)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1407, file: !758, line: 477, baseType: !898, size: 32, align: 32, offset: 2880)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1407, file: !758, line: 479, baseType: !1442, size: 64, align: 64, offset: 2944)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1455}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1445, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1445, file: !758, line: 203, baseType: !1324, size: 64, align: 64, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1445, file: !758, line: 204, baseType: !898, size: 32, align: 32, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1445, file: !758, line: 205, baseType: !1451, size: 64, align: 64, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1453, line: 86, baseType: !1454)
!1453 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1453, line: 86, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1445, file: !758, line: 206, baseType: !1375, size: 64, align: 64, offset: 256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1407, file: !758, line: 480, baseType: !898, size: 32, align: 32, offset: 3008)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1407, file: !758, line: 505, baseType: !898, size: 32, align: 32, offset: 3040)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1407, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1407, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1407, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1407, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1407, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1407, file: !758, line: 532, baseType: !1364, size: 64, align: 64, offset: 3264)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1407, file: !758, line: 539, baseType: !1364, size: 64, align: 64, offset: 3328)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1407, file: !758, line: 547, baseType: !1364, size: 64, align: 64, offset: 3392)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1407, file: !758, line: 554, baseType: !1451, size: 64, align: 64, offset: 3456)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1407, file: !758, line: 563, baseType: !898, size: 32, align: 32, offset: 3520)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1407, file: !758, line: 572, baseType: !898, size: 32, align: 32, offset: 3552)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1407, file: !758, line: 581, baseType: !898, size: 32, align: 32, offset: 3584)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1407, file: !758, line: 588, baseType: !1471, size: 64, align: 64, offset: 3648)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1407, file: !758, line: 593, baseType: !898, size: 32, align: 32, offset: 3712)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1407, file: !758, line: 596, baseType: !898, size: 32, align: 32, offset: 3744)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1407, file: !758, line: 599, baseType: !1375, size: 64, align: 64, offset: 3776)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1407, file: !758, line: 605, baseType: !1375, size: 64, align: 64, offset: 3840)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1407, file: !758, line: 616, baseType: !1375, size: 64, align: 64, offset: 3904)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1407, file: !758, line: 626, baseType: !1478, size: 64, align: 64, offset: 3968)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1479, line: 216, baseType: !1281)
!1479 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1407, file: !758, line: 627, baseType: !1478, size: 64, align: 64, offset: 4032)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1407, file: !758, line: 628, baseType: !1478, size: 64, align: 64, offset: 4096)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1407, file: !758, line: 629, baseType: !1478, size: 64, align: 64, offset: 4160)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1407, file: !758, line: 645, baseType: !1375, size: 64, align: 64, offset: 4224)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1252, file: !35, line: 3566, baseType: !1486, size: 64, align: 64, offset: 1408)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!898, !1199, !908, !1484, !1370}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1252, file: !35, line: 3567, baseType: !1297, size: 64, align: 64, offset: 1472)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1252, file: !35, line: 3576, baseType: !1491, size: 64, align: 64, offset: 1536)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!898, !1199, !1404}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1252, file: !35, line: 3577, baseType: !1495, size: 64, align: 64, offset: 1600)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!898, !1199, !1370}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1252, file: !35, line: 3584, baseType: !1499, size: 64, align: 64, offset: 1664)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!898, !1199, !1502}
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1252, file: !35, line: 3589, baseType: !1504, size: 64, align: 64, offset: 1728)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !1199}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1252, file: !35, line: 3594, baseType: !898, size: 32, align: 32, offset: 1792)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1252, file: !35, line: 3600, baseType: !1210, size: 64, align: 64, offset: 1856)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1252, file: !35, line: 3609, baseType: !1510, size: 64, align: 64, offset: 1920)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1513)
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1201, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1201, file: !35, line: 1581, baseType: !899, size: 32, align: 32, offset: 224)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1201, file: !35, line: 1583, baseType: !908, size: 64, align: 64, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1201, file: !35, line: 1591, baseType: !1518, size: 64, align: 64, offset: 320)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1311, line: 129, size: 1664, align: 64, elements: !1520)
!1520 = !{!1521, !1522, !1523, !1524, !1525, !1543, !1544, !1550, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1519, file: !1311, line: 136, baseType: !898, size: 32, align: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1519, file: !1311, line: 151, baseType: !898, size: 32, align: 32, offset: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1519, file: !1311, line: 157, baseType: !898, size: 32, align: 32, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1519, file: !1311, line: 159, baseType: !1502, size: 64, align: 64, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1519, file: !1311, line: 161, baseType: !1526, size: 64, align: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1311, line: 117, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1311, line: 100, size: 832, align: 64, elements: !1529)
!1529 = !{!1530, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1528, file: !1311, line: 105, baseType: !1531, size: 256, align: 64)
!1531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1532, size: 256, align: 64, elements: !1354)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1377, line: 238, baseType: !1534)
!1534 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1377, line: 238, flags: DIFlagFwdDecl)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1528, file: !1311, line: 110, baseType: !898, size: 32, align: 32, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1528, file: !1311, line: 111, baseType: !898, size: 32, align: 32, offset: 288)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1528, file: !1311, line: 111, baseType: !898, size: 32, align: 32, offset: 320)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1528, file: !1311, line: 112, baseType: !1351, size: 256, align: 32, offset: 352)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1528, file: !1311, line: 113, baseType: !1357, size: 128, align: 32, offset: 608)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1528, file: !1311, line: 114, baseType: !898, size: 32, align: 32, offset: 736)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1528, file: !1311, line: 115, baseType: !898, size: 32, align: 32, offset: 768)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1528, file: !1311, line: 116, baseType: !898, size: 32, align: 32, offset: 800)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1519, file: !1311, line: 163, baseType: !908, size: 64, align: 64, offset: 256)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1519, file: !1311, line: 165, baseType: !1545, size: 128, align: 64, offset: 320)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1311, line: 122, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1311, line: 119, size: 128, align: 64, elements: !1547)
!1547 = !{!1548, !1549}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1546, file: !1311, line: 120, baseType: !1370, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1546, file: !1311, line: 121, baseType: !1502, size: 64, align: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1519, file: !1311, line: 166, baseType: !1551, size: 128, align: 64, offset: 448)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1311, line: 127, baseType: !1552)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1311, line: 124, size: 128, align: 64, elements: !1553)
!1553 = !{!1554, !1627}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1552, file: !1311, line: 125, baseType: !1555, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1558)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1559)
!1559 = !{!1560, !1561, !1585, !1589, !1590, !1624, !1625, !1626}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1558, file: !35, line: 5751, baseType: !1204, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1558, file: !35, line: 5756, baseType: !1562, size: 64, align: 64, offset: 64)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1565)
!1565 = !{!1566, !1567, !1570, !1571, !1572, !1576, !1580, !1584}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1564, file: !35, line: 5797, baseType: !1210, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1564, file: !35, line: 5804, baseType: !1568, size: 64, align: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1564, file: !35, line: 5815, baseType: !1204, size: 64, align: 64, offset: 128)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1564, file: !35, line: 5825, baseType: !898, size: 32, align: 32, offset: 192)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1564, file: !35, line: 5826, baseType: !1573, size: 64, align: 64, offset: 256)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!898, !1556}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1564, file: !35, line: 5827, baseType: !1577, size: 64, align: 64, offset: 320)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!898, !1556, !1370}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1564, file: !35, line: 5828, baseType: !1581, size: 64, align: 64, offset: 384)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{null, !1556}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1564, file: !35, line: 5829, baseType: !1581, size: 64, align: 64, offset: 448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1558, file: !35, line: 5762, baseType: !1586, size: 64, align: 64, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1588)
!1588 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1558, file: !35, line: 5768, baseType: !908, size: 64, align: 64, offset: 192)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1558, file: !35, line: 5775, baseType: !1591, size: 64, align: 64, offset: 256)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1593)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1594)
!1594 = !{!1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1593, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1593, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1593, file: !35, line: 3948, baseType: !906, size: 32, align: 32, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1593, file: !35, line: 3958, baseType: !1324, size: 64, align: 64, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1593, file: !35, line: 3962, baseType: !898, size: 32, align: 32, offset: 192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1593, file: !35, line: 3968, baseType: !898, size: 32, align: 32, offset: 224)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1593, file: !35, line: 3973, baseType: !1364, size: 64, align: 64, offset: 256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1593, file: !35, line: 3986, baseType: !898, size: 32, align: 32, offset: 320)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1593, file: !35, line: 3999, baseType: !898, size: 32, align: 32, offset: 352)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1593, file: !35, line: 4004, baseType: !898, size: 32, align: 32, offset: 384)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1593, file: !35, line: 4005, baseType: !898, size: 32, align: 32, offset: 416)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1593, file: !35, line: 4010, baseType: !898, size: 32, align: 32, offset: 448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1593, file: !35, line: 4011, baseType: !898, size: 32, align: 32, offset: 480)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1593, file: !35, line: 4020, baseType: !1262, size: 64, align: 32, offset: 512)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1593, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1593, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1593, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1593, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1593, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1593, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1593, file: !35, line: 4039, baseType: !898, size: 32, align: 32, offset: 768)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1593, file: !35, line: 4046, baseType: !1280, size: 64, align: 64, offset: 832)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1593, file: !35, line: 4050, baseType: !898, size: 32, align: 32, offset: 896)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1593, file: !35, line: 4054, baseType: !898, size: 32, align: 32, offset: 928)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1593, file: !35, line: 4061, baseType: !898, size: 32, align: 32, offset: 960)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1593, file: !35, line: 4065, baseType: !898, size: 32, align: 32, offset: 992)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1593, file: !35, line: 4073, baseType: !898, size: 32, align: 32, offset: 1024)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1593, file: !35, line: 4080, baseType: !898, size: 32, align: 32, offset: 1056)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1593, file: !35, line: 4084, baseType: !898, size: 32, align: 32, offset: 1088)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1558, file: !35, line: 5781, baseType: !1591, size: 64, align: 64, offset: 320)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1558, file: !35, line: 5787, baseType: !1262, size: 64, align: 32, offset: 384)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1558, file: !35, line: 5793, baseType: !1262, size: 64, align: 32, offset: 448)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1552, file: !1311, line: 126, baseType: !898, size: 32, align: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1519, file: !1311, line: 172, baseType: !1370, size: 64, align: 64, offset: 576)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1519, file: !1311, line: 177, baseType: !1324, size: 64, align: 64, offset: 640)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1519, file: !1311, line: 178, baseType: !899, size: 32, align: 32, offset: 704)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1519, file: !1311, line: 180, baseType: !908, size: 64, align: 64, offset: 768)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1519, file: !1311, line: 185, baseType: !898, size: 32, align: 32, offset: 832)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1519, file: !1311, line: 190, baseType: !908, size: 64, align: 64, offset: 896)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1519, file: !1311, line: 195, baseType: !898, size: 32, align: 32, offset: 960)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1519, file: !1311, line: 200, baseType: !1370, size: 64, align: 64, offset: 1024)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1519, file: !1311, line: 201, baseType: !898, size: 32, align: 32, offset: 1088)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1519, file: !1311, line: 202, baseType: !1502, size: 64, align: 64, offset: 1152)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1519, file: !1311, line: 203, baseType: !898, size: 32, align: 32, offset: 1216)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1519, file: !1311, line: 205, baseType: !898, size: 32, align: 32, offset: 1248)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1519, file: !1311, line: 206, baseType: !898, size: 32, align: 32, offset: 1280)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1519, file: !1311, line: 209, baseType: !1478, size: 64, align: 64, offset: 1344)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1519, file: !1311, line: 212, baseType: !1478, size: 64, align: 64, offset: 1408)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1519, file: !1311, line: 213, baseType: !1502, size: 64, align: 64, offset: 1472)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1519, file: !1311, line: 215, baseType: !898, size: 32, align: 32, offset: 1536)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1519, file: !1311, line: 217, baseType: !898, size: 32, align: 32, offset: 1568)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1519, file: !1311, line: 220, baseType: !898, size: 32, align: 32, offset: 1600)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1201, file: !35, line: 1598, baseType: !908, size: 64, align: 64, offset: 384)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1201, file: !35, line: 1606, baseType: !1364, size: 64, align: 64, offset: 448)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1201, file: !35, line: 1614, baseType: !898, size: 32, align: 32, offset: 512)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1201, file: !35, line: 1622, baseType: !898, size: 32, align: 32, offset: 544)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1201, file: !35, line: 1628, baseType: !898, size: 32, align: 32, offset: 576)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1201, file: !35, line: 1636, baseType: !898, size: 32, align: 32, offset: 608)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1201, file: !35, line: 1643, baseType: !898, size: 32, align: 32, offset: 640)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1201, file: !35, line: 1657, baseType: !1324, size: 64, align: 64, offset: 704)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1201, file: !35, line: 1658, baseType: !898, size: 32, align: 32, offset: 768)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1201, file: !35, line: 1679, baseType: !1262, size: 64, align: 32, offset: 800)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1201, file: !35, line: 1688, baseType: !898, size: 32, align: 32, offset: 864)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1201, file: !35, line: 1712, baseType: !898, size: 32, align: 32, offset: 896)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1201, file: !35, line: 1729, baseType: !898, size: 32, align: 32, offset: 928)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1201, file: !35, line: 1729, baseType: !898, size: 32, align: 32, offset: 960)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1201, file: !35, line: 1744, baseType: !898, size: 32, align: 32, offset: 992)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1201, file: !35, line: 1744, baseType: !898, size: 32, align: 32, offset: 1024)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1201, file: !35, line: 1751, baseType: !898, size: 32, align: 32, offset: 1056)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1201, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1201, file: !35, line: 1791, baseType: !1666, size: 64, align: 64, offset: 1152)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{null, !1669, !1404, !1484, !898, !898, !898}
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1201, file: !35, line: 1808, baseType: !1671, size: 64, align: 64, offset: 1216)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!494, !1669, !1269}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1201, file: !35, line: 1816, baseType: !898, size: 32, align: 32, offset: 1280)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1201, file: !35, line: 1825, baseType: !1676, size: 32, align: 32, offset: 1312)
!1676 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1201, file: !35, line: 1830, baseType: !898, size: 32, align: 32, offset: 1344)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1201, file: !35, line: 1838, baseType: !1676, size: 32, align: 32, offset: 1376)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1201, file: !35, line: 1846, baseType: !898, size: 32, align: 32, offset: 1408)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1201, file: !35, line: 1851, baseType: !898, size: 32, align: 32, offset: 1440)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1201, file: !35, line: 1861, baseType: !1676, size: 32, align: 32, offset: 1472)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1201, file: !35, line: 1868, baseType: !1676, size: 32, align: 32, offset: 1504)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1201, file: !35, line: 1875, baseType: !1676, size: 32, align: 32, offset: 1536)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1201, file: !35, line: 1882, baseType: !1676, size: 32, align: 32, offset: 1568)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1201, file: !35, line: 1889, baseType: !1676, size: 32, align: 32, offset: 1600)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1201, file: !35, line: 1896, baseType: !1676, size: 32, align: 32, offset: 1632)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1201, file: !35, line: 1903, baseType: !1676, size: 32, align: 32, offset: 1664)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1201, file: !35, line: 1910, baseType: !898, size: 32, align: 32, offset: 1696)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1201, file: !35, line: 1915, baseType: !898, size: 32, align: 32, offset: 1728)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1201, file: !35, line: 1926, baseType: !1484, size: 64, align: 64, offset: 1792)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1201, file: !35, line: 1935, baseType: !1262, size: 64, align: 32, offset: 1856)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1201, file: !35, line: 1942, baseType: !898, size: 32, align: 32, offset: 1920)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1201, file: !35, line: 1948, baseType: !898, size: 32, align: 32, offset: 1952)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1201, file: !35, line: 1954, baseType: !898, size: 32, align: 32, offset: 1984)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1201, file: !35, line: 1960, baseType: !898, size: 32, align: 32, offset: 2016)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1201, file: !35, line: 1984, baseType: !898, size: 32, align: 32, offset: 2048)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1201, file: !35, line: 1991, baseType: !898, size: 32, align: 32, offset: 2080)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1201, file: !35, line: 1996, baseType: !898, size: 32, align: 32, offset: 2112)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1201, file: !35, line: 2004, baseType: !898, size: 32, align: 32, offset: 2144)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1201, file: !35, line: 2011, baseType: !898, size: 32, align: 32, offset: 2176)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1201, file: !35, line: 2018, baseType: !898, size: 32, align: 32, offset: 2208)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1201, file: !35, line: 2027, baseType: !898, size: 32, align: 32, offset: 2240)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1201, file: !35, line: 2034, baseType: !898, size: 32, align: 32, offset: 2272)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1201, file: !35, line: 2044, baseType: !898, size: 32, align: 32, offset: 2304)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1201, file: !35, line: 2054, baseType: !1706, size: 64, align: 64, offset: 2368)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1201, file: !35, line: 2061, baseType: !1706, size: 64, align: 64, offset: 2432)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1201, file: !35, line: 2066, baseType: !898, size: 32, align: 32, offset: 2496)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1201, file: !35, line: 2070, baseType: !898, size: 32, align: 32, offset: 2528)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1201, file: !35, line: 2078, baseType: !898, size: 32, align: 32, offset: 2560)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1201, file: !35, line: 2085, baseType: !898, size: 32, align: 32, offset: 2592)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1201, file: !35, line: 2092, baseType: !898, size: 32, align: 32, offset: 2624)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1201, file: !35, line: 2099, baseType: !898, size: 32, align: 32, offset: 2656)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1201, file: !35, line: 2106, baseType: !898, size: 32, align: 32, offset: 2688)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1201, file: !35, line: 2113, baseType: !898, size: 32, align: 32, offset: 2720)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1201, file: !35, line: 2120, baseType: !898, size: 32, align: 32, offset: 2752)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1201, file: !35, line: 2125, baseType: !898, size: 32, align: 32, offset: 2784)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1201, file: !35, line: 2133, baseType: !898, size: 32, align: 32, offset: 2816)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1201, file: !35, line: 2140, baseType: !898, size: 32, align: 32, offset: 2848)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1201, file: !35, line: 2145, baseType: !898, size: 32, align: 32, offset: 2880)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1201, file: !35, line: 2153, baseType: !898, size: 32, align: 32, offset: 2912)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1201, file: !35, line: 2158, baseType: !898, size: 32, align: 32, offset: 2944)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1201, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1201, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1201, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1201, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1201, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1201, file: !35, line: 2203, baseType: !898, size: 32, align: 32, offset: 3136)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1201, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1201, file: !35, line: 2212, baseType: !898, size: 32, align: 32, offset: 3200)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1201, file: !35, line: 2213, baseType: !898, size: 32, align: 32, offset: 3232)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1201, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1201, file: !35, line: 2232, baseType: !898, size: 32, align: 32, offset: 3296)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1201, file: !35, line: 2243, baseType: !898, size: 32, align: 32, offset: 3328)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1201, file: !35, line: 2249, baseType: !898, size: 32, align: 32, offset: 3360)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1201, file: !35, line: 2256, baseType: !898, size: 32, align: 32, offset: 3392)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1201, file: !35, line: 2263, baseType: !1280, size: 64, align: 64, offset: 3456)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1201, file: !35, line: 2270, baseType: !1280, size: 64, align: 64, offset: 3520)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1201, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1201, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1201, file: !35, line: 2367, baseType: !1742, size: 64, align: 64, offset: 3648)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1743 = !DISubroutineType(types: !1744)
!1744 = !{!898, !1669, !1502, !898}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1201, file: !35, line: 2383, baseType: !898, size: 32, align: 32, offset: 3712)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1201, file: !35, line: 2386, baseType: !1676, size: 32, align: 32, offset: 3744)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1201, file: !35, line: 2387, baseType: !1676, size: 32, align: 32, offset: 3776)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1201, file: !35, line: 2394, baseType: !898, size: 32, align: 32, offset: 3808)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1201, file: !35, line: 2401, baseType: !898, size: 32, align: 32, offset: 3840)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1201, file: !35, line: 2408, baseType: !898, size: 32, align: 32, offset: 3872)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1201, file: !35, line: 2415, baseType: !898, size: 32, align: 32, offset: 3904)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1201, file: !35, line: 2422, baseType: !898, size: 32, align: 32, offset: 3936)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1201, file: !35, line: 2423, baseType: !1754, size: 64, align: 64, offset: 3968)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1755, size: 64, align: 64)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1756)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1757)
!1757 = !{!1758, !1759, !1760, !1761}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1756, file: !35, line: 827, baseType: !898, size: 32, align: 32)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1756, file: !35, line: 828, baseType: !898, size: 32, align: 32, offset: 32)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1756, file: !35, line: 829, baseType: !898, size: 32, align: 32, offset: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1756, file: !35, line: 830, baseType: !1676, size: 32, align: 32, offset: 96)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1201, file: !35, line: 2430, baseType: !1364, size: 64, align: 64, offset: 4032)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1201, file: !35, line: 2437, baseType: !1364, size: 64, align: 64, offset: 4096)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1201, file: !35, line: 2444, baseType: !1676, size: 32, align: 32, offset: 4160)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1201, file: !35, line: 2451, baseType: !1676, size: 32, align: 32, offset: 4192)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1201, file: !35, line: 2458, baseType: !898, size: 32, align: 32, offset: 4224)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1201, file: !35, line: 2469, baseType: !898, size: 32, align: 32, offset: 4256)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1201, file: !35, line: 2475, baseType: !898, size: 32, align: 32, offset: 4288)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1201, file: !35, line: 2481, baseType: !898, size: 32, align: 32, offset: 4320)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1201, file: !35, line: 2485, baseType: !898, size: 32, align: 32, offset: 4352)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1201, file: !35, line: 2489, baseType: !898, size: 32, align: 32, offset: 4384)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1201, file: !35, line: 2493, baseType: !898, size: 32, align: 32, offset: 4416)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1201, file: !35, line: 2501, baseType: !898, size: 32, align: 32, offset: 4448)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1201, file: !35, line: 2506, baseType: !898, size: 32, align: 32, offset: 4480)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1201, file: !35, line: 2510, baseType: !898, size: 32, align: 32, offset: 4512)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1201, file: !35, line: 2514, baseType: !1364, size: 64, align: 64, offset: 4544)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1201, file: !35, line: 2528, baseType: !1778, size: 64, align: 64, offset: 4608)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64, align: 64)
!1779 = !DISubroutineType(types: !1780)
!1780 = !{null, !1669, !908, !898, !898}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1201, file: !35, line: 2534, baseType: !898, size: 32, align: 32, offset: 4672)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1201, file: !35, line: 2545, baseType: !898, size: 32, align: 32, offset: 4704)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1201, file: !35, line: 2547, baseType: !898, size: 32, align: 32, offset: 4736)
