; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--atrac3plus.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--atrac3plus.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.Atrac3pSpecCodeTab = type { i8, i8, i8, i8, i32, i8*, i8* }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.Atrac3pChanUnitCtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [16 x i8], [16 x i8], [2 x %struct.Atrac3pChanParams], [2 x %struct.Atrac3pWaveSynthParams], %struct.Atrac3pWaveSynthParams*, %struct.Atrac3pWaveSynthParams*, [24 x i8], [2 x %struct.Atrac3pIPQFChannelCtx], [2 x [2048 x float]] }
%struct.Atrac3pChanParams = type { i32, i32, i32, i32, i32, [32 x i32], [32 x i32], [32 x i32], [2048 x i16], [5 x i8], [2 x [16 x i8]], i8*, i8*, [2 x [16 x %struct.AtracGainInfo]], %struct.AtracGainInfo*, %struct.AtracGainInfo*, i32, [2 x [16 x %struct.Atrac3pWavesData]], %struct.Atrac3pWavesData*, %struct.Atrac3pWavesData* }
%struct.AtracGainInfo = type { i32, [7 x i32], [7 x i32] }
%struct.Atrac3pWavesData = type { %struct.Atrac3pWaveEnvelope, %struct.Atrac3pWaveEnvelope, i32, i32 }
%struct.Atrac3pWaveEnvelope = type { i32, i32, i32, i32 }

!913 = distinct !DIGlobalVariable(name: "wl_bits", scope: !903, file: !904, line: 86, type: !914, isLocal: true, isDefinition: true, variable: [4 x i8*]* @ff_atrac3p_init_vlcs.wl_bits)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 256, align: 64, elements: !910)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!918 = distinct !DIGlobalVariable(name: "wl_codes", scope: !903, file: !904, line: 90, type: !914, isLocal: true, isDefinition: true, variable: [4 x i8*]* @ff_atrac3p_init_vlcs.wl_codes)
!919 = distinct !DIGlobalVariable(name: "wl_xlats", scope: !903, file: !904, line: 94, type: !914, isLocal: true, isDefinition: true, variable: [4 x i8*]* @ff_atrac3p_init_vlcs.wl_xlats)
!920 = distinct !DIGlobalVariable(name: "ct_nb_bits", scope: !903, file: !904, line: 98, type: !908, isLocal: true, isDefinition: true, variable: [4 x i32]* @ff_atrac3p_init_vlcs.ct_nb_bits)
!921 = distinct !DIGlobalVariable(name: "ct_nb_codes", scope: !903, file: !904, line: 99, type: !908, isLocal: true, isDefinition: true, variable: [4 x i32]* @ff_atrac3p_init_vlcs.ct_nb_codes)
!922 = distinct !DIGlobalVariable(name: "ct_bits", scope: !903, file: !904, line: 100, type: !914, isLocal: true, isDefinition: true, variable: [4 x i8*]* @ff_atrac3p_init_vlcs.ct_bits)
!923 = distinct !DIGlobalVariable(name: "ct_codes", scope: !903, file: !904, line: 104, type: !914, isLocal: true, isDefinition: true, variable: [4 x i8*]* @ff_atrac3p_init_vlcs.ct_codes)
!924 = distinct !DIGlobalVariable(name: "ct_xlats", scope: !903, file: !904, line: 108, type: !914, isLocal: true, isDefinition: true, variable: [4 x i8*]* @ff_atrac3p_init_vlcs.ct_xlats)
!925 = distinct !DIGlobalVariable(name: "sf_nb_bits", scope: !903, file: !904, line: 112, type: !926, isLocal: true, isDefinition: true, variable: [8 x i32]* @ff_atrac3p_init_vlcs.sf_nb_bits)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 256, align: 32, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 8)
!929 = distinct !DIGlobalVariable(name: "sf_nb_codes", scope: !903, file: !904, line: 113, type: !926, isLocal: true, isDefinition: true, variable: [8 x i32]* @ff_atrac3p_init_vlcs.sf_nb_codes)
!930 = distinct !DIGlobalVariable(name: "sf_bits", scope: !903, file: !904, line: 114, type: !931, isLocal: true, isDefinition: true, variable: [8 x i8*]* @ff_atrac3p_init_vlcs.sf_bits)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 512, align: 64, elements: !927)
!932 = distinct !DIGlobalVariable(name: "sf_codes", scope: !903, file: !904, line: 119, type: !933, isLocal: true, isDefinition: true, variable: [8 x i16*]* @ff_atrac3p_init_vlcs.sf_codes)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 512, align: 64, elements: !927)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !898, line: 49, baseType: !938)
!938 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!939 = distinct !DIGlobalVariable(name: "sf_xlats", scope: !903, file: !904, line: 124, type: !931, isLocal: true, isDefinition: true, variable: [8 x i8*]* @ff_atrac3p_init_vlcs.sf_xlats)
!940 = distinct !DIGlobalVariable(name: "gain_cbs", scope: !903, file: !904, line: 129, type: !941, isLocal: true, isDefinition: true, variable: [11 x i8*]* @ff_atrac3p_init_vlcs.gain_cbs)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 704, align: 64, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 11)
!944 = distinct !DIGlobalVariable(name: "gain_xlats", scope: !903, file: !904, line: 137, type: !941, isLocal: true, isDefinition: true, variable: [11 x i8*]* @ff_atrac3p_init_vlcs.gain_xlats)
!945 = distinct !DIGlobalVariable(name: "tone_cbs", scope: !903, file: !904, line: 145, type: !946, isLocal: true, isDefinition: true, variable: [7 x i8*]* @ff_atrac3p_init_vlcs.tone_cbs)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 448, align: 64, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 7)
!949 = distinct !DIGlobalVariable(name: "tone_xlats", scope: !903, file: !904, line: 151, type: !946, isLocal: true, isDefinition: true, variable: [7 x i8*]* @ff_atrac3p_init_vlcs.tone_xlats)
!950 = distinct !DIGlobalVariable(name: "tables_data", scope: !0, file: !904, line: 34, type: !951, isLocal: true, isDefinition: true, variable: [154276 x [2 x i16]]* @tables_data)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 4936832, align: 16, elements: !955)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !953, line: 195, baseType: !954)
!953 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!954 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!955 = !{!956, !957}
!956 = !DISubrange(count: 154276)
!957 = !DISubrange(count: 2)
!958 = distinct !DIGlobalVariable(name: "wl_vlc_tabs", scope: !0, file: !904, line: 35, type: !959, isLocal: true, isDefinition: true, variable: [4 x %struct.VLC]* @wl_vlc_tabs)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 768, align: 64, elements: !910)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !961, line: 30, baseType: !962)
!961 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !961, line: 26, size: 192, align: 64, elements: !963)
!963 = !{!964, !965, !969, !970}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !962, file: !961, line: 27, baseType: !888, size: 32, align: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !962, file: !961, line: 28, baseType: !966, size: 64, align: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 32, align: 16, elements: !968)
!968 = !{!957}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !962, file: !961, line: 29, baseType: !888, size: 32, align: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !962, file: !961, line: 29, baseType: !888, size: 32, align: 32, offset: 160)
!971 = distinct !DIGlobalVariable(name: "sf_vlc_tabs", scope: !0, file: !904, line: 36, type: !972, isLocal: true, isDefinition: true, variable: [8 x %struct.VLC]* @sf_vlc_tabs)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 1536, align: 64, elements: !927)
!973 = distinct !DIGlobalVariable(name: "ct_vlc_tabs", scope: !0, file: !904, line: 37, type: !959, isLocal: true, isDefinition: true, variable: [4 x %struct.VLC]* @ct_vlc_tabs)
!974 = distinct !DIGlobalVariable(name: "spec_vlc_tabs", scope: !0, file: !904, line: 38, type: !975, isLocal: true, isDefinition: true, variable: [112 x %struct.VLC]* @spec_vlc_tabs)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 21504, align: 64, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 112)
!978 = distinct !DIGlobalVariable(name: "gain_vlc_tabs", scope: !0, file: !904, line: 39, type: !979, isLocal: true, isDefinition: true, variable: [11 x %struct.VLC]* @gain_vlc_tabs)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 2112, align: 64, elements: !942)
!980 = distinct !DIGlobalVariable(name: "tone_vlc_tabs", scope: !0, file: !904, line: 40, type: !981, isLocal: true, isDefinition: true, variable: [7 x %struct.VLC]* @tone_vlc_tabs)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 1344, align: 64, elements: !947)
!982 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_bits1", scope: !0, file: !983, line: 32, type: !984, isLocal: true, isDefinition: true, variable: [3 x i8]* @atrac3p_wl_huff_bits1)
!983 = !DIFile(filename: "libavcodec/atrac3plus_data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 24, align: 8, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 3)
!987 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_bits2", scope: !0, file: !983, line: 38, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @atrac3p_wl_huff_bits2)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 40, align: 8, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 5)
!991 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_bits3", scope: !0, file: !983, line: 46, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_wl_huff_bits3)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 64, align: 8, elements: !927)
!993 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_bits4", scope: !0, file: !983, line: 52, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_wl_huff_bits4)
!994 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_code1", scope: !0, file: !983, line: 30, type: !984, isLocal: true, isDefinition: true, variable: [3 x i8]* @atrac3p_wl_huff_code1)
!995 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_code2", scope: !0, file: !983, line: 36, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @atrac3p_wl_huff_code2)
!996 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_code3", scope: !0, file: !983, line: 42, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_wl_huff_code3)
!997 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_code4", scope: !0, file: !983, line: 48, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_wl_huff_code4)
!998 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_xlat1", scope: !0, file: !983, line: 34, type: !984, isLocal: true, isDefinition: true, variable: [3 x i8]* @atrac3p_wl_huff_xlat1)
!999 = distinct !DIGlobalVariable(name: "atrac3p_wl_huff_xlat2", scope: !0, file: !983, line: 40, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @atrac3p_wl_huff_xlat2)
!1000 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_bits1", scope: !0, file: !983, line: 159, type: !1001, isLocal: true, isDefinition: true, variable: [4 x i8]* @atrac3p_ct_huff_bits1)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 32, align: 8, elements: !910)
!1002 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_bits2", scope: !0, file: !983, line: 163, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_ct_huff_bits2)
!1003 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_bits3", scope: !0, file: !983, line: 171, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_ct_huff_bits3)
!1004 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_code1", scope: !0, file: !983, line: 157, type: !1001, isLocal: true, isDefinition: true, variable: [4 x i8]* @atrac3p_ct_huff_code1)
!1005 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_code2", scope: !0, file: !983, line: 161, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_ct_huff_code2)
!1006 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_code3", scope: !0, file: !983, line: 167, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_ct_huff_code3)
!1007 = distinct !DIGlobalVariable(name: "atrac3p_ct_huff_xlat1", scope: !0, file: !983, line: 165, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_ct_huff_xlat1)
!1008 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_bits1", scope: !0, file: !983, line: 66, type: !1009, isLocal: true, isDefinition: true, variable: [64 x i8]* @atrac3p_sf_huff_bits1)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 512, align: 8, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 64)
!1012 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_bits2", scope: !0, file: !983, line: 98, type: !1009, isLocal: true, isDefinition: true, variable: [64 x i8]* @atrac3p_sf_huff_bits2)
!1013 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_bits3", scope: !0, file: !983, line: 116, type: !1009, isLocal: true, isDefinition: true, variable: [64 x i8]* @atrac3p_sf_huff_bits3)
!1014 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_bits4", scope: !0, file: !983, line: 127, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_sf_huff_bits4)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 8, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 16)
!1018 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_bits5", scope: !0, file: !983, line: 144, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_sf_huff_bits5)
!1019 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_bits6", scope: !0, file: !983, line: 152, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_sf_huff_bits6)
!1020 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_code1", scope: !0, file: !983, line: 55, type: !1021, isLocal: true, isDefinition: true, variable: [64 x i16]* @atrac3p_sf_huff_code1)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 1024, align: 16, elements: !1010)
!1022 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_code2", scope: !0, file: !983, line: 87, type: !1021, isLocal: true, isDefinition: true, variable: [64 x i16]* @atrac3p_sf_huff_code2)
!1023 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_code3", scope: !0, file: !983, line: 105, type: !1021, isLocal: true, isDefinition: true, variable: [64 x i16]* @atrac3p_sf_huff_code3)
!1024 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_code4", scope: !0, file: !983, line: 123, type: !1025, isLocal: true, isDefinition: true, variable: [16 x i16]* @atrac3p_sf_huff_code4)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 16, elements: !1016)
!1026 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_code5", scope: !0, file: !983, line: 139, type: !1025, isLocal: true, isDefinition: true, variable: [16 x i16]* @atrac3p_sf_huff_code5)
!1027 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_code6", scope: !0, file: !983, line: 148, type: !1025, isLocal: true, isDefinition: true, variable: [16 x i16]* @atrac3p_sf_huff_code6)
!1028 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_xlat1", scope: !0, file: !983, line: 73, type: !1009, isLocal: true, isDefinition: true, variable: [64 x i8]* @atrac3p_sf_huff_xlat1)
!1029 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_xlat2", scope: !0, file: !983, line: 80, type: !1009, isLocal: true, isDefinition: true, variable: [64 x i8]* @atrac3p_sf_huff_xlat2)
!1030 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_xlat4", scope: !0, file: !983, line: 131, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_sf_huff_xlat4)
!1031 = distinct !DIGlobalVariable(name: "atrac3p_sf_huff_xlat5", scope: !0, file: !983, line: 135, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_sf_huff_xlat5)
!1032 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_npoints1_cb", scope: !0, file: !983, line: 1801, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @atrac3p_huff_gain_npoints1_cb)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 72, align: 8, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 9)
!1036 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev1_cb", scope: !0, file: !983, line: 1809, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @atrac3p_huff_gain_lev1_cb)
!1037 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev2_cb", scope: !0, file: !983, line: 1814, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @atrac3p_huff_gain_lev2_cb)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 88, align: 8, elements: !942)
!1039 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev3_cb", scope: !0, file: !983, line: 1822, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @atrac3p_huff_gain_lev3_cb)
!1040 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev4_cb", scope: !0, file: !983, line: 1830, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @atrac3p_huff_gain_lev4_cb)
!1041 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc3_cb", scope: !0, file: !983, line: 1850, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @atrac3p_huff_gain_loc3_cb)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 56, align: 8, elements: !947)
!1043 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc1_cb", scope: !0, file: !983, line: 1838, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @atrac3p_huff_gain_loc1_cb)
!1044 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc4_cb", scope: !0, file: !983, line: 1856, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @atrac3p_huff_gain_loc4_cb)
!1045 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc2_cb", scope: !0, file: !983, line: 1844, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_huff_gain_loc2_cb)
!1046 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc5_cb", scope: !0, file: !983, line: 1862, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @atrac3p_huff_gain_loc5_cb)
!1047 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_npoints2_xlat", scope: !0, file: !983, line: 1805, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_huff_gain_npoints2_xlat)
!1048 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev1_xlat", scope: !0, file: !983, line: 1810, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_huff_gain_lev1_xlat)
!1049 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev2_xlat", scope: !0, file: !983, line: 1818, type: !1050, isLocal: true, isDefinition: true, variable: [15 x i8]* @atrac3p_huff_gain_lev2_xlat)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 120, align: 8, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 15)
!1053 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev3_xlat", scope: !0, file: !983, line: 1826, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_huff_gain_lev3_xlat)
!1054 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_lev4_xlat", scope: !0, file: !983, line: 1834, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @atrac3p_huff_gain_lev4_xlat)
!1055 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc3_xlat", scope: !0, file: !983, line: 1851, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_huff_gain_loc3_xlat)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 8, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 32)
!1059 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc1_xlat", scope: !0, file: !983, line: 1839, type: !1060, isLocal: true, isDefinition: true, variable: [31 x i8]* @atrac3p_huff_gain_loc1_xlat)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 248, align: 8, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 31)
!1063 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc4_xlat", scope: !0, file: !983, line: 1857, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_huff_gain_loc4_xlat)
!1064 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc2_xlat", scope: !0, file: !983, line: 1845, type: !1060, isLocal: true, isDefinition: true, variable: [31 x i8]* @atrac3p_huff_gain_loc2_xlat)
!1065 = distinct !DIGlobalVariable(name: "atrac3p_huff_gain_loc5_xlat", scope: !0, file: !983, line: 1863, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_huff_gain_loc5_xlat)
!1066 = distinct !DIGlobalVariable(name: "atrac3p_huff_tonebands_cb", scope: !0, file: !983, line: 1869, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_huff_tonebands_cb)
!1067 = distinct !DIGlobalVariable(name: "atrac3p_huff_numwavs1_cb", scope: !0, file: !983, line: 1870, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @atrac3p_huff_numwavs1_cb)
!1068 = distinct !DIGlobalVariable(name: "atrac3p_huff_numwavs2_cb", scope: !0, file: !983, line: 1871, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_huff_numwavs2_cb)
!1069 = distinct !DIGlobalVariable(name: "atrac3p_huff_wav_ampsf1_cb", scope: !0, file: !983, line: 1873, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @atrac3p_huff_wav_ampsf1_cb)
!1070 = distinct !DIGlobalVariable(name: "atrac3p_huff_wav_ampsf2_cb", scope: !0, file: !983, line: 1879, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @atrac3p_huff_wav_ampsf2_cb)
!1071 = distinct !DIGlobalVariable(name: "atrac3p_huff_wav_ampsf3_cb", scope: !0, file: !983, line: 1885, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @atrac3p_huff_wav_ampsf3_cb)
!1072 = distinct !DIGlobalVariable(name: "atrac3p_huff_freq_cb", scope: !0, file: !983, line: 1891, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @atrac3p_huff_freq_cb)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 104, align: 8, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 13)
!1076 = distinct !DIGlobalVariable(name: "atrac3p_huff_numwavs2_xlat", scope: !0, file: !983, line: 1872, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @atrac3p_huff_numwavs2_xlat)
!1077 = distinct !DIGlobalVariable(name: "atrac3p_huff_wav_ampsf1_xlat", scope: !0, file: !983, line: 1874, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_huff_wav_ampsf1_xlat)
!1078 = distinct !DIGlobalVariable(name: "atrac3p_huff_wav_ampsf2_xlat", scope: !0, file: !983, line: 1880, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_huff_wav_ampsf2_xlat)
!1079 = distinct !DIGlobalVariable(name: "atrac3p_huff_wav_ampsf3_xlat", scope: !0, file: !983, line: 1886, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_huff_wav_ampsf3_xlat)
!1080 = distinct !DIGlobalVariable(name: "atrac3p_huff_freq_xlat", scope: !0, file: !983, line: 1895, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @atrac3p_huff_freq_xlat)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 2048, align: 8, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 256)
!1084 = distinct !DIGlobalVariable(name: "atrac3p_spectra_tabs", scope: !0, file: !983, line: 1652, type: !1085, isLocal: true, isDefinition: true, variable: [112 x %struct.Atrac3pSpecCodeTab]* @atrac3p_spectra_tabs)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 21504, align: 64, elements: !976)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pSpecCodeTab", file: !983, line: 1650, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pSpecCodeTab", file: !983, line: 1641, size: 192, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "group_size", scope: !1088, file: !983, line: 1642, baseType: !899, size: 8, align: 8)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "num_coeffs", scope: !1088, file: !983, line: 1643, baseType: !899, size: 8, align: 8, offset: 8)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1088, file: !983, line: 1644, baseType: !899, size: 8, align: 8, offset: 16)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "is_signed", scope: !1088, file: !983, line: 1645, baseType: !899, size: 8, align: 8, offset: 24)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "redirect", scope: !1088, file: !983, line: 1647, baseType: !888, size: 32, align: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1088, file: !983, line: 1648, baseType: !916, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "xlat", scope: !1088, file: !983, line: 1649, baseType: !916, size: 64, align: 64, offset: 128)
!1097 = distinct !DIGlobalVariable(name: "huff_a01_cb", scope: !0, file: !983, line: 440, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_a01_cb)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 112, align: 8, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 14)
!1101 = distinct !DIGlobalVariable(name: "huff_a01_xlat", scope: !0, file: !983, line: 444, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a01_xlat)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 648, align: 8, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 81)
!1105 = distinct !DIGlobalVariable(name: "huff_a02_cb", scope: !0, file: !983, line: 454, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_a02_cb)
!1106 = distinct !DIGlobalVariable(name: "huff_a02_xlat", scope: !0, file: !983, line: 458, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a02_xlat)
!1107 = distinct !DIGlobalVariable(name: "huff_a03_cb", scope: !0, file: !983, line: 468, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a03_cb)
!1108 = distinct !DIGlobalVariable(name: "huff_a03_xlat", scope: !0, file: !983, line: 470, type: !1109, isLocal: true, isDefinition: true, variable: [49 x i8]* @huff_a03_xlat)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 392, align: 8, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 49)
!1112 = distinct !DIGlobalVariable(name: "huff_a04_cb", scope: !0, file: !983, line: 478, type: !1001, isLocal: true, isDefinition: true, variable: [4 x i8]* @huff_a04_cb)
!1113 = distinct !DIGlobalVariable(name: "huff_a04_xlat", scope: !0, file: !983, line: 479, type: !1114, isLocal: true, isDefinition: true, variable: [6 x i8]* @huff_a04_xlat)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 48, align: 8, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 6)
!1117 = distinct !DIGlobalVariable(name: "huff_a05_cb", scope: !0, file: !983, line: 481, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a05_cb)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 96, align: 8, elements: !1119)
!1119 = !{!1120}
!1120 = !DISubrange(count: 12)
!1121 = distinct !DIGlobalVariable(name: "huff_a05_xlat", scope: !0, file: !983, line: 485, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_a05_xlat)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 1800, align: 8, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 225)
!1125 = distinct !DIGlobalVariable(name: "huff_a06_cb", scope: !0, file: !983, line: 507, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a06_cb)
!1126 = distinct !DIGlobalVariable(name: "huff_a06_xlat", scope: !0, file: !983, line: 511, type: !1015, isLocal: true, isDefinition: true, variable: [16 x i8]* @huff_a06_xlat)
!1127 = distinct !DIGlobalVariable(name: "huff_a07_cb", scope: !0, file: !983, line: 515, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_a07_cb)
!1128 = distinct !DIGlobalVariable(name: "huff_a07_xlat", scope: !0, file: !983, line: 519, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a07_xlat)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 504, align: 8, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 63)
!1132 = distinct !DIGlobalVariable(name: "huff_a11_cb", scope: !0, file: !983, line: 526, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_a11_cb)
!1133 = distinct !DIGlobalVariable(name: "huff_a11_xlat", scope: !0, file: !983, line: 530, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a11_xlat)
!1134 = distinct !DIGlobalVariable(name: "huff_a12_cb", scope: !0, file: !983, line: 540, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a12_cb)
!1135 = distinct !DIGlobalVariable(name: "huff_a12_xlat", scope: !0, file: !983, line: 542, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a12_xlat)
!1136 = distinct !DIGlobalVariable(name: "huff_a13_cb", scope: !0, file: !983, line: 552, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a13_cb)
!1137 = distinct !DIGlobalVariable(name: "huff_a13_xlat", scope: !0, file: !983, line: 556, type: !1109, isLocal: true, isDefinition: true, variable: [49 x i8]* @huff_a13_xlat)
!1138 = distinct !DIGlobalVariable(name: "huff_a14_cb", scope: !0, file: !983, line: 564, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a14_cb)
!1139 = distinct !DIGlobalVariable(name: "huff_a14_xlat", scope: !0, file: !983, line: 568, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_a14_xlat)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 968, align: 8, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 121)
!1143 = distinct !DIGlobalVariable(name: "huff_a15_cb", scope: !0, file: !983, line: 582, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a15_cb)
!1144 = distinct !DIGlobalVariable(name: "huff_a15_xlat", scope: !0, file: !983, line: 584, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_a15_xlat)
!1145 = distinct !DIGlobalVariable(name: "huff_a16_cb", scope: !0, file: !983, line: 606, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_a16_cb)
!1146 = distinct !DIGlobalVariable(name: "huff_a16_xlat", scope: !0, file: !983, line: 610, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a16_xlat)
!1147 = distinct !DIGlobalVariable(name: "huff_a17_cb", scope: !0, file: !983, line: 635, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a17_cb)
!1148 = distinct !DIGlobalVariable(name: "huff_a17_xlat", scope: !0, file: !983, line: 637, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a17_xlat)
!1149 = distinct !DIGlobalVariable(name: "huff_a21_cb", scope: !0, file: !983, line: 644, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_a21_cb)
!1150 = distinct !DIGlobalVariable(name: "huff_a21_xlat", scope: !0, file: !983, line: 648, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a21_xlat)
!1151 = distinct !DIGlobalVariable(name: "huff_a22_cb", scope: !0, file: !983, line: 658, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_a22_cb)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 80, align: 8, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 10)
!1155 = distinct !DIGlobalVariable(name: "huff_a22_xlat", scope: !0, file: !983, line: 660, type: !1156, isLocal: true, isDefinition: true, variable: [25 x i8]* @huff_a22_xlat)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 200, align: 8, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 25)
!1159 = distinct !DIGlobalVariable(name: "huff_a23_cb", scope: !0, file: !983, line: 666, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a23_cb)
!1160 = distinct !DIGlobalVariable(name: "huff_a23_xlat", scope: !0, file: !983, line: 668, type: !1109, isLocal: true, isDefinition: true, variable: [49 x i8]* @huff_a23_xlat)
!1161 = distinct !DIGlobalVariable(name: "huff_a24_cb", scope: !0, file: !983, line: 676, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @huff_a24_cb)
!1162 = distinct !DIGlobalVariable(name: "huff_a25_cb", scope: !0, file: !983, line: 678, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @huff_a25_cb)
!1163 = distinct !DIGlobalVariable(name: "huff_a25_xlat", scope: !0, file: !983, line: 680, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a25_xlat)
!1164 = distinct !DIGlobalVariable(name: "huff_a26_cb", scope: !0, file: !983, line: 682, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_a26_cb)
!1165 = distinct !DIGlobalVariable(name: "huff_a26_xlat", scope: !0, file: !983, line: 684, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a26_xlat)
!1166 = distinct !DIGlobalVariable(name: "huff_a27_cb", scope: !0, file: !983, line: 709, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a27_cb)
!1167 = distinct !DIGlobalVariable(name: "huff_a27_xlat", scope: !0, file: !983, line: 711, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a27_xlat)
!1168 = distinct !DIGlobalVariable(name: "huff_a31_cb", scope: !0, file: !983, line: 718, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a31_cb)
!1169 = distinct !DIGlobalVariable(name: "huff_a31_xlat", scope: !0, file: !983, line: 720, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a31_xlat)
!1170 = distinct !DIGlobalVariable(name: "huff_a32_cb", scope: !0, file: !983, line: 724, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_a32_cb)
!1171 = distinct !DIGlobalVariable(name: "huff_a32_xlat", scope: !0, file: !983, line: 728, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a32_xlat)
!1172 = distinct !DIGlobalVariable(name: "huff_a33_cb", scope: !0, file: !983, line: 738, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a33_cb)
!1173 = distinct !DIGlobalVariable(name: "huff_a33_xlat", scope: !0, file: !983, line: 742, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a33_xlat)
!1174 = distinct !DIGlobalVariable(name: "huff_a34_cb", scope: !0, file: !983, line: 767, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a34_cb)
!1175 = distinct !DIGlobalVariable(name: "huff_a34_xlat", scope: !0, file: !983, line: 769, type: !1114, isLocal: true, isDefinition: true, variable: [6 x i8]* @huff_a34_xlat)
!1176 = distinct !DIGlobalVariable(name: "huff_a35_cb", scope: !0, file: !983, line: 771, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_a35_cb)
!1177 = distinct !DIGlobalVariable(name: "huff_a35_xlat", scope: !0, file: !983, line: 773, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_a35_xlat)
!1178 = distinct !DIGlobalVariable(name: "huff_a36_cb", scope: !0, file: !983, line: 795, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a36_cb)
!1179 = distinct !DIGlobalVariable(name: "huff_a36_xlat", scope: !0, file: !983, line: 799, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a36_xlat)
!1180 = distinct !DIGlobalVariable(name: "huff_a37_cb", scope: !0, file: !983, line: 824, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a37_cb)
!1181 = distinct !DIGlobalVariable(name: "huff_a37_xlat", scope: !0, file: !983, line: 826, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a37_xlat)
!1182 = distinct !DIGlobalVariable(name: "huff_a41_cb", scope: !0, file: !983, line: 833, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_a41_cb)
!1183 = distinct !DIGlobalVariable(name: "huff_a41_xlat", scope: !0, file: !983, line: 837, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a41_xlat)
!1184 = distinct !DIGlobalVariable(name: "huff_a42_cb", scope: !0, file: !983, line: 847, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_a42_cb)
!1185 = distinct !DIGlobalVariable(name: "huff_a42_xlat", scope: !0, file: !983, line: 849, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a42_xlat)
!1186 = distinct !DIGlobalVariable(name: "huff_a43_cb", scope: !0, file: !983, line: 859, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @huff_a43_cb)
!1187 = distinct !DIGlobalVariable(name: "huff_a43_xlat", scope: !0, file: !983, line: 861, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a43_xlat)
!1188 = distinct !DIGlobalVariable(name: "huff_a44_cb", scope: !0, file: !983, line: 863, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a44_cb)
!1189 = distinct !DIGlobalVariable(name: "huff_a44_xlat", scope: !0, file: !983, line: 865, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_a44_xlat)
!1190 = distinct !DIGlobalVariable(name: "huff_a45_cb", scope: !0, file: !983, line: 879, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @huff_a45_cb)
!1191 = distinct !DIGlobalVariable(name: "huff_a45_xlat", scope: !0, file: !983, line: 881, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a45_xlat)
!1192 = distinct !DIGlobalVariable(name: "huff_a46_cb", scope: !0, file: !983, line: 883, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a46_cb)
!1193 = distinct !DIGlobalVariable(name: "huff_a46_xlat", scope: !0, file: !983, line: 885, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a46_xlat)
!1194 = distinct !DIGlobalVariable(name: "huff_a47_cb", scope: !0, file: !983, line: 910, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a47_cb)
!1195 = distinct !DIGlobalVariable(name: "huff_a47_xlat", scope: !0, file: !983, line: 912, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a47_xlat)
!1196 = distinct !DIGlobalVariable(name: "huff_a51_cb", scope: !0, file: !983, line: 919, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a51_cb)
!1197 = distinct !DIGlobalVariable(name: "huff_a51_xlat", scope: !0, file: !983, line: 923, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a51_xlat)
!1198 = distinct !DIGlobalVariable(name: "huff_a52_cb", scope: !0, file: !983, line: 933, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a52_cb)
!1199 = distinct !DIGlobalVariable(name: "huff_a52_xlat", scope: !0, file: !983, line: 935, type: !1156, isLocal: true, isDefinition: true, variable: [25 x i8]* @huff_a52_xlat)
!1200 = distinct !DIGlobalVariable(name: "huff_a53_xlat", scope: !0, file: !983, line: 941, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a53_xlat)
!1201 = distinct !DIGlobalVariable(name: "huff_a54_cb", scope: !0, file: !983, line: 943, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a54_cb)
!1202 = distinct !DIGlobalVariable(name: "huff_a54_xlat", scope: !0, file: !983, line: 945, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_a54_xlat)
!1203 = distinct !DIGlobalVariable(name: "huff_a55_cb", scope: !0, file: !983, line: 959, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a55_cb)
!1204 = distinct !DIGlobalVariable(name: "huff_a55_xlat", scope: !0, file: !983, line: 961, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a55_xlat)
!1205 = distinct !DIGlobalVariable(name: "huff_a56_cb", scope: !0, file: !983, line: 963, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a56_cb)
!1206 = distinct !DIGlobalVariable(name: "huff_a56_xlat", scope: !0, file: !983, line: 965, type: !1060, isLocal: true, isDefinition: true, variable: [31 x i8]* @huff_a56_xlat)
!1207 = distinct !DIGlobalVariable(name: "huff_a57_cb", scope: !0, file: !983, line: 970, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_a57_cb)
!1208 = distinct !DIGlobalVariable(name: "huff_a57_xlat", scope: !0, file: !983, line: 972, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a57_xlat)
!1209 = distinct !DIGlobalVariable(name: "huff_a61_cb", scope: !0, file: !983, line: 981, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a61_cb)
!1210 = distinct !DIGlobalVariable(name: "huff_a61_xlat", scope: !0, file: !983, line: 985, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a61_xlat)
!1211 = distinct !DIGlobalVariable(name: "huff_a62_cb", scope: !0, file: !983, line: 995, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a62_cb)
!1212 = distinct !DIGlobalVariable(name: "huff_a62_xlat", scope: !0, file: !983, line: 997, type: !1156, isLocal: true, isDefinition: true, variable: [25 x i8]* @huff_a62_xlat)
!1213 = distinct !DIGlobalVariable(name: "huff_a63_cb", scope: !0, file: !983, line: 1003, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_a63_cb)
!1214 = distinct !DIGlobalVariable(name: "huff_a63_xlat", scope: !0, file: !983, line: 1007, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a63_xlat)
!1215 = distinct !DIGlobalVariable(name: "huff_a64_cb", scope: !0, file: !983, line: 1032, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a64_cb)
!1216 = distinct !DIGlobalVariable(name: "huff_a64_xlat", scope: !0, file: !983, line: 1034, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_a64_xlat)
!1217 = distinct !DIGlobalVariable(name: "huff_a65_cb", scope: !0, file: !983, line: 1048, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_a65_cb)
!1218 = distinct !DIGlobalVariable(name: "huff_a65_xlat", scope: !0, file: !983, line: 1050, type: !1050, isLocal: true, isDefinition: true, variable: [15 x i8]* @huff_a65_xlat)
!1219 = distinct !DIGlobalVariable(name: "huff_a66_cb", scope: !0, file: !983, line: 1054, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_a66_cb)
!1220 = distinct !DIGlobalVariable(name: "huff_a66_xlat", scope: !0, file: !983, line: 1056, type: !1060, isLocal: true, isDefinition: true, variable: [31 x i8]* @huff_a66_xlat)
!1221 = distinct !DIGlobalVariable(name: "huff_a67_cb", scope: !0, file: !983, line: 1061, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_a67_cb)
!1222 = distinct !DIGlobalVariable(name: "huff_a67_xlat", scope: !0, file: !983, line: 1063, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_a67_xlat)
!1223 = distinct !DIGlobalVariable(name: "huff_a71_cb", scope: !0, file: !983, line: 1070, type: !988, isLocal: true, isDefinition: true, variable: [5 x i8]* @huff_a71_cb)
!1224 = distinct !DIGlobalVariable(name: "huff_a72_cb", scope: !0, file: !983, line: 1072, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a72_cb)
!1225 = distinct !DIGlobalVariable(name: "huff_a72_xlat", scope: !0, file: !983, line: 1076, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_a72_xlat)
!1226 = distinct !DIGlobalVariable(name: "huff_a73_cb", scope: !0, file: !983, line: 1086, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_a73_cb)
!1227 = distinct !DIGlobalVariable(name: "huff_a73_xlat", scope: !0, file: !983, line: 1088, type: !1109, isLocal: true, isDefinition: true, variable: [49 x i8]* @huff_a73_xlat)
!1228 = distinct !DIGlobalVariable(name: "huff_a74_cb", scope: !0, file: !983, line: 1096, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_a74_cb)
!1229 = distinct !DIGlobalVariable(name: "huff_a74_xlat", scope: !0, file: !983, line: 1100, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_a74_xlat)
!1230 = distinct !DIGlobalVariable(name: "huff_a75_cb", scope: !0, file: !983, line: 1114, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_a75_cb)
!1231 = distinct !DIGlobalVariable(name: "huff_a75_xlat", scope: !0, file: !983, line: 1116, type: !1050, isLocal: true, isDefinition: true, variable: [15 x i8]* @huff_a75_xlat)
!1232 = distinct !DIGlobalVariable(name: "huff_a76_cb", scope: !0, file: !983, line: 1120, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_a76_cb)
!1233 = distinct !DIGlobalVariable(name: "huff_a76_xlat", scope: !0, file: !983, line: 1124, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_a76_xlat)
!1234 = distinct !DIGlobalVariable(name: "huff_b01_cb", scope: !0, file: !983, line: 1149, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b01_cb)
!1235 = distinct !DIGlobalVariable(name: "huff_b01_xlat", scope: !0, file: !983, line: 1153, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b01_xlat)
!1236 = distinct !DIGlobalVariable(name: "huff_b02_cb", scope: !0, file: !983, line: 1163, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b02_cb)
!1237 = distinct !DIGlobalVariable(name: "huff_b02_xlat", scope: !0, file: !983, line: 1167, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b02_xlat)
!1238 = distinct !DIGlobalVariable(name: "huff_b03_cb", scope: !0, file: !983, line: 1177, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b03_cb)
!1239 = distinct !DIGlobalVariable(name: "huff_b03_xlat", scope: !0, file: !983, line: 1179, type: !1109, isLocal: true, isDefinition: true, variable: [49 x i8]* @huff_b03_xlat)
!1240 = distinct !DIGlobalVariable(name: "huff_b04_cb", scope: !0, file: !983, line: 1187, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_b04_cb)
!1241 = distinct !DIGlobalVariable(name: "huff_b04_xlat", scope: !0, file: !983, line: 1191, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_b04_xlat)
!1242 = distinct !DIGlobalVariable(name: "huff_b05_cb", scope: !0, file: !983, line: 1205, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b05_cb)
!1243 = distinct !DIGlobalVariable(name: "huff_b05_xlat", scope: !0, file: !983, line: 1209, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_b05_xlat)
!1244 = distinct !DIGlobalVariable(name: "huff_b07_cb", scope: !0, file: !983, line: 1231, type: !1033, isLocal: true, isDefinition: true, variable: [9 x i8]* @huff_b07_cb)
!1245 = distinct !DIGlobalVariable(name: "huff_b07_xlat", scope: !0, file: !983, line: 1233, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_b07_xlat)
!1246 = distinct !DIGlobalVariable(name: "huff_b12_cb", scope: !0, file: !983, line: 1240, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_b12_cb)
!1247 = distinct !DIGlobalVariable(name: "huff_b12_xlat", scope: !0, file: !983, line: 1242, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b12_xlat)
!1248 = distinct !DIGlobalVariable(name: "huff_b14_cb", scope: !0, file: !983, line: 1252, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b14_cb)
!1249 = distinct !DIGlobalVariable(name: "huff_b14_xlat", scope: !0, file: !983, line: 1256, type: !1140, isLocal: true, isDefinition: true, variable: [121 x i8]* @huff_b14_xlat)
!1250 = distinct !DIGlobalVariable(name: "huff_b16_cb", scope: !0, file: !983, line: 1270, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b16_cb)
!1251 = distinct !DIGlobalVariable(name: "huff_b16_xlat", scope: !0, file: !983, line: 1274, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_b16_xlat)
!1252 = distinct !DIGlobalVariable(name: "huff_b26_cb", scope: !0, file: !983, line: 1299, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_b26_cb)
!1253 = distinct !DIGlobalVariable(name: "huff_b26_xlat", scope: !0, file: !983, line: 1303, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_b26_xlat)
!1254 = distinct !DIGlobalVariable(name: "huff_b32_cb", scope: !0, file: !983, line: 1328, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_b32_cb)
!1255 = distinct !DIGlobalVariable(name: "huff_b32_xlat", scope: !0, file: !983, line: 1332, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b32_xlat)
!1256 = distinct !DIGlobalVariable(name: "huff_b33_cb", scope: !0, file: !983, line: 1342, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_b33_cb)
!1257 = distinct !DIGlobalVariable(name: "huff_b33_xlat", scope: !0, file: !983, line: 1346, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_b33_xlat)
!1258 = distinct !DIGlobalVariable(name: "huff_b35_cb", scope: !0, file: !983, line: 1371, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b35_cb)
!1259 = distinct !DIGlobalVariable(name: "huff_b35_xlat", scope: !0, file: !983, line: 1375, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_b35_xlat)
!1260 = distinct !DIGlobalVariable(name: "huff_b37_cb", scope: !0, file: !983, line: 1397, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_b37_cb)
!1261 = distinct !DIGlobalVariable(name: "huff_b37_xlat", scope: !0, file: !983, line: 1401, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_b37_xlat)
!1262 = distinct !DIGlobalVariable(name: "huff_b41_cb", scope: !0, file: !983, line: 1408, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b41_cb)
!1263 = distinct !DIGlobalVariable(name: "huff_b41_xlat", scope: !0, file: !983, line: 1412, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b41_xlat)
!1264 = distinct !DIGlobalVariable(name: "huff_b42_cb", scope: !0, file: !983, line: 1422, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b42_cb)
!1265 = distinct !DIGlobalVariable(name: "huff_b42_xlat", scope: !0, file: !983, line: 1424, type: !1156, isLocal: true, isDefinition: true, variable: [25 x i8]* @huff_b42_xlat)
!1266 = distinct !DIGlobalVariable(name: "huff_b43_cb", scope: !0, file: !983, line: 1430, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_b43_cb)
!1267 = distinct !DIGlobalVariable(name: "huff_b43_xlat", scope: !0, file: !983, line: 1432, type: !1109, isLocal: true, isDefinition: true, variable: [49 x i8]* @huff_b43_xlat)
!1268 = distinct !DIGlobalVariable(name: "huff_b47_cb", scope: !0, file: !983, line: 1440, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_b47_cb)
!1269 = distinct !DIGlobalVariable(name: "huff_b47_xlat", scope: !0, file: !983, line: 1442, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_b47_xlat)
!1270 = distinct !DIGlobalVariable(name: "huff_b52_cb", scope: !0, file: !983, line: 1449, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b52_cb)
!1271 = distinct !DIGlobalVariable(name: "huff_b52_xlat", scope: !0, file: !983, line: 1451, type: !1156, isLocal: true, isDefinition: true, variable: [25 x i8]* @huff_b52_xlat)
!1272 = distinct !DIGlobalVariable(name: "huff_b53_cb", scope: !0, file: !983, line: 1457, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_b53_cb)
!1273 = distinct !DIGlobalVariable(name: "huff_b53_xlat", scope: !0, file: !983, line: 1459, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_b53_xlat)
!1274 = distinct !DIGlobalVariable(name: "huff_b56_cb", scope: !0, file: !983, line: 1461, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b56_cb)
!1275 = distinct !DIGlobalVariable(name: "huff_b56_xlat", scope: !0, file: !983, line: 1463, type: !1060, isLocal: true, isDefinition: true, variable: [31 x i8]* @huff_b56_xlat)
!1276 = distinct !DIGlobalVariable(name: "huff_b62_cb", scope: !0, file: !983, line: 1468, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b62_cb)
!1277 = distinct !DIGlobalVariable(name: "huff_b62_xlat", scope: !0, file: !983, line: 1472, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b62_xlat)
!1278 = distinct !DIGlobalVariable(name: "huff_b63_cb", scope: !0, file: !983, line: 1482, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_b63_cb)
!1279 = distinct !DIGlobalVariable(name: "huff_b63_xlat", scope: !0, file: !983, line: 1484, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_b63_xlat)
!1280 = distinct !DIGlobalVariable(name: "huff_b64_cb", scope: !0, file: !983, line: 1486, type: !1042, isLocal: true, isDefinition: true, variable: [7 x i8]* @huff_b64_cb)
!1281 = distinct !DIGlobalVariable(name: "huff_b64_xlat", scope: !0, file: !983, line: 1488, type: !1114, isLocal: true, isDefinition: true, variable: [6 x i8]* @huff_b64_xlat)
!1282 = distinct !DIGlobalVariable(name: "huff_b65_cb", scope: !0, file: !983, line: 1490, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b65_cb)
!1283 = distinct !DIGlobalVariable(name: "huff_b65_xlat", scope: !0, file: !983, line: 1494, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_b65_xlat)
!1284 = distinct !DIGlobalVariable(name: "huff_b66_cb", scope: !0, file: !983, line: 1516, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b66_cb)
!1285 = distinct !DIGlobalVariable(name: "huff_b66_xlat", scope: !0, file: !983, line: 1520, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_b66_xlat)
!1286 = distinct !DIGlobalVariable(name: "huff_b67_cb", scope: !0, file: !983, line: 1545, type: !1152, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_b67_cb)
!1287 = distinct !DIGlobalVariable(name: "huff_b67_xlat", scope: !0, file: !983, line: 1547, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_b67_xlat)
!1288 = distinct !DIGlobalVariable(name: "huff_b71_cb", scope: !0, file: !983, line: 1554, type: !1098, isLocal: true, isDefinition: true, variable: [14 x i8]* @huff_b71_cb)
!1289 = distinct !DIGlobalVariable(name: "huff_b71_xlat", scope: !0, file: !983, line: 1558, type: !1102, isLocal: true, isDefinition: true, variable: [81 x i8]* @huff_b71_xlat)
!1290 = distinct !DIGlobalVariable(name: "huff_b73_cb", scope: !0, file: !983, line: 1568, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_b73_cb)
!1291 = distinct !DIGlobalVariable(name: "huff_b73_xlat", scope: !0, file: !983, line: 1572, type: !1081, isLocal: true, isDefinition: true, variable: [256 x i8]* @huff_b73_xlat)
!1292 = distinct !DIGlobalVariable(name: "huff_b74_cb", scope: !0, file: !983, line: 1597, type: !992, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_b74_cb)
!1293 = distinct !DIGlobalVariable(name: "huff_b74_xlat", scope: !0, file: !983, line: 1599, type: !1038, isLocal: true, isDefinition: true, variable: [11 x i8]* @huff_b74_xlat)
!1294 = distinct !DIGlobalVariable(name: "huff_b75_cb", scope: !0, file: !983, line: 1603, type: !1073, isLocal: true, isDefinition: true, variable: [13 x i8]* @huff_b75_cb)
!1295 = distinct !DIGlobalVariable(name: "huff_b75_xlat", scope: !0, file: !983, line: 1607, type: !1122, isLocal: true, isDefinition: true, variable: [225 x i8]* @huff_b75_xlat)
!1296 = distinct !DIGlobalVariable(name: "huff_b77_cb", scope: !0, file: !983, line: 1629, type: !1118, isLocal: true, isDefinition: true, variable: [12 x i8]* @huff_b77_cb)
!1297 = distinct !DIGlobalVariable(name: "huff_b77_xlat", scope: !0, file: !983, line: 1633, type: !1129, isLocal: true, isDefinition: true, variable: [63 x i8]* @huff_b77_xlat)
!1298 = distinct !DIGlobalVariable(name: "atrac3p_qu_num_to_seg", scope: !0, file: !983, line: 201, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_qu_num_to_seg)
!1299 = distinct !DIGlobalVariable(name: "atrac3p_wl_shapes", scope: !0, file: !983, line: 221, type: !1300, isLocal: true, isDefinition: true, variable: [8 x [16 x [9 x i8]]]* @atrac3p_wl_shapes)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 9216, align: 8, elements: !1304)
!1301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !953, line: 194, baseType: !1303)
!1303 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1304 = !{!928, !1017, !1035}
!1305 = distinct !DIGlobalVariable(name: "atrac3p_wl_weights", scope: !0, file: !983, line: 174, type: !1306, isLocal: true, isDefinition: true, variable: [6 x [32 x i8]]* @atrac3p_wl_weights)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 1536, align: 8, elements: !1307)
!1307 = !{!1116, !1058}
!1308 = distinct !DIGlobalVariable(name: "atrac3p_qu_to_subband", scope: !0, file: !983, line: 207, type: !1056, isLocal: true, isDefinition: true, variable: [32 x i8]* @atrac3p_qu_to_subband)
!1309 = distinct !DIGlobalVariable(name: "atrac3p_sf_shapes", scope: !0, file: !983, line: 355, type: !1310, isLocal: true, isDefinition: true, variable: [64 x [9 x i8]]* @atrac3p_sf_shapes)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 4608, align: 8, elements: !1311)
!1311 = !{!1011, !1035}
!1312 = distinct !DIGlobalVariable(name: "atrac3p_sf_weights", scope: !0, file: !983, line: 192, type: !1313, isLocal: true, isDefinition: true, variable: [2 x [32 x i8]]* @atrac3p_sf_weights)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 512, align: 8, elements: !1314)
!1314 = !{!957, !1058}
!1315 = distinct !DIGlobalVariable(name: "atrac3p_ct_restricted_to_full", scope: !0, file: !983, line: 422, type: !1316, isLocal: true, isDefinition: true, variable: [2 x [7 x [4 x i8]]]* @atrac3p_ct_restricted_to_full)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 448, align: 8, elements: !1317)
!1317 = !{!957, !948, !911}
!1318 = distinct !DIGlobalVariable(name: "atrac3p_subband_to_num_powgrps", scope: !0, file: !983, line: 213, type: !1319, isLocal: true, isDefinition: true, variable: [16 x i32]* @atrac3p_subband_to_num_powgrps)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 512, align: 32, elements: !1016)
!1320 = !{i32 2, !"Dwarf Version", i32 4}
!1321 = !{i32 2, !"Debug Info Version", i32 3}
!1322 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1323 = !DILocalVariable(name: "i", scope: !903, file: !904, line: 82, type: !888)
!1324 = !DIExpression()
!1325 = !DILocation(line: 82, column: 9, scope: !903)
!1326 = !DILocalVariable(name: "wl_vlc_offs", scope: !903, file: !904, line: 82, type: !888)
!1327 = !DILocation(line: 82, column: 12, scope: !903)
!1328 = !DILocalVariable(name: "ct_vlc_offs", scope: !903, file: !904, line: 82, type: !888)
!1329 = !DILocation(line: 82, column: 25, scope: !903)
!1330 = !DILocalVariable(name: "sf_vlc_offs", scope: !903, file: !904, line: 82, type: !888)
!1331 = !DILocation(line: 82, column: 38, scope: !903)
!1332 = !DILocalVariable(name: "tab_offset", scope: !903, file: !904, line: 82, type: !888)
!1333 = !DILocation(line: 82, column: 51, scope: !903)
!1334 = !DILocation(line: 157, column: 12, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !903, file: !904, line: 157, column: 5)
!1336 = !DILocation(line: 157, column: 29, scope: !1335)
!1337 = !DILocation(line: 157, column: 46, scope: !1335)
!1338 = !DILocation(line: 157, column: 10, scope: !1335)
!1339 = !DILocation(line: 157, column: 54, scope: !1340)
!1340 = !DILexicalBlockFile(scope: !1341, file: !904, discriminator: 1)
!1341 = distinct !DILexicalBlock(scope: !1335, file: !904, line: 157, column: 5)
!1342 = !DILocation(line: 157, column: 56, scope: !1340)
!1343 = !DILocation(line: 157, column: 5, scope: !1340)
!1344 = !DILocation(line: 158, column: 45, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1341, file: !904, line: 157, column: 66)
!1346 = !DILocation(line: 158, column: 33, scope: !1345)
!1347 = !DILocation(line: 158, column: 21, scope: !1345)
!1348 = !DILocation(line: 158, column: 9, scope: !1345)
!1349 = !DILocation(line: 158, column: 24, scope: !1345)
!1350 = !DILocation(line: 158, column: 30, scope: !1345)
!1351 = !DILocation(line: 159, column: 58, scope: !1345)
!1352 = !DILocation(line: 159, column: 47, scope: !1345)
!1353 = !DILocation(line: 159, column: 44, scope: !1345)
!1354 = !DILocation(line: 159, column: 21, scope: !1345)
!1355 = !DILocation(line: 159, column: 9, scope: !1345)
!1356 = !DILocation(line: 159, column: 24, scope: !1345)
!1357 = !DILocation(line: 159, column: 40, scope: !1345)
!1358 = !DILocation(line: 160, column: 45, scope: !1345)
!1359 = !DILocation(line: 160, column: 33, scope: !1345)
!1360 = !DILocation(line: 160, column: 21, scope: !1345)
!1361 = !DILocation(line: 160, column: 9, scope: !1345)
!1362 = !DILocation(line: 160, column: 24, scope: !1345)
!1363 = !DILocation(line: 160, column: 30, scope: !1345)
!1364 = !DILocation(line: 161, column: 58, scope: !1345)
!1365 = !DILocation(line: 161, column: 47, scope: !1345)
!1366 = !DILocation(line: 161, column: 44, scope: !1345)
!1367 = !DILocation(line: 161, column: 21, scope: !1345)
!1368 = !DILocation(line: 161, column: 9, scope: !1345)
!1369 = !DILocation(line: 161, column: 24, scope: !1345)
!1370 = !DILocation(line: 161, column: 40, scope: !1345)
!1371 = !DILocation(line: 163, column: 41, scope: !1345)
!1372 = !DILocation(line: 163, column: 29, scope: !1345)
!1373 = !DILocation(line: 163, column: 56, scope: !1345)
!1374 = !DILocation(line: 163, column: 45, scope: !1345)
!1375 = !DILocation(line: 163, column: 72, scope: !1345)
!1376 = !DILocation(line: 163, column: 60, scope: !1345)
!1377 = !DILocation(line: 164, column: 36, scope: !1345)
!1378 = !DILocation(line: 164, column: 28, scope: !1345)
!1379 = !DILocation(line: 165, column: 37, scope: !1345)
!1380 = !DILocation(line: 165, column: 28, scope: !1345)
!1381 = !DILocation(line: 166, column: 37, scope: !1345)
!1382 = !DILocation(line: 166, column: 28, scope: !1345)
!1383 = !DILocation(line: 163, column: 9, scope: !1345)
!1384 = !DILocation(line: 169, column: 41, scope: !1345)
!1385 = !DILocation(line: 169, column: 29, scope: !1345)
!1386 = !DILocation(line: 169, column: 56, scope: !1345)
!1387 = !DILocation(line: 169, column: 45, scope: !1345)
!1388 = !DILocation(line: 169, column: 72, scope: !1345)
!1389 = !DILocation(line: 169, column: 60, scope: !1345)
!1390 = !DILocation(line: 170, column: 36, scope: !1345)
!1391 = !DILocation(line: 170, column: 28, scope: !1345)
!1392 = !DILocation(line: 171, column: 37, scope: !1345)
!1393 = !DILocation(line: 171, column: 28, scope: !1345)
!1394 = !DILocation(line: 172, column: 37, scope: !1345)
!1395 = !DILocation(line: 172, column: 28, scope: !1345)
!1396 = !DILocation(line: 169, column: 9, scope: !1345)
!1397 = !DILocation(line: 175, column: 36, scope: !1345)
!1398 = !DILocation(line: 175, column: 24, scope: !1345)
!1399 = !DILocation(line: 175, column: 39, scope: !1345)
!1400 = !DILocation(line: 175, column: 21, scope: !1345)
!1401 = !DILocation(line: 176, column: 36, scope: !1345)
!1402 = !DILocation(line: 176, column: 24, scope: !1345)
!1403 = !DILocation(line: 176, column: 39, scope: !1345)
!1404 = !DILocation(line: 176, column: 21, scope: !1345)
!1405 = !DILocation(line: 177, column: 5, scope: !1345)
!1406 = !DILocation(line: 157, column: 62, scope: !1407)
!1407 = !DILexicalBlockFile(scope: !1341, file: !904, discriminator: 2)
!1408 = !DILocation(line: 157, column: 5, scope: !1407)
!1409 = distinct !{!1409, !1410}
!1410 = !DILocation(line: 157, column: 5, scope: !903)
!1411 = !DILocation(line: 179, column: 12, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !903, file: !904, line: 179, column: 5)
!1413 = !DILocation(line: 179, column: 29, scope: !1412)
!1414 = !DILocation(line: 179, column: 10, scope: !1412)
!1415 = !DILocation(line: 179, column: 35, scope: !1416)
!1416 = !DILexicalBlockFile(scope: !1417, file: !904, discriminator: 1)
!1417 = distinct !DILexicalBlock(scope: !1412, file: !904, line: 179, column: 5)
!1418 = !DILocation(line: 179, column: 37, scope: !1416)
!1419 = !DILocation(line: 179, column: 5, scope: !1416)
!1420 = !DILocation(line: 180, column: 45, scope: !1421)
!1421 = distinct !DILexicalBlock(scope: !1417, file: !904, line: 179, column: 47)
!1422 = !DILocation(line: 180, column: 33, scope: !1421)
!1423 = !DILocation(line: 180, column: 21, scope: !1421)
!1424 = !DILocation(line: 180, column: 9, scope: !1421)
!1425 = !DILocation(line: 180, column: 24, scope: !1421)
!1426 = !DILocation(line: 180, column: 30, scope: !1421)
!1427 = !DILocation(line: 181, column: 58, scope: !1421)
!1428 = !DILocation(line: 181, column: 47, scope: !1421)
!1429 = !DILocation(line: 181, column: 44, scope: !1421)
!1430 = !DILocation(line: 181, column: 21, scope: !1421)
!1431 = !DILocation(line: 181, column: 9, scope: !1421)
!1432 = !DILocation(line: 181, column: 24, scope: !1421)
!1433 = !DILocation(line: 181, column: 40, scope: !1421)
!1434 = !DILocation(line: 183, column: 41, scope: !1421)
!1435 = !DILocation(line: 183, column: 29, scope: !1421)
!1436 = !DILocation(line: 183, column: 56, scope: !1421)
!1437 = !DILocation(line: 183, column: 45, scope: !1421)
!1438 = !DILocation(line: 183, column: 72, scope: !1421)
!1439 = !DILocation(line: 183, column: 60, scope: !1421)
!1440 = !DILocation(line: 184, column: 36, scope: !1421)
!1441 = !DILocation(line: 184, column: 28, scope: !1421)
!1442 = !DILocation(line: 185, column: 37, scope: !1421)
!1443 = !DILocation(line: 185, column: 28, scope: !1421)
!1444 = !DILocation(line: 186, column: 37, scope: !1421)
!1445 = !DILocation(line: 186, column: 28, scope: !1421)
!1446 = !DILocation(line: 183, column: 9, scope: !1421)
!1447 = !DILocation(line: 188, column: 36, scope: !1421)
!1448 = !DILocation(line: 188, column: 24, scope: !1421)
!1449 = !DILocation(line: 188, column: 39, scope: !1421)
!1450 = !DILocation(line: 188, column: 21, scope: !1421)
!1451 = !DILocation(line: 189, column: 5, scope: !1421)
!1452 = !DILocation(line: 179, column: 43, scope: !1453)
!1453 = !DILexicalBlockFile(scope: !1417, file: !904, discriminator: 2)
!1454 = !DILocation(line: 179, column: 5, scope: !1453)
!1455 = distinct !{!1455, !1456}
!1456 = !DILocation(line: 179, column: 5, scope: !903)
!1457 = !DILocation(line: 191, column: 16, scope: !903)
!1458 = !DILocation(line: 194, column: 12, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !903, file: !904, line: 194, column: 5)
!1460 = !DILocation(line: 194, column: 10, scope: !1459)
!1461 = !DILocation(line: 194, column: 17, scope: !1462)
!1462 = !DILexicalBlockFile(scope: !1463, file: !904, discriminator: 1)
!1463 = distinct !DILexicalBlock(scope: !1459, file: !904, line: 194, column: 5)
!1464 = !DILocation(line: 194, column: 19, scope: !1462)
!1465 = !DILocation(line: 194, column: 5, scope: !1462)
!1466 = !DILocation(line: 195, column: 34, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1468, file: !904, line: 195, column: 13)
!1468 = distinct !DILexicalBlock(scope: !1463, file: !904, line: 194, column: 31)
!1469 = !DILocation(line: 195, column: 13, scope: !1467)
!1470 = !DILocation(line: 195, column: 37, scope: !1467)
!1471 = !DILocation(line: 195, column: 13, scope: !1468)
!1472 = !DILocation(line: 196, column: 55, scope: !1467)
!1473 = !DILocation(line: 196, column: 34, scope: !1467)
!1474 = !DILocation(line: 196, column: 58, scope: !1467)
!1475 = !DILocation(line: 197, column: 55, scope: !1467)
!1476 = !DILocation(line: 197, column: 34, scope: !1467)
!1477 = !DILocation(line: 197, column: 58, scope: !1467)
!1478 = !DILocation(line: 198, column: 62, scope: !1467)
!1479 = !DILocation(line: 198, column: 48, scope: !1467)
!1480 = !DILocation(line: 196, column: 13, scope: !1467)
!1481 = !DILocation(line: 200, column: 27, scope: !1467)
!1482 = !DILocation(line: 200, column: 13, scope: !1467)
!1483 = !DILocation(line: 200, column: 30, scope: !1467)
!1484 = !DILocation(line: 200, column: 36, scope: !1467)
!1485 = !DILocation(line: 201, column: 5, scope: !1468)
!1486 = !DILocation(line: 194, column: 27, scope: !1487)
!1487 = !DILexicalBlockFile(scope: !1463, file: !904, discriminator: 2)
!1488 = !DILocation(line: 194, column: 5, scope: !1487)
!1489 = distinct !{!1489, !1490}
!1490 = !DILocation(line: 194, column: 5, scope: !903)
!1491 = !DILocation(line: 204, column: 12, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !903, file: !904, line: 204, column: 5)
!1493 = !DILocation(line: 204, column: 10, scope: !1492)
!1494 = !DILocation(line: 204, column: 17, scope: !1495)
!1495 = !DILexicalBlockFile(scope: !1496, file: !904, discriminator: 1)
!1496 = distinct !DILexicalBlock(scope: !1492, file: !904, line: 204, column: 5)
!1497 = !DILocation(line: 204, column: 19, scope: !1495)
!1498 = !DILocation(line: 204, column: 5, scope: !1495)
!1499 = !DILocation(line: 205, column: 39, scope: !1496)
!1500 = !DILocation(line: 205, column: 30, scope: !1496)
!1501 = !DILocation(line: 205, column: 54, scope: !1496)
!1502 = !DILocation(line: 205, column: 43, scope: !1496)
!1503 = !DILocation(line: 205, column: 86, scope: !1496)
!1504 = !DILocation(line: 205, column: 72, scope: !1496)
!1505 = !DILocation(line: 205, column: 9, scope: !1496)
!1506 = !DILocation(line: 204, column: 26, scope: !1507)
!1507 = !DILexicalBlockFile(scope: !1496, file: !904, discriminator: 2)
!1508 = !DILocation(line: 204, column: 5, scope: !1507)
!1509 = distinct !{!1509, !1510}
!1510 = !DILocation(line: 204, column: 5, scope: !903)
!1511 = !DILocation(line: 208, column: 12, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !903, file: !904, line: 208, column: 5)
!1513 = !DILocation(line: 208, column: 10, scope: !1512)
!1514 = !DILocation(line: 208, column: 17, scope: !1515)
!1515 = !DILexicalBlockFile(scope: !1516, file: !904, discriminator: 1)
!1516 = distinct !DILexicalBlock(scope: !1512, file: !904, line: 208, column: 5)
!1517 = !DILocation(line: 208, column: 19, scope: !1515)
!1518 = !DILocation(line: 208, column: 5, scope: !1515)
!1519 = !DILocation(line: 209, column: 39, scope: !1516)
!1520 = !DILocation(line: 209, column: 30, scope: !1516)
!1521 = !DILocation(line: 209, column: 54, scope: !1516)
!1522 = !DILocation(line: 209, column: 43, scope: !1516)
!1523 = !DILocation(line: 209, column: 86, scope: !1516)
!1524 = !DILocation(line: 209, column: 72, scope: !1516)
!1525 = !DILocation(line: 209, column: 9, scope: !1516)
!1526 = !DILocation(line: 208, column: 25, scope: !1527)
!1527 = !DILexicalBlockFile(scope: !1516, file: !904, discriminator: 2)
!1528 = !DILocation(line: 208, column: 5, scope: !1527)
!1529 = distinct !{!1529, !1530}
!1530 = !DILocation(line: 208, column: 5, scope: !903)
!1531 = !DILocation(line: 210, column: 1, scope: !903)
!1532 = distinct !DISubprogram(name: "build_canonical_huff", scope: !904, file: !904, line: 50, type: !1533, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !907)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{null, !916, !916, !1535, !1536}
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1537 = !DILocalVariable(name: "cb", arg: 1, scope: !1532, file: !904, line: 50, type: !916)
!1538 = !DILocation(line: 50, column: 71, scope: !1532)
!1539 = !DILocalVariable(name: "xlat", arg: 2, scope: !1532, file: !904, line: 50, type: !916)
!1540 = !DILocation(line: 50, column: 90, scope: !1532)
!1541 = !DILocalVariable(name: "tab_offset", arg: 3, scope: !1532, file: !904, line: 51, type: !1535)
!1542 = !DILocation(line: 51, column: 47, scope: !1532)
!1543 = !DILocalVariable(name: "out_vlc", arg: 4, scope: !1532, file: !904, line: 51, type: !1536)
!1544 = !DILocation(line: 51, column: 64, scope: !1532)
!1545 = !DILocalVariable(name: "i", scope: !1532, file: !904, line: 53, type: !888)
!1546 = !DILocation(line: 53, column: 9, scope: !1532)
!1547 = !DILocalVariable(name: "b", scope: !1532, file: !904, line: 53, type: !888)
!1548 = !DILocation(line: 53, column: 12, scope: !1532)
!1549 = !DILocalVariable(name: "codes", scope: !1532, file: !904, line: 54, type: !1550)
!1550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 4096, align: 16, elements: !1082)
!1551 = !DILocation(line: 54, column: 14, scope: !1532)
!1552 = !DILocalVariable(name: "bits", scope: !1532, file: !904, line: 55, type: !1553)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 2048, align: 8, elements: !1082)
!1554 = !DILocation(line: 55, column: 13, scope: !1532)
!1555 = !DILocalVariable(name: "code", scope: !1532, file: !904, line: 56, type: !889)
!1556 = !DILocation(line: 56, column: 14, scope: !1532)
!1557 = !DILocalVariable(name: "index", scope: !1532, file: !904, line: 57, type: !888)
!1558 = !DILocation(line: 57, column: 9, scope: !1532)
!1559 = !DILocalVariable(name: "min_len", scope: !1532, file: !904, line: 58, type: !888)
!1560 = !DILocation(line: 58, column: 9, scope: !1532)
!1561 = !DILocation(line: 58, column: 22, scope: !1532)
!1562 = !DILocation(line: 58, column: 19, scope: !1532)
!1563 = !DILocalVariable(name: "max_len", scope: !1532, file: !904, line: 59, type: !888)
!1564 = !DILocation(line: 59, column: 9, scope: !1532)
!1565 = !DILocation(line: 59, column: 22, scope: !1532)
!1566 = !DILocation(line: 59, column: 19, scope: !1532)
!1567 = !DILocation(line: 61, column: 14, scope: !1568)
!1568 = distinct !DILexicalBlock(scope: !1532, file: !904, line: 61, column: 5)
!1569 = !DILocation(line: 61, column: 12, scope: !1568)
!1570 = !DILocation(line: 61, column: 10, scope: !1568)
!1571 = !DILocation(line: 61, column: 23, scope: !1572)
!1572 = !DILexicalBlockFile(scope: !1573, file: !904, discriminator: 1)
!1573 = distinct !DILexicalBlock(scope: !1568, file: !904, line: 61, column: 5)
!1574 = !DILocation(line: 61, column: 28, scope: !1572)
!1575 = !DILocation(line: 61, column: 25, scope: !1572)
!1576 = !DILocation(line: 61, column: 5, scope: !1572)
!1577 = !DILocation(line: 62, column: 21, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !1579, file: !904, line: 62, column: 9)
!1579 = distinct !DILexicalBlock(scope: !1573, file: !904, line: 61, column: 42)
!1580 = !DILocation(line: 62, column: 18, scope: !1578)
!1581 = !DILocation(line: 62, column: 16, scope: !1578)
!1582 = !DILocation(line: 62, column: 14, scope: !1578)
!1583 = !DILocation(line: 62, column: 25, scope: !1584)
!1584 = !DILexicalBlockFile(scope: !1585, file: !904, discriminator: 1)
!1585 = distinct !DILexicalBlock(scope: !1578, file: !904, line: 62, column: 9)
!1586 = !DILocation(line: 62, column: 27, scope: !1584)
!1587 = !DILocation(line: 62, column: 9, scope: !1584)
!1588 = !DILocation(line: 63, column: 13, scope: !1589)
!1589 = distinct !DILexicalBlock(scope: !1585, file: !904, line: 62, column: 37)
!1590 = distinct !{!1590, !1588}
!1591 = !DILocation(line: 63, column: 24, scope: !1592)
!1592 = !DILexicalBlockFile(scope: !1593, file: !904, discriminator: 1)
!1593 = distinct !DILexicalBlock(scope: !1594, file: !904, line: 63, column: 22)
!1594 = distinct !DILexicalBlock(scope: !1589, file: !904, line: 63, column: 16)
!1595 = !DILocation(line: 63, column: 30, scope: !1592)
!1596 = !DILocation(line: 63, column: 22, scope: !1592)
!1597 = !DILocation(line: 63, column: 40, scope: !1598)
!1598 = !DILexicalBlockFile(scope: !1599, file: !904, discriminator: 2)
!1599 = distinct !DILexicalBlock(scope: !1593, file: !904, line: 63, column: 38)
!1600 = !DILocation(line: 63, column: 98, scope: !1601)
!1601 = !DILexicalBlockFile(scope: !1598, file: !904, discriminator: 4)
!1602 = !DILocation(line: 63, column: 98, scope: !1598)
!1603 = !DILocation(line: 63, column: 109, scope: !1604)
!1604 = !DILexicalBlockFile(scope: !1594, file: !904, discriminator: 3)
!1605 = !DILocation(line: 64, column: 27, scope: !1589)
!1606 = !DILocation(line: 64, column: 18, scope: !1589)
!1607 = !DILocation(line: 64, column: 13, scope: !1589)
!1608 = !DILocation(line: 64, column: 25, scope: !1589)
!1609 = !DILocation(line: 65, column: 32, scope: !1589)
!1610 = !DILocation(line: 65, column: 28, scope: !1589)
!1611 = !DILocation(line: 65, column: 19, scope: !1589)
!1612 = !DILocation(line: 65, column: 13, scope: !1589)
!1613 = !DILocation(line: 65, column: 26, scope: !1589)
!1614 = !DILocation(line: 66, column: 18, scope: !1589)
!1615 = !DILocation(line: 67, column: 9, scope: !1589)
!1616 = !DILocation(line: 62, column: 33, scope: !1617)
!1617 = !DILexicalBlockFile(scope: !1585, file: !904, discriminator: 2)
!1618 = !DILocation(line: 62, column: 9, scope: !1617)
!1619 = distinct !{!1619, !1620}
!1620 = !DILocation(line: 62, column: 9, scope: !1579)
!1621 = !DILocation(line: 68, column: 14, scope: !1579)
!1622 = !DILocation(line: 69, column: 5, scope: !1579)
!1623 = !DILocation(line: 61, column: 38, scope: !1624)
!1624 = !DILexicalBlockFile(scope: !1573, file: !904, discriminator: 2)
!1625 = !DILocation(line: 61, column: 5, scope: !1624)
!1626 = distinct !{!1626, !1627}
!1627 = !DILocation(line: 61, column: 5, scope: !1532)
!1628 = !DILocation(line: 71, column: 36, scope: !1532)
!1629 = !DILocation(line: 71, column: 35, scope: !1532)
!1630 = !DILocation(line: 71, column: 23, scope: !1532)
!1631 = !DILocation(line: 71, column: 5, scope: !1532)
!1632 = !DILocation(line: 71, column: 14, scope: !1532)
!1633 = !DILocation(line: 71, column: 20, scope: !1532)
!1634 = !DILocation(line: 72, column: 37, scope: !1532)
!1635 = !DILocation(line: 72, column: 34, scope: !1532)
!1636 = !DILocation(line: 72, column: 5, scope: !1532)
!1637 = !DILocation(line: 72, column: 14, scope: !1532)
!1638 = !DILocation(line: 72, column: 30, scope: !1532)
!1639 = !DILocation(line: 74, column: 24, scope: !1532)
!1640 = !DILocation(line: 74, column: 33, scope: !1532)
!1641 = !DILocation(line: 74, column: 42, scope: !1532)
!1642 = !DILocation(line: 74, column: 49, scope: !1532)
!1643 = !DILocation(line: 74, column: 61, scope: !1532)
!1644 = !DILocation(line: 75, column: 24, scope: !1532)
!1645 = !DILocation(line: 74, column: 5, scope: !1532)
!1646 = !DILocation(line: 77, column: 25, scope: !1532)
!1647 = !DILocation(line: 77, column: 22, scope: !1532)
!1648 = !DILocation(line: 77, column: 6, scope: !1532)
!1649 = !DILocation(line: 77, column: 17, scope: !1532)
!1650 = !DILocation(line: 78, column: 1, scope: !1532)
!1651 = distinct !DISubprogram(name: "ff_atrac3p_decode_channel_unit", scope: !904, file: !904, line: 1757, type: !1652, isLocal: false, isDefinition: true, scopeLine: 1759, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !907)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!888, !1654, !1664, !888, !1782}
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1656, line: 70, baseType: !1657)
!1656 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1656, line: 61, size: 256, align: 64, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662, !1663}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1657, file: !1656, line: 62, baseType: !916, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1657, file: !1656, line: 62, baseType: !916, size: 64, align: 64, offset: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1657, file: !1656, line: 67, baseType: !888, size: 32, align: 32, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1657, file: !1656, line: 68, baseType: !888, size: 32, align: 32, offset: 160)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1657, file: !1656, line: 69, baseType: !888, size: 32, align: 32, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pChanUnitCtx", file: !1666, line: 154, baseType: !1667)
!1666 = !DIFile(filename: "libavcodec/atrac3plus.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pChanUnitCtx", file: !1666, line: 131, size: 295168, align: 256, elements: !1668)
!1668 = !{!1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1681, !1682, !1741, !1764, !1766, !1767, !1779}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !1667, file: !1666, line: 133, baseType: !888, size: 32, align: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "num_quant_units", scope: !1667, file: !1666, line: 134, baseType: !888, size: 32, align: 32, offset: 32)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "num_subbands", scope: !1667, file: !1666, line: 135, baseType: !888, size: 32, align: 32, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "used_quant_units", scope: !1667, file: !1666, line: 136, baseType: !888, size: 32, align: 32, offset: 96)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "num_coded_subbands", scope: !1667, file: !1666, line: 137, baseType: !888, size: 32, align: 32, offset: 128)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "mute_flag", scope: !1667, file: !1666, line: 138, baseType: !888, size: 32, align: 32, offset: 160)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "use_full_table", scope: !1667, file: !1666, line: 139, baseType: !888, size: 32, align: 32, offset: 192)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "noise_present", scope: !1667, file: !1666, line: 140, baseType: !888, size: 32, align: 32, offset: 224)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "noise_level_index", scope: !1667, file: !1666, line: 141, baseType: !888, size: 32, align: 32, offset: 256)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "noise_table_index", scope: !1667, file: !1666, line: 142, baseType: !888, size: 32, align: 32, offset: 288)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "swap_channels", scope: !1667, file: !1666, line: 143, baseType: !1680, size: 128, align: 8, offset: 320)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 128, align: 8, elements: !1016)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "negate_coeffs", scope: !1667, file: !1666, line: 144, baseType: !1680, size: 128, align: 8, offset: 448)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1667, file: !1666, line: 145, baseType: !1683, size: 124800, align: 64, offset: 576)
!1683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1684, size: 124800, align: 64, elements: !968)
!1684 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pChanParams", file: !1666, line: 116, baseType: !1685)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pChanParams", file: !1666, line: 89, size: 62400, align: 64, elements: !1686)
!1686 = !{!1687, !1688, !1689, !1690, !1691, !1692, !1694, !1695, !1696, !1700, !1702, !1705, !1707, !1708, !1718, !1720, !1721, !1722, !1738, !1740}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "ch_num", scope: !1685, file: !1666, line: 90, baseType: !888, size: 32, align: 32)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "num_coded_vals", scope: !1685, file: !1666, line: 91, baseType: !888, size: 32, align: 32, offset: 32)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "fill_mode", scope: !1685, file: !1666, line: 92, baseType: !888, size: 32, align: 32, offset: 64)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "split_point", scope: !1685, file: !1666, line: 93, baseType: !888, size: 32, align: 32, offset: 96)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "table_type", scope: !1685, file: !1666, line: 94, baseType: !888, size: 32, align: 32, offset: 128)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "qu_wordlen", scope: !1685, file: !1666, line: 95, baseType: !1693, size: 1024, align: 32, offset: 160)
!1693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 1024, align: 32, elements: !1057)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "qu_sf_idx", scope: !1685, file: !1666, line: 96, baseType: !1693, size: 1024, align: 32, offset: 1184)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "qu_tab_idx", scope: !1685, file: !1666, line: 97, baseType: !1693, size: 1024, align: 32, offset: 2208)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum", scope: !1685, file: !1666, line: 98, baseType: !1697, size: 32768, align: 16, offset: 3232)
!1697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 32768, align: 16, elements: !1698)
!1698 = !{!1699}
!1699 = !DISubrange(count: 2048)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "power_levs", scope: !1685, file: !1666, line: 99, baseType: !1701, size: 40, align: 8, offset: 36000)
!1701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 40, align: 8, elements: !989)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "wnd_shape_hist", scope: !1685, file: !1666, line: 102, baseType: !1703, size: 256, align: 8, offset: 36040)
!1703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 256, align: 8, elements: !1704)
!1704 = !{!957, !1017}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "wnd_shape", scope: !1685, file: !1666, line: 103, baseType: !1706, size: 64, align: 64, offset: 36352)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "wnd_shape_prev", scope: !1685, file: !1666, line: 104, baseType: !1706, size: 64, align: 64, offset: 36416)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "gain_data_hist", scope: !1685, file: !1666, line: 107, baseType: !1709, size: 15360, align: 32, offset: 36480)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1710, size: 15360, align: 32, elements: !1704)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtracGainInfo", file: !1711, line: 39, baseType: !1712)
!1711 = !DIFile(filename: "libavcodec/atrac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtracGainInfo", file: !1711, line: 35, size: 480, align: 32, elements: !1713)
!1713 = !{!1714, !1715, !1717}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "num_points", scope: !1712, file: !1711, line: 36, baseType: !888, size: 32, align: 32)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "lev_code", scope: !1712, file: !1711, line: 37, baseType: !1716, size: 224, align: 32, offset: 32)
!1716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 224, align: 32, elements: !947)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "loc_code", scope: !1712, file: !1711, line: 38, baseType: !1716, size: 224, align: 32, offset: 256)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "gain_data", scope: !1685, file: !1666, line: 108, baseType: !1719, size: 64, align: 64, offset: 51840)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "gain_data_prev", scope: !1685, file: !1666, line: 109, baseType: !1719, size: 64, align: 64, offset: 51904)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "num_gain_subbands", scope: !1685, file: !1666, line: 110, baseType: !888, size: 32, align: 32, offset: 51968)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "tones_info_hist", scope: !1685, file: !1666, line: 113, baseType: !1723, size: 10240, align: 32, offset: 52000)
!1723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1724, size: 10240, align: 32, elements: !1704)
!1724 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWavesData", file: !1666, line: 78, baseType: !1725)
!1725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWavesData", file: !1666, line: 73, size: 320, align: 32, elements: !1726)
!1726 = !{!1727, !1735, !1736, !1737}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pend_env", scope: !1725, file: !1666, line: 74, baseType: !1728, size: 128, align: 32)
!1728 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWaveEnvelope", file: !1666, line: 70, baseType: !1729)
!1729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWaveEnvelope", file: !1666, line: 65, size: 128, align: 32, elements: !1730)
!1730 = !{!1731, !1732, !1733, !1734}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "has_start_point", scope: !1729, file: !1666, line: 66, baseType: !888, size: 32, align: 32)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "has_stop_point", scope: !1729, file: !1666, line: 67, baseType: !888, size: 32, align: 32, offset: 32)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !1729, file: !1666, line: 68, baseType: !888, size: 32, align: 32, offset: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "stop_pos", scope: !1729, file: !1666, line: 69, baseType: !888, size: 32, align: 32, offset: 96)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "curr_env", scope: !1725, file: !1666, line: 75, baseType: !1728, size: 128, align: 32, offset: 128)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "num_wavs", scope: !1725, file: !1666, line: 76, baseType: !888, size: 32, align: 32, offset: 256)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "start_index", scope: !1725, file: !1666, line: 77, baseType: !888, size: 32, align: 32, offset: 288)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "tones_info", scope: !1685, file: !1666, line: 114, baseType: !1739, size: 64, align: 64, offset: 62272)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "tones_info_prev", scope: !1685, file: !1666, line: 115, baseType: !1739, size: 64, align: 64, offset: 62336)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "wave_synth_hist", scope: !1667, file: !1666, line: 148, baseType: !1742, size: 13312, align: 32, offset: 125376)
!1742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1743, size: 13312, align: 32, elements: !968)
!1743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWaveSynthParams", file: !1666, line: 128, baseType: !1744)
!1744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWaveSynthParams", file: !1666, line: 119, size: 6656, align: 32, elements: !1745)
!1745 = !{!1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "tones_present", scope: !1744, file: !1666, line: 120, baseType: !888, size: 32, align: 32)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude_mode", scope: !1744, file: !1666, line: 121, baseType: !888, size: 32, align: 32, offset: 32)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "num_tone_bands", scope: !1744, file: !1666, line: 122, baseType: !888, size: 32, align: 32, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "tone_sharing", scope: !1744, file: !1666, line: 123, baseType: !1680, size: 128, align: 8, offset: 96)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "tone_master", scope: !1744, file: !1666, line: 124, baseType: !1680, size: 128, align: 8, offset: 224)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "invert_phase", scope: !1744, file: !1666, line: 125, baseType: !1680, size: 128, align: 8, offset: 352)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "tones_index", scope: !1744, file: !1666, line: 126, baseType: !888, size: 32, align: 32, offset: 480)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "waves", scope: !1744, file: !1666, line: 127, baseType: !1754, size: 6144, align: 32, offset: 512)
!1754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1755, size: 6144, align: 32, elements: !1762)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pWaveParam", file: !1666, line: 86, baseType: !1756)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pWaveParam", file: !1666, line: 81, size: 128, align: 32, elements: !1757)
!1757 = !{!1758, !1759, !1760, !1761}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "freq_index", scope: !1756, file: !1666, line: 82, baseType: !888, size: 32, align: 32)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "amp_sf", scope: !1756, file: !1666, line: 83, baseType: !888, size: 32, align: 32, offset: 32)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "amp_index", scope: !1756, file: !1666, line: 84, baseType: !888, size: 32, align: 32, offset: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "phase_index", scope: !1756, file: !1666, line: 85, baseType: !888, size: 32, align: 32, offset: 96)
!1762 = !{!1763}
!1763 = !DISubrange(count: 48)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "waves_info", scope: !1667, file: !1666, line: 149, baseType: !1765, size: 64, align: 64, offset: 138688)
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "waves_info_prev", scope: !1667, file: !1666, line: 150, baseType: !1765, size: 64, align: 64, offset: 138752)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "ipqf_ctx", scope: !1667, file: !1666, line: 152, baseType: !1768, size: 25088, align: 256, offset: 139008)
!1768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1769, size: 25088, align: 256, elements: !968)
!1769 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atrac3pIPQFChannelCtx", file: !1666, line: 62, baseType: !1770)
!1770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atrac3pIPQFChannelCtx", file: !1666, line: 58, size: 12544, align: 256, elements: !1771)
!1771 = !{!1772, !1777, !1778}
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "buf1", scope: !1770, file: !1666, line: 59, baseType: !1773, size: 6144, align: 32)
!1773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1774, size: 6144, align: 32, elements: !1775)
!1774 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1775 = !{!1776, !928}
!1776 = !DISubrange(count: 24)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "buf2", scope: !1770, file: !1666, line: 60, baseType: !1773, size: 6144, align: 32, offset: 6144)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1770, file: !1666, line: 61, baseType: !888, size: 32, align: 32, offset: 12288)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "prev_buf", scope: !1667, file: !1666, line: 153, baseType: !1780, size: 131072, align: 32, offset: 164096)
!1780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1774, size: 131072, align: 32, elements: !1781)
!1781 = !{!957, !1699}
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64, align: 64)
!1783 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1784)
!1784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1785)
!1785 = !{!1786, !1830, !1831, !1832, !2088, !2089, !2090, !2091, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2117, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2300, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361}
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1784, file: !35, line: 1561, baseType: !1787, size: 64, align: 64)
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1788, size: 64, align: 64)
!1788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1789)
!1789 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1790)
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1791)
!1791 = !{!1792, !1796, !1800, !1804, !1805, !1806, !1807, !1811, !1817, !1819, !1823}
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1790, file: !4, line: 72, baseType: !1793, size: 64, align: 64)
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64, align: 64)
!1794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1795)
!1795 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1790, file: !4, line: 78, baseType: !1797, size: 64, align: 64, offset: 64)
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1798, size: 64, align: 64)
!1798 = !DISubroutineType(types: !1799)
!1799 = !{!1793, !890}
