; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cbs_vp9.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cbs_vp9.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CodedBitstreamContext = type { i8*, %struct.CodedBitstreamType*, i8*, i32*, i32, i32, i32 }
%struct.CodedBitstreamType = type { i32, i64, {}*, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamUnit*)*, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamUnit*)*, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamFragment*)*, void (%struct.CodedBitstreamContext*)* }
%struct.CodedBitstreamFragment = type { i8*, i64, i64, %struct.AVBufferRef*, i32, %struct.CodedBitstreamUnit* }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.CodedBitstreamUnit = type { i32, i8*, i64, i64, %struct.AVBufferRef*, i8*, %struct.AVBufferRef* }
%struct.VP9RawSuperframeIndex = type { i8, i8, i8, [8 x i32] }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.VP9RawFrame = type { %struct.VP9RawFrameHeader, i8*, i64, %struct.AVBufferRef* }

!449 = !DIEnumerator(name: "AV_CODEC_ID_SCTE_35", value: 98305)
!450 = !DIEnumerator(name: "AV_CODEC_ID_BINTEXT", value: 100352)
!451 = !DIEnumerator(name: "AV_CODEC_ID_XBIN", value: 100353)
!452 = !DIEnumerator(name: "AV_CODEC_ID_IDF", value: 100354)
!453 = !DIEnumerator(name: "AV_CODEC_ID_OTF", value: 100355)
!454 = !DIEnumerator(name: "AV_CODEC_ID_SMPTE_KLV", value: 100356)
!455 = !DIEnumerator(name: "AV_CODEC_ID_DVD_NAV", value: 100357)
!456 = !DIEnumerator(name: "AV_CODEC_ID_TIMED_ID3", value: 100358)
!457 = !DIEnumerator(name: "AV_CODEC_ID_BIN_DATA", value: 100359)
!458 = !DIEnumerator(name: "AV_CODEC_ID_PROBE", value: 102400)
!459 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2TS", value: 131072)
!460 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4SYSTEMS", value: 131073)
!461 = !DIEnumerator(name: "AV_CODEC_ID_FFMETADATA", value: 135168)
!462 = !DIEnumerator(name: "AV_CODEC_ID_WRAPPED_AVFRAME", value: 135169)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 43, size: 32, align: 32, elements: !465)
!464 = !DIFile(filename: "libavcodec/cbs_vp9.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!465 = !{!466, !467}
!466 = !DIEnumerator(name: "VP9_KEY_FRAME", value: 0)
!467 = !DIEnumerator(name: "VP9_NON_KEY_FRAME", value: 1)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 29, size: 32, align: 32, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476}
!470 = !DIEnumerator(name: "VP9_REFS_PER_FRAME", value: 3)
!471 = !DIEnumerator(name: "VP9_MIN_TILE_WIDTH_B64", value: 4)
!472 = !DIEnumerator(name: "VP9_MAX_TILE_WIDTH_B64", value: 64)
!473 = !DIEnumerator(name: "VP9_NUM_REF_FRAMES", value: 8)
!474 = !DIEnumerator(name: "VP9_MAX_REF_FRAMES", value: 4)
!475 = !DIEnumerator(name: "VP9_MAX_SEGMENTS", value: 8)
!476 = !DIEnumerator(name: "VP9_SEG_LVL_MAX", value: 4)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 68, size: 32, align: 32, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIEnumerator(name: "VP9_INTRA_FRAME", value: 0)
!480 = !DIEnumerator(name: "VP9_LAST_FRAME", value: 1)
!481 = !DIEnumerator(name: "VP9_GOLDEN_FRAME", value: 2)
!482 = !DIEnumerator(name: "VP9_ALTREF_FRAME", value: 3)
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 49, size: 32, align: 32, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIEnumerator(name: "VP9_FRAME_SYNC_0", value: 73)
!486 = !DIEnumerator(name: "VP9_FRAME_SYNC_1", value: 131)
!487 = !DIEnumerator(name: "VP9_FRAME_SYNC_2", value: 66)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 56, size: 32, align: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497}
!490 = !DIEnumerator(name: "VP9_CS_UNKNOWN", value: 0)
!491 = !DIEnumerator(name: "VP9_CS_BT_601", value: 1)
!492 = !DIEnumerator(name: "VP9_CS_BT_709", value: 2)
!493 = !DIEnumerator(name: "VP9_CS_SMPTE_170", value: 3)
!494 = !DIEnumerator(name: "VP9_CS_SMPTE_240", value: 4)
!495 = !DIEnumerator(name: "VP9_CS_BT_2020", value: 5)
!496 = !DIEnumerator(name: "VP9_CS_RESERVED", value: 6)
!497 = !DIEnumerator(name: "VP9_CS_RGB", value: 7)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 76, size: 32, align: 32, elements: !499)
!499 = !{!500, !501}
!500 = !DIEnumerator(name: "VP9_MAX_FRAMES_IN_SUPERFRAME", value: 8)
!501 = !DIEnumerator(name: "VP9_SUPERFRAME_MARKER", value: 6)
!502 = !{!503, !504, !505, !506, !514, !516, !619, !620, !622}
!503 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!504 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !509, line: 221, size: 32, align: 8, elements: !510)
!509 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!510 = !{!511}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !508, file: !509, line: 221, baseType: !512, size: 32, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !513, line: 51, baseType: !504)
!513 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !513, line: 48, baseType: !515)
!515 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9RawFrame", file: !464, line: 170, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9RawFrame", file: !464, line: 164, size: 1664, align: 64, elements: !519)
!519 = !{!520, !601, !603, !607}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !518, file: !464, line: 165, baseType: !521, size: 1424, align: 16)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9RawFrameHeader", file: !464, line: 162, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9RawFrameHeader", file: !464, line: 83, size: 1424, align: 16, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !544, !548, !549, !550, !551, !552, !553, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !572, !576, !578, !579, !580, !581, !582, !583, !584, !588, !589, !590, !591, !592, !596, !597, !598, !599, !600}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_marker", scope: !522, file: !464, line: 84, baseType: !514, size: 8, align: 8)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "profile_low_bit", scope: !522, file: !464, line: 85, baseType: !514, size: 8, align: 8, offset: 8)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "profile_high_bit", scope: !522, file: !464, line: 86, baseType: !514, size: 8, align: 8, offset: 16)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "show_existing_frame", scope: !522, file: !464, line: 88, baseType: !514, size: 8, align: 8, offset: 24)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_show_map_idx", scope: !522, file: !464, line: 89, baseType: !514, size: 8, align: 8, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_type", scope: !522, file: !464, line: 91, baseType: !514, size: 8, align: 8, offset: 40)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "show_frame", scope: !522, file: !464, line: 92, baseType: !514, size: 8, align: 8, offset: 48)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "error_resilient_mode", scope: !522, file: !464, line: 93, baseType: !514, size: 8, align: 8, offset: 56)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ten_or_twelve_bit", scope: !522, file: !464, line: 96, baseType: !514, size: 8, align: 8, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !522, file: !464, line: 97, baseType: !514, size: 8, align: 8, offset: 72)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !522, file: !464, line: 98, baseType: !514, size: 8, align: 8, offset: 80)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_x", scope: !522, file: !464, line: 99, baseType: !514, size: 8, align: 8, offset: 88)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_y", scope: !522, file: !464, line: 100, baseType: !514, size: 8, align: 8, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "refresh_frame_flags", scope: !522, file: !464, line: 102, baseType: !514, size: 8, align: 8, offset: 104)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !522, file: !464, line: 104, baseType: !514, size: 8, align: 8, offset: 112)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reset_frame_context", scope: !522, file: !464, line: 105, baseType: !514, size: 8, align: 8, offset: 120)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_idx", scope: !522, file: !464, line: 107, baseType: !541, size: 24, align: 8, offset: 128)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 24, align: 8, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 3)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_sign_bias", scope: !522, file: !464, line: 108, baseType: !545, size: 32, align: 8, offset: 152)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 32, align: 8, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 4)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "allow_high_precision_mv", scope: !522, file: !464, line: 110, baseType: !514, size: 8, align: 8, offset: 184)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refresh_frame_context", scope: !522, file: !464, line: 112, baseType: !514, size: 8, align: 8, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_parallel_decoding_mode", scope: !522, file: !464, line: 113, baseType: !514, size: 8, align: 8, offset: 200)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_context_idx", scope: !522, file: !464, line: 115, baseType: !514, size: 8, align: 8, offset: 208)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "found_ref", scope: !522, file: !464, line: 118, baseType: !541, size: 24, align: 8, offset: 216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width_minus_1", scope: !522, file: !464, line: 119, baseType: !554, size: 16, align: 16, offset: 240)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !513, line: 49, baseType: !555)
!555 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height_minus_1", scope: !522, file: !464, line: 120, baseType: !554, size: 16, align: 16, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "render_and_frame_size_different", scope: !522, file: !464, line: 121, baseType: !514, size: 8, align: 8, offset: 272)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "render_width_minus_1", scope: !522, file: !464, line: 122, baseType: !554, size: 16, align: 16, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "render_height_minus_1", scope: !522, file: !464, line: 123, baseType: !554, size: 16, align: 16, offset: 304)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "is_filter_switchable", scope: !522, file: !464, line: 126, baseType: !514, size: 8, align: 8, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "raw_interpolation_filter_type", scope: !522, file: !464, line: 127, baseType: !514, size: 8, align: 8, offset: 328)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_level", scope: !522, file: !464, line: 130, baseType: !514, size: 8, align: 8, offset: 336)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_sharpness", scope: !522, file: !464, line: 131, baseType: !514, size: 8, align: 8, offset: 344)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_delta_enabled", scope: !522, file: !464, line: 132, baseType: !514, size: 8, align: 8, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_delta_update", scope: !522, file: !464, line: 133, baseType: !514, size: 8, align: 8, offset: 360)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "update_ref_delta", scope: !522, file: !464, line: 134, baseType: !545, size: 32, align: 8, offset: 368)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_ref_deltas", scope: !522, file: !464, line: 135, baseType: !568, size: 32, align: 8, offset: 400)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32, align: 8, elements: !546)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !570, line: 194, baseType: !571)
!570 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!571 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "update_mode_delta", scope: !522, file: !464, line: 136, baseType: !573, size: 16, align: 8, offset: 432)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 16, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 2)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_mode_deltas", scope: !522, file: !464, line: 137, baseType: !577, size: 16, align: 8, offset: 448)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 16, align: 8, elements: !574)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "base_q_idx", scope: !522, file: !464, line: 140, baseType: !514, size: 8, align: 8, offset: 464)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_y_dc", scope: !522, file: !464, line: 141, baseType: !569, size: 8, align: 8, offset: 472)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_uv_dc", scope: !522, file: !464, line: 142, baseType: !569, size: 8, align: 8, offset: 480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "delta_q_uv_ac", scope: !522, file: !464, line: 143, baseType: !569, size: 8, align: 8, offset: 488)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_enabled", scope: !522, file: !464, line: 146, baseType: !514, size: 8, align: 8, offset: 496)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_update_map", scope: !522, file: !464, line: 147, baseType: !514, size: 8, align: 8, offset: 504)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_tree_probs", scope: !522, file: !464, line: 148, baseType: !585, size: 56, align: 8, offset: 512)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 56, align: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 7)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_temporal_update", scope: !522, file: !464, line: 149, baseType: !514, size: 8, align: 8, offset: 568)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_pred_prob", scope: !522, file: !464, line: 150, baseType: !541, size: 24, align: 8, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_update_data", scope: !522, file: !464, line: 151, baseType: !514, size: 8, align: 8, offset: 600)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "segmentation_abs_or_delta_update", scope: !522, file: !464, line: 152, baseType: !514, size: 8, align: 8, offset: 608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "feature_enabled", scope: !522, file: !464, line: 153, baseType: !593, size: 256, align: 8, offset: 616)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 256, align: 8, elements: !594)
!594 = !{!595, !547}
!595 = !DISubrange(count: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "feature_value", scope: !522, file: !464, line: 154, baseType: !593, size: 256, align: 8, offset: 872)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "feature_sign", scope: !522, file: !464, line: 155, baseType: !593, size: 256, align: 8, offset: 1128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tile_cols_log2", scope: !522, file: !464, line: 158, baseType: !514, size: 8, align: 8, offset: 1384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tile_rows_log2", scope: !522, file: !464, line: 159, baseType: !514, size: 8, align: 8, offset: 1392)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "header_size_in_bytes", scope: !522, file: !464, line: 161, baseType: !554, size: 16, align: 16, offset: 1408)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !518, file: !464, line: 167, baseType: !602, size: 64, align: 64, offset: 1472)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !518, file: !464, line: 168, baseType: !604, size: 64, align: 64, offset: 1536)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !605, line: 216, baseType: !606)
!605 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!606 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !518, file: !464, line: 169, baseType: !608, size: 64, align: 64, offset: 1600)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !610, line: 94, baseType: !611)
!610 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !610, line: 81, size: 192, align: 64, elements: !612)
!612 = !{!613, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !611, file: !610, line: 82, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !610, line: 73, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !610, line: 73, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !611, file: !610, line: 89, baseType: !602, size: 64, align: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !611, file: !610, line: 93, baseType: !503, size: 32, align: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !570, line: 196, baseType: !503)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !570, line: 197, baseType: !621)
!621 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!623 = !{!624, !687, !708, !709, !724}
!624 = distinct !DIGlobalVariable(name: "ff_cbs_type_vp9", scope: !0, file: !625, line: 681, type: !626, isLocal: false, isDefinition: true, variable: { i32, i64, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamFragment*, i32)*, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamUnit*)*, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamUnit*)*, i32 (%struct.CodedBitstreamContext*, %struct.CodedBitstreamFragment*)*, void (%struct.CodedBitstreamContext*)* }* @ff_cbs_type_vp9)
!625 = !DIFile(filename: "libavcodec/cbs_vp9.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamType", file: !628, line: 58, baseType: !629)
!628 = !DIFile(filename: "libavcodec/cbs_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !628, line: 28, size: 448, align: 64, elements: !630)
!630 = !{!631, !632, !633, !674, !678, !679, !683}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !629, file: !628, line: 29, baseType: !3, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !629, file: !628, line: 31, baseType: !604, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "split_fragment", scope: !629, file: !628, line: 38, baseType: !634, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!503, !637, !653, !503}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !639, line: 204, baseType: !640)
!639 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !639, line: 159, size: 384, align: 64, elements: !641)
!641 = !{!642, !643, !646, !647, !650, !651, !652}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !640, file: !639, line: 164, baseType: !505, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !640, file: !639, line: 169, baseType: !644, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !640, file: !639, line: 180, baseType: !505, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !640, file: !639, line: 188, baseType: !648, size: 64, align: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !639, line: 53, baseType: !512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !640, file: !639, line: 192, baseType: !503, size: 32, align: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !640, file: !639, line: 197, baseType: !503, size: 32, align: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !640, file: !639, line: 203, baseType: !503, size: 32, align: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !639, line: 154, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !639, line: 116, size: 384, align: 64, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !655, file: !639, line: 122, baseType: !602, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !655, file: !639, line: 129, baseType: !604, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !655, file: !639, line: 133, baseType: !604, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !655, file: !639, line: 139, baseType: !608, size: 64, align: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !655, file: !639, line: 147, baseType: !503, size: 32, align: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !655, file: !639, line: 153, baseType: !663, size: 64, align: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !639, line: 107, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !639, line: 64, size: 448, align: 64, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !665, file: !639, line: 68, baseType: !649, size: 32, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !665, file: !639, line: 75, baseType: !602, size: 64, align: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !665, file: !639, line: 80, baseType: !604, size: 64, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !665, file: !639, line: 86, baseType: !604, size: 64, align: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !665, file: !639, line: 92, baseType: !608, size: 64, align: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !665, file: !639, line: 101, baseType: !505, size: 64, align: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !665, file: !639, line: 106, baseType: !608, size: 64, align: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "read_unit", scope: !629, file: !628, line: 44, baseType: !675, size: 64, align: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!503, !637, !663}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "write_unit", scope: !629, file: !628, line: 48, baseType: !675, size: 64, align: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "assemble_fragment", scope: !629, file: !628, line: 53, baseType: !680, size: 64, align: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!503, !637, !653}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !629, file: !628, line: 57, baseType: !684, size: 64, align: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !637}
!687 = distinct !DIGlobalVariable(name: "segmentation_feature_bits", scope: !688, file: !689, line: 209, type: !706, isLocal: true, isDefinition: true, variable: [4 x i32]* @cbs_vp9_read_segmentation_params.segmentation_feature_bits)
!688 = distinct !DISubprogram(name: "cbs_vp9_read_segmentation_params", scope: !689, file: !689, line: 206, type: !690, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !705)
!689 = !DIFile(filename: "libavcodec/cbs_vp9_syntax_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!690 = !DISubroutineType(types: !691)
!691 = !{!503, !637, !692, !704}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !694, line: 70, baseType: !695)
!694 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !694, line: 61, size: 256, align: 64, elements: !696)
!696 = !{!697, !700, !701, !702, !703}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !695, file: !694, line: 62, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !695, file: !694, line: 62, baseType: !698, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !695, file: !694, line: 67, baseType: !503, size: 32, align: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !695, file: !694, line: 68, baseType: !503, size: 32, align: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !695, file: !694, line: 69, baseType: !503, size: 32, align: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!705 = !{}
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, align: 32, elements: !546)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!708 = distinct !DIGlobalVariable(name: "segmentation_feature_signed", scope: !688, file: !689, line: 210, type: !706, isLocal: true, isDefinition: true, variable: [4 x i32]* @cbs_vp9_read_segmentation_params.segmentation_feature_signed)
!709 = distinct !DIGlobalVariable(name: "segmentation_feature_bits", scope: !710, file: !689, line: 209, type: !706, isLocal: true, isDefinition: true, variable: [4 x i32]* @cbs_vp9_write_segmentation_params.segmentation_feature_bits)
!710 = distinct !DISubprogram(name: "cbs_vp9_write_segmentation_params", scope: !689, file: !689, line: 206, type: !711, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !705)
!711 = !DISubroutineType(types: !712)
!712 = !{!503, !637, !713, !704}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !715, line: 40, baseType: !716)
!715 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !715, line: 35, size: 320, align: 64, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !716, file: !715, line: 36, baseType: !512, size: 32, align: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !716, file: !715, line: 37, baseType: !503, size: 32, align: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !716, file: !715, line: 38, baseType: !602, size: 64, align: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !716, file: !715, line: 38, baseType: !602, size: 64, align: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !716, file: !715, line: 38, baseType: !602, size: 64, align: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !716, file: !715, line: 39, baseType: !503, size: 32, align: 32, offset: 256)
!724 = distinct !DIGlobalVariable(name: "segmentation_feature_signed", scope: !710, file: !689, line: 210, type: !706, isLocal: true, isDefinition: true, variable: [4 x i32]* @cbs_vp9_write_segmentation_params.segmentation_feature_signed)
!725 = !{i32 2, !"Dwarf Version", i32 4}
!726 = !{i32 2, !"Debug Info Version", i32 3}
!727 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!728 = distinct !DISubprogram(name: "cbs_vp9_split_fragment", scope: !625, file: !625, line: 412, type: !635, isLocal: true, isDefinition: true, scopeLine: 415, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !705)
!729 = !DILocalVariable(name: "ctx", arg: 1, scope: !728, file: !625, line: 412, type: !637)
!730 = !DIExpression()
!731 = !DILocation(line: 412, column: 58, scope: !728)
!732 = !DILocalVariable(name: "frag", arg: 2, scope: !728, file: !625, line: 413, type: !653)
!733 = !DILocation(line: 413, column: 59, scope: !728)
!734 = !DILocalVariable(name: "header", arg: 3, scope: !728, file: !625, line: 414, type: !503)
!735 = !DILocation(line: 414, column: 39, scope: !728)
!736 = !DILocalVariable(name: "superframe_header", scope: !728, file: !625, line: 416, type: !514)
!737 = !DILocation(line: 416, column: 13, scope: !728)
!738 = !DILocalVariable(name: "err", scope: !728, file: !625, line: 417, type: !503)
!739 = !DILocation(line: 417, column: 9, scope: !728)
!740 = !DILocation(line: 420, column: 36, scope: !728)
!741 = !DILocation(line: 420, column: 42, scope: !728)
!742 = !DILocation(line: 420, column: 52, scope: !728)
!743 = !DILocation(line: 420, column: 25, scope: !728)
!744 = !DILocation(line: 420, column: 31, scope: !728)
!745 = !DILocation(line: 420, column: 23, scope: !728)
!746 = !DILocation(line: 422, column: 10, scope: !747)
!747 = distinct !DILexicalBlock(scope: !728, file: !625, line: 422, column: 9)
!748 = !DILocation(line: 422, column: 28, scope: !747)
!749 = !DILocation(line: 422, column: 36, scope: !747)
!750 = !DILocation(line: 422, column: 9, scope: !728)
!751 = !DILocalVariable(name: "sfi", scope: !752, file: !625, line: 423, type: !753)
!752 = distinct !DILexicalBlock(scope: !747, file: !625, line: 422, column: 45)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9RawSuperframeIndex", file: !464, line: 177, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9RawSuperframeIndex", file: !464, line: 172, size: 288, align: 32, elements: !755)
!755 = !{!756, !757, !758, !759}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "superframe_marker", scope: !754, file: !464, line: 173, baseType: !514, size: 8, align: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_framesize_minus_1", scope: !754, file: !464, line: 174, baseType: !514, size: 8, align: 8, offset: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "frames_in_superframe_minus_1", scope: !754, file: !464, line: 175, baseType: !514, size: 8, align: 8, offset: 16)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "frame_sizes", scope: !754, file: !464, line: 176, baseType: !760, size: 256, align: 32, offset: 32)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 256, align: 32, elements: !761)
!761 = !{!595}
!762 = !DILocation(line: 423, column: 31, scope: !752)
!763 = !DILocalVariable(name: "gbc", scope: !752, file: !625, line: 424, type: !693)
!764 = !DILocation(line: 424, column: 23, scope: !752)
!765 = !DILocalVariable(name: "index_size", scope: !752, file: !625, line: 425, type: !604)
!766 = !DILocation(line: 425, column: 16, scope: !752)
!767 = !DILocalVariable(name: "pos", scope: !752, file: !625, line: 425, type: !604)
!768 = !DILocation(line: 425, column: 28, scope: !752)
!769 = !DILocalVariable(name: "i", scope: !752, file: !625, line: 426, type: !503)
!770 = !DILocation(line: 426, column: 13, scope: !752)
!771 = !DILocation(line: 428, column: 29, scope: !752)
!772 = !DILocation(line: 428, column: 47, scope: !752)
!773 = !DILocation(line: 428, column: 55, scope: !752)
!774 = !DILocation(line: 428, column: 61, scope: !752)
!775 = !DILocation(line: 429, column: 29, scope: !752)
!776 = !DILocation(line: 429, column: 47, scope: !752)
!777 = !DILocation(line: 429, column: 55, scope: !752)
!778 = !DILocation(line: 428, column: 66, scope: !752)
!779 = !DILocation(line: 428, column: 24, scope: !752)
!780 = !DILocation(line: 428, column: 22, scope: !752)
!781 = !DILocation(line: 428, column: 20, scope: !752)
!782 = !DILocation(line: 431, column: 35, scope: !752)
!783 = !DILocation(line: 431, column: 41, scope: !752)
!784 = !DILocation(line: 431, column: 48, scope: !752)
!785 = !DILocation(line: 431, column: 54, scope: !752)
!786 = !DILocation(line: 431, column: 46, scope: !752)
!787 = !DILocation(line: 431, column: 66, scope: !752)
!788 = !DILocation(line: 431, column: 64, scope: !752)
!789 = !DILocation(line: 432, column: 33, scope: !752)
!790 = !DILocation(line: 432, column: 31, scope: !752)
!791 = !DILocation(line: 432, column: 29, scope: !752)
!792 = !DILocation(line: 431, column: 15, scope: !752)
!793 = !DILocation(line: 431, column: 13, scope: !752)
!794 = !DILocation(line: 433, column: 13, scope: !795)
!795 = distinct !DILexicalBlock(scope: !752, file: !625, line: 433, column: 13)
!796 = !DILocation(line: 433, column: 17, scope: !795)
!797 = !DILocation(line: 433, column: 13, scope: !752)
!798 = !DILocation(line: 434, column: 20, scope: !795)
!799 = !DILocation(line: 434, column: 13, scope: !795)
!800 = !DILocation(line: 436, column: 45, scope: !752)
!801 = !DILocation(line: 436, column: 15, scope: !752)
!802 = !DILocation(line: 436, column: 13, scope: !752)
!803 = !DILocation(line: 437, column: 13, scope: !804)
!804 = distinct !DILexicalBlock(scope: !752, file: !625, line: 437, column: 13)
!805 = !DILocation(line: 437, column: 17, scope: !804)
!806 = !DILocation(line: 437, column: 13, scope: !752)
!807 = !DILocation(line: 438, column: 20, scope: !804)
!808 = !DILocation(line: 438, column: 13, scope: !804)
!809 = !DILocation(line: 440, column: 13, scope: !752)
!810 = !DILocation(line: 441, column: 16, scope: !811)
!811 = distinct !DILexicalBlock(scope: !752, file: !625, line: 441, column: 9)
!812 = !DILocation(line: 441, column: 14, scope: !811)
!813 = !DILocation(line: 441, column: 21, scope: !814)
!814 = !DILexicalBlockFile(scope: !815, file: !625, discriminator: 1)
!815 = distinct !DILexicalBlock(scope: !811, file: !625, line: 441, column: 9)
!816 = !DILocation(line: 441, column: 30, scope: !814)
!817 = !DILocation(line: 441, column: 26, scope: !814)
!818 = !DILocation(line: 441, column: 23, scope: !814)
!819 = !DILocation(line: 441, column: 9, scope: !814)
!820 = !DILocation(line: 442, column: 17, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !625, line: 442, column: 17)
!822 = distinct !DILexicalBlock(scope: !815, file: !625, line: 441, column: 65)
!823 = !DILocation(line: 442, column: 39, scope: !821)
!824 = !DILocation(line: 442, column: 23, scope: !821)
!825 = !DILocation(line: 442, column: 27, scope: !821)
!826 = !DILocation(line: 442, column: 21, scope: !821)
!827 = !DILocation(line: 442, column: 44, scope: !821)
!828 = !DILocation(line: 442, column: 42, scope: !821)
!829 = !DILocation(line: 442, column: 57, scope: !821)
!830 = !DILocation(line: 442, column: 63, scope: !821)
!831 = !DILocation(line: 442, column: 55, scope: !821)
!832 = !DILocation(line: 442, column: 17, scope: !822)
!833 = !DILocation(line: 443, column: 24, scope: !834)
!834 = distinct !DILexicalBlock(scope: !821, file: !625, line: 442, column: 74)
!835 = !DILocation(line: 443, column: 29, scope: !834)
!836 = !DILocation(line: 445, column: 24, scope: !834)
!837 = !DILocation(line: 445, column: 43, scope: !834)
!838 = !DILocation(line: 445, column: 27, scope: !834)
!839 = !DILocation(line: 445, column: 31, scope: !834)
!840 = !DILocation(line: 443, column: 17, scope: !834)
!841 = !DILocation(line: 446, column: 17, scope: !834)
!842 = !DILocation(line: 449, column: 43, scope: !822)
!843 = !DILocation(line: 449, column: 48, scope: !822)
!844 = !DILocation(line: 450, column: 43, scope: !822)
!845 = !DILocation(line: 450, column: 49, scope: !822)
!846 = !DILocation(line: 450, column: 56, scope: !822)
!847 = !DILocation(line: 450, column: 54, scope: !822)
!848 = !DILocation(line: 451, column: 59, scope: !822)
!849 = !DILocation(line: 451, column: 43, scope: !822)
!850 = !DILocation(line: 451, column: 47, scope: !822)
!851 = !DILocation(line: 452, column: 43, scope: !822)
!852 = !DILocation(line: 452, column: 49, scope: !822)
!853 = !DILocation(line: 449, column: 19, scope: !822)
!854 = !DILocation(line: 449, column: 17, scope: !822)
!855 = !DILocation(line: 453, column: 17, scope: !856)
!856 = distinct !DILexicalBlock(scope: !822, file: !625, line: 453, column: 17)
!857 = !DILocation(line: 453, column: 21, scope: !856)
!858 = !DILocation(line: 453, column: 17, scope: !822)
!859 = !DILocation(line: 454, column: 24, scope: !856)
!860 = !DILocation(line: 454, column: 17, scope: !856)
!861 = !DILocation(line: 456, column: 36, scope: !822)
!862 = !DILocation(line: 456, column: 20, scope: !822)
!863 = !DILocation(line: 456, column: 24, scope: !822)
!864 = !DILocation(line: 456, column: 17, scope: !822)
!865 = !DILocation(line: 457, column: 9, scope: !822)
!866 = !DILocation(line: 441, column: 61, scope: !867)
!867 = !DILexicalBlockFile(scope: !815, file: !625, discriminator: 2)
!868 = !DILocation(line: 441, column: 9, scope: !867)
!869 = distinct !{!869, !870}
!870 = !DILocation(line: 441, column: 9, scope: !752)
!871 = !DILocation(line: 458, column: 13, scope: !872)
!872 = distinct !DILexicalBlock(scope: !752, file: !625, line: 458, column: 13)
!873 = !DILocation(line: 458, column: 19, scope: !872)
!874 = !DILocation(line: 458, column: 17, scope: !872)
!875 = !DILocation(line: 458, column: 33, scope: !872)
!876 = !DILocation(line: 458, column: 39, scope: !872)
!877 = !DILocation(line: 458, column: 30, scope: !872)
!878 = !DILocation(line: 458, column: 13, scope: !752)
!879 = !DILocation(line: 459, column: 20, scope: !880)
!880 = distinct !DILexicalBlock(scope: !872, file: !625, line: 458, column: 50)
!881 = !DILocation(line: 459, column: 25, scope: !880)
!882 = !DILocation(line: 461, column: 20, scope: !880)
!883 = !DILocation(line: 461, column: 26, scope: !880)
!884 = !DILocation(line: 461, column: 39, scope: !880)
!885 = !DILocation(line: 461, column: 45, scope: !880)
!886 = !DILocation(line: 461, column: 43, scope: !880)
!887 = !DILocation(line: 461, column: 36, scope: !880)
!888 = !DILocation(line: 459, column: 13, scope: !880)
!889 = !DILocation(line: 462, column: 9, scope: !880)
!890 = !DILocation(line: 464, column: 9, scope: !752)
!891 = !DILocation(line: 467, column: 39, scope: !892)
!892 = distinct !DILexicalBlock(scope: !747, file: !625, line: 466, column: 12)
!893 = !DILocation(line: 467, column: 44, scope: !892)
!894 = !DILocation(line: 468, column: 39, scope: !892)
!895 = !DILocation(line: 468, column: 45, scope: !892)
!896 = !DILocation(line: 468, column: 51, scope: !892)
!897 = !DILocation(line: 468, column: 57, scope: !892)
!898 = !DILocation(line: 469, column: 39, scope: !892)
!899 = !DILocation(line: 469, column: 45, scope: !892)
!900 = !DILocation(line: 467, column: 15, scope: !892)
!901 = !DILocation(line: 467, column: 13, scope: !892)
!902 = !DILocation(line: 470, column: 13, scope: !903)
!903 = distinct !DILexicalBlock(scope: !892, file: !625, line: 470, column: 13)
!904 = !DILocation(line: 470, column: 17, scope: !903)
!905 = !DILocation(line: 470, column: 13, scope: !892)
!906 = !DILocation(line: 471, column: 20, scope: !903)
!907 = !DILocation(line: 471, column: 13, scope: !903)
!908 = !DILocation(line: 474, column: 5, scope: !728)
!909 = !DILocation(line: 475, column: 1, scope: !728)
!910 = distinct !DISubprogram(name: "cbs_vp9_read_unit", scope: !625, file: !625, line: 484, type: !676, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !705)
!911 = !DILocalVariable(name: "ctx", arg: 1, scope: !910, file: !625, line: 484, type: !637)
!912 = !DILocation(line: 484, column: 53, scope: !910)
!913 = !DILocalVariable(name: "unit", arg: 2, scope: !910, file: !625, line: 485, type: !663)
!914 = !DILocation(line: 485, column: 50, scope: !910)
!915 = !DILocalVariable(name: "frame", scope: !910, file: !625, line: 487, type: !516)
!916 = !DILocation(line: 487, column: 18, scope: !910)
!917 = !DILocalVariable(name: "gbc", scope: !910, file: !625, line: 488, type: !693)
!918 = !DILocation(line: 488, column: 19, scope: !910)
!919 = !DILocalVariable(name: "err", scope: !910, file: !625, line: 489, type: !503)
!920 = !DILocation(line: 489, column: 9, scope: !910)
!921 = !DILocalVariable(name: "pos", scope: !910, file: !625, line: 489, type: !503)
!922 = !DILocation(line: 489, column: 14, scope: !910)
!923 = !DILocation(line: 491, column: 31, scope: !910)
!924 = !DILocation(line: 491, column: 37, scope: !910)
!925 = !DILocation(line: 491, column: 47, scope: !910)
!926 = !DILocation(line: 491, column: 53, scope: !910)
!927 = !DILocation(line: 491, column: 45, scope: !910)
!928 = !DILocation(line: 491, column: 43, scope: !910)
!929 = !DILocation(line: 491, column: 11, scope: !910)
!930 = !DILocation(line: 491, column: 9, scope: !910)
!931 = !DILocation(line: 492, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !910, file: !625, line: 492, column: 9)
!933 = !DILocation(line: 492, column: 13, scope: !932)
!934 = !DILocation(line: 492, column: 9, scope: !910)
!935 = !DILocation(line: 493, column: 16, scope: !932)
!936 = !DILocation(line: 493, column: 9, scope: !932)
!937 = !DILocation(line: 495, column: 37, scope: !910)
!938 = !DILocation(line: 495, column: 42, scope: !910)
!939 = !DILocation(line: 495, column: 11, scope: !910)
!940 = !DILocation(line: 495, column: 9, scope: !910)
!941 = !DILocation(line: 497, column: 9, scope: !942)
!942 = distinct !DILexicalBlock(scope: !910, file: !625, line: 497, column: 9)
!943 = !DILocation(line: 497, column: 13, scope: !942)
!944 = !DILocation(line: 497, column: 9, scope: !910)
!945 = !DILocation(line: 498, column: 16, scope: !942)
!946 = !DILocation(line: 498, column: 9, scope: !942)
!947 = !DILocation(line: 499, column: 13, scope: !910)
!948 = !DILocation(line: 499, column: 19, scope: !910)
!949 = !DILocation(line: 499, column: 11, scope: !910)
!950 = !DILocation(line: 501, column: 30, scope: !910)
!951 = !DILocation(line: 501, column: 41, scope: !910)
!952 = !DILocation(line: 501, column: 11, scope: !910)
!953 = !DILocation(line: 501, column: 9, scope: !910)
!954 = !DILocation(line: 502, column: 9, scope: !955)
!955 = distinct !DILexicalBlock(scope: !910, file: !625, line: 502, column: 9)
!956 = !DILocation(line: 502, column: 13, scope: !955)
!957 = !DILocation(line: 502, column: 9, scope: !910)
!958 = !DILocation(line: 503, column: 16, scope: !955)
!959 = !DILocation(line: 503, column: 9, scope: !955)
!960 = !DILocation(line: 505, column: 11, scope: !910)
!961 = !DILocation(line: 505, column: 9, scope: !910)
!962 = !DILocation(line: 506, column: 5, scope: !910)
!963 = distinct !{!963, !962}
!964 = !DILocation(line: 506, column: 16, scope: !965)
!965 = !DILexicalBlockFile(scope: !966, file: !625, discriminator: 1)
!966 = distinct !DILexicalBlock(scope: !967, file: !625, line: 506, column: 14)
!967 = distinct !DILexicalBlock(scope: !910, file: !625, line: 506, column: 8)
!968 = !DILocation(line: 506, column: 20, scope: !965)
!969 = !DILocation(line: 506, column: 24, scope: !965)
!970 = !DILocation(line: 506, column: 14, scope: !965)
!971 = !DILocation(line: 506, column: 33, scope: !972)
!972 = !DILexicalBlockFile(scope: !973, file: !625, discriminator: 2)
!973 = distinct !DILexicalBlock(scope: !966, file: !625, line: 506, column: 31)
!974 = !DILocation(line: 506, column: 89, scope: !975)
!975 = !DILexicalBlockFile(scope: !972, file: !625, discriminator: 4)
!976 = !DILocation(line: 506, column: 89, scope: !972)
!977 = !DILocation(line: 506, column: 100, scope: !978)
!978 = !DILexicalBlockFile(scope: !967, file: !625, discriminator: 3)
!979 = !DILocation(line: 507, column: 9, scope: !910)
!980 = !DILocation(line: 508, column: 5, scope: !910)
!981 = distinct !{!981, !980}
!982 = !DILocation(line: 508, column: 16, scope: !983)
!983 = !DILexicalBlockFile(scope: !984, file: !625, discriminator: 1)
!984 = distinct !DILexicalBlock(scope: !985, file: !625, line: 508, column: 14)
!985 = distinct !DILexicalBlock(scope: !910, file: !625, line: 508, column: 8)
!986 = !DILocation(line: 508, column: 23, scope: !983)
!987 = !DILocation(line: 508, column: 29, scope: !983)
!988 = !DILocation(line: 508, column: 20, scope: !983)
!989 = !DILocation(line: 508, column: 14, scope: !983)
!990 = !DILocation(line: 508, column: 43, scope: !991)
!991 = !DILexicalBlockFile(scope: !992, file: !625, discriminator: 2)
!992 = distinct !DILexicalBlock(scope: !984, file: !625, line: 508, column: 41)
!993 = !DILocation(line: 508, column: 99, scope: !994)
!994 = !DILexicalBlockFile(scope: !991, file: !625, discriminator: 4)
!995 = !DILocation(line: 508, column: 99, scope: !991)
!996 = !DILocation(line: 508, column: 110, scope: !997)
!997 = !DILexicalBlockFile(scope: !985, file: !625, discriminator: 3)
!998 = !DILocation(line: 510, column: 9, scope: !999)
!999 = distinct !DILexicalBlock(scope: !910, file: !625, line: 510, column: 9)
!1000 = !DILocation(line: 510, column: 16, scope: !999)
!1001 = !DILocation(line: 510, column: 22, scope: !999)
!1002 = !DILocation(line: 510, column: 13, scope: !999)
!1003 = !DILocation(line: 510, column: 9, scope: !910)
!1004 = !DILocation(line: 512, column: 5, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !999, file: !625, line: 510, column: 33)
!1006 = !DILocation(line: 513, column: 41, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !999, file: !625, line: 512, column: 12)
!1008 = !DILocation(line: 513, column: 47, scope: !1007)
!1009 = !DILocation(line: 513, column: 27, scope: !1007)
!1010 = !DILocation(line: 513, column: 9, scope: !1007)
!1011 = !DILocation(line: 513, column: 16, scope: !1007)
!1012 = !DILocation(line: 513, column: 25, scope: !1007)
!1013 = !DILocation(line: 514, column: 14, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !625, line: 514, column: 13)
!1015 = !DILocation(line: 514, column: 21, scope: !1014)
!1016 = !DILocation(line: 514, column: 13, scope: !1007)
!1017 = !DILocation(line: 515, column: 13, scope: !1014)
!1018 = !DILocation(line: 517, column: 23, scope: !1007)
!1019 = !DILocation(line: 517, column: 29, scope: !1007)
!1020 = !DILocation(line: 517, column: 36, scope: !1007)
!1021 = !DILocation(line: 517, column: 34, scope: !1007)
!1022 = !DILocation(line: 517, column: 9, scope: !1007)
!1023 = !DILocation(line: 517, column: 16, scope: !1007)
!1024 = !DILocation(line: 517, column: 21, scope: !1007)
!1025 = !DILocation(line: 518, column: 28, scope: !1007)
!1026 = !DILocation(line: 518, column: 34, scope: !1007)
!1027 = !DILocation(line: 518, column: 46, scope: !1007)
!1028 = !DILocation(line: 518, column: 44, scope: !1007)
!1029 = !DILocation(line: 518, column: 9, scope: !1007)
!1030 = !DILocation(line: 518, column: 16, scope: !1007)
!1031 = !DILocation(line: 518, column: 26, scope: !1007)
!1032 = !DILocation(line: 521, column: 5, scope: !910)
!1033 = !DILocation(line: 522, column: 1, scope: !910)
!1034 = distinct !DISubprogram(name: "cbs_vp9_write_unit", scope: !625, file: !625, line: 524, type: !676, isLocal: true, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !705)
!1035 = !DILocalVariable(name: "ctx", arg: 1, scope: !1034, file: !625, line: 524, type: !637)
!1036 = !DILocation(line: 524, column: 54, scope: !1034)
!1037 = !DILocalVariable(name: "unit", arg: 2, scope: !1034, file: !625, line: 525, type: !663)
!1038 = !DILocation(line: 525, column: 51, scope: !1034)
!1039 = !DILocalVariable(name: "priv", scope: !1034, file: !625, line: 527, type: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamVP9Context", file: !464, line: 214, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamVP9Context", file: !464, line: 192, size: 1664, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1064, !1065}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1042, file: !464, line: 193, baseType: !503, size: 32, align: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cols", scope: !1042, file: !464, line: 196, baseType: !554, size: 16, align: 16, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mi_rows", scope: !1042, file: !464, line: 197, baseType: !554, size: 16, align: 16, offset: 48)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "sb64_cols", scope: !1042, file: !464, line: 199, baseType: !554, size: 16, align: 16, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "sb64_rows", scope: !1042, file: !464, line: 200, baseType: !554, size: 16, align: 16, offset: 80)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1042, file: !464, line: 202, baseType: !503, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1042, file: !464, line: 203, baseType: !503, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_x", scope: !1042, file: !464, line: 205, baseType: !514, size: 8, align: 8, offset: 160)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_y", scope: !1042, file: !464, line: 206, baseType: !514, size: 8, align: 8, offset: 168)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !1042, file: !464, line: 207, baseType: !503, size: 32, align: 32, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1042, file: !464, line: 209, baseType: !1055, size: 1280, align: 32, offset: 224)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 1280, align: 32, elements: !761)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9ReferenceFrameState", file: !464, line: 190, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9ReferenceFrameState", file: !464, line: 184, size: 160, align: 32, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1057, file: !464, line: 185, baseType: !503, size: 32, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1057, file: !464, line: 186, baseType: !503, size: 32, align: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_x", scope: !1057, file: !464, line: 187, baseType: !503, size: 32, align: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "subsampling_y", scope: !1057, file: !464, line: 188, baseType: !503, size: 32, align: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !1057, file: !464, line: 189, baseType: !503, size: 32, align: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer", scope: !1042, file: !464, line: 212, baseType: !602, size: 64, align: 64, offset: 1536)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_size", scope: !1042, file: !464, line: 213, baseType: !604, size: 64, align: 64, offset: 1600)
!1066 = !DILocation(line: 527, column: 31, scope: !1034)
!1067 = !DILocation(line: 527, column: 38, scope: !1034)
!1068 = !DILocation(line: 527, column: 43, scope: !1034)
!1069 = !DILocalVariable(name: "frame", scope: !1034, file: !625, line: 528, type: !516)
!1070 = !DILocation(line: 528, column: 18, scope: !1034)
!1071 = !DILocation(line: 528, column: 26, scope: !1034)
!1072 = !DILocation(line: 528, column: 32, scope: !1034)
!1073 = !DILocalVariable(name: "pbc", scope: !1034, file: !625, line: 529, type: !714)
!1074 = !DILocation(line: 529, column: 19, scope: !1034)
!1075 = !DILocalVariable(name: "err", scope: !1034, file: !625, line: 530, type: !503)
!1076 = !DILocation(line: 530, column: 9, scope: !1034)
!1077 = !DILocation(line: 532, column: 10, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1034, file: !625, line: 532, column: 9)
!1079 = !DILocation(line: 532, column: 16, scope: !1078)
!1080 = !DILocation(line: 532, column: 9, scope: !1034)
!1081 = !DILocation(line: 534, column: 9, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !625, line: 532, column: 30)
!1083 = !DILocation(line: 534, column: 15, scope: !1082)
!1084 = !DILocation(line: 534, column: 33, scope: !1082)
!1085 = !DILocation(line: 537, column: 28, scope: !1082)
!1086 = !DILocation(line: 537, column: 34, scope: !1082)
!1087 = !DILocation(line: 537, column: 27, scope: !1082)
!1088 = !DILocation(line: 537, column: 48, scope: !1082)
!1089 = !DILocation(line: 537, column: 54, scope: !1082)
!1090 = !DILocation(line: 537, column: 15, scope: !1082)
!1091 = !DILocation(line: 537, column: 13, scope: !1082)
!1092 = !DILocation(line: 538, column: 13, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !625, line: 538, column: 13)
!1094 = !DILocation(line: 538, column: 17, scope: !1093)
!1095 = !DILocation(line: 538, column: 13, scope: !1082)
!1096 = !DILocation(line: 539, column: 20, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !625, line: 538, column: 22)
!1098 = !DILocation(line: 539, column: 25, scope: !1097)
!1099 = !DILocation(line: 541, column: 41, scope: !1097)
!1100 = !DILocation(line: 541, column: 47, scope: !1097)
!1101 = !DILocation(line: 539, column: 13, scope: !1097)
!1102 = !DILocation(line: 542, column: 20, scope: !1097)
!1103 = !DILocation(line: 542, column: 13, scope: !1097)
!1104 = !DILocation(line: 544, column: 5, scope: !1082)
!1105 = !DILocation(line: 546, column: 25, scope: !1034)
!1106 = !DILocation(line: 546, column: 31, scope: !1034)
!1107 = !DILocation(line: 546, column: 45, scope: !1034)
!1108 = !DILocation(line: 546, column: 51, scope: !1034)
!1109 = !DILocation(line: 546, column: 5, scope: !1034)
!1110 = !DILocation(line: 548, column: 31, scope: !1034)
!1111 = !DILocation(line: 548, column: 42, scope: !1034)
!1112 = !DILocation(line: 548, column: 11, scope: !1034)
!1113 = !DILocation(line: 548, column: 9, scope: !1034)
!1114 = !DILocation(line: 549, column: 9, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1034, file: !625, line: 549, column: 9)
!1116 = !DILocation(line: 549, column: 13, scope: !1115)
!1117 = !DILocation(line: 549, column: 9, scope: !1034)
!1118 = !DILocation(line: 550, column: 9, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1115, file: !625, line: 549, column: 19)
!1120 = !DILocation(line: 550, column: 15, scope: !1119)
!1121 = !DILocation(line: 550, column: 33, scope: !1119)
!1122 = !DILocation(line: 551, column: 9, scope: !1119)
!1123 = !DILocation(line: 553, column: 9, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1034, file: !625, line: 553, column: 9)
!1125 = !DILocation(line: 553, column: 13, scope: !1124)
!1126 = !DILocation(line: 553, column: 9, scope: !1034)
!1127 = !DILocation(line: 554, column: 16, scope: !1124)
!1128 = !DILocation(line: 554, column: 9, scope: !1124)
