; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opusdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opusdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !910, line: 77, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914}
!912 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!914 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !910, line: 83, size: 32, align: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!918 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltBlockSize", file: !920, line: 56, size: 32, align: 32, elements: !921)
!920 = !DIFile(filename: "libavcodec/opus_celt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!921 = !{!922, !923, !924, !925, !926}
!922 = !DIEnumerator(name: "CELT_BLOCK_120", value: 0)
!923 = !DIEnumerator(name: "CELT_BLOCK_240", value: 1)
!924 = !DIEnumerator(name: "CELT_BLOCK_480", value: 2)
!925 = !DIEnumerator(name: "CELT_BLOCK_960", value: 3)
!926 = !DIEnumerator(name: "CELT_BLOCK_NB", value: 4)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltSpread", file: !920, line: 49, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "CELT_SPREAD_NONE", value: 0)
!930 = !DIEnumerator(name: "CELT_SPREAD_LIGHT", value: 1)
!931 = !DIEnumerator(name: "CELT_SPREAD_NORMAL", value: 2)
!932 = !DIEnumerator(name: "CELT_SPREAD_AGGRESSIVE", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpusMode", file: !934, line: 62, size: 32, align: 32, elements: !935)
!934 = !DIFile(filename: "libavcodec/opus.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!935 = !{!936, !937, !938, !939}
!936 = !DIEnumerator(name: "OPUS_MODE_SILK", value: 0)
!937 = !DIEnumerator(name: "OPUS_MODE_HYBRID", value: 1)
!938 = !DIEnumerator(name: "OPUS_MODE_CELT", value: 2)
!939 = !DIEnumerator(name: "OPUS_MODE_NB", value: 3)
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpusBandwidth", file: !934, line: 70, size: 32, align: 32, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947}
!942 = !DIEnumerator(name: "OPUS_BANDWIDTH_NARROWBAND", value: 0)
!943 = !DIEnumerator(name: "OPUS_BANDWIDTH_MEDIUMBAND", value: 1)
!944 = !DIEnumerator(name: "OPUS_BANDWIDTH_WIDEBAND", value: 2)
!945 = !DIEnumerator(name: "OPUS_BANDWIDTH_SUPERWIDEBAND", value: 3)
!946 = !DIEnumerator(name: "OPUS_BANDWIDTH_FULLBAND", value: 4)
!947 = !DIEnumerator(name: "OPUS_BANDWITH_NB", value: 5)
!948 = !{!949, !951, !952, !953, !955, !960}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!951 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !958, line: 48, baseType: !959)
!958 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!959 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!963 = !{!964, !1720, !1721, !1727, !2052, !2056}
!964 = distinct !DIGlobalVariable(name: "ff_opus_decoder", scope: !0, file: !965, line: 729, type: !966, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_opus_decoder)
!965 = !DIFile(filename: "libavcodec/opusdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !968)
!968 = !{!969, !973, !974, !975, !976, !977, !986, !989, !992, !995, !1000, !1001, !1076, !1084, !1085, !1086, !1088, !1635, !1641, !1649, !1653, !1654, !1691, !1695, !1699, !1700, !1704, !1708, !1709, !1713, !1714, !1715}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !14, line: 3475, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !967, file: !14, line: 3480, baseType: !970, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !967, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !967, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !967, file: !14, line: 3487, baseType: !951, size: 32, align: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !967, file: !14, line: 3488, baseType: !978, size: 64, align: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !981, line: 61, baseType: !982)
!981 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !981, line: 58, size: 64, align: 32, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !982, file: !981, line: 59, baseType: !951, size: 32, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !982, file: !981, line: 60, baseType: !951, size: 32, align: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !967, file: !14, line: 3489, baseType: !987, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !967, file: !14, line: 3490, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !967, file: !14, line: 3491, baseType: !993, size: 64, align: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !967, file: !14, line: 3492, baseType: !996, size: 64, align: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !958, line: 55, baseType: !999)
!999 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !967, file: !14, line: 3493, baseType: !957, size: 8, align: 8, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !967, file: !14, line: 3494, baseType: !1002, size: 64, align: 64, offset: 640)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1012, !1035, !1036, !1037, !1038, !1042, !1048, !1050, !1054}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1005, file: !713, line: 72, baseType: !970, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1005, file: !713, line: 78, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!970, !954}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1005, file: !713, line: 85, baseType: !1013, size: 64, align: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1031, !1032, !1033, !1034}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !691, line: 247, baseType: !970, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1015, file: !691, line: 253, baseType: !970, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1015, file: !691, line: 259, baseType: !951, size: 32, align: 32, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1015, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1015, file: !691, line: 271, baseType: !1022, size: 64, align: 64, offset: 192)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1015, file: !691, line: 265, size: 64, align: 64, elements: !1023)
!1023 = !{!1024, !1027, !1029, !1030}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1022, file: !691, line: 266, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !958, line: 40, baseType: !1026)
!1026 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1022, file: !691, line: 267, baseType: !1028, size: 64, align: 64)
!1028 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1022, file: !691, line: 268, baseType: !970, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1022, file: !691, line: 270, baseType: !980, size: 64, align: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1015, file: !691, line: 272, baseType: !1028, size: 64, align: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1015, file: !691, line: 273, baseType: !1028, size: 64, align: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !691, line: 275, baseType: !951, size: 32, align: 32, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1015, file: !691, line: 300, baseType: !970, size: 64, align: 64, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1005, file: !713, line: 93, baseType: !951, size: 32, align: 32, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1005, file: !713, line: 99, baseType: !951, size: 32, align: 32, offset: 224)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1005, file: !713, line: 108, baseType: !951, size: 32, align: 32, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1005, file: !713, line: 113, baseType: !1039, size: 64, align: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!954, !954, !954}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1005, file: !713, line: 123, baseType: !1043, size: 64, align: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!1046, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1005, file: !713, line: 130, baseType: !1049, size: 32, align: 32, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1005, file: !713, line: 136, baseType: !1051, size: 64, align: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1049, !954}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1005, file: !713, line: 142, baseType: !1055, size: 64, align: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!951, !1058, !954, !970, !951}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1061)
!1061 = !{!1062, !1074, !1075}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1060, file: !691, line: 360, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1066, file: !691, line: 307, baseType: !970, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1066, file: !691, line: 313, baseType: !1028, size: 64, align: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1066, file: !691, line: 313, baseType: !1028, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1066, file: !691, line: 318, baseType: !1028, size: 64, align: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1066, file: !691, line: 318, baseType: !1028, size: 64, align: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1066, file: !691, line: 323, baseType: !951, size: 32, align: 32, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1060, file: !691, line: 364, baseType: !951, size: 32, align: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1060, file: !691, line: 368, baseType: !951, size: 32, align: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !967, file: !14, line: 3495, baseType: !1077, size: 64, align: 64, offset: 704)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1080, file: !14, line: 3402, baseType: !951, size: 32, align: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1080, file: !14, line: 3403, baseType: !970, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !967, file: !14, line: 3507, baseType: !970, size: 64, align: 64, offset: 768)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !967, file: !14, line: 3516, baseType: !951, size: 32, align: 32, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !14, line: 3517, baseType: !1087, size: 64, align: 64, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !967, file: !14, line: 3527, baseType: !1089, size: 64, align: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!951, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1102, !1103, !1104, !1105, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1384, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1573, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1094, file: !14, line: 1561, baseType: !1002, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1094, file: !14, line: 1562, baseType: !951, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1094, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1094, file: !14, line: 1565, baseType: !1100, size: 64, align: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1094, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1094, file: !14, line: 1581, baseType: !952, size: 32, align: 32, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1094, file: !14, line: 1583, baseType: !954, size: 64, align: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1094, file: !14, line: 1591, baseType: !1106, size: 64, align: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1108, line: 129, size: 1664, align: 64, elements: !1109)
!1108 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1109 = !{!1110, !1111, !1112, !1113, !1209, !1230, !1231, !1260, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1107, file: !1108, line: 136, baseType: !951, size: 32, align: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1107, file: !1108, line: 151, baseType: !951, size: 32, align: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1107, file: !1108, line: 157, baseType: !951, size: 32, align: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1107, file: !1108, line: 159, baseType: !1114, size: 64, align: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1117)
!1117 = !{!1118, !1122, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1161, !1163, !1164, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1197, !1198, !1199, !1200, !1201, !1202, !1205, !1206, !1207, !1208}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !744, line: 282, baseType: !1119, size: 512, align: 64)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 512, align: 64, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 8)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1116, file: !744, line: 299, baseType: !1123, size: 256, align: 32, offset: 512)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 256, align: 32, elements: !1120)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1116, file: !744, line: 315, baseType: !955, size: 64, align: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1116, file: !744, line: 326, baseType: !951, size: 32, align: 32, offset: 832)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1116, file: !744, line: 326, baseType: !951, size: 32, align: 32, offset: 864)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1116, file: !744, line: 334, baseType: !951, size: 32, align: 32, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1116, file: !744, line: 341, baseType: !951, size: 32, align: 32, offset: 928)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1116, file: !744, line: 346, baseType: !951, size: 32, align: 32, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1116, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1116, file: !744, line: 356, baseType: !980, size: 64, align: 32, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !744, line: 361, baseType: !1025, size: 64, align: 64, offset: 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1116, file: !744, line: 369, baseType: !1025, size: 64, align: 64, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1116, file: !744, line: 377, baseType: !1025, size: 64, align: 64, offset: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1116, file: !744, line: 382, baseType: !951, size: 32, align: 32, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1116, file: !744, line: 386, baseType: !951, size: 32, align: 32, offset: 1312)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1116, file: !744, line: 391, baseType: !951, size: 32, align: 32, offset: 1344)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1116, file: !744, line: 396, baseType: !954, size: 64, align: 64, offset: 1408)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1116, file: !744, line: 403, baseType: !1140, size: 512, align: 64, offset: 1472)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 512, align: 64, elements: !1120)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1116, file: !744, line: 410, baseType: !951, size: 32, align: 32, offset: 1984)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1116, file: !744, line: 415, baseType: !951, size: 32, align: 32, offset: 2016)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1116, file: !744, line: 420, baseType: !951, size: 32, align: 32, offset: 2048)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1116, file: !744, line: 425, baseType: !951, size: 32, align: 32, offset: 2080)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1116, file: !744, line: 435, baseType: !1025, size: 64, align: 64, offset: 2112)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1116, file: !744, line: 440, baseType: !951, size: 32, align: 32, offset: 2176)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1116, file: !744, line: 445, baseType: !998, size: 64, align: 64, offset: 2240)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1116, file: !744, line: 459, baseType: !1149, size: 512, align: 64, offset: 2304)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 512, align: 64, elements: !1120)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1152, line: 94, baseType: !1153)
!1152 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1152, line: 81, size: 192, align: 64, elements: !1154)
!1154 = !{!1155, !1159, !1160}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1153, file: !1152, line: 82, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1152, line: 73, baseType: !1158)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1152, line: 73, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !1152, line: 89, baseType: !956, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !1152, line: 93, baseType: !951, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1116, file: !744, line: 473, baseType: !1162, size: 64, align: 64, offset: 2816)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1116, file: !744, line: 477, baseType: !951, size: 32, align: 32, offset: 2880)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1116, file: !744, line: 479, baseType: !1165, size: 64, align: 64, offset: 2944)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1178}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !744, line: 203, baseType: !956, size: 64, align: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !744, line: 204, baseType: !951, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1168, file: !744, line: 205, baseType: !1174, size: 64, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1176, line: 86, baseType: !1177)
!1176 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1176, line: 86, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1168, file: !744, line: 206, baseType: !1150, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1116, file: !744, line: 480, baseType: !951, size: 32, align: 32, offset: 3008)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !744, line: 505, baseType: !951, size: 32, align: 32, offset: 3040)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1116, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1116, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1116, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1116, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1116, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1116, file: !744, line: 532, baseType: !1025, size: 64, align: 64, offset: 3264)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1116, file: !744, line: 539, baseType: !1025, size: 64, align: 64, offset: 3328)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1116, file: !744, line: 547, baseType: !1025, size: 64, align: 64, offset: 3392)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1116, file: !744, line: 554, baseType: !1174, size: 64, align: 64, offset: 3456)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1116, file: !744, line: 563, baseType: !951, size: 32, align: 32, offset: 3520)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1116, file: !744, line: 572, baseType: !951, size: 32, align: 32, offset: 3552)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1116, file: !744, line: 581, baseType: !951, size: 32, align: 32, offset: 3584)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1116, file: !744, line: 588, baseType: !1194, size: 64, align: 64, offset: 3648)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !958, line: 36, baseType: !1196)
!1196 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1116, file: !744, line: 593, baseType: !951, size: 32, align: 32, offset: 3712)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1116, file: !744, line: 596, baseType: !951, size: 32, align: 32, offset: 3744)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1116, file: !744, line: 599, baseType: !1150, size: 64, align: 64, offset: 3776)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1116, file: !744, line: 605, baseType: !1150, size: 64, align: 64, offset: 3840)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1116, file: !744, line: 616, baseType: !1150, size: 64, align: 64, offset: 3904)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1116, file: !744, line: 626, baseType: !1203, size: 64, align: 64, offset: 3968)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1204, line: 216, baseType: !999)
!1204 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1116, file: !744, line: 627, baseType: !1203, size: 64, align: 64, offset: 4032)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1116, file: !744, line: 628, baseType: !1203, size: 64, align: 64, offset: 4096)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1116, file: !744, line: 629, baseType: !1203, size: 64, align: 64, offset: 4160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1116, file: !744, line: 645, baseType: !1150, size: 64, align: 64, offset: 4224)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1107, file: !1108, line: 161, baseType: !1210, size: 64, align: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1108, line: 117, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1108, line: 100, size: 832, align: 64, elements: !1213)
!1213 = !{!1214, !1221, !1222, !1223, !1224, !1225, !1227, !1228, !1229}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1212, file: !1108, line: 105, baseType: !1215, size: 256, align: 64)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1216, size: 256, align: 64, elements: !1219)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1152, line: 238, baseType: !1218)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1152, line: 238, flags: DIFlagFwdDecl)
!1219 = !{!1220}
!1220 = !DISubrange(count: 4)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1212, file: !1108, line: 110, baseType: !951, size: 32, align: 32, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1212, file: !1108, line: 111, baseType: !951, size: 32, align: 32, offset: 288)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1212, file: !1108, line: 111, baseType: !951, size: 32, align: 32, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1212, file: !1108, line: 112, baseType: !1123, size: 256, align: 32, offset: 352)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1212, file: !1108, line: 113, baseType: !1226, size: 128, align: 32, offset: 608)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 128, align: 32, elements: !1219)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1212, file: !1108, line: 114, baseType: !951, size: 32, align: 32, offset: 736)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1212, file: !1108, line: 115, baseType: !951, size: 32, align: 32, offset: 768)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1212, file: !1108, line: 116, baseType: !951, size: 32, align: 32, offset: 800)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1107, file: !1108, line: 163, baseType: !954, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1107, file: !1108, line: 165, baseType: !1232, size: 128, align: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1108, line: 122, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1108, line: 119, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1259}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1233, file: !1108, line: 120, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1255, !1256, !1257, !1258}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1238, file: !14, line: 1451, baseType: !1150, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1238, file: !14, line: 1461, baseType: !1025, size: 64, align: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1238, file: !14, line: 1467, baseType: !1025, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !14, line: 1468, baseType: !956, size: 64, align: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1238, file: !14, line: 1469, baseType: !951, size: 32, align: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1238, file: !14, line: 1470, baseType: !951, size: 32, align: 32, offset: 288)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1238, file: !14, line: 1474, baseType: !951, size: 32, align: 32, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1238, file: !14, line: 1479, baseType: !1248, size: 64, align: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1250, file: !14, line: 1412, baseType: !956, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1250, file: !14, line: 1413, baseType: !951, size: 32, align: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1250, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1238, file: !14, line: 1480, baseType: !951, size: 32, align: 32, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1238, file: !14, line: 1486, baseType: !1025, size: 64, align: 64, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1238, file: !14, line: 1488, baseType: !1025, size: 64, align: 64, offset: 576)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1238, file: !14, line: 1497, baseType: !1025, size: 64, align: 64, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1233, file: !1108, line: 121, baseType: !1114, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1107, file: !1108, line: 166, baseType: !1261, size: 128, align: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1108, line: 127, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1108, line: 124, size: 128, align: 64, elements: !1263)
!1263 = !{!1264, !1338}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1262, file: !1108, line: 125, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1295, !1299, !1300, !1335, !1336, !1337}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1268, file: !14, line: 5751, baseType: !1002, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1268, file: !14, line: 5756, baseType: !1272, size: 64, align: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1280, !1281, !1282, !1286, !1290, !1294}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1274, file: !14, line: 5797, baseType: !970, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1274, file: !14, line: 5804, baseType: !1278, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1274, file: !14, line: 5815, baseType: !1002, size: 64, align: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1274, file: !14, line: 5825, baseType: !951, size: 32, align: 32, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1274, file: !14, line: 5826, baseType: !1283, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!951, !1266}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1274, file: !14, line: 5827, baseType: !1287, size: 64, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!951, !1266, !1236}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1274, file: !14, line: 5828, baseType: !1291, size: 64, align: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{null, !1266}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1274, file: !14, line: 5829, baseType: !1291, size: 64, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1268, file: !14, line: 5762, baseType: !1296, size: 64, align: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1298)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1268, file: !14, line: 5768, baseType: !954, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1268, file: !14, line: 5775, baseType: !1301, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1303, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1303, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1303, file: !14, line: 3948, baseType: !1308, size: 32, align: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !958, line: 51, baseType: !952)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1303, file: !14, line: 3958, baseType: !956, size: 64, align: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1303, file: !14, line: 3962, baseType: !951, size: 32, align: 32, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1303, file: !14, line: 3968, baseType: !951, size: 32, align: 32, offset: 224)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1303, file: !14, line: 3973, baseType: !1025, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1303, file: !14, line: 3986, baseType: !951, size: 32, align: 32, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1303, file: !14, line: 3999, baseType: !951, size: 32, align: 32, offset: 352)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1303, file: !14, line: 4004, baseType: !951, size: 32, align: 32, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1303, file: !14, line: 4005, baseType: !951, size: 32, align: 32, offset: 416)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1303, file: !14, line: 4010, baseType: !951, size: 32, align: 32, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1303, file: !14, line: 4011, baseType: !951, size: 32, align: 32, offset: 480)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1303, file: !14, line: 4020, baseType: !980, size: 64, align: 32, offset: 512)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1303, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1303, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1303, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1303, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1303, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1303, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1303, file: !14, line: 4039, baseType: !951, size: 32, align: 32, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1303, file: !14, line: 4046, baseType: !998, size: 64, align: 64, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1303, file: !14, line: 4050, baseType: !951, size: 32, align: 32, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1303, file: !14, line: 4054, baseType: !951, size: 32, align: 32, offset: 928)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1303, file: !14, line: 4061, baseType: !951, size: 32, align: 32, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1303, file: !14, line: 4065, baseType: !951, size: 32, align: 32, offset: 992)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1303, file: !14, line: 4073, baseType: !951, size: 32, align: 32, offset: 1024)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1303, file: !14, line: 4080, baseType: !951, size: 32, align: 32, offset: 1056)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1303, file: !14, line: 4084, baseType: !951, size: 32, align: 32, offset: 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1268, file: !14, line: 5781, baseType: !1301, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1268, file: !14, line: 5787, baseType: !980, size: 64, align: 32, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1268, file: !14, line: 5793, baseType: !980, size: 64, align: 32, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1262, file: !1108, line: 126, baseType: !951, size: 32, align: 32, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1107, file: !1108, line: 172, baseType: !1236, size: 64, align: 64, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1107, file: !1108, line: 177, baseType: !956, size: 64, align: 64, offset: 640)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1107, file: !1108, line: 178, baseType: !952, size: 32, align: 32, offset: 704)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1107, file: !1108, line: 180, baseType: !954, size: 64, align: 64, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1107, file: !1108, line: 185, baseType: !951, size: 32, align: 32, offset: 832)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1107, file: !1108, line: 190, baseType: !954, size: 64, align: 64, offset: 896)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1107, file: !1108, line: 195, baseType: !951, size: 32, align: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1107, file: !1108, line: 200, baseType: !1236, size: 64, align: 64, offset: 1024)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1107, file: !1108, line: 201, baseType: !951, size: 32, align: 32, offset: 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1107, file: !1108, line: 202, baseType: !1114, size: 64, align: 64, offset: 1152)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1107, file: !1108, line: 203, baseType: !951, size: 32, align: 32, offset: 1216)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1107, file: !1108, line: 205, baseType: !951, size: 32, align: 32, offset: 1248)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1107, file: !1108, line: 206, baseType: !951, size: 32, align: 32, offset: 1280)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1107, file: !1108, line: 209, baseType: !1203, size: 64, align: 64, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1107, file: !1108, line: 212, baseType: !1203, size: 64, align: 64, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1107, file: !1108, line: 213, baseType: !1114, size: 64, align: 64, offset: 1472)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1107, file: !1108, line: 215, baseType: !951, size: 32, align: 32, offset: 1536)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1107, file: !1108, line: 217, baseType: !951, size: 32, align: 32, offset: 1568)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1107, file: !1108, line: 220, baseType: !951, size: 32, align: 32, offset: 1600)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1094, file: !14, line: 1598, baseType: !954, size: 64, align: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1094, file: !14, line: 1606, baseType: !1025, size: 64, align: 64, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1094, file: !14, line: 1614, baseType: !951, size: 32, align: 32, offset: 512)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1094, file: !14, line: 1622, baseType: !951, size: 32, align: 32, offset: 544)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1094, file: !14, line: 1628, baseType: !951, size: 32, align: 32, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1094, file: !14, line: 1636, baseType: !951, size: 32, align: 32, offset: 608)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1094, file: !14, line: 1643, baseType: !951, size: 32, align: 32, offset: 640)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1094, file: !14, line: 1657, baseType: !956, size: 64, align: 64, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1094, file: !14, line: 1658, baseType: !951, size: 32, align: 32, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1094, file: !14, line: 1679, baseType: !980, size: 64, align: 32, offset: 800)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1094, file: !14, line: 1688, baseType: !951, size: 32, align: 32, offset: 864)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1094, file: !14, line: 1712, baseType: !951, size: 32, align: 32, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1094, file: !14, line: 1729, baseType: !951, size: 32, align: 32, offset: 928)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1094, file: !14, line: 1729, baseType: !951, size: 32, align: 32, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1094, file: !14, line: 1744, baseType: !951, size: 32, align: 32, offset: 992)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1094, file: !14, line: 1744, baseType: !951, size: 32, align: 32, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1094, file: !14, line: 1751, baseType: !951, size: 32, align: 32, offset: 1056)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1094, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1094, file: !14, line: 1791, baseType: !1377, size: 64, align: 64, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{null, !1380, !1381, !1383, !951, !951, !951}
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1094, file: !14, line: 1808, baseType: !1385, size: 64, align: 64, offset: 1216)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!473, !1380, !987}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1094, file: !14, line: 1816, baseType: !951, size: 32, align: 32, offset: 1280)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1094, file: !14, line: 1825, baseType: !950, size: 32, align: 32, offset: 1312)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1094, file: !14, line: 1830, baseType: !951, size: 32, align: 32, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1094, file: !14, line: 1838, baseType: !950, size: 32, align: 32, offset: 1376)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1094, file: !14, line: 1846, baseType: !951, size: 32, align: 32, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1094, file: !14, line: 1851, baseType: !951, size: 32, align: 32, offset: 1440)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1094, file: !14, line: 1861, baseType: !950, size: 32, align: 32, offset: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1094, file: !14, line: 1868, baseType: !950, size: 32, align: 32, offset: 1504)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1094, file: !14, line: 1875, baseType: !950, size: 32, align: 32, offset: 1536)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1094, file: !14, line: 1882, baseType: !950, size: 32, align: 32, offset: 1568)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1094, file: !14, line: 1889, baseType: !950, size: 32, align: 32, offset: 1600)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1094, file: !14, line: 1896, baseType: !950, size: 32, align: 32, offset: 1632)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1094, file: !14, line: 1903, baseType: !950, size: 32, align: 32, offset: 1664)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1094, file: !14, line: 1910, baseType: !951, size: 32, align: 32, offset: 1696)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1094, file: !14, line: 1915, baseType: !951, size: 32, align: 32, offset: 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1094, file: !14, line: 1926, baseType: !1383, size: 64, align: 64, offset: 1792)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1094, file: !14, line: 1935, baseType: !980, size: 64, align: 32, offset: 1856)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1094, file: !14, line: 1942, baseType: !951, size: 32, align: 32, offset: 1920)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1094, file: !14, line: 1948, baseType: !951, size: 32, align: 32, offset: 1952)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1094, file: !14, line: 1954, baseType: !951, size: 32, align: 32, offset: 1984)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1094, file: !14, line: 1960, baseType: !951, size: 32, align: 32, offset: 2016)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1094, file: !14, line: 1984, baseType: !951, size: 32, align: 32, offset: 2048)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1094, file: !14, line: 1991, baseType: !951, size: 32, align: 32, offset: 2080)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1094, file: !14, line: 1996, baseType: !951, size: 32, align: 32, offset: 2112)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1094, file: !14, line: 2004, baseType: !951, size: 32, align: 32, offset: 2144)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1094, file: !14, line: 2011, baseType: !951, size: 32, align: 32, offset: 2176)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1094, file: !14, line: 2018, baseType: !951, size: 32, align: 32, offset: 2208)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1094, file: !14, line: 2027, baseType: !951, size: 32, align: 32, offset: 2240)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1094, file: !14, line: 2034, baseType: !951, size: 32, align: 32, offset: 2272)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1094, file: !14, line: 2044, baseType: !951, size: 32, align: 32, offset: 2304)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1094, file: !14, line: 2054, baseType: !1419, size: 64, align: 64, offset: 2368)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !958, line: 49, baseType: !1421)
!1421 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1094, file: !14, line: 2061, baseType: !1419, size: 64, align: 64, offset: 2432)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1094, file: !14, line: 2066, baseType: !951, size: 32, align: 32, offset: 2496)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1094, file: !14, line: 2070, baseType: !951, size: 32, align: 32, offset: 2528)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1094, file: !14, line: 2078, baseType: !951, size: 32, align: 32, offset: 2560)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1094, file: !14, line: 2085, baseType: !951, size: 32, align: 32, offset: 2592)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1094, file: !14, line: 2092, baseType: !951, size: 32, align: 32, offset: 2624)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1094, file: !14, line: 2099, baseType: !951, size: 32, align: 32, offset: 2656)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1094, file: !14, line: 2106, baseType: !951, size: 32, align: 32, offset: 2688)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1094, file: !14, line: 2113, baseType: !951, size: 32, align: 32, offset: 2720)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1094, file: !14, line: 2120, baseType: !951, size: 32, align: 32, offset: 2752)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1094, file: !14, line: 2125, baseType: !951, size: 32, align: 32, offset: 2784)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1094, file: !14, line: 2133, baseType: !951, size: 32, align: 32, offset: 2816)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1094, file: !14, line: 2140, baseType: !951, size: 32, align: 32, offset: 2848)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1094, file: !14, line: 2145, baseType: !951, size: 32, align: 32, offset: 2880)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1094, file: !14, line: 2153, baseType: !951, size: 32, align: 32, offset: 2912)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1094, file: !14, line: 2158, baseType: !951, size: 32, align: 32, offset: 2944)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1094, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1094, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1094, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1094, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1094, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1094, file: !14, line: 2203, baseType: !951, size: 32, align: 32, offset: 3136)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1094, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1094, file: !14, line: 2212, baseType: !951, size: 32, align: 32, offset: 3200)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1094, file: !14, line: 2213, baseType: !951, size: 32, align: 32, offset: 3232)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1094, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1094, file: !14, line: 2232, baseType: !951, size: 32, align: 32, offset: 3296)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1094, file: !14, line: 2243, baseType: !951, size: 32, align: 32, offset: 3328)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1094, file: !14, line: 2249, baseType: !951, size: 32, align: 32, offset: 3360)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1094, file: !14, line: 2256, baseType: !951, size: 32, align: 32, offset: 3392)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1094, file: !14, line: 2263, baseType: !998, size: 64, align: 64, offset: 3456)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1094, file: !14, line: 2270, baseType: !998, size: 64, align: 64, offset: 3520)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1094, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1094, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1094, file: !14, line: 2367, baseType: !1457, size: 64, align: 64, offset: 3648)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!951, !1380, !1114, !951}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1094, file: !14, line: 2383, baseType: !951, size: 32, align: 32, offset: 3712)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1094, file: !14, line: 2386, baseType: !950, size: 32, align: 32, offset: 3744)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1094, file: !14, line: 2387, baseType: !950, size: 32, align: 32, offset: 3776)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1094, file: !14, line: 2394, baseType: !951, size: 32, align: 32, offset: 3808)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1094, file: !14, line: 2401, baseType: !951, size: 32, align: 32, offset: 3840)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1094, file: !14, line: 2408, baseType: !951, size: 32, align: 32, offset: 3872)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1094, file: !14, line: 2415, baseType: !951, size: 32, align: 32, offset: 3904)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1094, file: !14, line: 2422, baseType: !951, size: 32, align: 32, offset: 3936)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1094, file: !14, line: 2423, baseType: !1469, size: 64, align: 64, offset: 3968)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1472)
!1472 = !{!1473, !1474, !1475, !1476}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1471, file: !14, line: 827, baseType: !951, size: 32, align: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1471, file: !14, line: 828, baseType: !951, size: 32, align: 32, offset: 32)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1471, file: !14, line: 829, baseType: !951, size: 32, align: 32, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1471, file: !14, line: 830, baseType: !950, size: 32, align: 32, offset: 96)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1094, file: !14, line: 2430, baseType: !1025, size: 64, align: 64, offset: 4032)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1094, file: !14, line: 2437, baseType: !1025, size: 64, align: 64, offset: 4096)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1094, file: !14, line: 2444, baseType: !950, size: 32, align: 32, offset: 4160)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1094, file: !14, line: 2451, baseType: !950, size: 32, align: 32, offset: 4192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1094, file: !14, line: 2458, baseType: !951, size: 32, align: 32, offset: 4224)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1094, file: !14, line: 2469, baseType: !951, size: 32, align: 32, offset: 4256)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1094, file: !14, line: 2475, baseType: !951, size: 32, align: 32, offset: 4288)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1094, file: !14, line: 2481, baseType: !951, size: 32, align: 32, offset: 4320)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1094, file: !14, line: 2485, baseType: !951, size: 32, align: 32, offset: 4352)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1094, file: !14, line: 2489, baseType: !951, size: 32, align: 32, offset: 4384)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1094, file: !14, line: 2493, baseType: !951, size: 32, align: 32, offset: 4416)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1094, file: !14, line: 2501, baseType: !951, size: 32, align: 32, offset: 4448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1094, file: !14, line: 2506, baseType: !951, size: 32, align: 32, offset: 4480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1094, file: !14, line: 2510, baseType: !951, size: 32, align: 32, offset: 4512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1094, file: !14, line: 2514, baseType: !1025, size: 64, align: 64, offset: 4544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1094, file: !14, line: 2528, baseType: !1493, size: 64, align: 64, offset: 4608)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1380, !954, !951, !951}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1094, file: !14, line: 2534, baseType: !951, size: 32, align: 32, offset: 4672)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1094, file: !14, line: 2545, baseType: !951, size: 32, align: 32, offset: 4704)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1094, file: !14, line: 2547, baseType: !951, size: 32, align: 32, offset: 4736)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1094, file: !14, line: 2549, baseType: !951, size: 32, align: 32, offset: 4768)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1094, file: !14, line: 2551, baseType: !951, size: 32, align: 32, offset: 4800)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1094, file: !14, line: 2553, baseType: !951, size: 32, align: 32, offset: 4832)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1094, file: !14, line: 2555, baseType: !951, size: 32, align: 32, offset: 4864)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1094, file: !14, line: 2557, baseType: !951, size: 32, align: 32, offset: 4896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1094, file: !14, line: 2559, baseType: !951, size: 32, align: 32, offset: 4928)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1094, file: !14, line: 2563, baseType: !951, size: 32, align: 32, offset: 4960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1094, file: !14, line: 2571, baseType: !1507, size: 64, align: 64, offset: 4992)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1094, file: !14, line: 2579, baseType: !1507, size: 64, align: 64, offset: 5056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1094, file: !14, line: 2586, baseType: !951, size: 32, align: 32, offset: 5120)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1094, file: !14, line: 2615, baseType: !951, size: 32, align: 32, offset: 5152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1094, file: !14, line: 2627, baseType: !951, size: 32, align: 32, offset: 5184)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1094, file: !14, line: 2637, baseType: !951, size: 32, align: 32, offset: 5216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1094, file: !14, line: 2681, baseType: !951, size: 32, align: 32, offset: 5248)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1094, file: !14, line: 2709, baseType: !1025, size: 64, align: 64, offset: 5312)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1094, file: !14, line: 2716, baseType: !1516, size: 64, align: 64, offset: 5376)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525, !1529, !1533, !1537, !1538, !1539, !1540, !1546, !1547, !1548, !1549, !1550}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !14, line: 3642, baseType: !970, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1518, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1518, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1518, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1518, file: !14, line: 3669, baseType: !951, size: 32, align: 32, offset: 160)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1518, file: !14, line: 3682, baseType: !1526, size: 64, align: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!951, !1092, !1114}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1518, file: !14, line: 3698, baseType: !1530, size: 64, align: 64, offset: 256)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!951, !1092, !961, !1308}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1518, file: !14, line: 3712, baseType: !1534, size: 64, align: 64, offset: 320)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!951, !1092, !951, !961, !1308}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1518, file: !14, line: 3726, baseType: !1530, size: 64, align: 64, offset: 384)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1518, file: !14, line: 3737, baseType: !1089, size: 64, align: 64, offset: 448)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1518, file: !14, line: 3746, baseType: !951, size: 32, align: 32, offset: 512)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1518, file: !14, line: 3757, baseType: !1541, size: 64, align: 64, offset: 576)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{null, !1544}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1518, file: !14, line: 3766, baseType: !1089, size: 64, align: 64, offset: 640)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1518, file: !14, line: 3774, baseType: !1089, size: 64, align: 64, offset: 704)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1518, file: !14, line: 3780, baseType: !951, size: 32, align: 32, offset: 768)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1518, file: !14, line: 3785, baseType: !951, size: 32, align: 32, offset: 800)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1518, file: !14, line: 3795, baseType: !1551, size: 64, align: 64, offset: 832)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!951, !1092, !1150}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1094, file: !14, line: 2728, baseType: !954, size: 64, align: 64, offset: 5440)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1094, file: !14, line: 2735, baseType: !1140, size: 512, align: 64, offset: 5504)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1094, file: !14, line: 2742, baseType: !951, size: 32, align: 32, offset: 6016)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1094, file: !14, line: 2755, baseType: !951, size: 32, align: 32, offset: 6048)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1094, file: !14, line: 2776, baseType: !951, size: 32, align: 32, offset: 6080)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1094, file: !14, line: 2783, baseType: !951, size: 32, align: 32, offset: 6112)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1094, file: !14, line: 2791, baseType: !951, size: 32, align: 32, offset: 6144)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1094, file: !14, line: 2802, baseType: !1114, size: 64, align: 64, offset: 6208)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1094, file: !14, line: 2811, baseType: !951, size: 32, align: 32, offset: 6272)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1094, file: !14, line: 2821, baseType: !951, size: 32, align: 32, offset: 6304)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1094, file: !14, line: 2830, baseType: !951, size: 32, align: 32, offset: 6336)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1094, file: !14, line: 2840, baseType: !951, size: 32, align: 32, offset: 6368)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1094, file: !14, line: 2851, baseType: !1567, size: 64, align: 64, offset: 6400)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!951, !1380, !1570, !954, !1383, !951, !951}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!951, !1380, !954}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1094, file: !14, line: 2871, baseType: !1574, size: 64, align: 64, offset: 6464)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!951, !1380, !1577, !954, !1383, !951}
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!951, !1380, !954, !951, !951}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1094, file: !14, line: 2878, baseType: !951, size: 32, align: 32, offset: 6528)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1094, file: !14, line: 2885, baseType: !951, size: 32, align: 32, offset: 6560)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1094, file: !14, line: 3005, baseType: !951, size: 32, align: 32, offset: 6592)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1094, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1094, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1094, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1094, file: !14, line: 3037, baseType: !956, size: 64, align: 64, offset: 6720)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1094, file: !14, line: 3038, baseType: !951, size: 32, align: 32, offset: 6784)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1094, file: !14, line: 3050, baseType: !998, size: 64, align: 64, offset: 6848)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1094, file: !14, line: 3065, baseType: !951, size: 32, align: 32, offset: 6912)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1094, file: !14, line: 3083, baseType: !951, size: 32, align: 32, offset: 6944)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1094, file: !14, line: 3092, baseType: !980, size: 64, align: 32, offset: 6976)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1094, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1094, file: !14, line: 3106, baseType: !980, size: 64, align: 32, offset: 7072)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1094, file: !14, line: 3113, baseType: !1595, size: 64, align: 64, offset: 7168)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1597)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1608}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1598, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1598, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1598, file: !14, line: 720, baseType: !970, size: 64, align: 64, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1598, file: !14, line: 724, baseType: !970, size: 64, align: 64, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1598, file: !14, line: 728, baseType: !951, size: 32, align: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1598, file: !14, line: 734, baseType: !1606, size: 64, align: 64, offset: 256)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1598, file: !14, line: 739, baseType: !1609, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1094, file: !14, line: 3129, baseType: !1025, size: 64, align: 64, offset: 7232)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1094, file: !14, line: 3130, baseType: !1025, size: 64, align: 64, offset: 7296)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1094, file: !14, line: 3131, baseType: !1025, size: 64, align: 64, offset: 7360)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1094, file: !14, line: 3132, baseType: !1025, size: 64, align: 64, offset: 7424)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1094, file: !14, line: 3139, baseType: !1507, size: 64, align: 64, offset: 7488)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1094, file: !14, line: 3147, baseType: !951, size: 32, align: 32, offset: 7552)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1094, file: !14, line: 3165, baseType: !951, size: 32, align: 32, offset: 7584)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1094, file: !14, line: 3172, baseType: !951, size: 32, align: 32, offset: 7616)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1094, file: !14, line: 3180, baseType: !951, size: 32, align: 32, offset: 7648)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1094, file: !14, line: 3191, baseType: !1419, size: 64, align: 64, offset: 7680)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1094, file: !14, line: 3199, baseType: !956, size: 64, align: 64, offset: 7744)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1094, file: !14, line: 3207, baseType: !1507, size: 64, align: 64, offset: 7808)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1094, file: !14, line: 3214, baseType: !952, size: 32, align: 32, offset: 7872)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1094, file: !14, line: 3224, baseType: !1248, size: 64, align: 64, offset: 7936)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1094, file: !14, line: 3225, baseType: !951, size: 32, align: 32, offset: 8000)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1094, file: !14, line: 3249, baseType: !1150, size: 64, align: 64, offset: 8064)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1094, file: !14, line: 3256, baseType: !951, size: 32, align: 32, offset: 8128)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1094, file: !14, line: 3271, baseType: !951, size: 32, align: 32, offset: 8160)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1094, file: !14, line: 3279, baseType: !1025, size: 64, align: 64, offset: 8192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1094, file: !14, line: 3301, baseType: !1150, size: 64, align: 64, offset: 8256)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1094, file: !14, line: 3310, baseType: !951, size: 32, align: 32, offset: 8320)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1094, file: !14, line: 3337, baseType: !951, size: 32, align: 32, offset: 8352)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1094, file: !14, line: 3351, baseType: !951, size: 32, align: 32, offset: 8384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1094, file: !14, line: 3359, baseType: !951, size: 32, align: 32, offset: 8416)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !967, file: !14, line: 3535, baseType: !1636, size: 64, align: 64, offset: 1024)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!951, !1092, !1639}
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !967, file: !14, line: 3541, baseType: !1642, size: 64, align: 64, offset: 1088)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1644)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1108, line: 223, size: 128, align: 64, elements: !1646)
!1646 = !{!1647, !1648}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1645, file: !1108, line: 224, baseType: !961, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1645, file: !1108, line: 225, baseType: !961, size: 64, align: 64, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !967, file: !14, line: 3549, baseType: !1650, size: 64, align: 64, offset: 1152)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{null, !1087}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !967, file: !14, line: 3551, baseType: !1089, size: 64, align: 64, offset: 1216)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !967, file: !14, line: 3552, baseType: !1655, size: 64, align: 64, offset: 1280)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!951, !1092, !956, !951, !1658}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1690}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1660, file: !14, line: 3921, baseType: !1420, size: 16, align: 16)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1660, file: !14, line: 3922, baseType: !1308, size: 32, align: 32, offset: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1660, file: !14, line: 3923, baseType: !1308, size: 32, align: 32, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1660, file: !14, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1660, file: !14, line: 3925, baseType: !1667, size: 64, align: 64, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1670)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1671)
!1671 = !{!1672, !1673, !1674, !1675, !1676, !1677, !1683, !1685, !1686, !1687, !1688, !1689}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1670, file: !14, line: 3886, baseType: !951, size: 32, align: 32)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1670, file: !14, line: 3887, baseType: !951, size: 32, align: 32, offset: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1670, file: !14, line: 3888, baseType: !951, size: 32, align: 32, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1670, file: !14, line: 3889, baseType: !951, size: 32, align: 32, offset: 96)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1670, file: !14, line: 3890, baseType: !951, size: 32, align: 32, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1670, file: !14, line: 3897, baseType: !1678, size: 768, align: 64, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1680)
!1680 = !{!1681, !1682}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1679, file: !14, line: 3855, baseType: !1119, size: 512, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1679, file: !14, line: 3857, baseType: !1123, size: 256, align: 32, offset: 512)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1670, file: !14, line: 3903, baseType: !1684, size: 256, align: 64, offset: 960)
!1684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 256, align: 64, elements: !1219)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1670, file: !14, line: 3904, baseType: !1226, size: 128, align: 32, offset: 1216)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1670, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1670, file: !14, line: 3908, baseType: !1507, size: 64, align: 64, offset: 1408)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1670, file: !14, line: 3915, baseType: !1507, size: 64, align: 64, offset: 1472)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1670, file: !14, line: 3917, baseType: !951, size: 32, align: 32, offset: 1536)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1660, file: !14, line: 3926, baseType: !1025, size: 64, align: 64, offset: 192)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !967, file: !14, line: 3564, baseType: !1692, size: 64, align: 64, offset: 1344)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!951, !1092, !1236, !1381, !1383}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !967, file: !14, line: 3566, baseType: !1696, size: 64, align: 64, offset: 1408)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!951, !1092, !954, !1383, !1236}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !967, file: !14, line: 3567, baseType: !1089, size: 64, align: 64, offset: 1472)
