; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegaudiodec_float.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegaudiodec_float.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!829 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!830 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!831 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!832 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!833 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!834 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!835 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!836 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!837 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!838 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!839 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!840 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!841 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!842 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!843 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!844 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!845 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!846 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!847 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!848 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!849 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!850 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!851 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889, !890, !891, !892, !893, !901, !916, !920, !922, !924, !926, !943, !944}
!888 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!890 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!891 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!892 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !896, line: 221, size: 32, align: 8, elements: !897)
!896 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !895, file: !896, line: 221, baseType: !899, size: 32, align: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !900, line: 51, baseType: !892)
!900 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPADecodeHeader", file: !903, line: 48, baseType: !904)
!903 = !DIFile(filename: "libavcodec/mpegaudiodecheader.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPADecodeHeader", file: !903, line: 46, size: 320, align: 32, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "error_protection", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate_index", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 160)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channels", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 224)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mode_ext", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !904, file: !903, line: 47, baseType: !891, size: 32, align: 32, offset: 288)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "OUT_INT", file: !919, line: 66, baseType: !888)
!919 = !DIFile(filename: "libavcodec/mpegaudio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !900, line: 48, baseType: !921)
!921 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !900, line: 40, baseType: !923)
!923 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !900, line: 38, baseType: !891)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias32", file: !896, line: 41, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !896, line: 36, size: 32, align: 32, elements: !930)
!930 = !{!931, !932, !938, !942}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !929, file: !896, line: 37, baseType: !899, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !929, file: !896, line: 38, baseType: !933, size: 32, align: 16)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 32, align: 16, elements: !936)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !900, line: 49, baseType: !935)
!935 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!936 = !{!937}
!937 = !DISubrange(count: 2)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !929, file: !896, line: 39, baseType: !939, size: 32, align: 8)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 32, align: 8, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 4)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !929, file: !896, line: 40, baseType: !888, size: 32, align: 32)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !896, line: 222, size: 16, align: 8, elements: !947)
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !946, file: !896, line: 222, baseType: !934, size: 16, align: 16)
!949 = !{!950, !1671, !1672, !1673, !1674, !1675, !1679, !1683, !1688, !1702, !1704, !1706, !1710, !1712, !1713, !1714, !1716, !1718, !1719, !1720, !1724, !1726, !1727, !1728, !1729, !1730, !1732, !1734, !1735, !1736, !1737, !1738, !1742, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1756, !1768, !1770, !1774, !1776, !1778, !1781, !1782, !1786, !1790, !1797, !1799, !1803, !1805, !1809, !1811, !1814, !1816, !1820, !1822, !1824, !1828, !1830, !1833, !1836, !1839, !1843, !1844, !1848, !1851, !1855, !2015, !2018, !2020, !2024}
!950 = distinct !DIGlobalVariable(name: "ff_mp1float_decoder", scope: !0, file: !951, line: 42, type: !952, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mp1float_decoder)
!951 = !DIFile(filename: "libavcodec/mpegaudiodec_float.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !954)
!954 = !{!955, !959, !960, !961, !962, !963, !972, !975, !978, !981, !986, !987, !1028, !1036, !1037, !1038, !1040, !1586, !1592, !1600, !1604, !1605, !1642, !1646, !1650, !1651, !1655, !1659, !1660, !1664, !1665, !1666}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !14, line: 3475, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !953, file: !14, line: 3480, baseType: !956, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !953, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !953, file: !14, line: 3487, baseType: !891, size: 32, align: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !953, file: !14, line: 3488, baseType: !964, size: 64, align: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !967, line: 61, baseType: !968)
!967 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !967, line: 58, size: 64, align: 32, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !968, file: !967, line: 59, baseType: !891, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !968, file: !967, line: 60, baseType: !891, size: 32, align: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !953, file: !14, line: 3489, baseType: !973, size: 64, align: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !953, file: !14, line: 3490, baseType: !976, size: 64, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !953, file: !14, line: 3491, baseType: !979, size: 64, align: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !953, file: !14, line: 3492, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !900, line: 55, baseType: !985)
!985 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !953, file: !14, line: 3493, baseType: !920, size: 8, align: 8, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !953, file: !14, line: 3494, baseType: !988, size: 64, align: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !992)
!992 = !{!993, !994, !998, !1002, !1003, !1004, !1005, !1009, !1015, !1017, !1021}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !991, file: !691, line: 72, baseType: !956, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !991, file: !691, line: 78, baseType: !995, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!956, !889}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !991, file: !691, line: 85, baseType: !999, size: 64, align: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !991, file: !691, line: 93, baseType: !891, size: 32, align: 32, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !991, file: !691, line: 99, baseType: !891, size: 32, align: 32, offset: 224)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !991, file: !691, line: 108, baseType: !891, size: 32, align: 32, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !991, file: !691, line: 113, baseType: !1006, size: 64, align: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!889, !889, !889}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !991, file: !691, line: 123, baseType: !1010, size: 64, align: 64, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!1013, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !991, file: !691, line: 130, baseType: !1016, size: 32, align: 32, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !991, file: !691, line: 136, baseType: !1018, size: 64, align: 64, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!1016, !889}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !991, file: !691, line: 142, baseType: !1022, size: 64, align: 64, offset: 576)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!891, !1025, !889, !956, !891}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !953, file: !14, line: 3495, baseType: !1029, size: 64, align: 64, offset: 704)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1032, file: !14, line: 3402, baseType: !891, size: 32, align: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1032, file: !14, line: 3403, baseType: !956, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !953, file: !14, line: 3507, baseType: !956, size: 64, align: 64, offset: 768)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !953, file: !14, line: 3516, baseType: !891, size: 32, align: 32, offset: 832)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !14, line: 3517, baseType: !1039, size: 64, align: 64, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !953, file: !14, line: 3527, baseType: !1041, size: 64, align: 64, offset: 960)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!891, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1054, !1055, !1056, !1057, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1335, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1524, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1046, file: !14, line: 1561, baseType: !988, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1046, file: !14, line: 1562, baseType: !891, size: 32, align: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1046, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1046, file: !14, line: 1565, baseType: !1052, size: 64, align: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1046, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1046, file: !14, line: 1581, baseType: !892, size: 32, align: 32, offset: 224)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1046, file: !14, line: 1583, baseType: !889, size: 64, align: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1046, file: !14, line: 1591, baseType: !1058, size: 64, align: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1060, line: 129, size: 1664, align: 64, elements: !1061)
!1060 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1061 = !{!1062, !1063, !1064, !1065, !1163, !1182, !1183, !1212, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1059, file: !1060, line: 136, baseType: !891, size: 32, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1059, file: !1060, line: 151, baseType: !891, size: 32, align: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1059, file: !1060, line: 157, baseType: !891, size: 32, align: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1059, file: !1060, line: 159, baseType: !1066, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1069)
!1069 = !{!1070, !1075, !1077, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1115, !1117, !1118, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1151, !1152, !1153, !1154, !1155, !1156, !1159, !1160, !1161, !1162}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1068, file: !722, line: 282, baseType: !1071, size: 512, align: 64)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, align: 64, elements: !1073)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1073 = !{!1074}
!1074 = !DISubrange(count: 8)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1068, file: !722, line: 299, baseType: !1076, size: 256, align: 32, offset: 512)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 256, align: 32, elements: !1073)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1068, file: !722, line: 315, baseType: !1078, size: 64, align: 64, offset: 768)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1068, file: !722, line: 326, baseType: !891, size: 32, align: 32, offset: 832)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1068, file: !722, line: 326, baseType: !891, size: 32, align: 32, offset: 864)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1068, file: !722, line: 334, baseType: !891, size: 32, align: 32, offset: 896)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1068, file: !722, line: 341, baseType: !891, size: 32, align: 32, offset: 928)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1068, file: !722, line: 346, baseType: !891, size: 32, align: 32, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1068, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1068, file: !722, line: 356, baseType: !966, size: 64, align: 32, offset: 1024)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1068, file: !722, line: 361, baseType: !922, size: 64, align: 64, offset: 1088)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1068, file: !722, line: 369, baseType: !922, size: 64, align: 64, offset: 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1068, file: !722, line: 377, baseType: !922, size: 64, align: 64, offset: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1068, file: !722, line: 382, baseType: !891, size: 32, align: 32, offset: 1280)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1068, file: !722, line: 386, baseType: !891, size: 32, align: 32, offset: 1312)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1068, file: !722, line: 391, baseType: !891, size: 32, align: 32, offset: 1344)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1068, file: !722, line: 396, baseType: !889, size: 64, align: 64, offset: 1408)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1068, file: !722, line: 403, baseType: !1094, size: 512, align: 64, offset: 1472)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 512, align: 64, elements: !1073)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1068, file: !722, line: 410, baseType: !891, size: 32, align: 32, offset: 1984)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1068, file: !722, line: 415, baseType: !891, size: 32, align: 32, offset: 2016)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1068, file: !722, line: 420, baseType: !891, size: 32, align: 32, offset: 2048)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1068, file: !722, line: 425, baseType: !891, size: 32, align: 32, offset: 2080)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1068, file: !722, line: 435, baseType: !922, size: 64, align: 64, offset: 2112)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1068, file: !722, line: 440, baseType: !891, size: 32, align: 32, offset: 2176)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1068, file: !722, line: 445, baseType: !984, size: 64, align: 64, offset: 2240)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1068, file: !722, line: 459, baseType: !1103, size: 512, align: 64, offset: 2304)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, align: 64, elements: !1073)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1106, line: 94, baseType: !1107)
!1106 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1106, line: 81, size: 192, align: 64, elements: !1108)
!1108 = !{!1109, !1113, !1114}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1107, file: !1106, line: 82, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1106, line: 73, baseType: !1112)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1106, line: 73, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !1106, line: 89, baseType: !1072, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !1106, line: 93, baseType: !891, size: 32, align: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1068, file: !722, line: 473, baseType: !1116, size: 64, align: 64, offset: 2816)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1068, file: !722, line: 477, baseType: !891, size: 32, align: 32, offset: 2880)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1068, file: !722, line: 479, baseType: !1119, size: 64, align: 64, offset: 2944)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1132}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1122, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !722, line: 203, baseType: !1072, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !722, line: 204, baseType: !891, size: 32, align: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1122, file: !722, line: 205, baseType: !1128, size: 64, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1130, line: 86, baseType: !1131)
!1130 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1130, line: 86, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1122, file: !722, line: 206, baseType: !1104, size: 64, align: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1068, file: !722, line: 480, baseType: !891, size: 32, align: 32, offset: 3008)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1068, file: !722, line: 505, baseType: !891, size: 32, align: 32, offset: 3040)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1068, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1068, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1068, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1068, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1068, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1068, file: !722, line: 532, baseType: !922, size: 64, align: 64, offset: 3264)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1068, file: !722, line: 539, baseType: !922, size: 64, align: 64, offset: 3328)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1068, file: !722, line: 547, baseType: !922, size: 64, align: 64, offset: 3392)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1068, file: !722, line: 554, baseType: !1128, size: 64, align: 64, offset: 3456)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1068, file: !722, line: 563, baseType: !891, size: 32, align: 32, offset: 3520)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1068, file: !722, line: 572, baseType: !891, size: 32, align: 32, offset: 3552)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1068, file: !722, line: 581, baseType: !891, size: 32, align: 32, offset: 3584)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1068, file: !722, line: 588, baseType: !1148, size: 64, align: 64, offset: 3648)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !900, line: 36, baseType: !1150)
!1150 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1068, file: !722, line: 593, baseType: !891, size: 32, align: 32, offset: 3712)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1068, file: !722, line: 596, baseType: !891, size: 32, align: 32, offset: 3744)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1068, file: !722, line: 599, baseType: !1104, size: 64, align: 64, offset: 3776)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1068, file: !722, line: 605, baseType: !1104, size: 64, align: 64, offset: 3840)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1068, file: !722, line: 616, baseType: !1104, size: 64, align: 64, offset: 3904)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1068, file: !722, line: 626, baseType: !1157, size: 64, align: 64, offset: 3968)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1158, line: 216, baseType: !985)
!1158 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1068, file: !722, line: 627, baseType: !1157, size: 64, align: 64, offset: 4032)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1068, file: !722, line: 628, baseType: !1157, size: 64, align: 64, offset: 4096)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1068, file: !722, line: 629, baseType: !1157, size: 64, align: 64, offset: 4160)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1068, file: !722, line: 645, baseType: !1104, size: 64, align: 64, offset: 4224)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1059, file: !1060, line: 161, baseType: !1164, size: 64, align: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1060, line: 117, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1060, line: 100, size: 832, align: 64, elements: !1167)
!1167 = !{!1168, !1173, !1174, !1175, !1176, !1177, !1179, !1180, !1181}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1166, file: !1060, line: 105, baseType: !1169, size: 256, align: 64)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 256, align: 64, elements: !940)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1106, line: 238, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1106, line: 238, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1166, file: !1060, line: 110, baseType: !891, size: 32, align: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1166, file: !1060, line: 111, baseType: !891, size: 32, align: 32, offset: 288)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1166, file: !1060, line: 111, baseType: !891, size: 32, align: 32, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1166, file: !1060, line: 112, baseType: !1076, size: 256, align: 32, offset: 352)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1166, file: !1060, line: 113, baseType: !1178, size: 128, align: 32, offset: 608)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 128, align: 32, elements: !940)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1166, file: !1060, line: 114, baseType: !891, size: 32, align: 32, offset: 736)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1166, file: !1060, line: 115, baseType: !891, size: 32, align: 32, offset: 768)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1166, file: !1060, line: 116, baseType: !891, size: 32, align: 32, offset: 800)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1059, file: !1060, line: 163, baseType: !889, size: 64, align: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1059, file: !1060, line: 165, baseType: !1184, size: 128, align: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1060, line: 122, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1060, line: 119, size: 128, align: 64, elements: !1186)
!1186 = !{!1187, !1211}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1185, file: !1060, line: 120, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1207, !1208, !1209, !1210}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1190, file: !14, line: 1451, baseType: !1104, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1190, file: !14, line: 1461, baseType: !922, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1190, file: !14, line: 1467, baseType: !922, size: 64, align: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1190, file: !14, line: 1468, baseType: !1072, size: 64, align: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1190, file: !14, line: 1469, baseType: !891, size: 32, align: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1190, file: !14, line: 1470, baseType: !891, size: 32, align: 32, offset: 288)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1190, file: !14, line: 1474, baseType: !891, size: 32, align: 32, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1190, file: !14, line: 1479, baseType: !1200, size: 64, align: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !14, line: 1412, baseType: !1072, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !14, line: 1413, baseType: !891, size: 32, align: 32, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1202, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1190, file: !14, line: 1480, baseType: !891, size: 32, align: 32, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1190, file: !14, line: 1486, baseType: !922, size: 64, align: 64, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1190, file: !14, line: 1488, baseType: !922, size: 64, align: 64, offset: 576)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1190, file: !14, line: 1497, baseType: !922, size: 64, align: 64, offset: 640)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1185, file: !1060, line: 121, baseType: !1066, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1059, file: !1060, line: 166, baseType: !1213, size: 128, align: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1060, line: 127, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1060, line: 124, size: 128, align: 64, elements: !1215)
!1215 = !{!1216, !1289}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1214, file: !1060, line: 125, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1247, !1251, !1252, !1286, !1287, !1288}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1220, file: !14, line: 5751, baseType: !988, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1220, file: !14, line: 5756, baseType: !1224, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1232, !1233, !1234, !1238, !1242, !1246}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1226, file: !14, line: 5797, baseType: !956, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1226, file: !14, line: 5804, baseType: !1230, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1226, file: !14, line: 5815, baseType: !988, size: 64, align: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1226, file: !14, line: 5825, baseType: !891, size: 32, align: 32, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1226, file: !14, line: 5826, baseType: !1235, size: 64, align: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!891, !1218}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1226, file: !14, line: 5827, baseType: !1239, size: 64, align: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!891, !1218, !1188}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1226, file: !14, line: 5828, baseType: !1243, size: 64, align: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{null, !1218}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1226, file: !14, line: 5829, baseType: !1243, size: 64, align: 64, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1220, file: !14, line: 5762, baseType: !1248, size: 64, align: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1250)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1220, file: !14, line: 5768, baseType: !889, size: 64, align: 64, offset: 192)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1220, file: !14, line: 5775, baseType: !1253, size: 64, align: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1256)
!1256 = !{!1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1255, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1255, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1255, file: !14, line: 3948, baseType: !899, size: 32, align: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1255, file: !14, line: 3958, baseType: !1072, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1255, file: !14, line: 3962, baseType: !891, size: 32, align: 32, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1255, file: !14, line: 3968, baseType: !891, size: 32, align: 32, offset: 224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1255, file: !14, line: 3973, baseType: !922, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1255, file: !14, line: 3986, baseType: !891, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1255, file: !14, line: 3999, baseType: !891, size: 32, align: 32, offset: 352)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1255, file: !14, line: 4004, baseType: !891, size: 32, align: 32, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1255, file: !14, line: 4005, baseType: !891, size: 32, align: 32, offset: 416)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1255, file: !14, line: 4010, baseType: !891, size: 32, align: 32, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1255, file: !14, line: 4011, baseType: !891, size: 32, align: 32, offset: 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1255, file: !14, line: 4020, baseType: !966, size: 64, align: 32, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1255, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1255, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1255, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1255, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1255, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1255, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1255, file: !14, line: 4039, baseType: !891, size: 32, align: 32, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1255, file: !14, line: 4046, baseType: !984, size: 64, align: 64, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1255, file: !14, line: 4050, baseType: !891, size: 32, align: 32, offset: 896)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1255, file: !14, line: 4054, baseType: !891, size: 32, align: 32, offset: 928)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1255, file: !14, line: 4061, baseType: !891, size: 32, align: 32, offset: 960)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1255, file: !14, line: 4065, baseType: !891, size: 32, align: 32, offset: 992)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1255, file: !14, line: 4073, baseType: !891, size: 32, align: 32, offset: 1024)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1255, file: !14, line: 4080, baseType: !891, size: 32, align: 32, offset: 1056)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1255, file: !14, line: 4084, baseType: !891, size: 32, align: 32, offset: 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1220, file: !14, line: 5781, baseType: !1253, size: 64, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1220, file: !14, line: 5787, baseType: !966, size: 64, align: 32, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1220, file: !14, line: 5793, baseType: !966, size: 64, align: 32, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1214, file: !1060, line: 126, baseType: !891, size: 32, align: 32, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1059, file: !1060, line: 172, baseType: !1188, size: 64, align: 64, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1059, file: !1060, line: 177, baseType: !1072, size: 64, align: 64, offset: 640)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1059, file: !1060, line: 178, baseType: !892, size: 32, align: 32, offset: 704)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1059, file: !1060, line: 180, baseType: !889, size: 64, align: 64, offset: 768)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1059, file: !1060, line: 185, baseType: !891, size: 32, align: 32, offset: 832)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1059, file: !1060, line: 190, baseType: !889, size: 64, align: 64, offset: 896)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1059, file: !1060, line: 195, baseType: !891, size: 32, align: 32, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1059, file: !1060, line: 200, baseType: !1188, size: 64, align: 64, offset: 1024)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1059, file: !1060, line: 201, baseType: !891, size: 32, align: 32, offset: 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1059, file: !1060, line: 202, baseType: !1066, size: 64, align: 64, offset: 1152)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1059, file: !1060, line: 203, baseType: !891, size: 32, align: 32, offset: 1216)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1059, file: !1060, line: 205, baseType: !891, size: 32, align: 32, offset: 1248)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1059, file: !1060, line: 206, baseType: !891, size: 32, align: 32, offset: 1280)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1059, file: !1060, line: 209, baseType: !1157, size: 64, align: 64, offset: 1344)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1059, file: !1060, line: 212, baseType: !1157, size: 64, align: 64, offset: 1408)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1059, file: !1060, line: 213, baseType: !1066, size: 64, align: 64, offset: 1472)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1059, file: !1060, line: 215, baseType: !891, size: 32, align: 32, offset: 1536)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1059, file: !1060, line: 217, baseType: !891, size: 32, align: 32, offset: 1568)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1059, file: !1060, line: 220, baseType: !891, size: 32, align: 32, offset: 1600)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1046, file: !14, line: 1598, baseType: !889, size: 64, align: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1046, file: !14, line: 1606, baseType: !922, size: 64, align: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1046, file: !14, line: 1614, baseType: !891, size: 32, align: 32, offset: 512)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1046, file: !14, line: 1622, baseType: !891, size: 32, align: 32, offset: 544)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1046, file: !14, line: 1628, baseType: !891, size: 32, align: 32, offset: 576)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1046, file: !14, line: 1636, baseType: !891, size: 32, align: 32, offset: 608)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1046, file: !14, line: 1643, baseType: !891, size: 32, align: 32, offset: 640)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1046, file: !14, line: 1657, baseType: !1072, size: 64, align: 64, offset: 704)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1046, file: !14, line: 1658, baseType: !891, size: 32, align: 32, offset: 768)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1046, file: !14, line: 1679, baseType: !966, size: 64, align: 32, offset: 800)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1046, file: !14, line: 1688, baseType: !891, size: 32, align: 32, offset: 864)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1046, file: !14, line: 1712, baseType: !891, size: 32, align: 32, offset: 896)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1046, file: !14, line: 1729, baseType: !891, size: 32, align: 32, offset: 928)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1046, file: !14, line: 1729, baseType: !891, size: 32, align: 32, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1046, file: !14, line: 1744, baseType: !891, size: 32, align: 32, offset: 992)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1046, file: !14, line: 1744, baseType: !891, size: 32, align: 32, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1046, file: !14, line: 1751, baseType: !891, size: 32, align: 32, offset: 1056)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1046, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1046, file: !14, line: 1791, baseType: !1328, size: 64, align: 64, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{null, !1331, !1332, !1334, !891, !891, !891}
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1046, file: !14, line: 1808, baseType: !1336, size: 64, align: 64, offset: 1216)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!473, !1331, !973}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1046, file: !14, line: 1816, baseType: !891, size: 32, align: 32, offset: 1280)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1046, file: !14, line: 1825, baseType: !888, size: 32, align: 32, offset: 1312)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1046, file: !14, line: 1830, baseType: !891, size: 32, align: 32, offset: 1344)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1046, file: !14, line: 1838, baseType: !888, size: 32, align: 32, offset: 1376)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1046, file: !14, line: 1846, baseType: !891, size: 32, align: 32, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1046, file: !14, line: 1851, baseType: !891, size: 32, align: 32, offset: 1440)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1046, file: !14, line: 1861, baseType: !888, size: 32, align: 32, offset: 1472)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1046, file: !14, line: 1868, baseType: !888, size: 32, align: 32, offset: 1504)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1046, file: !14, line: 1875, baseType: !888, size: 32, align: 32, offset: 1536)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1046, file: !14, line: 1882, baseType: !888, size: 32, align: 32, offset: 1568)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1046, file: !14, line: 1889, baseType: !888, size: 32, align: 32, offset: 1600)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1046, file: !14, line: 1896, baseType: !888, size: 32, align: 32, offset: 1632)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1046, file: !14, line: 1903, baseType: !888, size: 32, align: 32, offset: 1664)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1046, file: !14, line: 1910, baseType: !891, size: 32, align: 32, offset: 1696)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1046, file: !14, line: 1915, baseType: !891, size: 32, align: 32, offset: 1728)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1046, file: !14, line: 1926, baseType: !1334, size: 64, align: 64, offset: 1792)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1046, file: !14, line: 1935, baseType: !966, size: 64, align: 32, offset: 1856)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1046, file: !14, line: 1942, baseType: !891, size: 32, align: 32, offset: 1920)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1046, file: !14, line: 1948, baseType: !891, size: 32, align: 32, offset: 1952)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1046, file: !14, line: 1954, baseType: !891, size: 32, align: 32, offset: 1984)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1046, file: !14, line: 1960, baseType: !891, size: 32, align: 32, offset: 2016)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1046, file: !14, line: 1984, baseType: !891, size: 32, align: 32, offset: 2048)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1046, file: !14, line: 1991, baseType: !891, size: 32, align: 32, offset: 2080)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1046, file: !14, line: 1996, baseType: !891, size: 32, align: 32, offset: 2112)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1046, file: !14, line: 2004, baseType: !891, size: 32, align: 32, offset: 2144)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1046, file: !14, line: 2011, baseType: !891, size: 32, align: 32, offset: 2176)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1046, file: !14, line: 2018, baseType: !891, size: 32, align: 32, offset: 2208)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1046, file: !14, line: 2027, baseType: !891, size: 32, align: 32, offset: 2240)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1046, file: !14, line: 2034, baseType: !891, size: 32, align: 32, offset: 2272)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1046, file: !14, line: 2044, baseType: !891, size: 32, align: 32, offset: 2304)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1046, file: !14, line: 2054, baseType: !1370, size: 64, align: 64, offset: 2368)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1046, file: !14, line: 2061, baseType: !1370, size: 64, align: 64, offset: 2432)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1046, file: !14, line: 2066, baseType: !891, size: 32, align: 32, offset: 2496)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1046, file: !14, line: 2070, baseType: !891, size: 32, align: 32, offset: 2528)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1046, file: !14, line: 2078, baseType: !891, size: 32, align: 32, offset: 2560)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1046, file: !14, line: 2085, baseType: !891, size: 32, align: 32, offset: 2592)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1046, file: !14, line: 2092, baseType: !891, size: 32, align: 32, offset: 2624)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1046, file: !14, line: 2099, baseType: !891, size: 32, align: 32, offset: 2656)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1046, file: !14, line: 2106, baseType: !891, size: 32, align: 32, offset: 2688)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1046, file: !14, line: 2113, baseType: !891, size: 32, align: 32, offset: 2720)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1046, file: !14, line: 2120, baseType: !891, size: 32, align: 32, offset: 2752)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1046, file: !14, line: 2125, baseType: !891, size: 32, align: 32, offset: 2784)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1046, file: !14, line: 2133, baseType: !891, size: 32, align: 32, offset: 2816)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1046, file: !14, line: 2140, baseType: !891, size: 32, align: 32, offset: 2848)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1046, file: !14, line: 2145, baseType: !891, size: 32, align: 32, offset: 2880)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1046, file: !14, line: 2153, baseType: !891, size: 32, align: 32, offset: 2912)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1046, file: !14, line: 2158, baseType: !891, size: 32, align: 32, offset: 2944)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1046, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1046, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1046, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1046, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1046, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1046, file: !14, line: 2203, baseType: !891, size: 32, align: 32, offset: 3136)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1046, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1046, file: !14, line: 2212, baseType: !891, size: 32, align: 32, offset: 3200)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1046, file: !14, line: 2213, baseType: !891, size: 32, align: 32, offset: 3232)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1046, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1046, file: !14, line: 2232, baseType: !891, size: 32, align: 32, offset: 3296)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1046, file: !14, line: 2243, baseType: !891, size: 32, align: 32, offset: 3328)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1046, file: !14, line: 2249, baseType: !891, size: 32, align: 32, offset: 3360)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1046, file: !14, line: 2256, baseType: !891, size: 32, align: 32, offset: 3392)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1046, file: !14, line: 2263, baseType: !984, size: 64, align: 64, offset: 3456)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1046, file: !14, line: 2270, baseType: !984, size: 64, align: 64, offset: 3520)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1046, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1046, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1046, file: !14, line: 2367, baseType: !1406, size: 64, align: 64, offset: 3648)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!891, !1331, !1066, !891}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1046, file: !14, line: 2383, baseType: !891, size: 32, align: 32, offset: 3712)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1046, file: !14, line: 2386, baseType: !888, size: 32, align: 32, offset: 3744)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1046, file: !14, line: 2387, baseType: !888, size: 32, align: 32, offset: 3776)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1046, file: !14, line: 2394, baseType: !891, size: 32, align: 32, offset: 3808)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1046, file: !14, line: 2401, baseType: !891, size: 32, align: 32, offset: 3840)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1046, file: !14, line: 2408, baseType: !891, size: 32, align: 32, offset: 3872)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1046, file: !14, line: 2415, baseType: !891, size: 32, align: 32, offset: 3904)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1046, file: !14, line: 2422, baseType: !891, size: 32, align: 32, offset: 3936)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1046, file: !14, line: 2423, baseType: !1418, size: 64, align: 64, offset: 3968)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1420, file: !14, line: 827, baseType: !891, size: 32, align: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1420, file: !14, line: 828, baseType: !891, size: 32, align: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1420, file: !14, line: 829, baseType: !891, size: 32, align: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1420, file: !14, line: 830, baseType: !888, size: 32, align: 32, offset: 96)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1046, file: !14, line: 2430, baseType: !922, size: 64, align: 64, offset: 4032)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1046, file: !14, line: 2437, baseType: !922, size: 64, align: 64, offset: 4096)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1046, file: !14, line: 2444, baseType: !888, size: 32, align: 32, offset: 4160)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1046, file: !14, line: 2451, baseType: !888, size: 32, align: 32, offset: 4192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1046, file: !14, line: 2458, baseType: !891, size: 32, align: 32, offset: 4224)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1046, file: !14, line: 2469, baseType: !891, size: 32, align: 32, offset: 4256)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1046, file: !14, line: 2475, baseType: !891, size: 32, align: 32, offset: 4288)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1046, file: !14, line: 2481, baseType: !891, size: 32, align: 32, offset: 4320)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1046, file: !14, line: 2485, baseType: !891, size: 32, align: 32, offset: 4352)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1046, file: !14, line: 2489, baseType: !891, size: 32, align: 32, offset: 4384)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1046, file: !14, line: 2493, baseType: !891, size: 32, align: 32, offset: 4416)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1046, file: !14, line: 2501, baseType: !891, size: 32, align: 32, offset: 4448)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1046, file: !14, line: 2506, baseType: !891, size: 32, align: 32, offset: 4480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1046, file: !14, line: 2510, baseType: !891, size: 32, align: 32, offset: 4512)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1046, file: !14, line: 2514, baseType: !922, size: 64, align: 64, offset: 4544)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1046, file: !14, line: 2528, baseType: !1442, size: 64, align: 64, offset: 4608)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{null, !1331, !889, !891, !891}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1046, file: !14, line: 2534, baseType: !891, size: 32, align: 32, offset: 4672)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1046, file: !14, line: 2545, baseType: !891, size: 32, align: 32, offset: 4704)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1046, file: !14, line: 2547, baseType: !891, size: 32, align: 32, offset: 4736)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1046, file: !14, line: 2549, baseType: !891, size: 32, align: 32, offset: 4768)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1046, file: !14, line: 2551, baseType: !891, size: 32, align: 32, offset: 4800)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1046, file: !14, line: 2553, baseType: !891, size: 32, align: 32, offset: 4832)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1046, file: !14, line: 2555, baseType: !891, size: 32, align: 32, offset: 4864)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1046, file: !14, line: 2557, baseType: !891, size: 32, align: 32, offset: 4896)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1046, file: !14, line: 2559, baseType: !891, size: 32, align: 32, offset: 4928)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1046, file: !14, line: 2563, baseType: !891, size: 32, align: 32, offset: 4960)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1046, file: !14, line: 2571, baseType: !1456, size: 64, align: 64, offset: 4992)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1046, file: !14, line: 2579, baseType: !1456, size: 64, align: 64, offset: 5056)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1046, file: !14, line: 2586, baseType: !891, size: 32, align: 32, offset: 5120)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1046, file: !14, line: 2615, baseType: !891, size: 32, align: 32, offset: 5152)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1046, file: !14, line: 2627, baseType: !891, size: 32, align: 32, offset: 5184)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1046, file: !14, line: 2637, baseType: !891, size: 32, align: 32, offset: 5216)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1046, file: !14, line: 2681, baseType: !891, size: 32, align: 32, offset: 5248)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1046, file: !14, line: 2709, baseType: !922, size: 64, align: 64, offset: 5312)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1046, file: !14, line: 2716, baseType: !1465, size: 64, align: 64, offset: 5376)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1468)
!1468 = !{!1469, !1470, !1471, !1472, !1473, !1474, !1478, !1484, !1488, !1489, !1490, !1491, !1497, !1498, !1499, !1500, !1501}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1467, file: !14, line: 3642, baseType: !956, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1467, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1467, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1467, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1467, file: !14, line: 3669, baseType: !891, size: 32, align: 32, offset: 160)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1467, file: !14, line: 3682, baseType: !1475, size: 64, align: 64, offset: 192)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!891, !1044, !1066}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1467, file: !14, line: 3698, baseType: !1479, size: 64, align: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!891, !1044, !1482, !899}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1467, file: !14, line: 3712, baseType: !1485, size: 64, align: 64, offset: 320)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!891, !1044, !891, !1482, !899}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1467, file: !14, line: 3726, baseType: !1479, size: 64, align: 64, offset: 384)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1467, file: !14, line: 3737, baseType: !1041, size: 64, align: 64, offset: 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1467, file: !14, line: 3746, baseType: !891, size: 32, align: 32, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1467, file: !14, line: 3757, baseType: !1492, size: 64, align: 64, offset: 576)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !1495}
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1467, file: !14, line: 3766, baseType: !1041, size: 64, align: 64, offset: 640)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1467, file: !14, line: 3774, baseType: !1041, size: 64, align: 64, offset: 704)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1467, file: !14, line: 3780, baseType: !891, size: 32, align: 32, offset: 768)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1467, file: !14, line: 3785, baseType: !891, size: 32, align: 32, offset: 800)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1467, file: !14, line: 3795, baseType: !1502, size: 64, align: 64, offset: 832)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!891, !1044, !1104}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1046, file: !14, line: 2728, baseType: !889, size: 64, align: 64, offset: 5440)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1046, file: !14, line: 2735, baseType: !1094, size: 512, align: 64, offset: 5504)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1046, file: !14, line: 2742, baseType: !891, size: 32, align: 32, offset: 6016)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1046, file: !14, line: 2755, baseType: !891, size: 32, align: 32, offset: 6048)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1046, file: !14, line: 2776, baseType: !891, size: 32, align: 32, offset: 6080)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1046, file: !14, line: 2783, baseType: !891, size: 32, align: 32, offset: 6112)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1046, file: !14, line: 2791, baseType: !891, size: 32, align: 32, offset: 6144)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1046, file: !14, line: 2802, baseType: !1066, size: 64, align: 64, offset: 6208)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1046, file: !14, line: 2811, baseType: !891, size: 32, align: 32, offset: 6272)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1046, file: !14, line: 2821, baseType: !891, size: 32, align: 32, offset: 6304)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1046, file: !14, line: 2830, baseType: !891, size: 32, align: 32, offset: 6336)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1046, file: !14, line: 2840, baseType: !891, size: 32, align: 32, offset: 6368)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1046, file: !14, line: 2851, baseType: !1518, size: 64, align: 64, offset: 6400)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!891, !1331, !1521, !889, !1334, !891, !891}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!891, !1331, !889}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1046, file: !14, line: 2871, baseType: !1525, size: 64, align: 64, offset: 6464)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!891, !1331, !1528, !889, !1334, !891}
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!891, !1331, !889, !891, !891}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1046, file: !14, line: 2878, baseType: !891, size: 32, align: 32, offset: 6528)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1046, file: !14, line: 2885, baseType: !891, size: 32, align: 32, offset: 6560)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1046, file: !14, line: 3005, baseType: !891, size: 32, align: 32, offset: 6592)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1046, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1046, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1046, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1046, file: !14, line: 3037, baseType: !1072, size: 64, align: 64, offset: 6720)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1046, file: !14, line: 3038, baseType: !891, size: 32, align: 32, offset: 6784)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1046, file: !14, line: 3050, baseType: !984, size: 64, align: 64, offset: 6848)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1046, file: !14, line: 3065, baseType: !891, size: 32, align: 32, offset: 6912)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1046, file: !14, line: 3083, baseType: !891, size: 32, align: 32, offset: 6944)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1046, file: !14, line: 3092, baseType: !966, size: 64, align: 32, offset: 6976)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1046, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1046, file: !14, line: 3106, baseType: !966, size: 64, align: 32, offset: 7072)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1046, file: !14, line: 3113, baseType: !1546, size: 64, align: 64, offset: 7168)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1548)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1549)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1550)
!1550 = !{!1551, !1552, !1553, !1554, !1555, !1556, !1559}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1549, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1549, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1549, file: !14, line: 720, baseType: !956, size: 64, align: 64, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1549, file: !14, line: 724, baseType: !956, size: 64, align: 64, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1549, file: !14, line: 728, baseType: !891, size: 32, align: 32, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1549, file: !14, line: 734, baseType: !1557, size: 64, align: 64, offset: 256)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1549, file: !14, line: 739, baseType: !1560, size: 64, align: 64, offset: 320)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1046, file: !14, line: 3129, baseType: !922, size: 64, align: 64, offset: 7232)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1046, file: !14, line: 3130, baseType: !922, size: 64, align: 64, offset: 7296)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1046, file: !14, line: 3131, baseType: !922, size: 64, align: 64, offset: 7360)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1046, file: !14, line: 3132, baseType: !922, size: 64, align: 64, offset: 7424)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1046, file: !14, line: 3139, baseType: !1456, size: 64, align: 64, offset: 7488)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1046, file: !14, line: 3147, baseType: !891, size: 32, align: 32, offset: 7552)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1046, file: !14, line: 3165, baseType: !891, size: 32, align: 32, offset: 7584)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1046, file: !14, line: 3172, baseType: !891, size: 32, align: 32, offset: 7616)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1046, file: !14, line: 3180, baseType: !891, size: 32, align: 32, offset: 7648)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1046, file: !14, line: 3191, baseType: !1370, size: 64, align: 64, offset: 7680)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1046, file: !14, line: 3199, baseType: !1072, size: 64, align: 64, offset: 7744)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1046, file: !14, line: 3207, baseType: !1456, size: 64, align: 64, offset: 7808)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1046, file: !14, line: 3214, baseType: !892, size: 32, align: 32, offset: 7872)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1046, file: !14, line: 3224, baseType: !1200, size: 64, align: 64, offset: 7936)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1046, file: !14, line: 3225, baseType: !891, size: 32, align: 32, offset: 8000)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1046, file: !14, line: 3249, baseType: !1104, size: 64, align: 64, offset: 8064)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1046, file: !14, line: 3256, baseType: !891, size: 32, align: 32, offset: 8128)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1046, file: !14, line: 3271, baseType: !891, size: 32, align: 32, offset: 8160)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1046, file: !14, line: 3279, baseType: !922, size: 64, align: 64, offset: 8192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1046, file: !14, line: 3301, baseType: !1104, size: 64, align: 64, offset: 8256)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1046, file: !14, line: 3310, baseType: !891, size: 32, align: 32, offset: 8320)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1046, file: !14, line: 3337, baseType: !891, size: 32, align: 32, offset: 8352)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1046, file: !14, line: 3351, baseType: !891, size: 32, align: 32, offset: 8384)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1046, file: !14, line: 3359, baseType: !891, size: 32, align: 32, offset: 8416)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !953, file: !14, line: 3535, baseType: !1587, size: 64, align: 64, offset: 1024)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!891, !1044, !1590}
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !953, file: !14, line: 3541, baseType: !1593, size: 64, align: 64, offset: 1088)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1595)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1060, line: 223, size: 128, align: 64, elements: !1597)
!1597 = !{!1598, !1599}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1596, file: !1060, line: 224, baseType: !1482, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1596, file: !1060, line: 225, baseType: !1482, size: 64, align: 64, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !953, file: !14, line: 3549, baseType: !1601, size: 64, align: 64, offset: 1152)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{null, !1039}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !953, file: !14, line: 3551, baseType: !1041, size: 64, align: 64, offset: 1216)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !953, file: !14, line: 3552, baseType: !1606, size: 64, align: 64, offset: 1280)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!891, !1044, !1072, !891, !1609}
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1641}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1611, file: !14, line: 3921, baseType: !934, size: 16, align: 16)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1611, file: !14, line: 3922, baseType: !899, size: 32, align: 32, offset: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1611, file: !14, line: 3923, baseType: !899, size: 32, align: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1611, file: !14, line: 3924, baseType: !892, size: 32, align: 32, offset: 96)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1611, file: !14, line: 3925, baseType: !1618, size: 64, align: 64, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !1634, !1636, !1637, !1638, !1639, !1640}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1621, file: !14, line: 3886, baseType: !891, size: 32, align: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1621, file: !14, line: 3887, baseType: !891, size: 32, align: 32, offset: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1621, file: !14, line: 3888, baseType: !891, size: 32, align: 32, offset: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1621, file: !14, line: 3889, baseType: !891, size: 32, align: 32, offset: 96)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1621, file: !14, line: 3890, baseType: !891, size: 32, align: 32, offset: 128)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1621, file: !14, line: 3897, baseType: !1629, size: 768, align: 64, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1631)
!1631 = !{!1632, !1633}
