; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flacdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flacdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FLACExtradataFormat", file: !910, line: 58, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/flac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913}
!912 = !DIEnumerator(name: "FLAC_EXTRADATA_FORMAT_STREAMINFO", value: 0)
!913 = !DIEnumerator(name: "FLAC_EXTRADATA_FORMAT_FULL_HEADER", value: 1)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 47, size: 32, align: 32, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923}
!916 = !DIEnumerator(name: "FLAC_METADATA_TYPE_STREAMINFO", value: 0)
!917 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PADDING", value: 1)
!918 = !DIEnumerator(name: "FLAC_METADATA_TYPE_APPLICATION", value: 2)
!919 = !DIEnumerator(name: "FLAC_METADATA_TYPE_SEEKTABLE", value: 3)
!920 = !DIEnumerator(name: "FLAC_METADATA_TYPE_VORBIS_COMMENT", value: 4)
!921 = !DIEnumerator(name: "FLAC_METADATA_TYPE_CUESHEET", value: 5)
!922 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PICTURE", value: 6)
!923 = !DIEnumerator(name: "FLAC_METADATA_TYPE_INVALID", value: 127)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !925, line: 49, size: 32, align: 32, elements: !926)
!925 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934, !935}
!927 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!928 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!929 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!930 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!931 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!932 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!933 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!934 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!935 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 40, size: 32, align: 32, elements: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DIEnumerator(name: "FLAC_CHMODE_INDEPENDENT", value: 0)
!939 = !DIEnumerator(name: "FLAC_CHMODE_LEFT_SIDE", value: 1)
!940 = !DIEnumerator(name: "FLAC_CHMODE_RIGHT_SIDE", value: 2)
!941 = !DIEnumerator(name: "FLAC_CHMODE_MID_SIDE", value: 3)
!942 = !{!943, !944, !949, !950, !951, !958, !946, !957, !960, !963}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !947, line: 48, baseType: !948)
!947 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!948 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!949 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!950 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !954, line: 221, size: 32, align: 8, elements: !955)
!954 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !953, file: !954, line: 221, baseType: !957, size: 32, align: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !947, line: 51, baseType: !950)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !961, line: 197, baseType: !962)
!961 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!962 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !961, line: 196, baseType: !949)
!964 = !{!965, !1719, !1720}
!965 = distinct !DIGlobalVariable(name: "ff_flac_decoder", scope: !0, file: !966, line: 676, type: !967, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_flac_decoder)
!966 = !DIFile(filename: "libavcodec/flacdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !969)
!969 = !{!970, !974, !975, !976, !977, !978, !987, !990, !993, !996, !1001, !1002, !1075, !1083, !1084, !1085, !1087, !1634, !1640, !1648, !1652, !1653, !1690, !1694, !1698, !1699, !1703, !1707, !1708, !1712, !1713, !1714}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !14, line: 3475, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !968, file: !14, line: 3480, baseType: !971, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !968, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !968, file: !14, line: 3487, baseType: !949, size: 32, align: 32, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !968, file: !14, line: 3488, baseType: !979, size: 64, align: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !982, line: 61, baseType: !983)
!982 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !982, line: 58, size: 64, align: 32, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !983, file: !982, line: 59, baseType: !949, size: 32, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !983, file: !982, line: 60, baseType: !949, size: 32, align: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !968, file: !14, line: 3489, baseType: !988, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !968, file: !14, line: 3490, baseType: !991, size: 64, align: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !968, file: !14, line: 3491, baseType: !994, size: 64, align: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !968, file: !14, line: 3492, baseType: !997, size: 64, align: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !947, line: 55, baseType: !1000)
!1000 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !968, file: !14, line: 3493, baseType: !946, size: 8, align: 8, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !968, file: !14, line: 3494, baseType: !1003, size: 64, align: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1007)
!1007 = !{!1008, !1009, !1013, !1034, !1035, !1036, !1037, !1041, !1047, !1049, !1053}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1006, file: !713, line: 72, baseType: !971, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1006, file: !713, line: 78, baseType: !1010, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!971, !943}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1006, file: !713, line: 85, baseType: !1014, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1030, !1031, !1032, !1033}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !691, line: 247, baseType: !971, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1016, file: !691, line: 253, baseType: !971, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1016, file: !691, line: 259, baseType: !949, size: 32, align: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1016, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1016, file: !691, line: 271, baseType: !1023, size: 64, align: 64, offset: 192)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1016, file: !691, line: 265, size: 64, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1023, file: !691, line: 266, baseType: !960, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1023, file: !691, line: 267, baseType: !1027, size: 64, align: 64)
!1027 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1023, file: !691, line: 268, baseType: !971, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1023, file: !691, line: 270, baseType: !981, size: 64, align: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1016, file: !691, line: 272, baseType: !1027, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1016, file: !691, line: 273, baseType: !1027, size: 64, align: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1016, file: !691, line: 275, baseType: !949, size: 32, align: 32, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1016, file: !691, line: 300, baseType: !971, size: 64, align: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1006, file: !713, line: 93, baseType: !949, size: 32, align: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1006, file: !713, line: 99, baseType: !949, size: 32, align: 32, offset: 224)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1006, file: !713, line: 108, baseType: !949, size: 32, align: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1006, file: !713, line: 113, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!943, !943, !943}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1006, file: !713, line: 123, baseType: !1042, size: 64, align: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1006, file: !713, line: 130, baseType: !1048, size: 32, align: 32, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1006, file: !713, line: 136, baseType: !1050, size: 64, align: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1048, !943}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1006, file: !713, line: 142, baseType: !1054, size: 64, align: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!949, !1057, !943, !971, !949}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1060)
!1060 = !{!1061, !1073, !1074}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1059, file: !691, line: 360, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1065, file: !691, line: 307, baseType: !971, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1065, file: !691, line: 313, baseType: !1027, size: 64, align: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1065, file: !691, line: 313, baseType: !1027, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1065, file: !691, line: 318, baseType: !1027, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1065, file: !691, line: 318, baseType: !1027, size: 64, align: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1065, file: !691, line: 323, baseType: !949, size: 32, align: 32, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1059, file: !691, line: 364, baseType: !949, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1059, file: !691, line: 368, baseType: !949, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !968, file: !14, line: 3495, baseType: !1076, size: 64, align: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1079, file: !14, line: 3402, baseType: !949, size: 32, align: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1079, file: !14, line: 3403, baseType: !971, size: 64, align: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !968, file: !14, line: 3507, baseType: !971, size: 64, align: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !968, file: !14, line: 3516, baseType: !949, size: 32, align: 32, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !968, file: !14, line: 3517, baseType: !1086, size: 64, align: 64, offset: 896)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !968, file: !14, line: 3527, baseType: !1088, size: 64, align: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!949, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1101, !1102, !1103, !1104, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1382, !1386, !1387, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1572, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1093, file: !14, line: 1561, baseType: !1003, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1093, file: !14, line: 1562, baseType: !949, size: 32, align: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1093, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1093, file: !14, line: 1565, baseType: !1099, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1093, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1093, file: !14, line: 1581, baseType: !950, size: 32, align: 32, offset: 224)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1093, file: !14, line: 1583, baseType: !943, size: 64, align: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1093, file: !14, line: 1591, baseType: !1105, size: 64, align: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1107, line: 129, size: 1664, align: 64, elements: !1108)
!1107 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1108 = !{!1109, !1110, !1111, !1112, !1208, !1229, !1230, !1259, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1106, file: !1107, line: 136, baseType: !949, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1106, file: !1107, line: 151, baseType: !949, size: 32, align: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1106, file: !1107, line: 157, baseType: !949, size: 32, align: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1106, file: !1107, line: 159, baseType: !1113, size: 64, align: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1116)
!1116 = !{!1117, !1121, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1160, !1162, !1163, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1196, !1197, !1198, !1199, !1200, !1201, !1204, !1205, !1206, !1207}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1115, file: !744, line: 282, baseType: !1118, size: 512, align: 64)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 64, elements: !1119)
!1119 = !{!1120}
!1120 = !DISubrange(count: 8)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1115, file: !744, line: 299, baseType: !1122, size: 256, align: 32, offset: 512)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 32, elements: !1119)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1115, file: !744, line: 315, baseType: !944, size: 64, align: 64, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1115, file: !744, line: 326, baseType: !949, size: 32, align: 32, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1115, file: !744, line: 326, baseType: !949, size: 32, align: 32, offset: 864)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1115, file: !744, line: 334, baseType: !949, size: 32, align: 32, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1115, file: !744, line: 341, baseType: !949, size: 32, align: 32, offset: 928)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1115, file: !744, line: 346, baseType: !949, size: 32, align: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1115, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1115, file: !744, line: 356, baseType: !981, size: 64, align: 32, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1115, file: !744, line: 361, baseType: !960, size: 64, align: 64, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1115, file: !744, line: 369, baseType: !960, size: 64, align: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1115, file: !744, line: 377, baseType: !960, size: 64, align: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1115, file: !744, line: 382, baseType: !949, size: 32, align: 32, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1115, file: !744, line: 386, baseType: !949, size: 32, align: 32, offset: 1312)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1115, file: !744, line: 391, baseType: !949, size: 32, align: 32, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1115, file: !744, line: 396, baseType: !943, size: 64, align: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1115, file: !744, line: 403, baseType: !1139, size: 512, align: 64, offset: 1472)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 512, align: 64, elements: !1119)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1115, file: !744, line: 410, baseType: !949, size: 32, align: 32, offset: 1984)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1115, file: !744, line: 415, baseType: !949, size: 32, align: 32, offset: 2016)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1115, file: !744, line: 420, baseType: !949, size: 32, align: 32, offset: 2048)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1115, file: !744, line: 425, baseType: !949, size: 32, align: 32, offset: 2080)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1115, file: !744, line: 435, baseType: !960, size: 64, align: 64, offset: 2112)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1115, file: !744, line: 440, baseType: !949, size: 32, align: 32, offset: 2176)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1115, file: !744, line: 445, baseType: !999, size: 64, align: 64, offset: 2240)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1115, file: !744, line: 459, baseType: !1148, size: 512, align: 64, offset: 2304)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 512, align: 64, elements: !1119)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1151, line: 94, baseType: !1152)
!1151 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1151, line: 81, size: 192, align: 64, elements: !1153)
!1153 = !{!1154, !1158, !1159}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1152, file: !1151, line: 82, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1151, line: 73, baseType: !1157)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1151, line: 73, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !1151, line: 89, baseType: !945, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !1151, line: 93, baseType: !949, size: 32, align: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1115, file: !744, line: 473, baseType: !1161, size: 64, align: 64, offset: 2816)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1115, file: !744, line: 477, baseType: !949, size: 32, align: 32, offset: 2880)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1115, file: !744, line: 479, baseType: !1164, size: 64, align: 64, offset: 2944)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1177}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1167, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !744, line: 203, baseType: !945, size: 64, align: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !744, line: 204, baseType: !949, size: 32, align: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1167, file: !744, line: 205, baseType: !1173, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1175, line: 86, baseType: !1176)
!1175 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1175, line: 86, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1167, file: !744, line: 206, baseType: !1149, size: 64, align: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1115, file: !744, line: 480, baseType: !949, size: 32, align: 32, offset: 3008)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1115, file: !744, line: 505, baseType: !949, size: 32, align: 32, offset: 3040)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1115, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1115, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1115, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1115, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1115, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1115, file: !744, line: 532, baseType: !960, size: 64, align: 64, offset: 3264)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1115, file: !744, line: 539, baseType: !960, size: 64, align: 64, offset: 3328)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1115, file: !744, line: 547, baseType: !960, size: 64, align: 64, offset: 3392)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1115, file: !744, line: 554, baseType: !1173, size: 64, align: 64, offset: 3456)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1115, file: !744, line: 563, baseType: !949, size: 32, align: 32, offset: 3520)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1115, file: !744, line: 572, baseType: !949, size: 32, align: 32, offset: 3552)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1115, file: !744, line: 581, baseType: !949, size: 32, align: 32, offset: 3584)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1115, file: !744, line: 588, baseType: !1193, size: 64, align: 64, offset: 3648)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !961, line: 194, baseType: !1195)
!1195 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1115, file: !744, line: 593, baseType: !949, size: 32, align: 32, offset: 3712)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1115, file: !744, line: 596, baseType: !949, size: 32, align: 32, offset: 3744)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1115, file: !744, line: 599, baseType: !1149, size: 64, align: 64, offset: 3776)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1115, file: !744, line: 605, baseType: !1149, size: 64, align: 64, offset: 3840)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1115, file: !744, line: 616, baseType: !1149, size: 64, align: 64, offset: 3904)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1115, file: !744, line: 626, baseType: !1202, size: 64, align: 64, offset: 3968)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1203, line: 216, baseType: !1000)
!1203 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1115, file: !744, line: 627, baseType: !1202, size: 64, align: 64, offset: 4032)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1115, file: !744, line: 628, baseType: !1202, size: 64, align: 64, offset: 4096)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1115, file: !744, line: 629, baseType: !1202, size: 64, align: 64, offset: 4160)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1115, file: !744, line: 645, baseType: !1149, size: 64, align: 64, offset: 4224)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1106, file: !1107, line: 161, baseType: !1209, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1107, line: 117, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1107, line: 100, size: 832, align: 64, elements: !1212)
!1212 = !{!1213, !1220, !1221, !1222, !1223, !1224, !1226, !1227, !1228}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1211, file: !1107, line: 105, baseType: !1214, size: 256, align: 64)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 256, align: 64, elements: !1218)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1151, line: 238, baseType: !1217)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1151, line: 238, flags: DIFlagFwdDecl)
!1218 = !{!1219}
!1219 = !DISubrange(count: 4)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1211, file: !1107, line: 110, baseType: !949, size: 32, align: 32, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1211, file: !1107, line: 111, baseType: !949, size: 32, align: 32, offset: 288)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1211, file: !1107, line: 111, baseType: !949, size: 32, align: 32, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1211, file: !1107, line: 112, baseType: !1122, size: 256, align: 32, offset: 352)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1211, file: !1107, line: 113, baseType: !1225, size: 128, align: 32, offset: 608)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, align: 32, elements: !1218)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1211, file: !1107, line: 114, baseType: !949, size: 32, align: 32, offset: 736)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1211, file: !1107, line: 115, baseType: !949, size: 32, align: 32, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1211, file: !1107, line: 116, baseType: !949, size: 32, align: 32, offset: 800)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1106, file: !1107, line: 163, baseType: !943, size: 64, align: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1106, file: !1107, line: 165, baseType: !1231, size: 128, align: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1107, line: 122, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1107, line: 119, size: 128, align: 64, elements: !1233)
!1233 = !{!1234, !1258}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1232, file: !1107, line: 120, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1254, !1255, !1256, !1257}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1237, file: !14, line: 1451, baseType: !1149, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1237, file: !14, line: 1461, baseType: !960, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1237, file: !14, line: 1467, baseType: !960, size: 64, align: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !14, line: 1468, baseType: !945, size: 64, align: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1237, file: !14, line: 1469, baseType: !949, size: 32, align: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1237, file: !14, line: 1470, baseType: !949, size: 32, align: 32, offset: 288)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1237, file: !14, line: 1474, baseType: !949, size: 32, align: 32, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1237, file: !14, line: 1479, baseType: !1247, size: 64, align: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1249, file: !14, line: 1412, baseType: !945, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1249, file: !14, line: 1413, baseType: !949, size: 32, align: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1249, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1237, file: !14, line: 1480, baseType: !949, size: 32, align: 32, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1237, file: !14, line: 1486, baseType: !960, size: 64, align: 64, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1237, file: !14, line: 1488, baseType: !960, size: 64, align: 64, offset: 576)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1237, file: !14, line: 1497, baseType: !960, size: 64, align: 64, offset: 640)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1232, file: !1107, line: 121, baseType: !1113, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1106, file: !1107, line: 166, baseType: !1260, size: 128, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1107, line: 127, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1107, line: 124, size: 128, align: 64, elements: !1262)
!1262 = !{!1263, !1336}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1261, file: !1107, line: 125, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1268)
!1268 = !{!1269, !1270, !1294, !1298, !1299, !1333, !1334, !1335}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1267, file: !14, line: 5751, baseType: !1003, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1267, file: !14, line: 5756, baseType: !1271, size: 64, align: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1274)
!1274 = !{!1275, !1276, !1279, !1280, !1281, !1285, !1289, !1293}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1273, file: !14, line: 5797, baseType: !971, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1273, file: !14, line: 5804, baseType: !1277, size: 64, align: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1273, file: !14, line: 5815, baseType: !1003, size: 64, align: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1273, file: !14, line: 5825, baseType: !949, size: 32, align: 32, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1273, file: !14, line: 5826, baseType: !1282, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!949, !1265}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1273, file: !14, line: 5827, baseType: !1286, size: 64, align: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!949, !1265, !1235}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1273, file: !14, line: 5828, baseType: !1290, size: 64, align: 64, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1265}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1273, file: !14, line: 5829, baseType: !1290, size: 64, align: 64, offset: 448)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1267, file: !14, line: 5762, baseType: !1295, size: 64, align: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1297)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1267, file: !14, line: 5768, baseType: !943, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1267, file: !14, line: 5775, baseType: !1300, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1302, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1302, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1302, file: !14, line: 3948, baseType: !957, size: 32, align: 32, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1302, file: !14, line: 3958, baseType: !945, size: 64, align: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1302, file: !14, line: 3962, baseType: !949, size: 32, align: 32, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1302, file: !14, line: 3968, baseType: !949, size: 32, align: 32, offset: 224)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1302, file: !14, line: 3973, baseType: !960, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1302, file: !14, line: 3986, baseType: !949, size: 32, align: 32, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1302, file: !14, line: 3999, baseType: !949, size: 32, align: 32, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1302, file: !14, line: 4004, baseType: !949, size: 32, align: 32, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1302, file: !14, line: 4005, baseType: !949, size: 32, align: 32, offset: 416)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1302, file: !14, line: 4010, baseType: !949, size: 32, align: 32, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1302, file: !14, line: 4011, baseType: !949, size: 32, align: 32, offset: 480)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1302, file: !14, line: 4020, baseType: !981, size: 64, align: 32, offset: 512)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1302, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1302, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1302, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1302, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1302, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1302, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1302, file: !14, line: 4039, baseType: !949, size: 32, align: 32, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1302, file: !14, line: 4046, baseType: !999, size: 64, align: 64, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1302, file: !14, line: 4050, baseType: !949, size: 32, align: 32, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1302, file: !14, line: 4054, baseType: !949, size: 32, align: 32, offset: 928)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1302, file: !14, line: 4061, baseType: !949, size: 32, align: 32, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1302, file: !14, line: 4065, baseType: !949, size: 32, align: 32, offset: 992)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1302, file: !14, line: 4073, baseType: !949, size: 32, align: 32, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1302, file: !14, line: 4080, baseType: !949, size: 32, align: 32, offset: 1056)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1302, file: !14, line: 4084, baseType: !949, size: 32, align: 32, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1267, file: !14, line: 5781, baseType: !1300, size: 64, align: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1267, file: !14, line: 5787, baseType: !981, size: 64, align: 32, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1267, file: !14, line: 5793, baseType: !981, size: 64, align: 32, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1261, file: !1107, line: 126, baseType: !949, size: 32, align: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1106, file: !1107, line: 172, baseType: !1235, size: 64, align: 64, offset: 576)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1106, file: !1107, line: 177, baseType: !945, size: 64, align: 64, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1106, file: !1107, line: 178, baseType: !950, size: 32, align: 32, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1106, file: !1107, line: 180, baseType: !943, size: 64, align: 64, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1106, file: !1107, line: 185, baseType: !949, size: 32, align: 32, offset: 832)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1106, file: !1107, line: 190, baseType: !943, size: 64, align: 64, offset: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1106, file: !1107, line: 195, baseType: !949, size: 32, align: 32, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1106, file: !1107, line: 200, baseType: !1235, size: 64, align: 64, offset: 1024)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1106, file: !1107, line: 201, baseType: !949, size: 32, align: 32, offset: 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1106, file: !1107, line: 202, baseType: !1113, size: 64, align: 64, offset: 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1106, file: !1107, line: 203, baseType: !949, size: 32, align: 32, offset: 1216)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1106, file: !1107, line: 205, baseType: !949, size: 32, align: 32, offset: 1248)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1106, file: !1107, line: 206, baseType: !949, size: 32, align: 32, offset: 1280)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1106, file: !1107, line: 209, baseType: !1202, size: 64, align: 64, offset: 1344)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1106, file: !1107, line: 212, baseType: !1202, size: 64, align: 64, offset: 1408)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1106, file: !1107, line: 213, baseType: !1113, size: 64, align: 64, offset: 1472)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1106, file: !1107, line: 215, baseType: !949, size: 32, align: 32, offset: 1536)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1106, file: !1107, line: 217, baseType: !949, size: 32, align: 32, offset: 1568)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1106, file: !1107, line: 220, baseType: !949, size: 32, align: 32, offset: 1600)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1093, file: !14, line: 1598, baseType: !943, size: 64, align: 64, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1093, file: !14, line: 1606, baseType: !960, size: 64, align: 64, offset: 448)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1093, file: !14, line: 1614, baseType: !949, size: 32, align: 32, offset: 512)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1093, file: !14, line: 1622, baseType: !949, size: 32, align: 32, offset: 544)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1093, file: !14, line: 1628, baseType: !949, size: 32, align: 32, offset: 576)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !14, line: 1636, baseType: !949, size: 32, align: 32, offset: 608)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1093, file: !14, line: 1643, baseType: !949, size: 32, align: 32, offset: 640)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1093, file: !14, line: 1657, baseType: !945, size: 64, align: 64, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1093, file: !14, line: 1658, baseType: !949, size: 32, align: 32, offset: 768)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1093, file: !14, line: 1679, baseType: !981, size: 64, align: 32, offset: 800)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1093, file: !14, line: 1688, baseType: !949, size: 32, align: 32, offset: 864)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1093, file: !14, line: 1712, baseType: !949, size: 32, align: 32, offset: 896)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1093, file: !14, line: 1729, baseType: !949, size: 32, align: 32, offset: 928)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1093, file: !14, line: 1729, baseType: !949, size: 32, align: 32, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1093, file: !14, line: 1744, baseType: !949, size: 32, align: 32, offset: 992)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1093, file: !14, line: 1744, baseType: !949, size: 32, align: 32, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1093, file: !14, line: 1751, baseType: !949, size: 32, align: 32, offset: 1056)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1093, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1093, file: !14, line: 1791, baseType: !1375, size: 64, align: 64, offset: 1152)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !1378, !1379, !1381, !949, !949, !949}
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1093, file: !14, line: 1808, baseType: !1383, size: 64, align: 64, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!473, !1378, !988}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1093, file: !14, line: 1816, baseType: !949, size: 32, align: 32, offset: 1280)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1093, file: !14, line: 1825, baseType: !1388, size: 32, align: 32, offset: 1312)
!1388 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1093, file: !14, line: 1830, baseType: !949, size: 32, align: 32, offset: 1344)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1093, file: !14, line: 1838, baseType: !1388, size: 32, align: 32, offset: 1376)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1093, file: !14, line: 1846, baseType: !949, size: 32, align: 32, offset: 1408)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1093, file: !14, line: 1851, baseType: !949, size: 32, align: 32, offset: 1440)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1093, file: !14, line: 1861, baseType: !1388, size: 32, align: 32, offset: 1472)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1093, file: !14, line: 1868, baseType: !1388, size: 32, align: 32, offset: 1504)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1093, file: !14, line: 1875, baseType: !1388, size: 32, align: 32, offset: 1536)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1093, file: !14, line: 1882, baseType: !1388, size: 32, align: 32, offset: 1568)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1093, file: !14, line: 1889, baseType: !1388, size: 32, align: 32, offset: 1600)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1093, file: !14, line: 1896, baseType: !1388, size: 32, align: 32, offset: 1632)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1093, file: !14, line: 1903, baseType: !1388, size: 32, align: 32, offset: 1664)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1093, file: !14, line: 1910, baseType: !949, size: 32, align: 32, offset: 1696)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1093, file: !14, line: 1915, baseType: !949, size: 32, align: 32, offset: 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1093, file: !14, line: 1926, baseType: !1381, size: 64, align: 64, offset: 1792)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1093, file: !14, line: 1935, baseType: !981, size: 64, align: 32, offset: 1856)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1093, file: !14, line: 1942, baseType: !949, size: 32, align: 32, offset: 1920)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1093, file: !14, line: 1948, baseType: !949, size: 32, align: 32, offset: 1952)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1093, file: !14, line: 1954, baseType: !949, size: 32, align: 32, offset: 1984)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1093, file: !14, line: 1960, baseType: !949, size: 32, align: 32, offset: 2016)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1093, file: !14, line: 1984, baseType: !949, size: 32, align: 32, offset: 2048)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1093, file: !14, line: 1991, baseType: !949, size: 32, align: 32, offset: 2080)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1093, file: !14, line: 1996, baseType: !949, size: 32, align: 32, offset: 2112)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1093, file: !14, line: 2004, baseType: !949, size: 32, align: 32, offset: 2144)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1093, file: !14, line: 2011, baseType: !949, size: 32, align: 32, offset: 2176)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1093, file: !14, line: 2018, baseType: !949, size: 32, align: 32, offset: 2208)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1093, file: !14, line: 2027, baseType: !949, size: 32, align: 32, offset: 2240)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1093, file: !14, line: 2034, baseType: !949, size: 32, align: 32, offset: 2272)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1093, file: !14, line: 2044, baseType: !949, size: 32, align: 32, offset: 2304)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1093, file: !14, line: 2054, baseType: !1418, size: 64, align: 64, offset: 2368)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !947, line: 49, baseType: !1420)
!1420 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1093, file: !14, line: 2061, baseType: !1418, size: 64, align: 64, offset: 2432)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1093, file: !14, line: 2066, baseType: !949, size: 32, align: 32, offset: 2496)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1093, file: !14, line: 2070, baseType: !949, size: 32, align: 32, offset: 2528)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1093, file: !14, line: 2078, baseType: !949, size: 32, align: 32, offset: 2560)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1093, file: !14, line: 2085, baseType: !949, size: 32, align: 32, offset: 2592)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1093, file: !14, line: 2092, baseType: !949, size: 32, align: 32, offset: 2624)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1093, file: !14, line: 2099, baseType: !949, size: 32, align: 32, offset: 2656)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1093, file: !14, line: 2106, baseType: !949, size: 32, align: 32, offset: 2688)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1093, file: !14, line: 2113, baseType: !949, size: 32, align: 32, offset: 2720)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1093, file: !14, line: 2120, baseType: !949, size: 32, align: 32, offset: 2752)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1093, file: !14, line: 2125, baseType: !949, size: 32, align: 32, offset: 2784)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1093, file: !14, line: 2133, baseType: !949, size: 32, align: 32, offset: 2816)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1093, file: !14, line: 2140, baseType: !949, size: 32, align: 32, offset: 2848)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1093, file: !14, line: 2145, baseType: !949, size: 32, align: 32, offset: 2880)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1093, file: !14, line: 2153, baseType: !949, size: 32, align: 32, offset: 2912)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1093, file: !14, line: 2158, baseType: !949, size: 32, align: 32, offset: 2944)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1093, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1093, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1093, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1093, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1093, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1093, file: !14, line: 2203, baseType: !949, size: 32, align: 32, offset: 3136)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1093, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1093, file: !14, line: 2212, baseType: !949, size: 32, align: 32, offset: 3200)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1093, file: !14, line: 2213, baseType: !949, size: 32, align: 32, offset: 3232)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1093, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1093, file: !14, line: 2232, baseType: !949, size: 32, align: 32, offset: 3296)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1093, file: !14, line: 2243, baseType: !949, size: 32, align: 32, offset: 3328)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1093, file: !14, line: 2249, baseType: !949, size: 32, align: 32, offset: 3360)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1093, file: !14, line: 2256, baseType: !949, size: 32, align: 32, offset: 3392)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1093, file: !14, line: 2263, baseType: !999, size: 64, align: 64, offset: 3456)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1093, file: !14, line: 2270, baseType: !999, size: 64, align: 64, offset: 3520)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1093, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1093, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1093, file: !14, line: 2367, baseType: !1456, size: 64, align: 64, offset: 3648)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!949, !1378, !1113, !949}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1093, file: !14, line: 2383, baseType: !949, size: 32, align: 32, offset: 3712)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1093, file: !14, line: 2386, baseType: !1388, size: 32, align: 32, offset: 3744)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1093, file: !14, line: 2387, baseType: !1388, size: 32, align: 32, offset: 3776)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1093, file: !14, line: 2394, baseType: !949, size: 32, align: 32, offset: 3808)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1093, file: !14, line: 2401, baseType: !949, size: 32, align: 32, offset: 3840)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1093, file: !14, line: 2408, baseType: !949, size: 32, align: 32, offset: 3872)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1093, file: !14, line: 2415, baseType: !949, size: 32, align: 32, offset: 3904)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1093, file: !14, line: 2422, baseType: !949, size: 32, align: 32, offset: 3936)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1093, file: !14, line: 2423, baseType: !1468, size: 64, align: 64, offset: 3968)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1470, file: !14, line: 827, baseType: !949, size: 32, align: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1470, file: !14, line: 828, baseType: !949, size: 32, align: 32, offset: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1470, file: !14, line: 829, baseType: !949, size: 32, align: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1470, file: !14, line: 830, baseType: !1388, size: 32, align: 32, offset: 96)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1093, file: !14, line: 2430, baseType: !960, size: 64, align: 64, offset: 4032)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1093, file: !14, line: 2437, baseType: !960, size: 64, align: 64, offset: 4096)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1093, file: !14, line: 2444, baseType: !1388, size: 32, align: 32, offset: 4160)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1093, file: !14, line: 2451, baseType: !1388, size: 32, align: 32, offset: 4192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1093, file: !14, line: 2458, baseType: !949, size: 32, align: 32, offset: 4224)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1093, file: !14, line: 2469, baseType: !949, size: 32, align: 32, offset: 4256)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1093, file: !14, line: 2475, baseType: !949, size: 32, align: 32, offset: 4288)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1093, file: !14, line: 2481, baseType: !949, size: 32, align: 32, offset: 4320)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1093, file: !14, line: 2485, baseType: !949, size: 32, align: 32, offset: 4352)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1093, file: !14, line: 2489, baseType: !949, size: 32, align: 32, offset: 4384)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1093, file: !14, line: 2493, baseType: !949, size: 32, align: 32, offset: 4416)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1093, file: !14, line: 2501, baseType: !949, size: 32, align: 32, offset: 4448)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1093, file: !14, line: 2506, baseType: !949, size: 32, align: 32, offset: 4480)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1093, file: !14, line: 2510, baseType: !949, size: 32, align: 32, offset: 4512)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1093, file: !14, line: 2514, baseType: !960, size: 64, align: 64, offset: 4544)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1093, file: !14, line: 2528, baseType: !1492, size: 64, align: 64, offset: 4608)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !1378, !943, !949, !949}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1093, file: !14, line: 2534, baseType: !949, size: 32, align: 32, offset: 4672)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1093, file: !14, line: 2545, baseType: !949, size: 32, align: 32, offset: 4704)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1093, file: !14, line: 2547, baseType: !949, size: 32, align: 32, offset: 4736)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1093, file: !14, line: 2549, baseType: !949, size: 32, align: 32, offset: 4768)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1093, file: !14, line: 2551, baseType: !949, size: 32, align: 32, offset: 4800)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1093, file: !14, line: 2553, baseType: !949, size: 32, align: 32, offset: 4832)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1093, file: !14, line: 2555, baseType: !949, size: 32, align: 32, offset: 4864)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1093, file: !14, line: 2557, baseType: !949, size: 32, align: 32, offset: 4896)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1093, file: !14, line: 2559, baseType: !949, size: 32, align: 32, offset: 4928)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1093, file: !14, line: 2563, baseType: !949, size: 32, align: 32, offset: 4960)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1093, file: !14, line: 2571, baseType: !1506, size: 64, align: 64, offset: 4992)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1093, file: !14, line: 2579, baseType: !1506, size: 64, align: 64, offset: 5056)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1093, file: !14, line: 2586, baseType: !949, size: 32, align: 32, offset: 5120)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1093, file: !14, line: 2615, baseType: !949, size: 32, align: 32, offset: 5152)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1093, file: !14, line: 2627, baseType: !949, size: 32, align: 32, offset: 5184)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1093, file: !14, line: 2637, baseType: !949, size: 32, align: 32, offset: 5216)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1093, file: !14, line: 2681, baseType: !949, size: 32, align: 32, offset: 5248)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1093, file: !14, line: 2709, baseType: !960, size: 64, align: 64, offset: 5312)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1093, file: !14, line: 2716, baseType: !1515, size: 64, align: 64, offset: 5376)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1518)
!1518 = !{!1519, !1520, !1521, !1522, !1523, !1524, !1528, !1532, !1536, !1537, !1538, !1539, !1545, !1546, !1547, !1548, !1549}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1517, file: !14, line: 3642, baseType: !971, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1517, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1517, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1517, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1517, file: !14, line: 3669, baseType: !949, size: 32, align: 32, offset: 160)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1517, file: !14, line: 3682, baseType: !1525, size: 64, align: 64, offset: 192)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!949, !1091, !1113}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1517, file: !14, line: 3698, baseType: !1529, size: 64, align: 64, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!949, !1091, !958, !957}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1517, file: !14, line: 3712, baseType: !1533, size: 64, align: 64, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!949, !1091, !949, !958, !957}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1517, file: !14, line: 3726, baseType: !1529, size: 64, align: 64, offset: 384)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1517, file: !14, line: 3737, baseType: !1088, size: 64, align: 64, offset: 448)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1517, file: !14, line: 3746, baseType: !949, size: 32, align: 32, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1517, file: !14, line: 3757, baseType: !1540, size: 64, align: 64, offset: 576)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{null, !1543}
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1517, file: !14, line: 3766, baseType: !1088, size: 64, align: 64, offset: 640)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1517, file: !14, line: 3774, baseType: !1088, size: 64, align: 64, offset: 704)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1517, file: !14, line: 3780, baseType: !949, size: 32, align: 32, offset: 768)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1517, file: !14, line: 3785, baseType: !949, size: 32, align: 32, offset: 800)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1517, file: !14, line: 3795, baseType: !1550, size: 64, align: 64, offset: 832)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!949, !1091, !1149}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1093, file: !14, line: 2728, baseType: !943, size: 64, align: 64, offset: 5440)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1093, file: !14, line: 2735, baseType: !1139, size: 512, align: 64, offset: 5504)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1093, file: !14, line: 2742, baseType: !949, size: 32, align: 32, offset: 6016)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1093, file: !14, line: 2755, baseType: !949, size: 32, align: 32, offset: 6048)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1093, file: !14, line: 2776, baseType: !949, size: 32, align: 32, offset: 6080)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1093, file: !14, line: 2783, baseType: !949, size: 32, align: 32, offset: 6112)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1093, file: !14, line: 2791, baseType: !949, size: 32, align: 32, offset: 6144)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1093, file: !14, line: 2802, baseType: !1113, size: 64, align: 64, offset: 6208)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1093, file: !14, line: 2811, baseType: !949, size: 32, align: 32, offset: 6272)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1093, file: !14, line: 2821, baseType: !949, size: 32, align: 32, offset: 6304)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1093, file: !14, line: 2830, baseType: !949, size: 32, align: 32, offset: 6336)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1093, file: !14, line: 2840, baseType: !949, size: 32, align: 32, offset: 6368)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1093, file: !14, line: 2851, baseType: !1566, size: 64, align: 64, offset: 6400)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!949, !1378, !1569, !943, !1381, !949, !949}
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!949, !1378, !943}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1093, file: !14, line: 2871, baseType: !1573, size: 64, align: 64, offset: 6464)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!949, !1378, !1576, !943, !1381, !949}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!949, !1378, !943, !949, !949}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1093, file: !14, line: 2878, baseType: !949, size: 32, align: 32, offset: 6528)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1093, file: !14, line: 2885, baseType: !949, size: 32, align: 32, offset: 6560)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1093, file: !14, line: 3005, baseType: !949, size: 32, align: 32, offset: 6592)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1093, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1093, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1093, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1093, file: !14, line: 3037, baseType: !945, size: 64, align: 64, offset: 6720)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1093, file: !14, line: 3038, baseType: !949, size: 32, align: 32, offset: 6784)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1093, file: !14, line: 3050, baseType: !999, size: 64, align: 64, offset: 6848)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1093, file: !14, line: 3065, baseType: !949, size: 32, align: 32, offset: 6912)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1093, file: !14, line: 3083, baseType: !949, size: 32, align: 32, offset: 6944)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1093, file: !14, line: 3092, baseType: !981, size: 64, align: 32, offset: 6976)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1093, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1093, file: !14, line: 3106, baseType: !981, size: 64, align: 32, offset: 7072)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1093, file: !14, line: 3113, baseType: !1594, size: 64, align: 64, offset: 7168)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1596)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602, !1603, !1604, !1607}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1597, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1597, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1597, file: !14, line: 720, baseType: !971, size: 64, align: 64, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1597, file: !14, line: 724, baseType: !971, size: 64, align: 64, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1597, file: !14, line: 728, baseType: !949, size: 32, align: 32, offset: 192)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1597, file: !14, line: 734, baseType: !1605, size: 64, align: 64, offset: 256)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1597, file: !14, line: 739, baseType: !1608, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1093, file: !14, line: 3129, baseType: !960, size: 64, align: 64, offset: 7232)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1093, file: !14, line: 3130, baseType: !960, size: 64, align: 64, offset: 7296)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1093, file: !14, line: 3131, baseType: !960, size: 64, align: 64, offset: 7360)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1093, file: !14, line: 3132, baseType: !960, size: 64, align: 64, offset: 7424)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1093, file: !14, line: 3139, baseType: !1506, size: 64, align: 64, offset: 7488)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1093, file: !14, line: 3147, baseType: !949, size: 32, align: 32, offset: 7552)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1093, file: !14, line: 3165, baseType: !949, size: 32, align: 32, offset: 7584)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1093, file: !14, line: 3172, baseType: !949, size: 32, align: 32, offset: 7616)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1093, file: !14, line: 3180, baseType: !949, size: 32, align: 32, offset: 7648)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1093, file: !14, line: 3191, baseType: !1418, size: 64, align: 64, offset: 7680)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1093, file: !14, line: 3199, baseType: !945, size: 64, align: 64, offset: 7744)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1093, file: !14, line: 3207, baseType: !1506, size: 64, align: 64, offset: 7808)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1093, file: !14, line: 3214, baseType: !950, size: 32, align: 32, offset: 7872)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1093, file: !14, line: 3224, baseType: !1247, size: 64, align: 64, offset: 7936)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1093, file: !14, line: 3225, baseType: !949, size: 32, align: 32, offset: 8000)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1093, file: !14, line: 3249, baseType: !1149, size: 64, align: 64, offset: 8064)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1093, file: !14, line: 3256, baseType: !949, size: 32, align: 32, offset: 8128)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1093, file: !14, line: 3271, baseType: !949, size: 32, align: 32, offset: 8160)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1093, file: !14, line: 3279, baseType: !960, size: 64, align: 64, offset: 8192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1093, file: !14, line: 3301, baseType: !1149, size: 64, align: 64, offset: 8256)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1093, file: !14, line: 3310, baseType: !949, size: 32, align: 32, offset: 8320)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1093, file: !14, line: 3337, baseType: !949, size: 32, align: 32, offset: 8352)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1093, file: !14, line: 3351, baseType: !949, size: 32, align: 32, offset: 8384)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1093, file: !14, line: 3359, baseType: !949, size: 32, align: 32, offset: 8416)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !968, file: !14, line: 3535, baseType: !1635, size: 64, align: 64, offset: 1024)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!949, !1091, !1638}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !968, file: !14, line: 3541, baseType: !1641, size: 64, align: 64, offset: 1088)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1644)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1107, line: 223, size: 128, align: 64, elements: !1645)
!1645 = !{!1646, !1647}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1644, file: !1107, line: 224, baseType: !958, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1644, file: !1107, line: 225, baseType: !958, size: 64, align: 64, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !968, file: !14, line: 3549, baseType: !1649, size: 64, align: 64, offset: 1152)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !1086}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !968, file: !14, line: 3551, baseType: !1088, size: 64, align: 64, offset: 1216)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !968, file: !14, line: 3552, baseType: !1654, size: 64, align: 64, offset: 1280)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!949, !1091, !945, !949, !1657}
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664, !1665, !1689}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1659, file: !14, line: 3921, baseType: !1419, size: 16, align: 16)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1659, file: !14, line: 3922, baseType: !957, size: 32, align: 32, offset: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1659, file: !14, line: 3923, baseType: !957, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1659, file: !14, line: 3924, baseType: !950, size: 32, align: 32, offset: 96)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1659, file: !14, line: 3925, baseType: !1666, size: 64, align: 64, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1669)
!1669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1670)
!1670 = !{!1671, !1672, !1673, !1674, !1675, !1676, !1682, !1684, !1685, !1686, !1687, !1688}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1669, file: !14, line: 3886, baseType: !949, size: 32, align: 32)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1669, file: !14, line: 3887, baseType: !949, size: 32, align: 32, offset: 32)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1669, file: !14, line: 3888, baseType: !949, size: 32, align: 32, offset: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1669, file: !14, line: 3889, baseType: !949, size: 32, align: 32, offset: 96)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1669, file: !14, line: 3890, baseType: !949, size: 32, align: 32, offset: 128)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1669, file: !14, line: 3897, baseType: !1677, size: 768, align: 64, offset: 192)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1679)
!1679 = !{!1680, !1681}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1678, file: !14, line: 3855, baseType: !1118, size: 512, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1678, file: !14, line: 3857, baseType: !1122, size: 256, align: 32, offset: 512)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1669, file: !14, line: 3903, baseType: !1683, size: 256, align: 64, offset: 960)
!1683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 64, elements: !1218)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1669, file: !14, line: 3904, baseType: !1225, size: 128, align: 32, offset: 1216)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1669, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1669, file: !14, line: 3908, baseType: !1506, size: 64, align: 64, offset: 1408)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1669, file: !14, line: 3915, baseType: !1506, size: 64, align: 64, offset: 1472)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1669, file: !14, line: 3917, baseType: !949, size: 32, align: 32, offset: 1536)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1659, file: !14, line: 3926, baseType: !960, size: 64, align: 64, offset: 192)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !968, file: !14, line: 3564, baseType: !1691, size: 64, align: 64, offset: 1344)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!949, !1091, !1235, !1379, !1381}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !968, file: !14, line: 3566, baseType: !1695, size: 64, align: 64, offset: 1408)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!949, !1091, !943, !1381, !1235}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !968, file: !14, line: 3567, baseType: !1088, size: 64, align: 64, offset: 1472)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !968, file: !14, line: 3576, baseType: !1700, size: 64, align: 64, offset: 1536)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!949, !1091, !1379}
