; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--synth_filter.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--synth_filter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SynthFilterContext = type { void (%struct.FFTContext*, float*, i32*, float*, float*, float*, float*, float)*, void (%struct.FFTContext*, float*, i32*, float*, float*, float*, float*, float)*, void (%struct.DCADCTContext*, i32*, i32*, i32*, i32*, i32*, i32*)*, void (%struct.DCADCTContext*, i32*, i32*, i32*, i32*, i32*, i32*)* }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }
%struct.FFTComplex = type { float, float }
%struct.DCADCTContext = type { [2 x void (i32*, i32*)*] }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_synth_filter_init(%struct.SynthFilterContext* %c) #0 !dbg !23 {
entry:
  %c.addr = alloca %struct.SynthFilterContext*, align 8
  store %struct.SynthFilterContext* %c, %struct.SynthFilterContext** %c.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--synth_filter.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{!14, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !15, line: 40, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !15, line: 38, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!23 = distinct !DISubprogram(name: "ff_synth_filter_init", scope: !24, file: !24, line: 171, type: !25, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !111)
!24 = !DIFile(filename: "libavcodec/synth_filter.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "SynthFilterContext", file: !29, line: 45, baseType: !30)
!29 = !DIFile(filename: "libavcodec/synth_filter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SynthFilterContext", file: !29, line: 27, size: 256, align: 64, elements: !31)
!31 = !{!32, !90, !91, !110}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "synth_filter_float", scope: !30, file: !29, line: 28, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36, !86, !87, !86, !88, !86, !88, !54}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !38, line: 41, baseType: !39)
!38 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !40)
!40 = !{!41, !42, !43, !47, !56, !57, !58, !60, !61, !66, !67, !73, !74, !75, !81, !82, !83}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !39, file: !4, line: 89, baseType: !19, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !39, file: !4, line: 90, baseType: !19, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !39, file: !4, line: 91, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 49, baseType: !46)
!46 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !39, file: !4, line: 92, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !38, line: 39, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !38, line: 37, size: 64, align: 32, elements: !51)
!51 = !{!52, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !50, file: !38, line: 38, baseType: !53, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !38, line: 35, baseType: !54)
!54 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !50, file: !38, line: 38, baseType: !53, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !39, file: !4, line: 93, baseType: !19, size: 32, align: 32, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !39, file: !4, line: 94, baseType: !19, size: 32, align: 32, offset: 224)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !39, file: !4, line: 96, baseType: !59, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !39, file: !4, line: 97, baseType: !59, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !39, file: !4, line: 101, baseType: !62, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !48}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !39, file: !4, line: 106, baseType: !62, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !39, file: !4, line: 107, baseType: !68, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !65, !59, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !39, file: !4, line: 108, baseType: !68, size: 64, align: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !39, file: !4, line: 109, baseType: !68, size: 64, align: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !39, file: !4, line: 110, baseType: !76, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !65, !79, !71}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !54)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !39, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !39, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !39, file: !4, line: 113, baseType: !84, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 51, baseType: !17)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "synth_filter_float_64", scope: !30, file: !29, line: 33, baseType: !33, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "synth_filter_fixed", scope: !30, file: !29, line: 37, baseType: !92, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !105, !87, !105, !106, !105, !106}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCADCTContext", file: !97, line: 28, baseType: !98)
!97 = !DIFile(filename: "libavcodec/dcadct.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCADCTContext", file: !97, line: 26, size: 128, align: 64, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !98, file: !97, line: 27, baseType: !101, size: 128, align: 64)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, align: 64, elements: !108)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !106}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!108 = !{!109}
!109 = !DISubrange(count: 2)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "synth_filter_fixed_64", scope: !30, file: !29, line: 41, baseType: !92, size: 64, align: 64, offset: 192)
!111 = !{}
!112 = !DILocalVariable(name: "c", arg: 1, scope: !23, file: !24, line: 171, type: !27)
!113 = !DIExpression()
!114 = !DILocation(line: 171, column: 69, scope: !23)
!115 = !DILocation(line: 173, column: 5, scope: !23)
!116 = !DILocation(line: 173, column: 8, scope: !23)
!117 = !DILocation(line: 173, column: 27, scope: !23)
!118 = !DILocation(line: 174, column: 5, scope: !23)
!119 = !DILocation(line: 174, column: 8, scope: !23)
!120 = !DILocation(line: 174, column: 30, scope: !23)
!121 = !DILocation(line: 175, column: 5, scope: !23)
!122 = !DILocation(line: 175, column: 8, scope: !23)
!123 = !DILocation(line: 175, column: 27, scope: !23)
!124 = !DILocation(line: 176, column: 5, scope: !23)
!125 = !DILocation(line: 176, column: 8, scope: !23)
!126 = !DILocation(line: 176, column: 30, scope: !23)
!127 = !DILocation(line: 183, column: 34, scope: !128)
!128 = distinct !DILexicalBlock(scope: !23, file: !24, line: 182, column: 9)
!129 = !DILocation(line: 183, column: 9, scope: !128)
!130 = !DILocation(line: 184, column: 1, scope: !23)
!131 = distinct !DISubprogram(name: "synth_filter_float", scope: !24, file: !24, line: 27, type: !34, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !111)
!132 = !DILocalVariable(name: "imdct", arg: 1, scope: !131, file: !24, line: 27, type: !36)
!133 = !DILocation(line: 27, column: 44, scope: !131)
!134 = !DILocalVariable(name: "synth_buf_ptr", arg: 2, scope: !131, file: !24, line: 28, type: !86)
!135 = !DILocation(line: 28, column: 39, scope: !131)
!136 = !DILocalVariable(name: "synth_buf_offset", arg: 3, scope: !131, file: !24, line: 28, type: !87)
!137 = !DILocation(line: 28, column: 59, scope: !131)
!138 = !DILocalVariable(name: "synth_buf2", arg: 4, scope: !131, file: !24, line: 29, type: !86)
!139 = !DILocation(line: 29, column: 38, scope: !131)
!140 = !DILocalVariable(name: "window", arg: 5, scope: !131, file: !24, line: 29, type: !88)
!141 = !DILocation(line: 29, column: 66, scope: !131)
!142 = !DILocalVariable(name: "out", arg: 6, scope: !131, file: !24, line: 30, type: !86)
!143 = !DILocation(line: 30, column: 38, scope: !131)
!144 = !DILocalVariable(name: "in", arg: 7, scope: !131, file: !24, line: 30, type: !88)
!145 = !DILocation(line: 30, column: 59, scope: !131)
!146 = !DILocalVariable(name: "scale", arg: 8, scope: !131, file: !24, line: 30, type: !54)
!147 = !DILocation(line: 30, column: 73, scope: !131)
!148 = !DILocalVariable(name: "synth_buf", scope: !131, file: !24, line: 32, type: !86)
!149 = !DILocation(line: 32, column: 12, scope: !131)
!150 = !DILocation(line: 32, column: 24, scope: !131)
!151 = !DILocation(line: 32, column: 41, scope: !131)
!152 = !DILocation(line: 32, column: 40, scope: !131)
!153 = !DILocation(line: 32, column: 38, scope: !131)
!154 = !DILocalVariable(name: "i", scope: !131, file: !24, line: 33, type: !19)
!155 = !DILocation(line: 33, column: 9, scope: !131)
!156 = !DILocalVariable(name: "j", scope: !131, file: !24, line: 33, type: !19)
!157 = !DILocation(line: 33, column: 12, scope: !131)
!158 = !DILocation(line: 35, column: 5, scope: !131)
!159 = !DILocation(line: 35, column: 12, scope: !131)
!160 = !DILocation(line: 35, column: 23, scope: !131)
!161 = !DILocation(line: 35, column: 30, scope: !131)
!162 = !DILocation(line: 35, column: 41, scope: !131)
!163 = !DILocation(line: 37, column: 12, scope: !164)
!164 = distinct !DILexicalBlock(scope: !131, file: !24, line: 37, column: 5)
!165 = !DILocation(line: 37, column: 10, scope: !164)
!166 = !DILocation(line: 37, column: 17, scope: !167)
!167 = !DILexicalBlockFile(scope: !168, file: !24, discriminator: 1)
!168 = distinct !DILexicalBlock(scope: !164, file: !24, line: 37, column: 5)
!169 = !DILocation(line: 37, column: 19, scope: !167)
!170 = !DILocation(line: 37, column: 5, scope: !167)
