; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mxpegdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mxpegdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!911 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JpegMarker", file: !913, line: 37, size: 32, align: 32, elements: !914)
!913 = !DIFile(filename: "libavcodec/mjpeg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!915 = !DIEnumerator(name: "SOF0", value: 192)
!916 = !DIEnumerator(name: "SOF1", value: 193)
!917 = !DIEnumerator(name: "SOF2", value: 194)
!918 = !DIEnumerator(name: "SOF3", value: 195)
!919 = !DIEnumerator(name: "SOF5", value: 197)
!920 = !DIEnumerator(name: "SOF6", value: 198)
!921 = !DIEnumerator(name: "SOF7", value: 199)
!922 = !DIEnumerator(name: "JPG", value: 200)
!923 = !DIEnumerator(name: "SOF9", value: 201)
!924 = !DIEnumerator(name: "SOF10", value: 202)
!925 = !DIEnumerator(name: "SOF11", value: 203)
!926 = !DIEnumerator(name: "SOF13", value: 205)
!927 = !DIEnumerator(name: "SOF14", value: 206)
!928 = !DIEnumerator(name: "SOF15", value: 207)
!929 = !DIEnumerator(name: "DHT", value: 196)
!930 = !DIEnumerator(name: "DAC", value: 204)
!931 = !DIEnumerator(name: "RST0", value: 208)
!932 = !DIEnumerator(name: "RST1", value: 209)
!933 = !DIEnumerator(name: "RST2", value: 210)
!934 = !DIEnumerator(name: "RST3", value: 211)
!935 = !DIEnumerator(name: "RST4", value: 212)
!936 = !DIEnumerator(name: "RST5", value: 213)
!937 = !DIEnumerator(name: "RST6", value: 214)
!938 = !DIEnumerator(name: "RST7", value: 215)
!939 = !DIEnumerator(name: "SOI", value: 216)
!940 = !DIEnumerator(name: "EOI", value: 217)
!941 = !DIEnumerator(name: "SOS", value: 218)
!942 = !DIEnumerator(name: "DQT", value: 219)
!943 = !DIEnumerator(name: "DNL", value: 220)
!944 = !DIEnumerator(name: "DRI", value: 221)
!945 = !DIEnumerator(name: "DHP", value: 222)
!946 = !DIEnumerator(name: "EXP", value: 223)
!947 = !DIEnumerator(name: "APP0", value: 224)
!948 = !DIEnumerator(name: "APP1", value: 225)
!949 = !DIEnumerator(name: "APP2", value: 226)
!950 = !DIEnumerator(name: "APP3", value: 227)
!951 = !DIEnumerator(name: "APP4", value: 228)
!952 = !DIEnumerator(name: "APP5", value: 229)
!953 = !DIEnumerator(name: "APP6", value: 230)
!954 = !DIEnumerator(name: "APP7", value: 231)
!955 = !DIEnumerator(name: "APP8", value: 232)
!956 = !DIEnumerator(name: "APP9", value: 233)
!957 = !DIEnumerator(name: "APP10", value: 234)
!958 = !DIEnumerator(name: "APP11", value: 235)
!959 = !DIEnumerator(name: "APP12", value: 236)
!960 = !DIEnumerator(name: "APP13", value: 237)
!961 = !DIEnumerator(name: "APP14", value: 238)
!962 = !DIEnumerator(name: "APP15", value: 239)
!963 = !DIEnumerator(name: "JPG0", value: 240)
!964 = !DIEnumerator(name: "JPG1", value: 241)
!965 = !DIEnumerator(name: "JPG2", value: 242)
!966 = !DIEnumerator(name: "JPG3", value: 243)
!967 = !DIEnumerator(name: "JPG4", value: 244)
!968 = !DIEnumerator(name: "JPG5", value: 245)
!969 = !DIEnumerator(name: "JPG6", value: 246)
!970 = !DIEnumerator(name: "SOF48", value: 247)
!971 = !DIEnumerator(name: "LSE", value: 248)
!972 = !DIEnumerator(name: "JPG9", value: 249)
!973 = !DIEnumerator(name: "JPG10", value: 250)
!974 = !DIEnumerator(name: "JPG11", value: 251)
!975 = !DIEnumerator(name: "JPG12", value: 252)
!976 = !DIEnumerator(name: "JPG13", value: 253)
!977 = !DIEnumerator(name: "COM", value: 254)
!978 = !DIEnumerator(name: "TEM", value: 1)
!979 = !{!980, !981, !982}
!980 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!981 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !985, line: 222, size: 16, align: 8, elements: !986)
!985 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !984, file: !985, line: 222, baseType: !988, size: 16, align: 16)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !989, line: 49, baseType: !990)
!989 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!990 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!991 = !{!992}
!992 = distinct !DIGlobalVariable(name: "ff_mxpeg_decoder", scope: !0, file: !993, line: 337, type: !994, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mxpeg_decoder)
!993 = !DIFile(filename: "libavcodec/mxpegdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !996)
!996 = !{!997, !1001, !1002, !1003, !1004, !1005, !1014, !1017, !1020, !1023, !1028, !1031, !1073, !1081, !1082, !1083, !1085, !1637, !1643, !1651, !1655, !1656, !1693, !1697, !1701, !1702, !1706, !1710, !1711, !1715, !1716, !1717}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !14, line: 3475, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !995, file: !14, line: 3480, baseType: !998, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !995, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !995, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !995, file: !14, line: 3487, baseType: !980, size: 32, align: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !995, file: !14, line: 3488, baseType: !1006, size: 64, align: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1009, line: 61, baseType: !1010)
!1009 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1009, line: 58, size: 64, align: 32, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1010, file: !1009, line: 59, baseType: !980, size: 32, align: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1010, file: !1009, line: 60, baseType: !980, size: 32, align: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !995, file: !14, line: 3489, baseType: !1015, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !995, file: !14, line: 3490, baseType: !1018, size: 64, align: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !995, file: !14, line: 3491, baseType: !1021, size: 64, align: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !995, file: !14, line: 3492, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !989, line: 55, baseType: !1027)
!1027 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !995, file: !14, line: 3493, baseType: !1029, size: 8, align: 8, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !989, line: 48, baseType: !1030)
!1030 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !995, file: !14, line: 3494, baseType: !1032, size: 64, align: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1043, !1047, !1048, !1049, !1050, !1054, !1060, !1062, !1066}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1035, file: !691, line: 72, baseType: !998, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1035, file: !691, line: 78, baseType: !1039, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!998, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1035, file: !691, line: 85, baseType: !1044, size: 64, align: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1035, file: !691, line: 93, baseType: !980, size: 32, align: 32, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1035, file: !691, line: 99, baseType: !980, size: 32, align: 32, offset: 224)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1035, file: !691, line: 108, baseType: !980, size: 32, align: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1035, file: !691, line: 113, baseType: !1051, size: 64, align: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1042, !1042, !1042}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1035, file: !691, line: 123, baseType: !1055, size: 64, align: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!1058, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1035, file: !691, line: 130, baseType: !1061, size: 32, align: 32, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1035, file: !691, line: 136, baseType: !1063, size: 64, align: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!1061, !1042}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1035, file: !691, line: 142, baseType: !1067, size: 64, align: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!980, !1070, !1042, !998, !980}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !995, file: !14, line: 3495, baseType: !1074, size: 64, align: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1077, file: !14, line: 3402, baseType: !980, size: 32, align: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1077, file: !14, line: 3403, baseType: !998, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !995, file: !14, line: 3507, baseType: !998, size: 64, align: 64, offset: 768)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !995, file: !14, line: 3516, baseType: !980, size: 32, align: 32, offset: 832)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !14, line: 3517, baseType: !1084, size: 64, align: 64, offset: 896)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !995, file: !14, line: 3527, baseType: !1086, size: 64, align: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!980, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096, !1099, !1100, !1101, !1102, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1385, !1389, !1390, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1575, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1091, file: !14, line: 1561, baseType: !1032, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1091, file: !14, line: 1562, baseType: !980, size: 32, align: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1091, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1091, file: !14, line: 1565, baseType: !1097, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1091, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1091, file: !14, line: 1581, baseType: !981, size: 32, align: 32, offset: 224)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1091, file: !14, line: 1583, baseType: !1042, size: 64, align: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1091, file: !14, line: 1591, baseType: !1103, size: 64, align: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1105, line: 129, size: 1664, align: 64, elements: !1106)
!1105 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1106 = !{!1107, !1108, !1109, !1110, !1210, !1231, !1232, !1261, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1104, file: !1105, line: 136, baseType: !980, size: 32, align: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1104, file: !1105, line: 151, baseType: !980, size: 32, align: 32, offset: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1104, file: !1105, line: 157, baseType: !980, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1104, file: !1105, line: 159, baseType: !1111, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1114)
!1114 = !{!1115, !1120, !1122, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1162, !1164, !1165, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1198, !1199, !1200, !1201, !1202, !1203, !1206, !1207, !1208, !1209}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !722, line: 282, baseType: !1116, size: 512, align: 64)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 512, align: 64, elements: !1118)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1118 = !{!1119}
!1119 = !DISubrange(count: 8)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1113, file: !722, line: 299, baseType: !1121, size: 256, align: 32, offset: 512)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 256, align: 32, elements: !1118)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1113, file: !722, line: 315, baseType: !1123, size: 64, align: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1113, file: !722, line: 326, baseType: !980, size: 32, align: 32, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1113, file: !722, line: 326, baseType: !980, size: 32, align: 32, offset: 864)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1113, file: !722, line: 334, baseType: !980, size: 32, align: 32, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1113, file: !722, line: 341, baseType: !980, size: 32, align: 32, offset: 928)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1113, file: !722, line: 346, baseType: !980, size: 32, align: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1113, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1113, file: !722, line: 356, baseType: !1008, size: 64, align: 32, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1113, file: !722, line: 361, baseType: !1132, size: 64, align: 64, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !989, line: 40, baseType: !1133)
!1133 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1113, file: !722, line: 369, baseType: !1132, size: 64, align: 64, offset: 1152)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1113, file: !722, line: 377, baseType: !1132, size: 64, align: 64, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1113, file: !722, line: 382, baseType: !980, size: 32, align: 32, offset: 1280)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1113, file: !722, line: 386, baseType: !980, size: 32, align: 32, offset: 1312)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1113, file: !722, line: 391, baseType: !980, size: 32, align: 32, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1113, file: !722, line: 396, baseType: !1042, size: 64, align: 64, offset: 1408)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1113, file: !722, line: 403, baseType: !1141, size: 512, align: 64, offset: 1472)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 512, align: 64, elements: !1118)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1113, file: !722, line: 410, baseType: !980, size: 32, align: 32, offset: 1984)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1113, file: !722, line: 415, baseType: !980, size: 32, align: 32, offset: 2016)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1113, file: !722, line: 420, baseType: !980, size: 32, align: 32, offset: 2048)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1113, file: !722, line: 425, baseType: !980, size: 32, align: 32, offset: 2080)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1113, file: !722, line: 435, baseType: !1132, size: 64, align: 64, offset: 2112)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1113, file: !722, line: 440, baseType: !980, size: 32, align: 32, offset: 2176)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1113, file: !722, line: 445, baseType: !1026, size: 64, align: 64, offset: 2240)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1113, file: !722, line: 459, baseType: !1150, size: 512, align: 64, offset: 2304)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 512, align: 64, elements: !1118)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1153, line: 94, baseType: !1154)
!1153 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1153, line: 81, size: 192, align: 64, elements: !1155)
!1155 = !{!1156, !1160, !1161}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1154, file: !1153, line: 82, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1153, line: 73, baseType: !1159)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1153, line: 73, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !1153, line: 89, baseType: !1117, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !1153, line: 93, baseType: !980, size: 32, align: 32, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1113, file: !722, line: 473, baseType: !1163, size: 64, align: 64, offset: 2816)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1113, file: !722, line: 477, baseType: !980, size: 32, align: 32, offset: 2880)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1113, file: !722, line: 479, baseType: !1166, size: 64, align: 64, offset: 2944)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1179}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1169, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1169, file: !722, line: 203, baseType: !1117, size: 64, align: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1169, file: !722, line: 204, baseType: !980, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1169, file: !722, line: 205, baseType: !1175, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1177, line: 86, baseType: !1178)
!1177 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1177, line: 86, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1169, file: !722, line: 206, baseType: !1151, size: 64, align: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1113, file: !722, line: 480, baseType: !980, size: 32, align: 32, offset: 3008)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !722, line: 505, baseType: !980, size: 32, align: 32, offset: 3040)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1113, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1113, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1113, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1113, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1113, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1113, file: !722, line: 532, baseType: !1132, size: 64, align: 64, offset: 3264)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1113, file: !722, line: 539, baseType: !1132, size: 64, align: 64, offset: 3328)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1113, file: !722, line: 547, baseType: !1132, size: 64, align: 64, offset: 3392)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1113, file: !722, line: 554, baseType: !1175, size: 64, align: 64, offset: 3456)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1113, file: !722, line: 563, baseType: !980, size: 32, align: 32, offset: 3520)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1113, file: !722, line: 572, baseType: !980, size: 32, align: 32, offset: 3552)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1113, file: !722, line: 581, baseType: !980, size: 32, align: 32, offset: 3584)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1113, file: !722, line: 588, baseType: !1195, size: 64, align: 64, offset: 3648)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !989, line: 36, baseType: !1197)
!1197 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1113, file: !722, line: 593, baseType: !980, size: 32, align: 32, offset: 3712)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1113, file: !722, line: 596, baseType: !980, size: 32, align: 32, offset: 3744)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1113, file: !722, line: 599, baseType: !1151, size: 64, align: 64, offset: 3776)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1113, file: !722, line: 605, baseType: !1151, size: 64, align: 64, offset: 3840)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1113, file: !722, line: 616, baseType: !1151, size: 64, align: 64, offset: 3904)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1113, file: !722, line: 626, baseType: !1204, size: 64, align: 64, offset: 3968)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1205, line: 216, baseType: !1027)
!1205 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1113, file: !722, line: 627, baseType: !1204, size: 64, align: 64, offset: 4032)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1113, file: !722, line: 628, baseType: !1204, size: 64, align: 64, offset: 4096)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1113, file: !722, line: 629, baseType: !1204, size: 64, align: 64, offset: 4160)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1113, file: !722, line: 645, baseType: !1151, size: 64, align: 64, offset: 4224)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1104, file: !1105, line: 161, baseType: !1211, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1105, line: 117, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1105, line: 100, size: 832, align: 64, elements: !1214)
!1214 = !{!1215, !1222, !1223, !1224, !1225, !1226, !1228, !1229, !1230}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1213, file: !1105, line: 105, baseType: !1216, size: 256, align: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1217, size: 256, align: 64, elements: !1220)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1153, line: 238, baseType: !1219)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1153, line: 238, flags: DIFlagFwdDecl)
!1220 = !{!1221}
!1221 = !DISubrange(count: 4)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1213, file: !1105, line: 110, baseType: !980, size: 32, align: 32, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1213, file: !1105, line: 111, baseType: !980, size: 32, align: 32, offset: 288)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1213, file: !1105, line: 111, baseType: !980, size: 32, align: 32, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1213, file: !1105, line: 112, baseType: !1121, size: 256, align: 32, offset: 352)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1213, file: !1105, line: 113, baseType: !1227, size: 128, align: 32, offset: 608)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 128, align: 32, elements: !1220)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1213, file: !1105, line: 114, baseType: !980, size: 32, align: 32, offset: 736)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1213, file: !1105, line: 115, baseType: !980, size: 32, align: 32, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1213, file: !1105, line: 116, baseType: !980, size: 32, align: 32, offset: 800)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1104, file: !1105, line: 163, baseType: !1042, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1104, file: !1105, line: 165, baseType: !1233, size: 128, align: 64, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1105, line: 122, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1105, line: 119, size: 128, align: 64, elements: !1235)
!1235 = !{!1236, !1260}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1234, file: !1105, line: 120, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1256, !1257, !1258, !1259}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1239, file: !14, line: 1451, baseType: !1151, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1239, file: !14, line: 1461, baseType: !1132, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1239, file: !14, line: 1467, baseType: !1132, size: 64, align: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1239, file: !14, line: 1468, baseType: !1117, size: 64, align: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1239, file: !14, line: 1469, baseType: !980, size: 32, align: 32, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1239, file: !14, line: 1470, baseType: !980, size: 32, align: 32, offset: 288)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1239, file: !14, line: 1474, baseType: !980, size: 32, align: 32, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1239, file: !14, line: 1479, baseType: !1249, size: 64, align: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !14, line: 1412, baseType: !1117, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !14, line: 1413, baseType: !980, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1251, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1239, file: !14, line: 1480, baseType: !980, size: 32, align: 32, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1239, file: !14, line: 1486, baseType: !1132, size: 64, align: 64, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1239, file: !14, line: 1488, baseType: !1132, size: 64, align: 64, offset: 576)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1239, file: !14, line: 1497, baseType: !1132, size: 64, align: 64, offset: 640)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1234, file: !1105, line: 121, baseType: !1111, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1104, file: !1105, line: 166, baseType: !1262, size: 128, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1105, line: 127, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1105, line: 124, size: 128, align: 64, elements: !1264)
!1264 = !{!1265, !1339}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1263, file: !1105, line: 125, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1296, !1300, !1301, !1336, !1337, !1338}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1269, file: !14, line: 5751, baseType: !1032, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1269, file: !14, line: 5756, baseType: !1273, size: 64, align: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1281, !1282, !1283, !1287, !1291, !1295}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1275, file: !14, line: 5797, baseType: !998, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1275, file: !14, line: 5804, baseType: !1279, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1275, file: !14, line: 5815, baseType: !1032, size: 64, align: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1275, file: !14, line: 5825, baseType: !980, size: 32, align: 32, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1275, file: !14, line: 5826, baseType: !1284, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!980, !1267}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1275, file: !14, line: 5827, baseType: !1288, size: 64, align: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!980, !1267, !1237}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1275, file: !14, line: 5828, baseType: !1292, size: 64, align: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1267}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1275, file: !14, line: 5829, baseType: !1292, size: 64, align: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1269, file: !14, line: 5762, baseType: !1297, size: 64, align: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1299)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1269, file: !14, line: 5768, baseType: !1042, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1269, file: !14, line: 5775, baseType: !1302, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1304, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1304, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1304, file: !14, line: 3948, baseType: !1309, size: 32, align: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !989, line: 51, baseType: !981)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1304, file: !14, line: 3958, baseType: !1117, size: 64, align: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1304, file: !14, line: 3962, baseType: !980, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1304, file: !14, line: 3968, baseType: !980, size: 32, align: 32, offset: 224)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1304, file: !14, line: 3973, baseType: !1132, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1304, file: !14, line: 3986, baseType: !980, size: 32, align: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1304, file: !14, line: 3999, baseType: !980, size: 32, align: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1304, file: !14, line: 4004, baseType: !980, size: 32, align: 32, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1304, file: !14, line: 4005, baseType: !980, size: 32, align: 32, offset: 416)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1304, file: !14, line: 4010, baseType: !980, size: 32, align: 32, offset: 448)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1304, file: !14, line: 4011, baseType: !980, size: 32, align: 32, offset: 480)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1304, file: !14, line: 4020, baseType: !1008, size: 64, align: 32, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1304, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1304, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1304, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1304, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1304, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1304, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1304, file: !14, line: 4039, baseType: !980, size: 32, align: 32, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1304, file: !14, line: 4046, baseType: !1026, size: 64, align: 64, offset: 832)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1304, file: !14, line: 4050, baseType: !980, size: 32, align: 32, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1304, file: !14, line: 4054, baseType: !980, size: 32, align: 32, offset: 928)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1304, file: !14, line: 4061, baseType: !980, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1304, file: !14, line: 4065, baseType: !980, size: 32, align: 32, offset: 992)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1304, file: !14, line: 4073, baseType: !980, size: 32, align: 32, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1304, file: !14, line: 4080, baseType: !980, size: 32, align: 32, offset: 1056)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1304, file: !14, line: 4084, baseType: !980, size: 32, align: 32, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1269, file: !14, line: 5781, baseType: !1302, size: 64, align: 64, offset: 320)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1269, file: !14, line: 5787, baseType: !1008, size: 64, align: 32, offset: 384)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1269, file: !14, line: 5793, baseType: !1008, size: 64, align: 32, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1263, file: !1105, line: 126, baseType: !980, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1104, file: !1105, line: 172, baseType: !1237, size: 64, align: 64, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1104, file: !1105, line: 177, baseType: !1117, size: 64, align: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1104, file: !1105, line: 178, baseType: !981, size: 32, align: 32, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1104, file: !1105, line: 180, baseType: !1042, size: 64, align: 64, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1104, file: !1105, line: 185, baseType: !980, size: 32, align: 32, offset: 832)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1104, file: !1105, line: 190, baseType: !1042, size: 64, align: 64, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1104, file: !1105, line: 195, baseType: !980, size: 32, align: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1104, file: !1105, line: 200, baseType: !1237, size: 64, align: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1104, file: !1105, line: 201, baseType: !980, size: 32, align: 32, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1104, file: !1105, line: 202, baseType: !1111, size: 64, align: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1104, file: !1105, line: 203, baseType: !980, size: 32, align: 32, offset: 1216)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1104, file: !1105, line: 205, baseType: !980, size: 32, align: 32, offset: 1248)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1104, file: !1105, line: 206, baseType: !980, size: 32, align: 32, offset: 1280)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1104, file: !1105, line: 209, baseType: !1204, size: 64, align: 64, offset: 1344)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1104, file: !1105, line: 212, baseType: !1204, size: 64, align: 64, offset: 1408)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1104, file: !1105, line: 213, baseType: !1111, size: 64, align: 64, offset: 1472)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1104, file: !1105, line: 215, baseType: !980, size: 32, align: 32, offset: 1536)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1104, file: !1105, line: 217, baseType: !980, size: 32, align: 32, offset: 1568)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1104, file: !1105, line: 220, baseType: !980, size: 32, align: 32, offset: 1600)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1091, file: !14, line: 1598, baseType: !1042, size: 64, align: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1091, file: !14, line: 1606, baseType: !1132, size: 64, align: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1091, file: !14, line: 1614, baseType: !980, size: 32, align: 32, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1091, file: !14, line: 1622, baseType: !980, size: 32, align: 32, offset: 544)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1091, file: !14, line: 1628, baseType: !980, size: 32, align: 32, offset: 576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1091, file: !14, line: 1636, baseType: !980, size: 32, align: 32, offset: 608)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1091, file: !14, line: 1643, baseType: !980, size: 32, align: 32, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1091, file: !14, line: 1657, baseType: !1117, size: 64, align: 64, offset: 704)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1091, file: !14, line: 1658, baseType: !980, size: 32, align: 32, offset: 768)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1091, file: !14, line: 1679, baseType: !1008, size: 64, align: 32, offset: 800)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1091, file: !14, line: 1688, baseType: !980, size: 32, align: 32, offset: 864)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1091, file: !14, line: 1712, baseType: !980, size: 32, align: 32, offset: 896)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1091, file: !14, line: 1729, baseType: !980, size: 32, align: 32, offset: 928)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1091, file: !14, line: 1729, baseType: !980, size: 32, align: 32, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1091, file: !14, line: 1744, baseType: !980, size: 32, align: 32, offset: 992)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1091, file: !14, line: 1744, baseType: !980, size: 32, align: 32, offset: 1024)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1091, file: !14, line: 1751, baseType: !980, size: 32, align: 32, offset: 1056)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1091, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1091, file: !14, line: 1791, baseType: !1378, size: 64, align: 64, offset: 1152)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1381, !1382, !1384, !980, !980, !980}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1091, file: !14, line: 1808, baseType: !1386, size: 64, align: 64, offset: 1216)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!473, !1381, !1015}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1091, file: !14, line: 1816, baseType: !980, size: 32, align: 32, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1091, file: !14, line: 1825, baseType: !1391, size: 32, align: 32, offset: 1312)
!1391 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1091, file: !14, line: 1830, baseType: !980, size: 32, align: 32, offset: 1344)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1091, file: !14, line: 1838, baseType: !1391, size: 32, align: 32, offset: 1376)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1091, file: !14, line: 1846, baseType: !980, size: 32, align: 32, offset: 1408)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1091, file: !14, line: 1851, baseType: !980, size: 32, align: 32, offset: 1440)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1091, file: !14, line: 1861, baseType: !1391, size: 32, align: 32, offset: 1472)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1091, file: !14, line: 1868, baseType: !1391, size: 32, align: 32, offset: 1504)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1091, file: !14, line: 1875, baseType: !1391, size: 32, align: 32, offset: 1536)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1091, file: !14, line: 1882, baseType: !1391, size: 32, align: 32, offset: 1568)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1091, file: !14, line: 1889, baseType: !1391, size: 32, align: 32, offset: 1600)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1091, file: !14, line: 1896, baseType: !1391, size: 32, align: 32, offset: 1632)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1091, file: !14, line: 1903, baseType: !1391, size: 32, align: 32, offset: 1664)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1091, file: !14, line: 1910, baseType: !980, size: 32, align: 32, offset: 1696)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1091, file: !14, line: 1915, baseType: !980, size: 32, align: 32, offset: 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1091, file: !14, line: 1926, baseType: !1384, size: 64, align: 64, offset: 1792)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1091, file: !14, line: 1935, baseType: !1008, size: 64, align: 32, offset: 1856)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1091, file: !14, line: 1942, baseType: !980, size: 32, align: 32, offset: 1920)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1091, file: !14, line: 1948, baseType: !980, size: 32, align: 32, offset: 1952)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1091, file: !14, line: 1954, baseType: !980, size: 32, align: 32, offset: 1984)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1091, file: !14, line: 1960, baseType: !980, size: 32, align: 32, offset: 2016)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1091, file: !14, line: 1984, baseType: !980, size: 32, align: 32, offset: 2048)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1091, file: !14, line: 1991, baseType: !980, size: 32, align: 32, offset: 2080)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1091, file: !14, line: 1996, baseType: !980, size: 32, align: 32, offset: 2112)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1091, file: !14, line: 2004, baseType: !980, size: 32, align: 32, offset: 2144)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1091, file: !14, line: 2011, baseType: !980, size: 32, align: 32, offset: 2176)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1091, file: !14, line: 2018, baseType: !980, size: 32, align: 32, offset: 2208)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1091, file: !14, line: 2027, baseType: !980, size: 32, align: 32, offset: 2240)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1091, file: !14, line: 2034, baseType: !980, size: 32, align: 32, offset: 2272)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1091, file: !14, line: 2044, baseType: !980, size: 32, align: 32, offset: 2304)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1091, file: !14, line: 2054, baseType: !1421, size: 64, align: 64, offset: 2368)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1091, file: !14, line: 2061, baseType: !1421, size: 64, align: 64, offset: 2432)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1091, file: !14, line: 2066, baseType: !980, size: 32, align: 32, offset: 2496)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1091, file: !14, line: 2070, baseType: !980, size: 32, align: 32, offset: 2528)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1091, file: !14, line: 2078, baseType: !980, size: 32, align: 32, offset: 2560)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1091, file: !14, line: 2085, baseType: !980, size: 32, align: 32, offset: 2592)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1091, file: !14, line: 2092, baseType: !980, size: 32, align: 32, offset: 2624)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1091, file: !14, line: 2099, baseType: !980, size: 32, align: 32, offset: 2656)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1091, file: !14, line: 2106, baseType: !980, size: 32, align: 32, offset: 2688)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1091, file: !14, line: 2113, baseType: !980, size: 32, align: 32, offset: 2720)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1091, file: !14, line: 2120, baseType: !980, size: 32, align: 32, offset: 2752)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1091, file: !14, line: 2125, baseType: !980, size: 32, align: 32, offset: 2784)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1091, file: !14, line: 2133, baseType: !980, size: 32, align: 32, offset: 2816)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1091, file: !14, line: 2140, baseType: !980, size: 32, align: 32, offset: 2848)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1091, file: !14, line: 2145, baseType: !980, size: 32, align: 32, offset: 2880)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1091, file: !14, line: 2153, baseType: !980, size: 32, align: 32, offset: 2912)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1091, file: !14, line: 2158, baseType: !980, size: 32, align: 32, offset: 2944)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1091, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1091, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1091, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1091, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1091, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1091, file: !14, line: 2203, baseType: !980, size: 32, align: 32, offset: 3136)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1091, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1091, file: !14, line: 2212, baseType: !980, size: 32, align: 32, offset: 3200)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1091, file: !14, line: 2213, baseType: !980, size: 32, align: 32, offset: 3232)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1091, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1091, file: !14, line: 2232, baseType: !980, size: 32, align: 32, offset: 3296)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1091, file: !14, line: 2243, baseType: !980, size: 32, align: 32, offset: 3328)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1091, file: !14, line: 2249, baseType: !980, size: 32, align: 32, offset: 3360)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1091, file: !14, line: 2256, baseType: !980, size: 32, align: 32, offset: 3392)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1091, file: !14, line: 2263, baseType: !1026, size: 64, align: 64, offset: 3456)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1091, file: !14, line: 2270, baseType: !1026, size: 64, align: 64, offset: 3520)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1091, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1091, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1091, file: !14, line: 2367, baseType: !1457, size: 64, align: 64, offset: 3648)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!980, !1381, !1111, !980}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1091, file: !14, line: 2383, baseType: !980, size: 32, align: 32, offset: 3712)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1091, file: !14, line: 2386, baseType: !1391, size: 32, align: 32, offset: 3744)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1091, file: !14, line: 2387, baseType: !1391, size: 32, align: 32, offset: 3776)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1091, file: !14, line: 2394, baseType: !980, size: 32, align: 32, offset: 3808)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1091, file: !14, line: 2401, baseType: !980, size: 32, align: 32, offset: 3840)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1091, file: !14, line: 2408, baseType: !980, size: 32, align: 32, offset: 3872)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1091, file: !14, line: 2415, baseType: !980, size: 32, align: 32, offset: 3904)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1091, file: !14, line: 2422, baseType: !980, size: 32, align: 32, offset: 3936)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1091, file: !14, line: 2423, baseType: !1469, size: 64, align: 64, offset: 3968)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1472)
!1472 = !{!1473, !1474, !1475, !1476}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1471, file: !14, line: 827, baseType: !980, size: 32, align: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1471, file: !14, line: 828, baseType: !980, size: 32, align: 32, offset: 32)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1471, file: !14, line: 829, baseType: !980, size: 32, align: 32, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1471, file: !14, line: 830, baseType: !1391, size: 32, align: 32, offset: 96)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1091, file: !14, line: 2430, baseType: !1132, size: 64, align: 64, offset: 4032)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1091, file: !14, line: 2437, baseType: !1132, size: 64, align: 64, offset: 4096)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1091, file: !14, line: 2444, baseType: !1391, size: 32, align: 32, offset: 4160)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1091, file: !14, line: 2451, baseType: !1391, size: 32, align: 32, offset: 4192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1091, file: !14, line: 2458, baseType: !980, size: 32, align: 32, offset: 4224)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1091, file: !14, line: 2469, baseType: !980, size: 32, align: 32, offset: 4256)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1091, file: !14, line: 2475, baseType: !980, size: 32, align: 32, offset: 4288)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1091, file: !14, line: 2481, baseType: !980, size: 32, align: 32, offset: 4320)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1091, file: !14, line: 2485, baseType: !980, size: 32, align: 32, offset: 4352)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1091, file: !14, line: 2489, baseType: !980, size: 32, align: 32, offset: 4384)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1091, file: !14, line: 2493, baseType: !980, size: 32, align: 32, offset: 4416)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1091, file: !14, line: 2501, baseType: !980, size: 32, align: 32, offset: 4448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1091, file: !14, line: 2506, baseType: !980, size: 32, align: 32, offset: 4480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1091, file: !14, line: 2510, baseType: !980, size: 32, align: 32, offset: 4512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1091, file: !14, line: 2514, baseType: !1132, size: 64, align: 64, offset: 4544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1091, file: !14, line: 2528, baseType: !1493, size: 64, align: 64, offset: 4608)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1381, !1042, !980, !980}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1091, file: !14, line: 2534, baseType: !980, size: 32, align: 32, offset: 4672)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1091, file: !14, line: 2545, baseType: !980, size: 32, align: 32, offset: 4704)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1091, file: !14, line: 2547, baseType: !980, size: 32, align: 32, offset: 4736)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1091, file: !14, line: 2549, baseType: !980, size: 32, align: 32, offset: 4768)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1091, file: !14, line: 2551, baseType: !980, size: 32, align: 32, offset: 4800)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1091, file: !14, line: 2553, baseType: !980, size: 32, align: 32, offset: 4832)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1091, file: !14, line: 2555, baseType: !980, size: 32, align: 32, offset: 4864)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1091, file: !14, line: 2557, baseType: !980, size: 32, align: 32, offset: 4896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1091, file: !14, line: 2559, baseType: !980, size: 32, align: 32, offset: 4928)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1091, file: !14, line: 2563, baseType: !980, size: 32, align: 32, offset: 4960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1091, file: !14, line: 2571, baseType: !1507, size: 64, align: 64, offset: 4992)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1091, file: !14, line: 2579, baseType: !1507, size: 64, align: 64, offset: 5056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1091, file: !14, line: 2586, baseType: !980, size: 32, align: 32, offset: 5120)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1091, file: !14, line: 2615, baseType: !980, size: 32, align: 32, offset: 5152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1091, file: !14, line: 2627, baseType: !980, size: 32, align: 32, offset: 5184)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1091, file: !14, line: 2637, baseType: !980, size: 32, align: 32, offset: 5216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1091, file: !14, line: 2681, baseType: !980, size: 32, align: 32, offset: 5248)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1091, file: !14, line: 2709, baseType: !1132, size: 64, align: 64, offset: 5312)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1091, file: !14, line: 2716, baseType: !1516, size: 64, align: 64, offset: 5376)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525, !1529, !1535, !1539, !1540, !1541, !1542, !1548, !1549, !1550, !1551, !1552}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1518, file: !14, line: 3642, baseType: !998, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1518, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1518, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1518, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1518, file: !14, line: 3669, baseType: !980, size: 32, align: 32, offset: 160)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1518, file: !14, line: 3682, baseType: !1526, size: 64, align: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!980, !1089, !1111}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1518, file: !14, line: 3698, baseType: !1530, size: 64, align: 64, offset: 256)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!980, !1089, !1533, !1309}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1518, file: !14, line: 3712, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!980, !1089, !980, !1533, !1309}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1518, file: !14, line: 3726, baseType: !1530, size: 64, align: 64, offset: 384)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1518, file: !14, line: 3737, baseType: !1086, size: 64, align: 64, offset: 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1518, file: !14, line: 3746, baseType: !980, size: 32, align: 32, offset: 512)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1518, file: !14, line: 3757, baseType: !1543, size: 64, align: 64, offset: 576)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{null, !1546}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1518, file: !14, line: 3766, baseType: !1086, size: 64, align: 64, offset: 640)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1518, file: !14, line: 3774, baseType: !1086, size: 64, align: 64, offset: 704)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1518, file: !14, line: 3780, baseType: !980, size: 32, align: 32, offset: 768)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1518, file: !14, line: 3785, baseType: !980, size: 32, align: 32, offset: 800)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1518, file: !14, line: 3795, baseType: !1553, size: 64, align: 64, offset: 832)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!980, !1089, !1151}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1091, file: !14, line: 2728, baseType: !1042, size: 64, align: 64, offset: 5440)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1091, file: !14, line: 2735, baseType: !1141, size: 512, align: 64, offset: 5504)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1091, file: !14, line: 2742, baseType: !980, size: 32, align: 32, offset: 6016)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1091, file: !14, line: 2755, baseType: !980, size: 32, align: 32, offset: 6048)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1091, file: !14, line: 2776, baseType: !980, size: 32, align: 32, offset: 6080)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1091, file: !14, line: 2783, baseType: !980, size: 32, align: 32, offset: 6112)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1091, file: !14, line: 2791, baseType: !980, size: 32, align: 32, offset: 6144)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1091, file: !14, line: 2802, baseType: !1111, size: 64, align: 64, offset: 6208)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1091, file: !14, line: 2811, baseType: !980, size: 32, align: 32, offset: 6272)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1091, file: !14, line: 2821, baseType: !980, size: 32, align: 32, offset: 6304)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1091, file: !14, line: 2830, baseType: !980, size: 32, align: 32, offset: 6336)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1091, file: !14, line: 2840, baseType: !980, size: 32, align: 32, offset: 6368)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1091, file: !14, line: 2851, baseType: !1569, size: 64, align: 64, offset: 6400)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!980, !1381, !1572, !1042, !1384, !980, !980}
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!980, !1381, !1042}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1091, file: !14, line: 2871, baseType: !1576, size: 64, align: 64, offset: 6464)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!980, !1381, !1579, !1042, !1384, !980}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!980, !1381, !1042, !980, !980}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1091, file: !14, line: 2878, baseType: !980, size: 32, align: 32, offset: 6528)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1091, file: !14, line: 2885, baseType: !980, size: 32, align: 32, offset: 6560)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1091, file: !14, line: 3005, baseType: !980, size: 32, align: 32, offset: 6592)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1091, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1091, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1091, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1091, file: !14, line: 3037, baseType: !1117, size: 64, align: 64, offset: 6720)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1091, file: !14, line: 3038, baseType: !980, size: 32, align: 32, offset: 6784)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1091, file: !14, line: 3050, baseType: !1026, size: 64, align: 64, offset: 6848)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1091, file: !14, line: 3065, baseType: !980, size: 32, align: 32, offset: 6912)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1091, file: !14, line: 3083, baseType: !980, size: 32, align: 32, offset: 6944)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1091, file: !14, line: 3092, baseType: !1008, size: 64, align: 32, offset: 6976)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1091, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1091, file: !14, line: 3106, baseType: !1008, size: 64, align: 32, offset: 7072)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1091, file: !14, line: 3113, baseType: !1597, size: 64, align: 64, offset: 7168)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1599)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1605, !1606, !1607, !1610}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1600, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1600, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1600, file: !14, line: 720, baseType: !998, size: 64, align: 64, offset: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1600, file: !14, line: 724, baseType: !998, size: 64, align: 64, offset: 128)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1600, file: !14, line: 728, baseType: !980, size: 32, align: 32, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1600, file: !14, line: 734, baseType: !1608, size: 64, align: 64, offset: 256)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1600, file: !14, line: 739, baseType: !1611, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1091, file: !14, line: 3129, baseType: !1132, size: 64, align: 64, offset: 7232)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1091, file: !14, line: 3130, baseType: !1132, size: 64, align: 64, offset: 7296)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1091, file: !14, line: 3131, baseType: !1132, size: 64, align: 64, offset: 7360)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1091, file: !14, line: 3132, baseType: !1132, size: 64, align: 64, offset: 7424)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1091, file: !14, line: 3139, baseType: !1507, size: 64, align: 64, offset: 7488)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1091, file: !14, line: 3147, baseType: !980, size: 32, align: 32, offset: 7552)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1091, file: !14, line: 3165, baseType: !980, size: 32, align: 32, offset: 7584)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1091, file: !14, line: 3172, baseType: !980, size: 32, align: 32, offset: 7616)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1091, file: !14, line: 3180, baseType: !980, size: 32, align: 32, offset: 7648)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1091, file: !14, line: 3191, baseType: !1421, size: 64, align: 64, offset: 7680)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1091, file: !14, line: 3199, baseType: !1117, size: 64, align: 64, offset: 7744)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1091, file: !14, line: 3207, baseType: !1507, size: 64, align: 64, offset: 7808)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1091, file: !14, line: 3214, baseType: !981, size: 32, align: 32, offset: 7872)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1091, file: !14, line: 3224, baseType: !1249, size: 64, align: 64, offset: 7936)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1091, file: !14, line: 3225, baseType: !980, size: 32, align: 32, offset: 8000)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1091, file: !14, line: 3249, baseType: !1151, size: 64, align: 64, offset: 8064)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1091, file: !14, line: 3256, baseType: !980, size: 32, align: 32, offset: 8128)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1091, file: !14, line: 3271, baseType: !980, size: 32, align: 32, offset: 8160)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1091, file: !14, line: 3279, baseType: !1132, size: 64, align: 64, offset: 8192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1091, file: !14, line: 3301, baseType: !1151, size: 64, align: 64, offset: 8256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1091, file: !14, line: 3310, baseType: !980, size: 32, align: 32, offset: 8320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1091, file: !14, line: 3337, baseType: !980, size: 32, align: 32, offset: 8352)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1091, file: !14, line: 3351, baseType: !980, size: 32, align: 32, offset: 8384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1091, file: !14, line: 3359, baseType: !980, size: 32, align: 32, offset: 8416)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !995, file: !14, line: 3535, baseType: !1638, size: 64, align: 64, offset: 1024)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{!980, !1089, !1641}
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !995, file: !14, line: 3541, baseType: !1644, size: 64, align: 64, offset: 1088)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1646)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1105, line: 223, size: 128, align: 64, elements: !1648)
!1648 = !{!1649, !1650}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1647, file: !1105, line: 224, baseType: !1533, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1647, file: !1105, line: 225, baseType: !1533, size: 64, align: 64, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !995, file: !14, line: 3549, baseType: !1652, size: 64, align: 64, offset: 1152)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1084}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !995, file: !14, line: 3551, baseType: !1086, size: 64, align: 64, offset: 1216)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !995, file: !14, line: 3552, baseType: !1657, size: 64, align: 64, offset: 1280)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!980, !1089, !1117, !980, !1660}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1663)
!1663 = !{!1664, !1665, !1666, !1667, !1668, !1692}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1662, file: !14, line: 3921, baseType: !988, size: 16, align: 16)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1662, file: !14, line: 3922, baseType: !1309, size: 32, align: 32, offset: 32)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1662, file: !14, line: 3923, baseType: !1309, size: 32, align: 32, offset: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1662, file: !14, line: 3924, baseType: !981, size: 32, align: 32, offset: 96)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1662, file: !14, line: 3925, baseType: !1669, size: 64, align: 64, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1685, !1687, !1688, !1689, !1690, !1691}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1672, file: !14, line: 3886, baseType: !980, size: 32, align: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1672, file: !14, line: 3887, baseType: !980, size: 32, align: 32, offset: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1672, file: !14, line: 3888, baseType: !980, size: 32, align: 32, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1672, file: !14, line: 3889, baseType: !980, size: 32, align: 32, offset: 96)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1672, file: !14, line: 3890, baseType: !980, size: 32, align: 32, offset: 128)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1672, file: !14, line: 3897, baseType: !1680, size: 768, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1681)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1682)
!1682 = !{!1683, !1684}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1681, file: !14, line: 3855, baseType: !1116, size: 512, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1681, file: !14, line: 3857, baseType: !1121, size: 256, align: 32, offset: 512)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1672, file: !14, line: 3903, baseType: !1686, size: 256, align: 64, offset: 960)
!1686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 256, align: 64, elements: !1220)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1672, file: !14, line: 3904, baseType: !1227, size: 128, align: 32, offset: 1216)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1672, file: !14, line: 3908, baseType: !1507, size: 64, align: 64, offset: 1408)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1672, file: !14, line: 3915, baseType: !1507, size: 64, align: 64, offset: 1472)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1672, file: !14, line: 3917, baseType: !980, size: 32, align: 32, offset: 1536)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1662, file: !14, line: 3926, baseType: !1132, size: 64, align: 64, offset: 192)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !995, file: !14, line: 3564, baseType: !1694, size: 64, align: 64, offset: 1344)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!980, !1089, !1237, !1382, !1384}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !995, file: !14, line: 3566, baseType: !1698, size: 64, align: 64, offset: 1408)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!980, !1089, !1042, !1384, !1237}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !995, file: !14, line: 3567, baseType: !1086, size: 64, align: 64, offset: 1472)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !995, file: !14, line: 3576, baseType: !1703, size: 64, align: 64, offset: 1536)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!980, !1089, !1382}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !995, file: !14, line: 3577, baseType: !1707, size: 64, align: 64, offset: 1600)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!980, !1089, !1237}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !995, file: !14, line: 3584, baseType: !1526, size: 64, align: 64, offset: 1664)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !995, file: !14, line: 3589, baseType: !1712, size: 64, align: 64, offset: 1728)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DISubroutineType(types: !1714)
!1714 = !{null, !1089}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !995, file: !14, line: 3594, baseType: !980, size: 32, align: 32, offset: 1792)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !995, file: !14, line: 3600, baseType: !998, size: 64, align: 64, offset: 1856)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !995, file: !14, line: 3609, baseType: !1718, size: 64, align: 64, offset: 1920)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1721)
!1721 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1722 = !{i32 2, !"Dwarf Version", i32 4}
!1723 = !{i32 2, !"Debug Info Version", i32 3}
!1724 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1725 = distinct !DISubprogram(name: "mxpeg_decode_init", scope: !993, file: !993, line: 64, type: !1087, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1726)
!1726 = !{}
!1727 = !DILocalVariable(name: "avctx", arg: 1, scope: !1725, file: !993, line: 64, type: !1089)
!1728 = !DIExpression()
!1729 = !DILocation(line: 64, column: 68, scope: !1725)
!1730 = !DILocalVariable(name: "s", scope: !1725, file: !993, line: 66, type: !1731)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXpegDecodeContext", file: !993, line: 43, baseType: !1733)
