; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--encode.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--encode.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !889, !890, !893, !894}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !891, line: 197, baseType: !892)
!891 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!892 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!893 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!894 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!895 = !{i32 2, !"Dwarf Version", i32 4}
!896 = !{i32 2, !"Debug Info Version", i32 3}
!897 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!898 = distinct !DISubprogram(name: "ff_alloc_packet2", scope: !899, file: !899, line: 32, type: !900, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1629)
!899 = !DIFile(filename: "libavcodec/encode.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!900 = !DISubroutineType(types: !901)
!901 = !{!893, !902, !1081, !890, !890}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !905)
!905 = !{!906, !950, !951, !952, !1227, !1228, !1229, !1230, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1383, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1567, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !904, file: !35, line: 1561, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !911)
!911 = !{!912, !916, !920, !924, !925, !926, !927, !931, !937, !939, !943}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !910, file: !4, line: 72, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !910, file: !4, line: 78, baseType: !917, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!913, !888}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !910, file: !4, line: 85, baseType: !921, size: 64, align: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !910, file: !4, line: 93, baseType: !893, size: 32, align: 32, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !910, file: !4, line: 99, baseType: !893, size: 32, align: 32, offset: 224)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !910, file: !4, line: 108, baseType: !893, size: 32, align: 32, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !910, file: !4, line: 113, baseType: !928, size: 64, align: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!888, !888, !888}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !910, file: !4, line: 123, baseType: !932, size: 64, align: 64, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!935, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !910, file: !4, line: 130, baseType: !938, size: 32, align: 32, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !910, file: !4, line: 136, baseType: !940, size: 64, align: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!938, !888}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !910, file: !4, line: 142, baseType: !944, size: 64, align: 64, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!893, !947, !888, !913, !893}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !904, file: !35, line: 1562, baseType: !893, size: 32, align: 32, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !904, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !904, file: !35, line: 1565, baseType: !953, size: 64, align: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !971, !974, !977, !980, !986, !989, !990, !998, !999, !1000, !1002, !1006, !1012, !1023, !1027, !1028, !1077, !1198, !1202, !1203, !1207, !1211, !1216, !1220, !1221, !1222}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !35, line: 3475, baseType: !913, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !955, file: !35, line: 3480, baseType: !913, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !955, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !955, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !955, file: !35, line: 3487, baseType: !893, size: 32, align: 32, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !955, file: !35, line: 3488, baseType: !963, size: 64, align: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !966, line: 61, baseType: !967)
!966 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !966, line: 58, size: 64, align: 32, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !967, file: !966, line: 59, baseType: !893, size: 32, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !967, file: !966, line: 60, baseType: !893, size: 32, align: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !955, file: !35, line: 3489, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !955, file: !35, line: 3490, baseType: !975, size: 64, align: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !955, file: !35, line: 3491, baseType: !978, size: 64, align: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !955, file: !35, line: 3492, baseType: !981, size: 64, align: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !984, line: 55, baseType: !985)
!984 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!985 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !955, file: !35, line: 3493, baseType: !987, size: 8, align: 8, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !984, line: 48, baseType: !988)
!988 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !955, file: !35, line: 3494, baseType: !907, size: 64, align: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !955, file: !35, line: 3495, baseType: !991, size: 64, align: 64, offset: 704)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !994, file: !35, line: 3402, baseType: !893, size: 32, align: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !994, file: !35, line: 3403, baseType: !913, size: 64, align: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !955, file: !35, line: 3507, baseType: !913, size: 64, align: 64, offset: 768)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !955, file: !35, line: 3516, baseType: !893, size: 32, align: 32, offset: 832)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !35, line: 3517, baseType: !1001, size: 64, align: 64, offset: 896)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !955, file: !35, line: 3527, baseType: !1003, size: 64, align: 64, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!893, !902}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !955, file: !35, line: 3535, baseType: !1007, size: 64, align: 64, offset: 1024)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!893, !902, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !955, file: !35, line: 3541, baseType: !1013, size: 64, align: 64, offset: 1088)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1017, line: 223, size: 128, align: 64, elements: !1018)
!1017 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1018 = !{!1019, !1022}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1016, file: !1017, line: 224, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1016, file: !1017, line: 225, baseType: !1020, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !955, file: !35, line: 3549, baseType: !1024, size: 64, align: 64, offset: 1152)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !1001}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !955, file: !35, line: 3551, baseType: !1003, size: 64, align: 64, offset: 1216)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !955, file: !35, line: 3552, baseType: !1029, size: 64, align: 64, offset: 1280)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!893, !902, !1032, !893, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1036)
!1036 = !{!1037, !1040, !1042, !1043, !1044, !1076}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1035, file: !35, line: 3921, baseType: !1038, size: 16, align: 16)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !984, line: 49, baseType: !1039)
!1039 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1035, file: !35, line: 3922, baseType: !1041, size: 32, align: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !984, line: 51, baseType: !894)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1035, file: !35, line: 3923, baseType: !1041, size: 32, align: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1035, file: !35, line: 3924, baseType: !894, size: 32, align: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1035, file: !35, line: 3925, baseType: !1045, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1065, !1069, !1071, !1072, !1074, !1075}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1048, file: !35, line: 3886, baseType: !893, size: 32, align: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1048, file: !35, line: 3887, baseType: !893, size: 32, align: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1048, file: !35, line: 3888, baseType: !893, size: 32, align: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1048, file: !35, line: 3889, baseType: !893, size: 32, align: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1048, file: !35, line: 3890, baseType: !893, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1048, file: !35, line: 3897, baseType: !1056, size: 768, align: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1058)
!1058 = !{!1059, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1057, file: !35, line: 3855, baseType: !1060, size: 512, align: 64)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 512, align: 64, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 8)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1057, file: !35, line: 3857, baseType: !1064, size: 256, align: 32, offset: 512)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 256, align: 32, elements: !1061)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !35, line: 3903, baseType: !1066, size: 256, align: 64, offset: 960)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 256, align: 64, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 4)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1048, file: !35, line: 3904, baseType: !1070, size: 128, align: 32, offset: 1216)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 128, align: 32, elements: !1067)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1048, file: !35, line: 3908, baseType: !1073, size: 64, align: 64, offset: 1408)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1048, file: !35, line: 3915, baseType: !1073, size: 64, align: 64, offset: 1472)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1048, file: !35, line: 3917, baseType: !893, size: 32, align: 32, offset: 1536)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1035, file: !35, line: 3926, baseType: !890, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !955, file: !35, line: 3564, baseType: !1078, size: 64, align: 64, offset: 1344)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!893, !902, !1081, !1115, !1197}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1084)
!1084 = !{!1085, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1111, !1112, !1113, !1114}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1083, file: !35, line: 1451, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1088, line: 94, baseType: !1089)
!1088 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1088, line: 81, size: 192, align: 64, elements: !1090)
!1090 = !{!1091, !1095, !1096}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1089, file: !1088, line: 82, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1088, line: 73, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1088, line: 73, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !1088, line: 89, baseType: !1032, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !1088, line: 93, baseType: !893, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1083, file: !35, line: 1461, baseType: !890, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1083, file: !35, line: 1467, baseType: !890, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !35, line: 1468, baseType: !1032, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !35, line: 1469, baseType: !893, size: 32, align: 32, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1083, file: !35, line: 1470, baseType: !893, size: 32, align: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1083, file: !35, line: 1474, baseType: !893, size: 32, align: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1083, file: !35, line: 1479, baseType: !1104, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !35, line: 1412, baseType: !1032, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !35, line: 1413, baseType: !893, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1106, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1083, file: !35, line: 1480, baseType: !893, size: 32, align: 32, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1083, file: !35, line: 1486, baseType: !890, size: 64, align: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1083, file: !35, line: 1488, baseType: !890, size: 64, align: 64, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1083, file: !35, line: 1497, baseType: !890, size: 64, align: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1151, !1152, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1185, !1186, !1187, !1188, !1189, !1190, !1193, !1194, !1195, !1196}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !758, line: 282, baseType: !1060, size: 512, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1118, file: !758, line: 299, baseType: !1064, size: 256, align: 32, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1118, file: !758, line: 315, baseType: !1123, size: 64, align: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1118, file: !758, line: 326, baseType: !893, size: 32, align: 32, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1118, file: !758, line: 326, baseType: !893, size: 32, align: 32, offset: 864)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1118, file: !758, line: 334, baseType: !893, size: 32, align: 32, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1118, file: !758, line: 341, baseType: !893, size: 32, align: 32, offset: 928)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1118, file: !758, line: 346, baseType: !893, size: 32, align: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1118, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1118, file: !758, line: 356, baseType: !965, size: 64, align: 32, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !758, line: 361, baseType: !890, size: 64, align: 64, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1118, file: !758, line: 369, baseType: !890, size: 64, align: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1118, file: !758, line: 377, baseType: !890, size: 64, align: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1118, file: !758, line: 382, baseType: !893, size: 32, align: 32, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1118, file: !758, line: 386, baseType: !893, size: 32, align: 32, offset: 1312)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1118, file: !758, line: 391, baseType: !893, size: 32, align: 32, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1118, file: !758, line: 396, baseType: !888, size: 64, align: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1118, file: !758, line: 403, baseType: !1139, size: 512, align: 64, offset: 1472)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 512, align: 64, elements: !1061)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1118, file: !758, line: 410, baseType: !893, size: 32, align: 32, offset: 1984)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1118, file: !758, line: 415, baseType: !893, size: 32, align: 32, offset: 2016)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1118, file: !758, line: 420, baseType: !893, size: 32, align: 32, offset: 2048)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1118, file: !758, line: 425, baseType: !893, size: 32, align: 32, offset: 2080)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1118, file: !758, line: 435, baseType: !890, size: 64, align: 64, offset: 2112)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1118, file: !758, line: 440, baseType: !893, size: 32, align: 32, offset: 2176)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1118, file: !758, line: 445, baseType: !983, size: 64, align: 64, offset: 2240)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !758, line: 459, baseType: !1148, size: 512, align: 64, offset: 2304)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 512, align: 64, elements: !1061)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1118, file: !758, line: 473, baseType: !1150, size: 64, align: 64, offset: 2816)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1118, file: !758, line: 477, baseType: !893, size: 32, align: 32, offset: 2880)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !758, line: 479, baseType: !1153, size: 64, align: 64, offset: 2944)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1166}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !758, line: 203, baseType: !1032, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !758, line: 204, baseType: !893, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1156, file: !758, line: 205, baseType: !1162, size: 64, align: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1164, line: 86, baseType: !1165)
!1164 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1164, line: 86, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1156, file: !758, line: 206, baseType: !1086, size: 64, align: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1118, file: !758, line: 480, baseType: !893, size: 32, align: 32, offset: 3008)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !758, line: 505, baseType: !893, size: 32, align: 32, offset: 3040)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1118, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1118, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1118, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1118, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1118, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1118, file: !758, line: 532, baseType: !890, size: 64, align: 64, offset: 3264)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1118, file: !758, line: 539, baseType: !890, size: 64, align: 64, offset: 3328)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1118, file: !758, line: 547, baseType: !890, size: 64, align: 64, offset: 3392)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1118, file: !758, line: 554, baseType: !1162, size: 64, align: 64, offset: 3456)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1118, file: !758, line: 563, baseType: !893, size: 32, align: 32, offset: 3520)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1118, file: !758, line: 572, baseType: !893, size: 32, align: 32, offset: 3552)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1118, file: !758, line: 581, baseType: !893, size: 32, align: 32, offset: 3584)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1118, file: !758, line: 588, baseType: !1182, size: 64, align: 64, offset: 3648)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !891, line: 194, baseType: !1184)
!1184 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1118, file: !758, line: 593, baseType: !893, size: 32, align: 32, offset: 3712)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1118, file: !758, line: 596, baseType: !893, size: 32, align: 32, offset: 3744)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1118, file: !758, line: 599, baseType: !1086, size: 64, align: 64, offset: 3776)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1118, file: !758, line: 605, baseType: !1086, size: 64, align: 64, offset: 3840)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1118, file: !758, line: 616, baseType: !1086, size: 64, align: 64, offset: 3904)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1118, file: !758, line: 626, baseType: !1191, size: 64, align: 64, offset: 3968)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1192, line: 216, baseType: !985)
!1192 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1118, file: !758, line: 627, baseType: !1191, size: 64, align: 64, offset: 4032)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1118, file: !758, line: 628, baseType: !1191, size: 64, align: 64, offset: 4096)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1118, file: !758, line: 629, baseType: !1191, size: 64, align: 64, offset: 4160)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1118, file: !758, line: 645, baseType: !1086, size: 64, align: 64, offset: 4224)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !955, file: !35, line: 3566, baseType: !1199, size: 64, align: 64, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!893, !902, !888, !1197, !1081}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !955, file: !35, line: 3567, baseType: !1003, size: 64, align: 64, offset: 1472)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !955, file: !35, line: 3576, baseType: !1204, size: 64, align: 64, offset: 1536)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!893, !902, !1115}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !955, file: !35, line: 3577, baseType: !1208, size: 64, align: 64, offset: 1600)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!893, !902, !1081}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !955, file: !35, line: 3584, baseType: !1212, size: 64, align: 64, offset: 1664)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!893, !902, !1215}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !955, file: !35, line: 3589, baseType: !1217, size: 64, align: 64, offset: 1728)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{null, !902}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !955, file: !35, line: 3594, baseType: !893, size: 32, align: 32, offset: 1792)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !955, file: !35, line: 3600, baseType: !913, size: 64, align: 64, offset: 1856)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !955, file: !35, line: 3609, baseType: !1223, size: 64, align: 64, offset: 1920)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !904, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !904, file: !35, line: 1581, baseType: !894, size: 32, align: 32, offset: 224)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !904, file: !35, line: 1583, baseType: !888, size: 64, align: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !904, file: !35, line: 1591, baseType: !1231, size: 64, align: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1017, line: 129, size: 1664, align: 64, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1256, !1257, !1263, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1232, file: !1017, line: 136, baseType: !893, size: 32, align: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1232, file: !1017, line: 151, baseType: !893, size: 32, align: 32, offset: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1232, file: !1017, line: 157, baseType: !893, size: 32, align: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1232, file: !1017, line: 159, baseType: !1215, size: 64, align: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1232, file: !1017, line: 161, baseType: !1239, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1017, line: 117, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1017, line: 100, size: 832, align: 64, elements: !1242)
!1242 = !{!1243, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1241, file: !1017, line: 105, baseType: !1244, size: 256, align: 64)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1245, size: 256, align: 64, elements: !1067)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1088, line: 238, baseType: !1247)
!1247 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1088, line: 238, flags: DIFlagFwdDecl)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1241, file: !1017, line: 110, baseType: !893, size: 32, align: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1241, file: !1017, line: 111, baseType: !893, size: 32, align: 32, offset: 288)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1241, file: !1017, line: 111, baseType: !893, size: 32, align: 32, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1241, file: !1017, line: 112, baseType: !1064, size: 256, align: 32, offset: 352)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1241, file: !1017, line: 113, baseType: !1070, size: 128, align: 32, offset: 608)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1241, file: !1017, line: 114, baseType: !893, size: 32, align: 32, offset: 736)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1241, file: !1017, line: 115, baseType: !893, size: 32, align: 32, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1241, file: !1017, line: 116, baseType: !893, size: 32, align: 32, offset: 800)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1232, file: !1017, line: 163, baseType: !888, size: 64, align: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1232, file: !1017, line: 165, baseType: !1258, size: 128, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1017, line: 122, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1017, line: 119, size: 128, align: 64, elements: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1259, file: !1017, line: 120, baseType: !1081, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1259, file: !1017, line: 121, baseType: !1215, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1232, file: !1017, line: 166, baseType: !1264, size: 128, align: 64, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1017, line: 127, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1017, line: 124, size: 128, align: 64, elements: !1266)
!1266 = !{!1267, !1340}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1265, file: !1017, line: 125, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1298, !1302, !1303, !1337, !1338, !1339}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1271, file: !35, line: 5751, baseType: !907, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1271, file: !35, line: 5756, baseType: !1275, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1283, !1284, !1285, !1289, !1293, !1297}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1277, file: !35, line: 5797, baseType: !913, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1277, file: !35, line: 5804, baseType: !1281, size: 64, align: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1277, file: !35, line: 5815, baseType: !907, size: 64, align: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1277, file: !35, line: 5825, baseType: !893, size: 32, align: 32, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1277, file: !35, line: 5826, baseType: !1286, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!893, !1269}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1277, file: !35, line: 5827, baseType: !1290, size: 64, align: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!893, !1269, !1081}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1277, file: !35, line: 5828, baseType: !1294, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{null, !1269}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1277, file: !35, line: 5829, baseType: !1294, size: 64, align: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1271, file: !35, line: 5762, baseType: !1299, size: 64, align: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1301)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1271, file: !35, line: 5768, baseType: !888, size: 64, align: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1271, file: !35, line: 5775, baseType: !1304, size: 64, align: 64, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1306, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1306, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1306, file: !35, line: 3948, baseType: !1041, size: 32, align: 32, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1306, file: !35, line: 3958, baseType: !1032, size: 64, align: 64, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1306, file: !35, line: 3962, baseType: !893, size: 32, align: 32, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1306, file: !35, line: 3968, baseType: !893, size: 32, align: 32, offset: 224)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1306, file: !35, line: 3973, baseType: !890, size: 64, align: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1306, file: !35, line: 3986, baseType: !893, size: 32, align: 32, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1306, file: !35, line: 3999, baseType: !893, size: 32, align: 32, offset: 352)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1306, file: !35, line: 4004, baseType: !893, size: 32, align: 32, offset: 384)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1306, file: !35, line: 4005, baseType: !893, size: 32, align: 32, offset: 416)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1306, file: !35, line: 4010, baseType: !893, size: 32, align: 32, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1306, file: !35, line: 4011, baseType: !893, size: 32, align: 32, offset: 480)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1306, file: !35, line: 4020, baseType: !965, size: 64, align: 32, offset: 512)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1306, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1306, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1306, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1306, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1306, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1306, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1306, file: !35, line: 4039, baseType: !893, size: 32, align: 32, offset: 768)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1306, file: !35, line: 4046, baseType: !983, size: 64, align: 64, offset: 832)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1306, file: !35, line: 4050, baseType: !893, size: 32, align: 32, offset: 896)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1306, file: !35, line: 4054, baseType: !893, size: 32, align: 32, offset: 928)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1306, file: !35, line: 4061, baseType: !893, size: 32, align: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1306, file: !35, line: 4065, baseType: !893, size: 32, align: 32, offset: 992)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1306, file: !35, line: 4073, baseType: !893, size: 32, align: 32, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1306, file: !35, line: 4080, baseType: !893, size: 32, align: 32, offset: 1056)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1306, file: !35, line: 4084, baseType: !893, size: 32, align: 32, offset: 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1271, file: !35, line: 5781, baseType: !1304, size: 64, align: 64, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1271, file: !35, line: 5787, baseType: !965, size: 64, align: 32, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1271, file: !35, line: 5793, baseType: !965, size: 64, align: 32, offset: 448)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1265, file: !1017, line: 126, baseType: !893, size: 32, align: 32, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1232, file: !1017, line: 172, baseType: !1081, size: 64, align: 64, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1232, file: !1017, line: 177, baseType: !1032, size: 64, align: 64, offset: 640)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1232, file: !1017, line: 178, baseType: !894, size: 32, align: 32, offset: 704)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1232, file: !1017, line: 180, baseType: !888, size: 64, align: 64, offset: 768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1232, file: !1017, line: 185, baseType: !893, size: 32, align: 32, offset: 832)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1232, file: !1017, line: 190, baseType: !888, size: 64, align: 64, offset: 896)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1232, file: !1017, line: 195, baseType: !893, size: 32, align: 32, offset: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1232, file: !1017, line: 200, baseType: !1081, size: 64, align: 64, offset: 1024)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1232, file: !1017, line: 201, baseType: !893, size: 32, align: 32, offset: 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1232, file: !1017, line: 202, baseType: !1215, size: 64, align: 64, offset: 1152)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1232, file: !1017, line: 203, baseType: !893, size: 32, align: 32, offset: 1216)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1232, file: !1017, line: 205, baseType: !893, size: 32, align: 32, offset: 1248)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1232, file: !1017, line: 206, baseType: !893, size: 32, align: 32, offset: 1280)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1232, file: !1017, line: 209, baseType: !1191, size: 64, align: 64, offset: 1344)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1232, file: !1017, line: 212, baseType: !1191, size: 64, align: 64, offset: 1408)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1232, file: !1017, line: 213, baseType: !1215, size: 64, align: 64, offset: 1472)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1232, file: !1017, line: 215, baseType: !893, size: 32, align: 32, offset: 1536)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1232, file: !1017, line: 217, baseType: !893, size: 32, align: 32, offset: 1568)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1232, file: !1017, line: 220, baseType: !893, size: 32, align: 32, offset: 1600)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !904, file: !35, line: 1598, baseType: !888, size: 64, align: 64, offset: 384)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !904, file: !35, line: 1606, baseType: !890, size: 64, align: 64, offset: 448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !904, file: !35, line: 1614, baseType: !893, size: 32, align: 32, offset: 512)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !904, file: !35, line: 1622, baseType: !893, size: 32, align: 32, offset: 544)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !904, file: !35, line: 1628, baseType: !893, size: 32, align: 32, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !904, file: !35, line: 1636, baseType: !893, size: 32, align: 32, offset: 608)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !904, file: !35, line: 1643, baseType: !893, size: 32, align: 32, offset: 640)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !904, file: !35, line: 1657, baseType: !1032, size: 64, align: 64, offset: 704)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !904, file: !35, line: 1658, baseType: !893, size: 32, align: 32, offset: 768)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !904, file: !35, line: 1679, baseType: !965, size: 64, align: 32, offset: 800)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !904, file: !35, line: 1688, baseType: !893, size: 32, align: 32, offset: 864)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !904, file: !35, line: 1712, baseType: !893, size: 32, align: 32, offset: 896)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !904, file: !35, line: 1729, baseType: !893, size: 32, align: 32, offset: 928)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !904, file: !35, line: 1729, baseType: !893, size: 32, align: 32, offset: 960)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !904, file: !35, line: 1744, baseType: !893, size: 32, align: 32, offset: 992)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !904, file: !35, line: 1744, baseType: !893, size: 32, align: 32, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !904, file: !35, line: 1751, baseType: !893, size: 32, align: 32, offset: 1056)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !904, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !904, file: !35, line: 1791, baseType: !1379, size: 64, align: 64, offset: 1152)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1382, !1115, !1197, !893, !893, !893}
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !904, file: !35, line: 1808, baseType: !1384, size: 64, align: 64, offset: 1216)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!494, !1382, !972}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !904, file: !35, line: 1816, baseType: !893, size: 32, align: 32, offset: 1280)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !904, file: !35, line: 1825, baseType: !1389, size: 32, align: 32, offset: 1312)
!1389 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !904, file: !35, line: 1830, baseType: !893, size: 32, align: 32, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !904, file: !35, line: 1838, baseType: !1389, size: 32, align: 32, offset: 1376)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !904, file: !35, line: 1846, baseType: !893, size: 32, align: 32, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !904, file: !35, line: 1851, baseType: !893, size: 32, align: 32, offset: 1440)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !904, file: !35, line: 1861, baseType: !1389, size: 32, align: 32, offset: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !904, file: !35, line: 1868, baseType: !1389, size: 32, align: 32, offset: 1504)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !904, file: !35, line: 1875, baseType: !1389, size: 32, align: 32, offset: 1536)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !904, file: !35, line: 1882, baseType: !1389, size: 32, align: 32, offset: 1568)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !904, file: !35, line: 1889, baseType: !1389, size: 32, align: 32, offset: 1600)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !904, file: !35, line: 1896, baseType: !1389, size: 32, align: 32, offset: 1632)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !904, file: !35, line: 1903, baseType: !1389, size: 32, align: 32, offset: 1664)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !904, file: !35, line: 1910, baseType: !893, size: 32, align: 32, offset: 1696)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !904, file: !35, line: 1915, baseType: !893, size: 32, align: 32, offset: 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !904, file: !35, line: 1926, baseType: !1197, size: 64, align: 64, offset: 1792)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !904, file: !35, line: 1935, baseType: !965, size: 64, align: 32, offset: 1856)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !904, file: !35, line: 1942, baseType: !893, size: 32, align: 32, offset: 1920)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !904, file: !35, line: 1948, baseType: !893, size: 32, align: 32, offset: 1952)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !904, file: !35, line: 1954, baseType: !893, size: 32, align: 32, offset: 1984)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !904, file: !35, line: 1960, baseType: !893, size: 32, align: 32, offset: 2016)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !904, file: !35, line: 1984, baseType: !893, size: 32, align: 32, offset: 2048)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !904, file: !35, line: 1991, baseType: !893, size: 32, align: 32, offset: 2080)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !904, file: !35, line: 1996, baseType: !893, size: 32, align: 32, offset: 2112)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !904, file: !35, line: 2004, baseType: !893, size: 32, align: 32, offset: 2144)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !904, file: !35, line: 2011, baseType: !893, size: 32, align: 32, offset: 2176)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !904, file: !35, line: 2018, baseType: !893, size: 32, align: 32, offset: 2208)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !904, file: !35, line: 2027, baseType: !893, size: 32, align: 32, offset: 2240)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !904, file: !35, line: 2034, baseType: !893, size: 32, align: 32, offset: 2272)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !904, file: !35, line: 2044, baseType: !893, size: 32, align: 32, offset: 2304)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !904, file: !35, line: 2054, baseType: !1419, size: 64, align: 64, offset: 2368)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !904, file: !35, line: 2061, baseType: !1419, size: 64, align: 64, offset: 2432)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !904, file: !35, line: 2066, baseType: !893, size: 32, align: 32, offset: 2496)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !904, file: !35, line: 2070, baseType: !893, size: 32, align: 32, offset: 2528)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !904, file: !35, line: 2078, baseType: !893, size: 32, align: 32, offset: 2560)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !904, file: !35, line: 2085, baseType: !893, size: 32, align: 32, offset: 2592)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !904, file: !35, line: 2092, baseType: !893, size: 32, align: 32, offset: 2624)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !904, file: !35, line: 2099, baseType: !893, size: 32, align: 32, offset: 2656)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !904, file: !35, line: 2106, baseType: !893, size: 32, align: 32, offset: 2688)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !904, file: !35, line: 2113, baseType: !893, size: 32, align: 32, offset: 2720)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !904, file: !35, line: 2120, baseType: !893, size: 32, align: 32, offset: 2752)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !904, file: !35, line: 2125, baseType: !893, size: 32, align: 32, offset: 2784)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !904, file: !35, line: 2133, baseType: !893, size: 32, align: 32, offset: 2816)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !904, file: !35, line: 2140, baseType: !893, size: 32, align: 32, offset: 2848)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !904, file: !35, line: 2145, baseType: !893, size: 32, align: 32, offset: 2880)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !904, file: !35, line: 2153, baseType: !893, size: 32, align: 32, offset: 2912)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !904, file: !35, line: 2158, baseType: !893, size: 32, align: 32, offset: 2944)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !904, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !904, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !904, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !904, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !904, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !904, file: !35, line: 2203, baseType: !893, size: 32, align: 32, offset: 3136)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !904, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !904, file: !35, line: 2212, baseType: !893, size: 32, align: 32, offset: 3200)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !904, file: !35, line: 2213, baseType: !893, size: 32, align: 32, offset: 3232)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !904, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !904, file: !35, line: 2232, baseType: !893, size: 32, align: 32, offset: 3296)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !904, file: !35, line: 2243, baseType: !893, size: 32, align: 32, offset: 3328)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !904, file: !35, line: 2249, baseType: !893, size: 32, align: 32, offset: 3360)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !904, file: !35, line: 2256, baseType: !893, size: 32, align: 32, offset: 3392)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !904, file: !35, line: 2263, baseType: !983, size: 64, align: 64, offset: 3456)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !904, file: !35, line: 2270, baseType: !983, size: 64, align: 64, offset: 3520)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !904, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !904, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !904, file: !35, line: 2367, baseType: !1455, size: 64, align: 64, offset: 3648)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!893, !1382, !1215, !893}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !904, file: !35, line: 2383, baseType: !893, size: 32, align: 32, offset: 3712)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !904, file: !35, line: 2386, baseType: !1389, size: 32, align: 32, offset: 3744)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !904, file: !35, line: 2387, baseType: !1389, size: 32, align: 32, offset: 3776)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !904, file: !35, line: 2394, baseType: !893, size: 32, align: 32, offset: 3808)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !904, file: !35, line: 2401, baseType: !893, size: 32, align: 32, offset: 3840)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !904, file: !35, line: 2408, baseType: !893, size: 32, align: 32, offset: 3872)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !904, file: !35, line: 2415, baseType: !893, size: 32, align: 32, offset: 3904)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !904, file: !35, line: 2422, baseType: !893, size: 32, align: 32, offset: 3936)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !904, file: !35, line: 2423, baseType: !1467, size: 64, align: 64, offset: 3968)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1470)
!1470 = !{!1471, !1472, !1473, !1474}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1469, file: !35, line: 827, baseType: !893, size: 32, align: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1469, file: !35, line: 828, baseType: !893, size: 32, align: 32, offset: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1469, file: !35, line: 829, baseType: !893, size: 32, align: 32, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1469, file: !35, line: 830, baseType: !1389, size: 32, align: 32, offset: 96)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !904, file: !35, line: 2430, baseType: !890, size: 64, align: 64, offset: 4032)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !904, file: !35, line: 2437, baseType: !890, size: 64, align: 64, offset: 4096)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !904, file: !35, line: 2444, baseType: !1389, size: 32, align: 32, offset: 4160)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !904, file: !35, line: 2451, baseType: !1389, size: 32, align: 32, offset: 4192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !904, file: !35, line: 2458, baseType: !893, size: 32, align: 32, offset: 4224)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !904, file: !35, line: 2469, baseType: !893, size: 32, align: 32, offset: 4256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !904, file: !35, line: 2475, baseType: !893, size: 32, align: 32, offset: 4288)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !904, file: !35, line: 2481, baseType: !893, size: 32, align: 32, offset: 4320)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !904, file: !35, line: 2485, baseType: !893, size: 32, align: 32, offset: 4352)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !904, file: !35, line: 2489, baseType: !893, size: 32, align: 32, offset: 4384)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !904, file: !35, line: 2493, baseType: !893, size: 32, align: 32, offset: 4416)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !904, file: !35, line: 2501, baseType: !893, size: 32, align: 32, offset: 4448)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !904, file: !35, line: 2506, baseType: !893, size: 32, align: 32, offset: 4480)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !904, file: !35, line: 2510, baseType: !893, size: 32, align: 32, offset: 4512)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !904, file: !35, line: 2514, baseType: !890, size: 64, align: 64, offset: 4544)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !904, file: !35, line: 2528, baseType: !1491, size: 64, align: 64, offset: 4608)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1382, !888, !893, !893}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !904, file: !35, line: 2534, baseType: !893, size: 32, align: 32, offset: 4672)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !904, file: !35, line: 2545, baseType: !893, size: 32, align: 32, offset: 4704)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !904, file: !35, line: 2547, baseType: !893, size: 32, align: 32, offset: 4736)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !904, file: !35, line: 2549, baseType: !893, size: 32, align: 32, offset: 4768)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !904, file: !35, line: 2551, baseType: !893, size: 32, align: 32, offset: 4800)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !904, file: !35, line: 2553, baseType: !893, size: 32, align: 32, offset: 4832)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !904, file: !35, line: 2555, baseType: !893, size: 32, align: 32, offset: 4864)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !904, file: !35, line: 2557, baseType: !893, size: 32, align: 32, offset: 4896)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !904, file: !35, line: 2559, baseType: !893, size: 32, align: 32, offset: 4928)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !904, file: !35, line: 2563, baseType: !893, size: 32, align: 32, offset: 4960)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !904, file: !35, line: 2571, baseType: !1073, size: 64, align: 64, offset: 4992)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !904, file: !35, line: 2579, baseType: !1073, size: 64, align: 64, offset: 5056)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !904, file: !35, line: 2586, baseType: !893, size: 32, align: 32, offset: 5120)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !904, file: !35, line: 2615, baseType: !893, size: 32, align: 32, offset: 5152)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !904, file: !35, line: 2627, baseType: !893, size: 32, align: 32, offset: 5184)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !904, file: !35, line: 2637, baseType: !893, size: 32, align: 32, offset: 5216)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !904, file: !35, line: 2681, baseType: !893, size: 32, align: 32, offset: 5248)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !904, file: !35, line: 2709, baseType: !890, size: 64, align: 64, offset: 5312)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !904, file: !35, line: 2716, baseType: !1513, size: 64, align: 64, offset: 5376)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520, !1521, !1522, !1523, !1527, !1531, !1532, !1533, !1534, !1540, !1541, !1542, !1543, !1544}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1515, file: !35, line: 3642, baseType: !913, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1515, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1515, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1515, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1515, file: !35, line: 3669, baseType: !893, size: 32, align: 32, offset: 160)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1515, file: !35, line: 3682, baseType: !1212, size: 64, align: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1515, file: !35, line: 3698, baseType: !1524, size: 64, align: 64, offset: 256)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!893, !902, !1020, !1041}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1515, file: !35, line: 3712, baseType: !1528, size: 64, align: 64, offset: 320)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!893, !902, !893, !1020, !1041}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1515, file: !35, line: 3726, baseType: !1524, size: 64, align: 64, offset: 384)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1515, file: !35, line: 3737, baseType: !1003, size: 64, align: 64, offset: 448)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1515, file: !35, line: 3746, baseType: !893, size: 32, align: 32, offset: 512)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1515, file: !35, line: 3757, baseType: !1535, size: 64, align: 64, offset: 576)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{null, !1538}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1515, file: !35, line: 3766, baseType: !1003, size: 64, align: 64, offset: 640)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1515, file: !35, line: 3774, baseType: !1003, size: 64, align: 64, offset: 704)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1515, file: !35, line: 3780, baseType: !893, size: 32, align: 32, offset: 768)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1515, file: !35, line: 3785, baseType: !893, size: 32, align: 32, offset: 800)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1515, file: !35, line: 3795, baseType: !1545, size: 64, align: 64, offset: 832)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!893, !902, !1086}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !904, file: !35, line: 2728, baseType: !888, size: 64, align: 64, offset: 5440)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !904, file: !35, line: 2735, baseType: !1139, size: 512, align: 64, offset: 5504)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !904, file: !35, line: 2742, baseType: !893, size: 32, align: 32, offset: 6016)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !904, file: !35, line: 2755, baseType: !893, size: 32, align: 32, offset: 6048)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !904, file: !35, line: 2776, baseType: !893, size: 32, align: 32, offset: 6080)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !904, file: !35, line: 2783, baseType: !893, size: 32, align: 32, offset: 6112)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !904, file: !35, line: 2791, baseType: !893, size: 32, align: 32, offset: 6144)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !904, file: !35, line: 2802, baseType: !1215, size: 64, align: 64, offset: 6208)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !904, file: !35, line: 2811, baseType: !893, size: 32, align: 32, offset: 6272)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !904, file: !35, line: 2821, baseType: !893, size: 32, align: 32, offset: 6304)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !904, file: !35, line: 2830, baseType: !893, size: 32, align: 32, offset: 6336)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !904, file: !35, line: 2840, baseType: !893, size: 32, align: 32, offset: 6368)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !904, file: !35, line: 2851, baseType: !1561, size: 64, align: 64, offset: 6400)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!893, !1382, !1564, !888, !1197, !893, !893}
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!893, !1382, !888}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !904, file: !35, line: 2871, baseType: !1568, size: 64, align: 64, offset: 6464)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!893, !1382, !1571, !888, !1197, !893}
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!893, !1382, !888, !893, !893}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !904, file: !35, line: 2878, baseType: !893, size: 32, align: 32, offset: 6528)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !904, file: !35, line: 2885, baseType: !893, size: 32, align: 32, offset: 6560)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !904, file: !35, line: 3005, baseType: !893, size: 32, align: 32, offset: 6592)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !904, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !904, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !904, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !904, file: !35, line: 3037, baseType: !1032, size: 64, align: 64, offset: 6720)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !904, file: !35, line: 3038, baseType: !893, size: 32, align: 32, offset: 6784)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !904, file: !35, line: 3050, baseType: !983, size: 64, align: 64, offset: 6848)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !904, file: !35, line: 3065, baseType: !893, size: 32, align: 32, offset: 6912)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !904, file: !35, line: 3083, baseType: !893, size: 32, align: 32, offset: 6944)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !904, file: !35, line: 3092, baseType: !965, size: 64, align: 32, offset: 6976)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !904, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !904, file: !35, line: 3106, baseType: !965, size: 64, align: 32, offset: 7072)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !904, file: !35, line: 3113, baseType: !1589, size: 64, align: 64, offset: 7168)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1591)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1593)
!1593 = !{!1594, !1595, !1596, !1597, !1598, !1599, !1602}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1592, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1592, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1592, file: !35, line: 720, baseType: !913, size: 64, align: 64, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1592, file: !35, line: 724, baseType: !913, size: 64, align: 64, offset: 128)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1592, file: !35, line: 728, baseType: !893, size: 32, align: 32, offset: 192)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1592, file: !35, line: 734, baseType: !1600, size: 64, align: 64, offset: 256)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1592, file: !35, line: 739, baseType: !1603, size: 64, align: 64, offset: 320)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !904, file: !35, line: 3129, baseType: !890, size: 64, align: 64, offset: 7232)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !904, file: !35, line: 3130, baseType: !890, size: 64, align: 64, offset: 7296)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !904, file: !35, line: 3131, baseType: !890, size: 64, align: 64, offset: 7360)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !904, file: !35, line: 3132, baseType: !890, size: 64, align: 64, offset: 7424)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !904, file: !35, line: 3139, baseType: !1073, size: 64, align: 64, offset: 7488)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !904, file: !35, line: 3147, baseType: !893, size: 32, align: 32, offset: 7552)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !904, file: !35, line: 3165, baseType: !893, size: 32, align: 32, offset: 7584)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !904, file: !35, line: 3172, baseType: !893, size: 32, align: 32, offset: 7616)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !904, file: !35, line: 3180, baseType: !893, size: 32, align: 32, offset: 7648)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !904, file: !35, line: 3191, baseType: !1419, size: 64, align: 64, offset: 7680)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !904, file: !35, line: 3199, baseType: !1032, size: 64, align: 64, offset: 7744)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !904, file: !35, line: 3207, baseType: !1073, size: 64, align: 64, offset: 7808)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !904, file: !35, line: 3214, baseType: !894, size: 32, align: 32, offset: 7872)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !904, file: !35, line: 3224, baseType: !1104, size: 64, align: 64, offset: 7936)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !904, file: !35, line: 3225, baseType: !893, size: 32, align: 32, offset: 8000)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !904, file: !35, line: 3249, baseType: !1086, size: 64, align: 64, offset: 8064)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !904, file: !35, line: 3256, baseType: !893, size: 32, align: 32, offset: 8128)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !904, file: !35, line: 3271, baseType: !893, size: 32, align: 32, offset: 8160)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !904, file: !35, line: 3279, baseType: !890, size: 64, align: 64, offset: 8192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !904, file: !35, line: 3301, baseType: !1086, size: 64, align: 64, offset: 8256)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !904, file: !35, line: 3310, baseType: !893, size: 32, align: 32, offset: 8320)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !904, file: !35, line: 3337, baseType: !893, size: 32, align: 32, offset: 8352)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !904, file: !35, line: 3351, baseType: !893, size: 32, align: 32, offset: 8384)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !904, file: !35, line: 3359, baseType: !893, size: 32, align: 32, offset: 8416)
!1629 = !{}
!1630 = !DILocalVariable(name: "avctx", arg: 1, scope: !898, file: !899, line: 32, type: !902)
!1631 = !DIExpression()
!1632 = !DILocation(line: 32, column: 38, scope: !898)
!1633 = !DILocalVariable(name: "avpkt", arg: 2, scope: !898, file: !899, line: 32, type: !1081)
!1634 = !DILocation(line: 32, column: 55, scope: !898)
!1635 = !DILocalVariable(name: "size", arg: 3, scope: !898, file: !899, line: 32, type: !890)
!1636 = !DILocation(line: 32, column: 70, scope: !898)
!1637 = !DILocalVariable(name: "min_size", arg: 4, scope: !898, file: !899, line: 32, type: !890)
!1638 = !DILocation(line: 32, column: 84, scope: !898)
!1639 = !DILocation(line: 34, column: 9, scope: !1640)
!1640 = distinct !DILexicalBlock(scope: !898, file: !899, line: 34, column: 9)
!1641 = !DILocation(line: 34, column: 16, scope: !1640)
!1642 = !DILocation(line: 34, column: 21, scope: !1640)
!1643 = !DILocation(line: 34, column: 9, scope: !898)
!1644 = !DILocation(line: 35, column: 16, scope: !1645)
!1645 = distinct !DILexicalBlock(scope: !1640, file: !899, line: 34, column: 26)
!1646 = !DILocation(line: 35, column: 69, scope: !1645)
!1647 = !DILocation(line: 35, column: 76, scope: !1645)
!1648 = !DILocation(line: 35, column: 9, scope: !1645)
!1649 = !DILocation(line: 36, column: 9, scope: !1645)
!1650 = !DILocation(line: 38, column: 9, scope: !1651)
!1651 = distinct !DILexicalBlock(scope: !898, file: !899, line: 38, column: 9)
!1652 = !DILocation(line: 38, column: 14, scope: !1651)
!1653 = !DILocation(line: 38, column: 18, scope: !1651)
!1654 = !DILocation(line: 38, column: 21, scope: !1655)
!1655 = !DILexicalBlockFile(scope: !1651, file: !899, discriminator: 1)
!1656 = !DILocation(line: 38, column: 26, scope: !1655)
!1657 = !DILocation(line: 38, column: 9, scope: !1655)
!1658 = !DILocation(line: 39, column: 16, scope: !1659)
!1659 = distinct !DILexicalBlock(scope: !1651, file: !899, line: 38, column: 45)
!1660 = !DILocation(line: 40, column: 16, scope: !1659)
!1661 = !DILocation(line: 39, column: 9, scope: !1659)
!1662 = !DILocation(line: 41, column: 9, scope: !1659)
!1663 = !DILocation(line: 44, column: 9, scope: !1664)
!1664 = distinct !DILexicalBlock(scope: !898, file: !899, line: 44, column: 9)
!1665 = !DILocation(line: 44, column: 15, scope: !1664)
!1666 = !DILocation(line: 44, column: 20, scope: !1667)
!1667 = !DILexicalBlockFile(scope: !1664, file: !899, discriminator: 1)
!1668 = !DILocation(line: 44, column: 19, scope: !1667)
!1669 = !DILocation(line: 44, column: 31, scope: !1667)
!1670 = !DILocation(line: 44, column: 29, scope: !1667)
!1671 = !DILocation(line: 44, column: 9, scope: !1667)
!1672 = !DILocation(line: 45, column: 9, scope: !1673)
!1673 = distinct !DILexicalBlock(scope: !1664, file: !899, line: 44, column: 37)
!1674 = distinct !{!1674, !1672}
!1675 = !DILocation(line: 45, column: 21, scope: !1676)
!1676 = !DILexicalBlockFile(scope: !1677, file: !899, discriminator: 1)
!1677 = distinct !DILexicalBlock(scope: !1678, file: !899, line: 45, column: 18)
!1678 = distinct !DILexicalBlock(scope: !1673, file: !899, line: 45, column: 12)
!1679 = !DILocation(line: 45, column: 28, scope: !1676)
!1680 = !DILocation(line: 45, column: 33, scope: !1676)
!1681 = !DILocation(line: 45, column: 36, scope: !1682)
!1682 = !DILexicalBlockFile(scope: !1677, file: !899, discriminator: 2)
!1683 = !DILocation(line: 45, column: 43, scope: !1682)
!1684 = !DILocation(line: 45, column: 51, scope: !1682)
!1685 = !DILocation(line: 45, column: 58, scope: !1682)
!1686 = !DILocation(line: 45, column: 68, scope: !1682)
!1687 = !DILocation(line: 45, column: 48, scope: !1682)
!1688 = !DILocation(line: 45, column: 18, scope: !1682)
!1689 = !DILocation(line: 45, column: 84, scope: !1690)
!1690 = !DILexicalBlockFile(scope: !1691, file: !899, discriminator: 3)
