; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dirac_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dirac_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!840 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!841 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!842 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !509, line: 493, size: 32, align: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!845 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!846 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!847 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!848 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!849 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !{!894, !897}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !895, line: 40, baseType: !896)
!895 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!896 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !900, line: 221, size: 32, align: 8, elements: !901)
!900 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !899, file: !900, line: 221, baseType: !903, size: 32, align: 32)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 51, baseType: !904)
!904 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!905 = !{!906, !1572}
!906 = distinct !DIGlobalVariable(name: "ff_dirac_parser", scope: !0, file: !907, line: 276, type: !908, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_dirac_parser)
!907 = !DIFile(filename: "libavcodec/dirac_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !910)
!910 = !{!911, !916, !917, !966, !1563, !1567, !1571}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !909, file: !4, line: 5260, baseType: !912, size: 160, align: 32)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 160, align: 32, elements: !914)
!913 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!914 = !{!915}
!915 = !DISubrange(count: 5)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !909, file: !4, line: 5261, baseType: !913, size: 32, align: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !909, file: !4, line: 5262, baseType: !918, size: 64, align: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!913, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !924)
!924 = !{!925, !927, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !923, file: !4, line: 5093, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !923, file: !4, line: 5094, baseType: !928, size: 64, align: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !923, file: !4, line: 5095, baseType: !894, size: 64, align: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !923, file: !4, line: 5096, baseType: !894, size: 64, align: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !923, file: !4, line: 5098, baseType: !894, size: 64, align: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !923, file: !4, line: 5100, baseType: !913, size: 32, align: 32, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !923, file: !4, line: 5110, baseType: !913, size: 32, align: 32, offset: 352)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !923, file: !4, line: 5111, baseType: !894, size: 64, align: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !923, file: !4, line: 5112, baseType: !894, size: 64, align: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !923, file: !4, line: 5115, baseType: !894, size: 64, align: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !923, file: !4, line: 5116, baseType: !894, size: 64, align: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !923, file: !4, line: 5117, baseType: !913, size: 32, align: 32, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !923, file: !4, line: 5120, baseType: !913, size: 32, align: 32, offset: 672)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !923, file: !4, line: 5121, baseType: !941, size: 256, align: 64, offset: 704)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 256, align: 64, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 4)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !923, file: !4, line: 5122, baseType: !941, size: 256, align: 64, offset: 960)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !923, file: !4, line: 5123, baseType: !941, size: 256, align: 64, offset: 1216)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !923, file: !4, line: 5125, baseType: !913, size: 32, align: 32, offset: 1472)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !923, file: !4, line: 5132, baseType: !894, size: 64, align: 64, offset: 1536)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !923, file: !4, line: 5133, baseType: !941, size: 256, align: 64, offset: 1600)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !923, file: !4, line: 5141, baseType: !913, size: 32, align: 32, offset: 1856)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !923, file: !4, line: 5148, baseType: !894, size: 64, align: 64, offset: 1920)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !923, file: !4, line: 5161, baseType: !913, size: 32, align: 32, offset: 1984)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !923, file: !4, line: 5176, baseType: !913, size: 32, align: 32, offset: 2016)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !923, file: !4, line: 5190, baseType: !913, size: 32, align: 32, offset: 2048)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !923, file: !4, line: 5197, baseType: !941, size: 256, align: 64, offset: 2112)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !923, file: !4, line: 5202, baseType: !894, size: 64, align: 64, offset: 2368)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !923, file: !4, line: 5207, baseType: !894, size: 64, align: 64, offset: 2432)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !923, file: !4, line: 5214, baseType: !913, size: 32, align: 32, offset: 2496)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !923, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !923, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !923, file: !4, line: 5234, baseType: !913, size: 32, align: 32, offset: 2592)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !923, file: !4, line: 5239, baseType: !913, size: 32, align: 32, offset: 2624)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !923, file: !4, line: 5240, baseType: !913, size: 32, align: 32, offset: 2656)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !923, file: !4, line: 5245, baseType: !913, size: 32, align: 32, offset: 2688)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !923, file: !4, line: 5246, baseType: !913, size: 32, align: 32, offset: 2720)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !923, file: !4, line: 5256, baseType: !913, size: 32, align: 32, offset: 2752)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !909, file: !4, line: 5265, baseType: !967, size: 64, align: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!913, !921, !970, !1562, !1255, !1458, !913}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !973)
!973 = !{!974, !1018, !1019, !1020, !1285, !1286, !1287, !1288, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1314, !1318, !1319, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1500, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !972, file: !4, line: 1561, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !979)
!979 = !{!980, !984, !988, !992, !993, !994, !995, !999, !1005, !1007, !1011}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !978, file: !19, line: 72, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !978, file: !19, line: 78, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!981, !926}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !978, file: !19, line: 85, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !978, file: !19, line: 93, baseType: !913, size: 32, align: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !978, file: !19, line: 99, baseType: !913, size: 32, align: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !978, file: !19, line: 108, baseType: !913, size: 32, align: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !978, file: !19, line: 113, baseType: !996, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!926, !926, !926}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !978, file: !19, line: 123, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !978, file: !19, line: 130, baseType: !1006, size: 32, align: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !978, file: !19, line: 136, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1006, !926}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !978, file: !19, line: 142, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!913, !1015, !926, !981, !913}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !972, file: !4, line: 1562, baseType: !913, size: 32, align: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !972, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !972, file: !4, line: 1565, baseType: !1021, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1039, !1042, !1045, !1048, !1053, !1056, !1057, !1065, !1066, !1067, !1069, !1073, !1079, !1084, !1088, !1089, !1135, !1256, !1260, !1261, !1265, !1269, !1274, !1278, !1279, !1280}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !4, line: 3475, baseType: !981, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1023, file: !4, line: 3480, baseType: !981, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1023, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1023, file: !4, line: 3487, baseType: !913, size: 32, align: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1023, file: !4, line: 3488, baseType: !1031, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1034, line: 61, baseType: !1035)
!1034 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1034, line: 58, size: 64, align: 32, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1035, file: !1034, line: 59, baseType: !913, size: 32, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1035, file: !1034, line: 60, baseType: !913, size: 32, align: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1023, file: !4, line: 3489, baseType: !1040, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1023, file: !4, line: 3490, baseType: !1043, size: 64, align: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1023, file: !4, line: 3491, baseType: !1046, size: 64, align: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1023, file: !4, line: 3492, baseType: !1049, size: 64, align: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 55, baseType: !1052)
!1052 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1023, file: !4, line: 3493, baseType: !1054, size: 8, align: 8, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 48, baseType: !1055)
!1055 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1023, file: !4, line: 3494, baseType: !975, size: 64, align: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1023, file: !4, line: 3495, baseType: !1058, size: 64, align: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1061, file: !4, line: 3402, baseType: !913, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !4, line: 3403, baseType: !981, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1023, file: !4, line: 3507, baseType: !981, size: 64, align: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1023, file: !4, line: 3516, baseType: !913, size: 32, align: 32, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !4, line: 3517, baseType: !1068, size: 64, align: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1023, file: !4, line: 3527, baseType: !1070, size: 64, align: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!913, !970}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1023, file: !4, line: 3535, baseType: !1074, size: 64, align: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!913, !970, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1023, file: !4, line: 3541, baseType: !1080, size: 64, align: 64, offset: 1088)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1083)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1023, file: !4, line: 3549, baseType: !1085, size: 64, align: 64, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !1068}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1023, file: !4, line: 3551, baseType: !1070, size: 64, align: 64, offset: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1023, file: !4, line: 3552, baseType: !1090, size: 64, align: 64, offset: 1280)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!913, !970, !1093, !913, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1097)
!1097 = !{!1098, !1101, !1102, !1103, !1104, !1134}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1096, file: !4, line: 3921, baseType: !1099, size: 16, align: 16)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !895, line: 49, baseType: !1100)
!1100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1096, file: !4, line: 3922, baseType: !903, size: 32, align: 32, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1096, file: !4, line: 3923, baseType: !903, size: 32, align: 32, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1096, file: !4, line: 3924, baseType: !904, size: 32, align: 32, offset: 96)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1096, file: !4, line: 3925, baseType: !1105, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1125, !1127, !1129, !1130, !1132, !1133}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1108, file: !4, line: 3886, baseType: !913, size: 32, align: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1108, file: !4, line: 3887, baseType: !913, size: 32, align: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1108, file: !4, line: 3888, baseType: !913, size: 32, align: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1108, file: !4, line: 3889, baseType: !913, size: 32, align: 32, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1108, file: !4, line: 3890, baseType: !913, size: 32, align: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1108, file: !4, line: 3897, baseType: !1116, size: 768, align: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1118)
!1118 = !{!1119, !1123}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !4, line: 3855, baseType: !1120, size: 512, align: 64)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 8)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1117, file: !4, line: 3857, baseType: !1124, size: 256, align: 32, offset: 512)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 256, align: 32, elements: !1121)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !4, line: 3903, baseType: !1126, size: 256, align: 64, offset: 960)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 256, align: 64, elements: !942)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1108, file: !4, line: 3904, baseType: !1128, size: 128, align: 32, offset: 1216)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, align: 32, elements: !942)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1108, file: !4, line: 3908, baseType: !1131, size: 64, align: 64, offset: 1408)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1108, file: !4, line: 3915, baseType: !1131, size: 64, align: 64, offset: 1472)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1108, file: !4, line: 3917, baseType: !913, size: 32, align: 32, offset: 1536)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1096, file: !4, line: 3926, baseType: !894, size: 64, align: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1023, file: !4, line: 3564, baseType: !1136, size: 64, align: 64, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!913, !970, !1139, !1173, !1255}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1142)
!1142 = !{!1143, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1169, !1170, !1171, !1172}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1141, file: !4, line: 1451, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1146, line: 94, baseType: !1147)
!1146 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1146, line: 81, size: 192, align: 64, elements: !1148)
!1148 = !{!1149, !1153, !1154}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1147, file: !1146, line: 82, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1146, line: 73, baseType: !1152)
!1152 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1146, line: 73, flags: DIFlagFwdDecl)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !1146, line: 89, baseType: !1093, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1147, file: !1146, line: 93, baseType: !913, size: 32, align: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1141, file: !4, line: 1461, baseType: !894, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1141, file: !4, line: 1467, baseType: !894, size: 64, align: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !4, line: 1468, baseType: !1093, size: 64, align: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !4, line: 1469, baseType: !913, size: 32, align: 32, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1141, file: !4, line: 1470, baseType: !913, size: 32, align: 32, offset: 288)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !4, line: 1474, baseType: !913, size: 32, align: 32, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1141, file: !4, line: 1479, baseType: !1162, size: 64, align: 64, offset: 384)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1165)
!1165 = !{!1166, !1167, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !4, line: 1412, baseType: !1093, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1164, file: !4, line: 1413, baseType: !913, size: 32, align: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1164, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1141, file: !4, line: 1480, baseType: !913, size: 32, align: 32, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1141, file: !4, line: 1486, baseType: !894, size: 64, align: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1141, file: !4, line: 1488, baseType: !894, size: 64, align: 64, offset: 576)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1141, file: !4, line: 1497, baseType: !894, size: 64, align: 64, offset: 640)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1207, !1209, !1210, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243, !1244, !1245, !1246, !1247, !1248, !1251, !1252, !1253, !1254}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1176, file: !772, line: 282, baseType: !1120, size: 512, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1176, file: !772, line: 299, baseType: !1124, size: 256, align: 32, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1176, file: !772, line: 315, baseType: !1181, size: 64, align: 64, offset: 768)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1176, file: !772, line: 326, baseType: !913, size: 32, align: 32, offset: 832)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1176, file: !772, line: 326, baseType: !913, size: 32, align: 32, offset: 864)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1176, file: !772, line: 334, baseType: !913, size: 32, align: 32, offset: 896)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1176, file: !772, line: 341, baseType: !913, size: 32, align: 32, offset: 928)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1176, file: !772, line: 346, baseType: !913, size: 32, align: 32, offset: 960)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1176, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1176, file: !772, line: 356, baseType: !1033, size: 64, align: 32, offset: 1024)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1176, file: !772, line: 361, baseType: !894, size: 64, align: 64, offset: 1088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1176, file: !772, line: 369, baseType: !894, size: 64, align: 64, offset: 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1176, file: !772, line: 377, baseType: !894, size: 64, align: 64, offset: 1216)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1176, file: !772, line: 382, baseType: !913, size: 32, align: 32, offset: 1280)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1176, file: !772, line: 386, baseType: !913, size: 32, align: 32, offset: 1312)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1176, file: !772, line: 391, baseType: !913, size: 32, align: 32, offset: 1344)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1176, file: !772, line: 396, baseType: !926, size: 64, align: 64, offset: 1408)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1176, file: !772, line: 403, baseType: !1197, size: 512, align: 64, offset: 1472)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, align: 64, elements: !1121)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1176, file: !772, line: 410, baseType: !913, size: 32, align: 32, offset: 1984)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1176, file: !772, line: 415, baseType: !913, size: 32, align: 32, offset: 2016)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1176, file: !772, line: 420, baseType: !913, size: 32, align: 32, offset: 2048)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1176, file: !772, line: 425, baseType: !913, size: 32, align: 32, offset: 2080)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1176, file: !772, line: 435, baseType: !894, size: 64, align: 64, offset: 2112)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1176, file: !772, line: 440, baseType: !913, size: 32, align: 32, offset: 2176)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1176, file: !772, line: 445, baseType: !1051, size: 64, align: 64, offset: 2240)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1176, file: !772, line: 459, baseType: !1206, size: 512, align: 64, offset: 2304)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 512, align: 64, elements: !1121)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1176, file: !772, line: 473, baseType: !1208, size: 64, align: 64, offset: 2816)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1176, file: !772, line: 477, baseType: !913, size: 32, align: 32, offset: 2880)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1176, file: !772, line: 479, baseType: !1211, size: 64, align: 64, offset: 2944)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1224}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1214, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !772, line: 203, baseType: !1093, size: 64, align: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1214, file: !772, line: 204, baseType: !913, size: 32, align: 32, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1214, file: !772, line: 205, baseType: !1220, size: 64, align: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1222, line: 86, baseType: !1223)
!1222 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1222, line: 86, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1214, file: !772, line: 206, baseType: !1144, size: 64, align: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1176, file: !772, line: 480, baseType: !913, size: 32, align: 32, offset: 3008)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1176, file: !772, line: 505, baseType: !913, size: 32, align: 32, offset: 3040)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1176, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1176, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1176, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1176, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1176, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1176, file: !772, line: 532, baseType: !894, size: 64, align: 64, offset: 3264)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1176, file: !772, line: 539, baseType: !894, size: 64, align: 64, offset: 3328)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1176, file: !772, line: 547, baseType: !894, size: 64, align: 64, offset: 3392)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1176, file: !772, line: 554, baseType: !1220, size: 64, align: 64, offset: 3456)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1176, file: !772, line: 563, baseType: !913, size: 32, align: 32, offset: 3520)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1176, file: !772, line: 572, baseType: !913, size: 32, align: 32, offset: 3552)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1176, file: !772, line: 581, baseType: !913, size: 32, align: 32, offset: 3584)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1176, file: !772, line: 588, baseType: !1240, size: 64, align: 64, offset: 3648)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 36, baseType: !1242)
!1242 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1176, file: !772, line: 593, baseType: !913, size: 32, align: 32, offset: 3712)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1176, file: !772, line: 596, baseType: !913, size: 32, align: 32, offset: 3744)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1176, file: !772, line: 599, baseType: !1144, size: 64, align: 64, offset: 3776)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1176, file: !772, line: 605, baseType: !1144, size: 64, align: 64, offset: 3840)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1176, file: !772, line: 616, baseType: !1144, size: 64, align: 64, offset: 3904)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1176, file: !772, line: 626, baseType: !1249, size: 64, align: 64, offset: 3968)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1250, line: 216, baseType: !1052)
!1250 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1176, file: !772, line: 627, baseType: !1249, size: 64, align: 64, offset: 4032)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1176, file: !772, line: 628, baseType: !1249, size: 64, align: 64, offset: 4096)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1176, file: !772, line: 629, baseType: !1249, size: 64, align: 64, offset: 4160)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1176, file: !772, line: 645, baseType: !1144, size: 64, align: 64, offset: 4224)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1023, file: !4, line: 3566, baseType: !1257, size: 64, align: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!913, !970, !926, !1255, !1139}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1023, file: !4, line: 3567, baseType: !1070, size: 64, align: 64, offset: 1472)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1023, file: !4, line: 3576, baseType: !1262, size: 64, align: 64, offset: 1536)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!913, !970, !1173}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1023, file: !4, line: 3577, baseType: !1266, size: 64, align: 64, offset: 1600)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!913, !970, !1139}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1023, file: !4, line: 3584, baseType: !1270, size: 64, align: 64, offset: 1664)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!913, !970, !1273}
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1023, file: !4, line: 3589, baseType: !1275, size: 64, align: 64, offset: 1728)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{null, !970}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1023, file: !4, line: 3594, baseType: !913, size: 32, align: 32, offset: 1792)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1023, file: !4, line: 3600, baseType: !981, size: 64, align: 64, offset: 1856)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1023, file: !4, line: 3609, baseType: !1281, size: 64, align: 64, offset: 1920)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1284)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !972, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !972, file: !4, line: 1581, baseType: !904, size: 32, align: 32, offset: 224)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !972, file: !4, line: 1583, baseType: !926, size: 64, align: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !972, file: !4, line: 1591, baseType: !1289, size: 64, align: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !972, file: !4, line: 1598, baseType: !926, size: 64, align: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !972, file: !4, line: 1606, baseType: !894, size: 64, align: 64, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !972, file: !4, line: 1614, baseType: !913, size: 32, align: 32, offset: 512)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !972, file: !4, line: 1622, baseType: !913, size: 32, align: 32, offset: 544)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !972, file: !4, line: 1628, baseType: !913, size: 32, align: 32, offset: 576)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !4, line: 1636, baseType: !913, size: 32, align: 32, offset: 608)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !972, file: !4, line: 1643, baseType: !913, size: 32, align: 32, offset: 640)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !972, file: !4, line: 1657, baseType: !1093, size: 64, align: 64, offset: 704)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !972, file: !4, line: 1658, baseType: !913, size: 32, align: 32, offset: 768)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !972, file: !4, line: 1679, baseType: !1033, size: 64, align: 32, offset: 800)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !972, file: !4, line: 1688, baseType: !913, size: 32, align: 32, offset: 864)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !972, file: !4, line: 1712, baseType: !913, size: 32, align: 32, offset: 896)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !972, file: !4, line: 1729, baseType: !913, size: 32, align: 32, offset: 928)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !972, file: !4, line: 1729, baseType: !913, size: 32, align: 32, offset: 960)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !972, file: !4, line: 1744, baseType: !913, size: 32, align: 32, offset: 992)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !972, file: !4, line: 1744, baseType: !913, size: 32, align: 32, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !972, file: !4, line: 1751, baseType: !913, size: 32, align: 32, offset: 1056)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !972, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !972, file: !4, line: 1791, baseType: !1310, size: 64, align: 64, offset: 1152)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{null, !1313, !1173, !1255, !913, !913, !913}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !972, file: !4, line: 1808, baseType: !1315, size: 64, align: 64, offset: 1216)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!508, !1313, !1040}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !972, file: !4, line: 1816, baseType: !913, size: 32, align: 32, offset: 1280)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !972, file: !4, line: 1825, baseType: !1320, size: 32, align: 32, offset: 1312)
!1320 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !972, file: !4, line: 1830, baseType: !913, size: 32, align: 32, offset: 1344)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !972, file: !4, line: 1838, baseType: !1320, size: 32, align: 32, offset: 1376)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !972, file: !4, line: 1846, baseType: !913, size: 32, align: 32, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !972, file: !4, line: 1851, baseType: !913, size: 32, align: 32, offset: 1440)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !972, file: !4, line: 1861, baseType: !1320, size: 32, align: 32, offset: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !972, file: !4, line: 1868, baseType: !1320, size: 32, align: 32, offset: 1504)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !972, file: !4, line: 1875, baseType: !1320, size: 32, align: 32, offset: 1536)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !972, file: !4, line: 1882, baseType: !1320, size: 32, align: 32, offset: 1568)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !972, file: !4, line: 1889, baseType: !1320, size: 32, align: 32, offset: 1600)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !972, file: !4, line: 1896, baseType: !1320, size: 32, align: 32, offset: 1632)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !972, file: !4, line: 1903, baseType: !1320, size: 32, align: 32, offset: 1664)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !972, file: !4, line: 1910, baseType: !913, size: 32, align: 32, offset: 1696)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !972, file: !4, line: 1915, baseType: !913, size: 32, align: 32, offset: 1728)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !972, file: !4, line: 1926, baseType: !1255, size: 64, align: 64, offset: 1792)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !972, file: !4, line: 1935, baseType: !1033, size: 64, align: 32, offset: 1856)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !972, file: !4, line: 1942, baseType: !913, size: 32, align: 32, offset: 1920)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !972, file: !4, line: 1948, baseType: !913, size: 32, align: 32, offset: 1952)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !972, file: !4, line: 1954, baseType: !913, size: 32, align: 32, offset: 1984)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !972, file: !4, line: 1960, baseType: !913, size: 32, align: 32, offset: 2016)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !972, file: !4, line: 1984, baseType: !913, size: 32, align: 32, offset: 2048)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !972, file: !4, line: 1991, baseType: !913, size: 32, align: 32, offset: 2080)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !972, file: !4, line: 1996, baseType: !913, size: 32, align: 32, offset: 2112)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !972, file: !4, line: 2004, baseType: !913, size: 32, align: 32, offset: 2144)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !972, file: !4, line: 2011, baseType: !913, size: 32, align: 32, offset: 2176)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !972, file: !4, line: 2018, baseType: !913, size: 32, align: 32, offset: 2208)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !972, file: !4, line: 2027, baseType: !913, size: 32, align: 32, offset: 2240)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !972, file: !4, line: 2034, baseType: !913, size: 32, align: 32, offset: 2272)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !972, file: !4, line: 2044, baseType: !913, size: 32, align: 32, offset: 2304)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !972, file: !4, line: 2054, baseType: !1350, size: 64, align: 64, offset: 2368)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !972, file: !4, line: 2061, baseType: !1350, size: 64, align: 64, offset: 2432)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !972, file: !4, line: 2066, baseType: !913, size: 32, align: 32, offset: 2496)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !972, file: !4, line: 2070, baseType: !913, size: 32, align: 32, offset: 2528)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !972, file: !4, line: 2078, baseType: !913, size: 32, align: 32, offset: 2560)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !972, file: !4, line: 2085, baseType: !913, size: 32, align: 32, offset: 2592)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !972, file: !4, line: 2092, baseType: !913, size: 32, align: 32, offset: 2624)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !972, file: !4, line: 2099, baseType: !913, size: 32, align: 32, offset: 2656)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !972, file: !4, line: 2106, baseType: !913, size: 32, align: 32, offset: 2688)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !972, file: !4, line: 2113, baseType: !913, size: 32, align: 32, offset: 2720)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !972, file: !4, line: 2120, baseType: !913, size: 32, align: 32, offset: 2752)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !972, file: !4, line: 2125, baseType: !913, size: 32, align: 32, offset: 2784)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !972, file: !4, line: 2133, baseType: !913, size: 32, align: 32, offset: 2816)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !972, file: !4, line: 2140, baseType: !913, size: 32, align: 32, offset: 2848)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !972, file: !4, line: 2145, baseType: !913, size: 32, align: 32, offset: 2880)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !972, file: !4, line: 2153, baseType: !913, size: 32, align: 32, offset: 2912)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !972, file: !4, line: 2158, baseType: !913, size: 32, align: 32, offset: 2944)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !972, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !972, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !972, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !972, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !972, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !972, file: !4, line: 2203, baseType: !913, size: 32, align: 32, offset: 3136)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !972, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !972, file: !4, line: 2212, baseType: !913, size: 32, align: 32, offset: 3200)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !972, file: !4, line: 2213, baseType: !913, size: 32, align: 32, offset: 3232)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !972, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !972, file: !4, line: 2232, baseType: !913, size: 32, align: 32, offset: 3296)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !972, file: !4, line: 2243, baseType: !913, size: 32, align: 32, offset: 3328)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !972, file: !4, line: 2249, baseType: !913, size: 32, align: 32, offset: 3360)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !972, file: !4, line: 2256, baseType: !913, size: 32, align: 32, offset: 3392)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !972, file: !4, line: 2263, baseType: !1051, size: 64, align: 64, offset: 3456)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !972, file: !4, line: 2270, baseType: !1051, size: 64, align: 64, offset: 3520)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !972, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !972, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !972, file: !4, line: 2367, baseType: !1386, size: 64, align: 64, offset: 3648)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!913, !1313, !1273, !913}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !972, file: !4, line: 2383, baseType: !913, size: 32, align: 32, offset: 3712)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !972, file: !4, line: 2386, baseType: !1320, size: 32, align: 32, offset: 3744)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !972, file: !4, line: 2387, baseType: !1320, size: 32, align: 32, offset: 3776)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !972, file: !4, line: 2394, baseType: !913, size: 32, align: 32, offset: 3808)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !972, file: !4, line: 2401, baseType: !913, size: 32, align: 32, offset: 3840)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !972, file: !4, line: 2408, baseType: !913, size: 32, align: 32, offset: 3872)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !972, file: !4, line: 2415, baseType: !913, size: 32, align: 32, offset: 3904)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !972, file: !4, line: 2422, baseType: !913, size: 32, align: 32, offset: 3936)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !972, file: !4, line: 2423, baseType: !1398, size: 64, align: 64, offset: 3968)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1400, file: !4, line: 827, baseType: !913, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1400, file: !4, line: 828, baseType: !913, size: 32, align: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1400, file: !4, line: 829, baseType: !913, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1400, file: !4, line: 830, baseType: !1320, size: 32, align: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !972, file: !4, line: 2430, baseType: !894, size: 64, align: 64, offset: 4032)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !972, file: !4, line: 2437, baseType: !894, size: 64, align: 64, offset: 4096)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !972, file: !4, line: 2444, baseType: !1320, size: 32, align: 32, offset: 4160)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !972, file: !4, line: 2451, baseType: !1320, size: 32, align: 32, offset: 4192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !972, file: !4, line: 2458, baseType: !913, size: 32, align: 32, offset: 4224)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !972, file: !4, line: 2469, baseType: !913, size: 32, align: 32, offset: 4256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !972, file: !4, line: 2475, baseType: !913, size: 32, align: 32, offset: 4288)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !972, file: !4, line: 2481, baseType: !913, size: 32, align: 32, offset: 4320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !972, file: !4, line: 2485, baseType: !913, size: 32, align: 32, offset: 4352)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !972, file: !4, line: 2489, baseType: !913, size: 32, align: 32, offset: 4384)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !972, file: !4, line: 2493, baseType: !913, size: 32, align: 32, offset: 4416)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !972, file: !4, line: 2501, baseType: !913, size: 32, align: 32, offset: 4448)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !972, file: !4, line: 2506, baseType: !913, size: 32, align: 32, offset: 4480)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !972, file: !4, line: 2510, baseType: !913, size: 32, align: 32, offset: 4512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !972, file: !4, line: 2514, baseType: !894, size: 64, align: 64, offset: 4544)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !972, file: !4, line: 2528, baseType: !1422, size: 64, align: 64, offset: 4608)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1313, !926, !913, !913}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !972, file: !4, line: 2534, baseType: !913, size: 32, align: 32, offset: 4672)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !972, file: !4, line: 2545, baseType: !913, size: 32, align: 32, offset: 4704)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !972, file: !4, line: 2547, baseType: !913, size: 32, align: 32, offset: 4736)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !972, file: !4, line: 2549, baseType: !913, size: 32, align: 32, offset: 4768)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !972, file: !4, line: 2551, baseType: !913, size: 32, align: 32, offset: 4800)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !972, file: !4, line: 2553, baseType: !913, size: 32, align: 32, offset: 4832)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !972, file: !4, line: 2555, baseType: !913, size: 32, align: 32, offset: 4864)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !972, file: !4, line: 2557, baseType: !913, size: 32, align: 32, offset: 4896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !972, file: !4, line: 2559, baseType: !913, size: 32, align: 32, offset: 4928)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !972, file: !4, line: 2563, baseType: !913, size: 32, align: 32, offset: 4960)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !972, file: !4, line: 2571, baseType: !1131, size: 64, align: 64, offset: 4992)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !972, file: !4, line: 2579, baseType: !1131, size: 64, align: 64, offset: 5056)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !972, file: !4, line: 2586, baseType: !913, size: 32, align: 32, offset: 5120)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !972, file: !4, line: 2615, baseType: !913, size: 32, align: 32, offset: 5152)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !972, file: !4, line: 2627, baseType: !913, size: 32, align: 32, offset: 5184)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !972, file: !4, line: 2637, baseType: !913, size: 32, align: 32, offset: 5216)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !972, file: !4, line: 2681, baseType: !913, size: 32, align: 32, offset: 5248)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !972, file: !4, line: 2709, baseType: !894, size: 64, align: 64, offset: 5312)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !972, file: !4, line: 2716, baseType: !1444, size: 64, align: 64, offset: 5376)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452, !1453, !1454, !1460, !1464, !1465, !1466, !1467, !1473, !1474, !1475, !1476, !1477}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1446, file: !4, line: 3642, baseType: !981, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1446, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1446, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1446, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1446, file: !4, line: 3669, baseType: !913, size: 32, align: 32, offset: 160)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1446, file: !4, line: 3682, baseType: !1270, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1446, file: !4, line: 3698, baseType: !1455, size: 64, align: 64, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!913, !970, !1458, !903}
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1446, file: !4, line: 3712, baseType: !1461, size: 64, align: 64, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!913, !970, !913, !1458, !903}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1446, file: !4, line: 3726, baseType: !1455, size: 64, align: 64, offset: 384)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1446, file: !4, line: 3737, baseType: !1070, size: 64, align: 64, offset: 448)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1446, file: !4, line: 3746, baseType: !913, size: 32, align: 32, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1446, file: !4, line: 3757, baseType: !1468, size: 64, align: 64, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{null, !1471}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1446, file: !4, line: 3766, baseType: !1070, size: 64, align: 64, offset: 640)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1446, file: !4, line: 3774, baseType: !1070, size: 64, align: 64, offset: 704)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1446, file: !4, line: 3780, baseType: !913, size: 32, align: 32, offset: 768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1446, file: !4, line: 3785, baseType: !913, size: 32, align: 32, offset: 800)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1446, file: !4, line: 3795, baseType: !1478, size: 64, align: 64, offset: 832)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!913, !970, !1144}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !972, file: !4, line: 2728, baseType: !926, size: 64, align: 64, offset: 5440)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !972, file: !4, line: 2735, baseType: !1197, size: 512, align: 64, offset: 5504)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !972, file: !4, line: 2742, baseType: !913, size: 32, align: 32, offset: 6016)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !972, file: !4, line: 2755, baseType: !913, size: 32, align: 32, offset: 6048)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !972, file: !4, line: 2776, baseType: !913, size: 32, align: 32, offset: 6080)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !972, file: !4, line: 2783, baseType: !913, size: 32, align: 32, offset: 6112)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !972, file: !4, line: 2791, baseType: !913, size: 32, align: 32, offset: 6144)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !972, file: !4, line: 2802, baseType: !1273, size: 64, align: 64, offset: 6208)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !972, file: !4, line: 2811, baseType: !913, size: 32, align: 32, offset: 6272)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !972, file: !4, line: 2821, baseType: !913, size: 32, align: 32, offset: 6304)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !972, file: !4, line: 2830, baseType: !913, size: 32, align: 32, offset: 6336)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !972, file: !4, line: 2840, baseType: !913, size: 32, align: 32, offset: 6368)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !972, file: !4, line: 2851, baseType: !1494, size: 64, align: 64, offset: 6400)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!913, !1313, !1497, !926, !1255, !913, !913}
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!913, !1313, !926}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !972, file: !4, line: 2871, baseType: !1501, size: 64, align: 64, offset: 6464)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!913, !1313, !1504, !926, !1255, !913}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!913, !1313, !926, !913, !913}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !972, file: !4, line: 2878, baseType: !913, size: 32, align: 32, offset: 6528)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !972, file: !4, line: 2885, baseType: !913, size: 32, align: 32, offset: 6560)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !972, file: !4, line: 3005, baseType: !913, size: 32, align: 32, offset: 6592)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !972, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !972, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !972, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !972, file: !4, line: 3037, baseType: !1093, size: 64, align: 64, offset: 6720)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !972, file: !4, line: 3038, baseType: !913, size: 32, align: 32, offset: 6784)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !972, file: !4, line: 3050, baseType: !1051, size: 64, align: 64, offset: 6848)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !972, file: !4, line: 3065, baseType: !913, size: 32, align: 32, offset: 6912)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !972, file: !4, line: 3083, baseType: !913, size: 32, align: 32, offset: 6944)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !972, file: !4, line: 3092, baseType: !1033, size: 64, align: 32, offset: 6976)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !972, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !972, file: !4, line: 3106, baseType: !1033, size: 64, align: 32, offset: 7072)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !972, file: !4, line: 3113, baseType: !1522, size: 64, align: 64, offset: 7168)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1524)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1532, !1535}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1525, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1525, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1525, file: !4, line: 720, baseType: !981, size: 64, align: 64, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1525, file: !4, line: 724, baseType: !981, size: 64, align: 64, offset: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1525, file: !4, line: 728, baseType: !913, size: 32, align: 32, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1525, file: !4, line: 734, baseType: !1533, size: 64, align: 64, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1525, file: !4, line: 739, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !972, file: !4, line: 3129, baseType: !894, size: 64, align: 64, offset: 7232)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !972, file: !4, line: 3130, baseType: !894, size: 64, align: 64, offset: 7296)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !972, file: !4, line: 3131, baseType: !894, size: 64, align: 64, offset: 7360)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !972, file: !4, line: 3132, baseType: !894, size: 64, align: 64, offset: 7424)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !972, file: !4, line: 3139, baseType: !1131, size: 64, align: 64, offset: 7488)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !972, file: !4, line: 3147, baseType: !913, size: 32, align: 32, offset: 7552)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !972, file: !4, line: 3165, baseType: !913, size: 32, align: 32, offset: 7584)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !972, file: !4, line: 3172, baseType: !913, size: 32, align: 32, offset: 7616)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !972, file: !4, line: 3180, baseType: !913, size: 32, align: 32, offset: 7648)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !972, file: !4, line: 3191, baseType: !1350, size: 64, align: 64, offset: 7680)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !972, file: !4, line: 3199, baseType: !1093, size: 64, align: 64, offset: 7744)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !972, file: !4, line: 3207, baseType: !1131, size: 64, align: 64, offset: 7808)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !972, file: !4, line: 3214, baseType: !904, size: 32, align: 32, offset: 7872)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !972, file: !4, line: 3224, baseType: !1162, size: 64, align: 64, offset: 7936)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !972, file: !4, line: 3225, baseType: !913, size: 32, align: 32, offset: 8000)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !972, file: !4, line: 3249, baseType: !1144, size: 64, align: 64, offset: 8064)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !972, file: !4, line: 3256, baseType: !913, size: 32, align: 32, offset: 8128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !972, file: !4, line: 3271, baseType: !913, size: 32, align: 32, offset: 8160)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !972, file: !4, line: 3279, baseType: !894, size: 64, align: 64, offset: 8192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !972, file: !4, line: 3301, baseType: !1144, size: 64, align: 64, offset: 8256)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !972, file: !4, line: 3310, baseType: !913, size: 32, align: 32, offset: 8320)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !972, file: !4, line: 3337, baseType: !913, size: 32, align: 32, offset: 8352)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !972, file: !4, line: 3351, baseType: !913, size: 32, align: 32, offset: 8384)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !972, file: !4, line: 3359, baseType: !913, size: 32, align: 32, offset: 8416)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !909, file: !4, line: 5269, baseType: !1564, size: 64, align: 64, offset: 320)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{null, !921}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !909, file: !4, line: 5270, baseType: !1568, size: 64, align: 64, offset: 384)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!913, !970, !1458, !913}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !909, file: !4, line: 5271, baseType: !928, size: 64, align: 64, offset: 448)
!1572 = distinct !DIGlobalVariable(name: "valid_pu_types", scope: !1573, file: !907, line: 105, type: !1598, isLocal: true, isDefinition: true, variable: [17 x i8]* @unpack_parse_unit.valid_pu_types)
!1573 = distinct !DISubprogram(name: "unpack_parse_unit", scope: !907, file: !907, line: 100, type: !1574, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1597)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!913, !1576, !1583, !913}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiracParseUnit", file: !907, line: 98, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DiracParseUnit", file: !907, line: 94, size: 96, align: 32, elements: !1579)
!1579 = !{!1580, !1581, !1582}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "next_pu_offset", scope: !1578, file: !907, line: 95, baseType: !913, size: 32, align: 32)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "prev_pu_offset", scope: !1578, file: !907, line: 96, baseType: !913, size: 32, align: 32, offset: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pu_type", scope: !1578, file: !907, line: 97, baseType: !1054, size: 8, align: 8, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiracParseContext", file: !907, line: 54, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DiracParseContext", file: !907, line: 43, size: 448, align: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1585, file: !907, line: 44, baseType: !913, size: 32, align: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "is_synced", scope: !1585, file: !907, line: 45, baseType: !913, size: 32, align: 32, offset: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sync_offset", scope: !1585, file: !907, line: 46, baseType: !913, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "header_bytes_needed", scope: !1585, file: !907, line: 47, baseType: !913, size: 32, align: 32, offset: 96)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "overread_index", scope: !1585, file: !907, line: 48, baseType: !913, size: 32, align: 32, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1585, file: !907, line: 49, baseType: !913, size: 32, align: 32, offset: 160)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1585, file: !907, line: 50, baseType: !913, size: 32, align: 32, offset: 192)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1585, file: !907, line: 51, baseType: !1093, size: 64, align: 64, offset: 256)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "dirac_unit_size", scope: !1585, file: !907, line: 52, baseType: !913, size: 32, align: 32, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "dirac_unit", scope: !1585, file: !907, line: 53, baseType: !1093, size: 64, align: 64, offset: 384)
!1597 = !{}
!1598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 136, align: 8, elements: !1599)
!1599 = !{!1600}
!1600 = !DISubrange(count: 17)
!1601 = !{i32 2, !"Dwarf Version", i32 4}
!1602 = !{i32 2, !"Debug Info Version", i32 3}
!1603 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1604 = distinct !DISubprogram(name: "dirac_parse", scope: !907, file: !907, line: 238, type: !968, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1597)
!1605 = !DILocalVariable(name: "s", arg: 1, scope: !1604, file: !907, line: 238, type: !921)
!1606 = !DIExpression()
!1607 = !DILocation(line: 238, column: 46, scope: !1604)
!1608 = !DILocalVariable(name: "avctx", arg: 2, scope: !1604, file: !907, line: 238, type: !970)
!1609 = !DILocation(line: 238, column: 65, scope: !1604)
!1610 = !DILocalVariable(name: "poutbuf", arg: 3, scope: !1604, file: !907, line: 239, type: !1562)
!1611 = !DILocation(line: 239, column: 40, scope: !1604)
!1612 = !DILocalVariable(name: "poutbuf_size", arg: 4, scope: !1604, file: !907, line: 239, type: !1255)
!1613 = !DILocation(line: 239, column: 54, scope: !1604)
!1614 = !DILocalVariable(name: "buf", arg: 5, scope: !1604, file: !907, line: 240, type: !1458)
!1615 = !DILocation(line: 240, column: 39, scope: !1604)
!1616 = !DILocalVariable(name: "buf_size", arg: 6, scope: !1604, file: !907, line: 240, type: !913)
!1617 = !DILocation(line: 240, column: 48, scope: !1604)
!1618 = !DILocalVariable(name: "pc", scope: !1604, file: !907, line: 242, type: !1583)
!1619 = !DILocation(line: 242, column: 24, scope: !1604)
!1620 = !DILocation(line: 242, column: 29, scope: !1604)
!1621 = !DILocation(line: 242, column: 32, scope: !1604)
!1622 = !DILocalVariable(name: "next", scope: !1604, file: !907, line: 243, type: !913)
!1623 = !DILocation(line: 243, column: 9, scope: !1604)
!1624 = !DILocation(line: 245, column: 6, scope: !1604)
!1625 = !DILocation(line: 245, column: 14, scope: !1604)
!1626 = !DILocation(line: 246, column: 6, scope: !1604)
!1627 = !DILocation(line: 246, column: 19, scope: !1604)
!1628 = !DILocation(line: 248, column: 9, scope: !1629)
!1629 = distinct !DILexicalBlock(scope: !1604, file: !907, line: 248, column: 9)
!1630 = !DILocation(line: 248, column: 12, scope: !1629)
!1631 = !DILocation(line: 248, column: 18, scope: !1629)
!1632 = !DILocation(line: 248, column: 9, scope: !1604)
!1633 = !DILocation(line: 249, column: 16, scope: !1634)
!1634 = distinct !DILexicalBlock(scope: !1629, file: !907, line: 248, column: 28)
!1635 = !DILocation(line: 249, column: 14, scope: !1634)
!1636 = !DILocation(line: 250, column: 20, scope: !1634)
!1637 = !DILocation(line: 250, column: 10, scope: !1634)
!1638 = !DILocation(line: 250, column: 18, scope: !1634)
!1639 = !DILocation(line: 251, column: 25, scope: !1634)
!1640 = !DILocation(line: 251, column: 10, scope: !1634)
!1641 = !DILocation(line: 251, column: 23, scope: !1634)
!1642 = !DILocation(line: 253, column: 5, scope: !1634)
!1643 = !DILocation(line: 254, column: 31, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1629, file: !907, line: 253, column: 12)
!1645 = !DILocation(line: 254, column: 35, scope: !1644)
!1646 = !DILocation(line: 254, column: 40, scope: !1644)
!1647 = !DILocation(line: 254, column: 16, scope: !1644)
!1648 = !DILocation(line: 254, column: 14, scope: !1644)
!1649 = !DILocation(line: 255, column: 14, scope: !1650)
!1650 = distinct !DILexicalBlock(scope: !1644, file: !907, line: 255, column: 13)
!1651 = !DILocation(line: 255, column: 18, scope: !1650)
!1652 = !DILocation(line: 255, column: 28, scope: !1650)
!1653 = !DILocation(line: 255, column: 31, scope: !1654)
!1654 = !DILexicalBlockFile(scope: !1650, file: !907, discriminator: 1)
!1655 = !DILocation(line: 255, column: 36, scope: !1654)
