; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--pngenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--pngenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !910, line: 51, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919}
!912 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!913 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!914 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!915 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!916 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!917 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!918 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!919 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !910, line: 147, size: 32, align: 32, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!923 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!924 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !926, line: 49, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936}
!928 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!929 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!930 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!931 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!932 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!933 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!934 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!935 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!936 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 30, size: 32, align: 32, elements: !939)
!938 = !DIFile(filename: "libavcodec/apng.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!939 = !{!940, !941, !942}
!940 = !DIEnumerator(name: "APNG_DISPOSE_OP_NONE", value: 0)
!941 = !DIEnumerator(name: "APNG_DISPOSE_OP_BACKGROUND", value: 1)
!942 = !DIEnumerator(name: "APNG_DISPOSE_OP_PREVIOUS", value: 2)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !938, line: 36, size: 32, align: 32, elements: !944)
!944 = !{!945, !946}
!945 = !DIEnumerator(name: "APNG_BLEND_OP_SOURCE", value: 0)
!946 = !DIEnumerator(name: "APNG_BLEND_OP_OVER", value: 1)
!947 = !{!948, !949, !950, !953, !960, !958, !961, !966, !973, !974, !977, !979, !985, !1085}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!949 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!952 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !955, line: 220, size: 64, align: 8, elements: !956)
!955 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !954, file: !955, line: 220, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !959)
!959 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!960 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !955, line: 221, size: 32, align: 8, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !962, file: !955, line: 221, baseType: !965, size: 32, align: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !960)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStereo3D", file: !910, line: 191, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStereo3D", file: !910, line: 176, size: 96, align: 32, elements: !969)
!969 = !{!970, !971, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !910, line: 180, baseType: !909, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !910, line: 185, baseType: !949, size: 32, align: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !968, file: !910, line: 190, baseType: !920, size: 32, align: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !976)
!976 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !978)
!978 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !955, line: 222, size: 16, align: 8, elements: !981)
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !980, file: !955, line: 222, baseType: !983, size: 16, align: 16)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !984)
!984 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !988)
!988 = !{!989, !993, !995, !997, !998, !999, !1000, !1001, !1002, !1003, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1039, !1041, !1042, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1078, !1081, !1082, !1083, !1084}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !987, file: !744, line: 282, baseType: !990, size: 512, align: 64)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 512, align: 64, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 8)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !987, file: !744, line: 299, baseType: !994, size: 256, align: 32, offset: 512)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 32, elements: !991)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !987, file: !744, line: 315, baseType: !996, size: 64, align: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !987, file: !744, line: 326, baseType: !949, size: 32, align: 32, offset: 832)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !987, file: !744, line: 326, baseType: !949, size: 32, align: 32, offset: 864)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !987, file: !744, line: 334, baseType: !949, size: 32, align: 32, offset: 896)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !987, file: !744, line: 341, baseType: !949, size: 32, align: 32, offset: 928)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !987, file: !744, line: 346, baseType: !949, size: 32, align: 32, offset: 960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !987, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !987, file: !744, line: 356, baseType: !1004, size: 64, align: 32, offset: 1024)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1005, line: 61, baseType: !1006)
!1005 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1005, line: 58, size: 64, align: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1006, file: !1005, line: 59, baseType: !949, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1006, file: !1005, line: 60, baseType: !949, size: 32, align: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !987, file: !744, line: 361, baseType: !950, size: 64, align: 64, offset: 1088)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !987, file: !744, line: 369, baseType: !950, size: 64, align: 64, offset: 1152)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !987, file: !744, line: 377, baseType: !950, size: 64, align: 64, offset: 1216)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !987, file: !744, line: 382, baseType: !949, size: 32, align: 32, offset: 1280)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !987, file: !744, line: 386, baseType: !949, size: 32, align: 32, offset: 1312)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !987, file: !744, line: 391, baseType: !949, size: 32, align: 32, offset: 1344)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !987, file: !744, line: 396, baseType: !948, size: 64, align: 64, offset: 1408)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !987, file: !744, line: 403, baseType: !1018, size: 512, align: 64, offset: 1472)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 512, align: 64, elements: !991)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !987, file: !744, line: 410, baseType: !949, size: 32, align: 32, offset: 1984)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !987, file: !744, line: 415, baseType: !949, size: 32, align: 32, offset: 2016)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !987, file: !744, line: 420, baseType: !949, size: 32, align: 32, offset: 2048)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !987, file: !744, line: 425, baseType: !949, size: 32, align: 32, offset: 2080)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !987, file: !744, line: 435, baseType: !950, size: 64, align: 64, offset: 2112)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !987, file: !744, line: 440, baseType: !949, size: 32, align: 32, offset: 2176)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !987, file: !744, line: 445, baseType: !958, size: 64, align: 64, offset: 2240)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !987, file: !744, line: 459, baseType: !1027, size: 512, align: 64, offset: 2304)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 512, align: 64, elements: !991)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1030, line: 94, baseType: !1031)
!1030 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1030, line: 81, size: 192, align: 64, elements: !1032)
!1032 = !{!1033, !1037, !1038}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1031, file: !1030, line: 82, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1030, line: 73, baseType: !1036)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1030, line: 73, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1031, file: !1030, line: 89, baseType: !974, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1031, file: !1030, line: 93, baseType: !949, size: 32, align: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !987, file: !744, line: 473, baseType: !1040, size: 64, align: 64, offset: 2816)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !987, file: !744, line: 477, baseType: !949, size: 32, align: 32, offset: 2880)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !987, file: !744, line: 479, baseType: !1043, size: 64, align: 64, offset: 2944)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1056}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1046, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !744, line: 203, baseType: !974, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1046, file: !744, line: 204, baseType: !949, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1046, file: !744, line: 205, baseType: !1052, size: 64, align: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1054, line: 86, baseType: !1055)
!1054 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1054, line: 86, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1046, file: !744, line: 206, baseType: !1028, size: 64, align: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !987, file: !744, line: 480, baseType: !949, size: 32, align: 32, offset: 3008)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !744, line: 505, baseType: !949, size: 32, align: 32, offset: 3040)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !987, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !987, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !987, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !987, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !987, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !987, file: !744, line: 532, baseType: !950, size: 64, align: 64, offset: 3264)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !987, file: !744, line: 539, baseType: !950, size: 64, align: 64, offset: 3328)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !987, file: !744, line: 547, baseType: !950, size: 64, align: 64, offset: 3392)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !987, file: !744, line: 554, baseType: !1052, size: 64, align: 64, offset: 3456)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !987, file: !744, line: 563, baseType: !949, size: 32, align: 32, offset: 3520)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !987, file: !744, line: 572, baseType: !949, size: 32, align: 32, offset: 3552)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !987, file: !744, line: 581, baseType: !949, size: 32, align: 32, offset: 3584)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !987, file: !744, line: 588, baseType: !1072, size: 64, align: 64, offset: 3648)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !987, file: !744, line: 593, baseType: !949, size: 32, align: 32, offset: 3712)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !987, file: !744, line: 596, baseType: !949, size: 32, align: 32, offset: 3744)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !987, file: !744, line: 599, baseType: !1028, size: 64, align: 64, offset: 3776)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !987, file: !744, line: 605, baseType: !1028, size: 64, align: 64, offset: 3840)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !987, file: !744, line: 616, baseType: !1028, size: 64, align: 64, offset: 3904)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !987, file: !744, line: 626, baseType: !1079, size: 64, align: 64, offset: 3968)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1080, line: 216, baseType: !959)
!1080 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !987, file: !744, line: 627, baseType: !1079, size: 64, align: 64, offset: 4032)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !987, file: !744, line: 628, baseType: !1079, size: 64, align: 64, offset: 4096)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !987, file: !744, line: 629, baseType: !1079, size: 64, align: 64, offset: 4160)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !987, file: !744, line: 645, baseType: !1028, size: 64, align: 64, offset: 4224)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1086 = !{!1087, !1737, !1738, !1739, !1745, !1753}
!1087 = distinct !DIGlobalVariable(name: "ff_png_encoder", scope: !0, file: !1088, line: 1140, type: !1089, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_png_encoder)
!1088 = !DIFile(filename: "libavcodec/pngenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1091)
!1091 = !{!1092, !1096, !1097, !1098, !1099, !1100, !1103, !1106, !1109, !1112, !1115, !1116, !1189, !1197, !1198, !1199, !1201, !1652, !1658, !1666, !1670, !1671, !1708, !1712, !1716, !1717, !1721, !1725, !1726, !1730, !1731, !1732}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1090, file: !14, line: 3475, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1090, file: !14, line: 3480, baseType: !1093, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1090, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1090, file: !14, line: 3487, baseType: !949, size: 32, align: 32, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1090, file: !14, line: 3488, baseType: !1101, size: 64, align: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1090, file: !14, line: 3489, baseType: !1104, size: 64, align: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1090, file: !14, line: 3490, baseType: !1107, size: 64, align: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1090, file: !14, line: 3491, baseType: !1110, size: 64, align: 64, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1090, file: !14, line: 3492, baseType: !1113, size: 64, align: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1090, file: !14, line: 3493, baseType: !975, size: 8, align: 8, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1090, file: !14, line: 3494, baseType: !1117, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1121)
!1121 = !{!1122, !1123, !1127, !1148, !1149, !1150, !1151, !1155, !1161, !1163, !1167}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1120, file: !713, line: 72, baseType: !1093, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1120, file: !713, line: 78, baseType: !1124, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!1093, !948}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1120, file: !713, line: 85, baseType: !1128, size: 64, align: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1144, !1145, !1146, !1147}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1130, file: !691, line: 247, baseType: !1093, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1130, file: !691, line: 253, baseType: !1093, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1130, file: !691, line: 259, baseType: !949, size: 32, align: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1130, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1130, file: !691, line: 271, baseType: !1137, size: 64, align: 64, offset: 192)
!1137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1130, file: !691, line: 265, size: 64, align: 64, elements: !1138)
!1138 = !{!1139, !1140, !1142, !1143}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1137, file: !691, line: 266, baseType: !950, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1137, file: !691, line: 267, baseType: !1141, size: 64, align: 64)
!1141 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1137, file: !691, line: 268, baseType: !1093, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1137, file: !691, line: 270, baseType: !1004, size: 64, align: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1130, file: !691, line: 272, baseType: !1141, size: 64, align: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1130, file: !691, line: 273, baseType: !1141, size: 64, align: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1130, file: !691, line: 275, baseType: !949, size: 32, align: 32, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1130, file: !691, line: 300, baseType: !1093, size: 64, align: 64, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1120, file: !713, line: 93, baseType: !949, size: 32, align: 32, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1120, file: !713, line: 99, baseType: !949, size: 32, align: 32, offset: 224)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1120, file: !713, line: 108, baseType: !949, size: 32, align: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1120, file: !713, line: 113, baseType: !1152, size: 64, align: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!948, !948, !948}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1120, file: !713, line: 123, baseType: !1156, size: 64, align: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1159, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1120, file: !713, line: 130, baseType: !1162, size: 32, align: 32, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1120, file: !713, line: 136, baseType: !1164, size: 64, align: 64, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!1162, !948}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1120, file: !713, line: 142, baseType: !1168, size: 64, align: 64, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!949, !1171, !948, !1093, !949}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1174)
!1174 = !{!1175, !1187, !1188}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1173, file: !691, line: 360, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1179, file: !691, line: 307, baseType: !1093, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1179, file: !691, line: 313, baseType: !1141, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1179, file: !691, line: 313, baseType: !1141, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1179, file: !691, line: 318, baseType: !1141, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1179, file: !691, line: 318, baseType: !1141, size: 64, align: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1179, file: !691, line: 323, baseType: !949, size: 32, align: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1173, file: !691, line: 364, baseType: !949, size: 32, align: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1173, file: !691, line: 368, baseType: !949, size: 32, align: 32, offset: 96)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1090, file: !14, line: 3495, baseType: !1190, size: 64, align: 64, offset: 704)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1194)
!1194 = !{!1195, !1196}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1193, file: !14, line: 3402, baseType: !949, size: 32, align: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1193, file: !14, line: 3403, baseType: !1093, size: 64, align: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1090, file: !14, line: 3507, baseType: !1093, size: 64, align: 64, offset: 768)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1090, file: !14, line: 3516, baseType: !949, size: 32, align: 32, offset: 832)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !14, line: 3517, baseType: !1200, size: 64, align: 64, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1090, file: !14, line: 3527, baseType: !1202, size: 64, align: 64, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!949, !1205}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1215, !1216, !1217, !1218, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1401, !1405, !1406, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1590, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1207, file: !14, line: 1561, baseType: !1117, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1207, file: !14, line: 1562, baseType: !949, size: 32, align: 32, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1207, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1207, file: !14, line: 1565, baseType: !1213, size: 64, align: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1207, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1207, file: !14, line: 1581, baseType: !960, size: 32, align: 32, offset: 224)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1207, file: !14, line: 1583, baseType: !948, size: 64, align: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1207, file: !14, line: 1591, baseType: !1219, size: 64, align: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1221, line: 129, size: 1664, align: 64, elements: !1222)
!1221 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1248, !1249, !1278, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1220, file: !1221, line: 136, baseType: !949, size: 32, align: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1220, file: !1221, line: 151, baseType: !949, size: 32, align: 32, offset: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1220, file: !1221, line: 157, baseType: !949, size: 32, align: 32, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1220, file: !1221, line: 159, baseType: !985, size: 64, align: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1220, file: !1221, line: 161, baseType: !1228, size: 64, align: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1221, line: 117, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1221, line: 100, size: 832, align: 64, elements: !1231)
!1231 = !{!1232, !1239, !1240, !1241, !1242, !1243, !1245, !1246, !1247}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1230, file: !1221, line: 105, baseType: !1233, size: 256, align: 64)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1234, size: 256, align: 64, elements: !1237)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1030, line: 238, baseType: !1236)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1030, line: 238, flags: DIFlagFwdDecl)
!1237 = !{!1238}
!1238 = !DISubrange(count: 4)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1230, file: !1221, line: 110, baseType: !949, size: 32, align: 32, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1230, file: !1221, line: 111, baseType: !949, size: 32, align: 32, offset: 288)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1230, file: !1221, line: 111, baseType: !949, size: 32, align: 32, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1230, file: !1221, line: 112, baseType: !994, size: 256, align: 32, offset: 352)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1230, file: !1221, line: 113, baseType: !1244, size: 128, align: 32, offset: 608)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, align: 32, elements: !1237)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1230, file: !1221, line: 114, baseType: !949, size: 32, align: 32, offset: 736)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1230, file: !1221, line: 115, baseType: !949, size: 32, align: 32, offset: 768)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1230, file: !1221, line: 116, baseType: !949, size: 32, align: 32, offset: 800)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1220, file: !1221, line: 163, baseType: !948, size: 64, align: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1220, file: !1221, line: 165, baseType: !1250, size: 128, align: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1221, line: 122, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1221, line: 119, size: 128, align: 64, elements: !1252)
!1252 = !{!1253, !1277}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1251, file: !1221, line: 120, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1273, !1274, !1275, !1276}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1256, file: !14, line: 1451, baseType: !1028, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1256, file: !14, line: 1461, baseType: !950, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1256, file: !14, line: 1467, baseType: !950, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1256, file: !14, line: 1468, baseType: !974, size: 64, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1256, file: !14, line: 1469, baseType: !949, size: 32, align: 32, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1256, file: !14, line: 1470, baseType: !949, size: 32, align: 32, offset: 288)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !14, line: 1474, baseType: !949, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1256, file: !14, line: 1479, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !14, line: 1412, baseType: !974, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !14, line: 1413, baseType: !949, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1256, file: !14, line: 1480, baseType: !949, size: 32, align: 32, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1256, file: !14, line: 1486, baseType: !950, size: 64, align: 64, offset: 512)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1256, file: !14, line: 1488, baseType: !950, size: 64, align: 64, offset: 576)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1256, file: !14, line: 1497, baseType: !950, size: 64, align: 64, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1251, file: !1221, line: 121, baseType: !985, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1220, file: !1221, line: 166, baseType: !1279, size: 128, align: 64, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1221, line: 127, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1221, line: 124, size: 128, align: 64, elements: !1281)
!1281 = !{!1282, !1355}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1280, file: !1221, line: 125, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1287)
!1287 = !{!1288, !1289, !1313, !1317, !1318, !1352, !1353, !1354}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1286, file: !14, line: 5751, baseType: !1117, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1286, file: !14, line: 5756, baseType: !1290, size: 64, align: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1293)
!1293 = !{!1294, !1295, !1298, !1299, !1300, !1304, !1308, !1312}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1292, file: !14, line: 5797, baseType: !1093, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1292, file: !14, line: 5804, baseType: !1296, size: 64, align: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1292, file: !14, line: 5815, baseType: !1117, size: 64, align: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1292, file: !14, line: 5825, baseType: !949, size: 32, align: 32, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1292, file: !14, line: 5826, baseType: !1301, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!949, !1284}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1292, file: !14, line: 5827, baseType: !1305, size: 64, align: 64, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!949, !1284, !1254}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1292, file: !14, line: 5828, baseType: !1309, size: 64, align: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{null, !1284}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1292, file: !14, line: 5829, baseType: !1309, size: 64, align: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1286, file: !14, line: 5762, baseType: !1314, size: 64, align: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1316)
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1286, file: !14, line: 5768, baseType: !948, size: 64, align: 64, offset: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1286, file: !14, line: 5775, baseType: !1319, size: 64, align: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1321, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1321, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1321, file: !14, line: 3948, baseType: !965, size: 32, align: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1321, file: !14, line: 3958, baseType: !974, size: 64, align: 64, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1321, file: !14, line: 3962, baseType: !949, size: 32, align: 32, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1321, file: !14, line: 3968, baseType: !949, size: 32, align: 32, offset: 224)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1321, file: !14, line: 3973, baseType: !950, size: 64, align: 64, offset: 256)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1321, file: !14, line: 3986, baseType: !949, size: 32, align: 32, offset: 320)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1321, file: !14, line: 3999, baseType: !949, size: 32, align: 32, offset: 352)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1321, file: !14, line: 4004, baseType: !949, size: 32, align: 32, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1321, file: !14, line: 4005, baseType: !949, size: 32, align: 32, offset: 416)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1321, file: !14, line: 4010, baseType: !949, size: 32, align: 32, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1321, file: !14, line: 4011, baseType: !949, size: 32, align: 32, offset: 480)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1321, file: !14, line: 4020, baseType: !1004, size: 64, align: 32, offset: 512)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1321, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1321, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1321, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1321, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1321, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1321, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1321, file: !14, line: 4039, baseType: !949, size: 32, align: 32, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1321, file: !14, line: 4046, baseType: !958, size: 64, align: 64, offset: 832)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1321, file: !14, line: 4050, baseType: !949, size: 32, align: 32, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1321, file: !14, line: 4054, baseType: !949, size: 32, align: 32, offset: 928)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1321, file: !14, line: 4061, baseType: !949, size: 32, align: 32, offset: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1321, file: !14, line: 4065, baseType: !949, size: 32, align: 32, offset: 992)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1321, file: !14, line: 4073, baseType: !949, size: 32, align: 32, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1321, file: !14, line: 4080, baseType: !949, size: 32, align: 32, offset: 1056)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1321, file: !14, line: 4084, baseType: !949, size: 32, align: 32, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1286, file: !14, line: 5781, baseType: !1319, size: 64, align: 64, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1286, file: !14, line: 5787, baseType: !1004, size: 64, align: 32, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1286, file: !14, line: 5793, baseType: !1004, size: 64, align: 32, offset: 448)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1280, file: !1221, line: 126, baseType: !949, size: 32, align: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1220, file: !1221, line: 172, baseType: !1254, size: 64, align: 64, offset: 576)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1220, file: !1221, line: 177, baseType: !974, size: 64, align: 64, offset: 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1220, file: !1221, line: 178, baseType: !960, size: 32, align: 32, offset: 704)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1220, file: !1221, line: 180, baseType: !948, size: 64, align: 64, offset: 768)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1220, file: !1221, line: 185, baseType: !949, size: 32, align: 32, offset: 832)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1220, file: !1221, line: 190, baseType: !948, size: 64, align: 64, offset: 896)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1220, file: !1221, line: 195, baseType: !949, size: 32, align: 32, offset: 960)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1220, file: !1221, line: 200, baseType: !1254, size: 64, align: 64, offset: 1024)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1220, file: !1221, line: 201, baseType: !949, size: 32, align: 32, offset: 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1220, file: !1221, line: 202, baseType: !985, size: 64, align: 64, offset: 1152)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1220, file: !1221, line: 203, baseType: !949, size: 32, align: 32, offset: 1216)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1220, file: !1221, line: 205, baseType: !949, size: 32, align: 32, offset: 1248)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1220, file: !1221, line: 206, baseType: !949, size: 32, align: 32, offset: 1280)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1220, file: !1221, line: 209, baseType: !1079, size: 64, align: 64, offset: 1344)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1220, file: !1221, line: 212, baseType: !1079, size: 64, align: 64, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1220, file: !1221, line: 213, baseType: !985, size: 64, align: 64, offset: 1472)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1220, file: !1221, line: 215, baseType: !949, size: 32, align: 32, offset: 1536)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1220, file: !1221, line: 217, baseType: !949, size: 32, align: 32, offset: 1568)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1220, file: !1221, line: 220, baseType: !949, size: 32, align: 32, offset: 1600)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1207, file: !14, line: 1598, baseType: !948, size: 64, align: 64, offset: 384)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1207, file: !14, line: 1606, baseType: !950, size: 64, align: 64, offset: 448)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1207, file: !14, line: 1614, baseType: !949, size: 32, align: 32, offset: 512)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1207, file: !14, line: 1622, baseType: !949, size: 32, align: 32, offset: 544)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1207, file: !14, line: 1628, baseType: !949, size: 32, align: 32, offset: 576)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1207, file: !14, line: 1636, baseType: !949, size: 32, align: 32, offset: 608)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1207, file: !14, line: 1643, baseType: !949, size: 32, align: 32, offset: 640)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1207, file: !14, line: 1657, baseType: !974, size: 64, align: 64, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1207, file: !14, line: 1658, baseType: !949, size: 32, align: 32, offset: 768)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1207, file: !14, line: 1679, baseType: !1004, size: 64, align: 32, offset: 800)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1207, file: !14, line: 1688, baseType: !949, size: 32, align: 32, offset: 864)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1207, file: !14, line: 1712, baseType: !949, size: 32, align: 32, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1207, file: !14, line: 1729, baseType: !949, size: 32, align: 32, offset: 928)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1207, file: !14, line: 1729, baseType: !949, size: 32, align: 32, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1207, file: !14, line: 1744, baseType: !949, size: 32, align: 32, offset: 992)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1207, file: !14, line: 1744, baseType: !949, size: 32, align: 32, offset: 1024)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1207, file: !14, line: 1751, baseType: !949, size: 32, align: 32, offset: 1056)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1207, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1207, file: !14, line: 1791, baseType: !1394, size: 64, align: 64, offset: 1152)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !1397, !1398, !1400, !949, !949, !949}
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1207, file: !14, line: 1808, baseType: !1402, size: 64, align: 64, offset: 1216)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!473, !1397, !1104}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1207, file: !14, line: 1816, baseType: !949, size: 32, align: 32, offset: 1280)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1207, file: !14, line: 1825, baseType: !1407, size: 32, align: 32, offset: 1312)
!1407 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1207, file: !14, line: 1830, baseType: !949, size: 32, align: 32, offset: 1344)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1207, file: !14, line: 1838, baseType: !1407, size: 32, align: 32, offset: 1376)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1207, file: !14, line: 1846, baseType: !949, size: 32, align: 32, offset: 1408)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1207, file: !14, line: 1851, baseType: !949, size: 32, align: 32, offset: 1440)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1207, file: !14, line: 1861, baseType: !1407, size: 32, align: 32, offset: 1472)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1207, file: !14, line: 1868, baseType: !1407, size: 32, align: 32, offset: 1504)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1207, file: !14, line: 1875, baseType: !1407, size: 32, align: 32, offset: 1536)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1207, file: !14, line: 1882, baseType: !1407, size: 32, align: 32, offset: 1568)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1207, file: !14, line: 1889, baseType: !1407, size: 32, align: 32, offset: 1600)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1207, file: !14, line: 1896, baseType: !1407, size: 32, align: 32, offset: 1632)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1207, file: !14, line: 1903, baseType: !1407, size: 32, align: 32, offset: 1664)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1207, file: !14, line: 1910, baseType: !949, size: 32, align: 32, offset: 1696)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1207, file: !14, line: 1915, baseType: !949, size: 32, align: 32, offset: 1728)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1207, file: !14, line: 1926, baseType: !1400, size: 64, align: 64, offset: 1792)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1207, file: !14, line: 1935, baseType: !1004, size: 64, align: 32, offset: 1856)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1207, file: !14, line: 1942, baseType: !949, size: 32, align: 32, offset: 1920)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1207, file: !14, line: 1948, baseType: !949, size: 32, align: 32, offset: 1952)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1207, file: !14, line: 1954, baseType: !949, size: 32, align: 32, offset: 1984)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1207, file: !14, line: 1960, baseType: !949, size: 32, align: 32, offset: 2016)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1207, file: !14, line: 1984, baseType: !949, size: 32, align: 32, offset: 2048)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1207, file: !14, line: 1991, baseType: !949, size: 32, align: 32, offset: 2080)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1207, file: !14, line: 1996, baseType: !949, size: 32, align: 32, offset: 2112)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1207, file: !14, line: 2004, baseType: !949, size: 32, align: 32, offset: 2144)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1207, file: !14, line: 2011, baseType: !949, size: 32, align: 32, offset: 2176)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1207, file: !14, line: 2018, baseType: !949, size: 32, align: 32, offset: 2208)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1207, file: !14, line: 2027, baseType: !949, size: 32, align: 32, offset: 2240)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1207, file: !14, line: 2034, baseType: !949, size: 32, align: 32, offset: 2272)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1207, file: !14, line: 2044, baseType: !949, size: 32, align: 32, offset: 2304)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1207, file: !14, line: 2054, baseType: !1085, size: 64, align: 64, offset: 2368)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1207, file: !14, line: 2061, baseType: !1085, size: 64, align: 64, offset: 2432)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1207, file: !14, line: 2066, baseType: !949, size: 32, align: 32, offset: 2496)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1207, file: !14, line: 2070, baseType: !949, size: 32, align: 32, offset: 2528)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1207, file: !14, line: 2078, baseType: !949, size: 32, align: 32, offset: 2560)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1207, file: !14, line: 2085, baseType: !949, size: 32, align: 32, offset: 2592)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1207, file: !14, line: 2092, baseType: !949, size: 32, align: 32, offset: 2624)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1207, file: !14, line: 2099, baseType: !949, size: 32, align: 32, offset: 2656)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1207, file: !14, line: 2106, baseType: !949, size: 32, align: 32, offset: 2688)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1207, file: !14, line: 2113, baseType: !949, size: 32, align: 32, offset: 2720)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1207, file: !14, line: 2120, baseType: !949, size: 32, align: 32, offset: 2752)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1207, file: !14, line: 2125, baseType: !949, size: 32, align: 32, offset: 2784)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1207, file: !14, line: 2133, baseType: !949, size: 32, align: 32, offset: 2816)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1207, file: !14, line: 2140, baseType: !949, size: 32, align: 32, offset: 2848)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1207, file: !14, line: 2145, baseType: !949, size: 32, align: 32, offset: 2880)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1207, file: !14, line: 2153, baseType: !949, size: 32, align: 32, offset: 2912)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1207, file: !14, line: 2158, baseType: !949, size: 32, align: 32, offset: 2944)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1207, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1207, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1207, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1207, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1207, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1207, file: !14, line: 2203, baseType: !949, size: 32, align: 32, offset: 3136)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1207, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1207, file: !14, line: 2212, baseType: !949, size: 32, align: 32, offset: 3200)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1207, file: !14, line: 2213, baseType: !949, size: 32, align: 32, offset: 3232)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1207, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1207, file: !14, line: 2232, baseType: !949, size: 32, align: 32, offset: 3296)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1207, file: !14, line: 2243, baseType: !949, size: 32, align: 32, offset: 3328)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1207, file: !14, line: 2249, baseType: !949, size: 32, align: 32, offset: 3360)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1207, file: !14, line: 2256, baseType: !949, size: 32, align: 32, offset: 3392)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1207, file: !14, line: 2263, baseType: !958, size: 64, align: 64, offset: 3456)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1207, file: !14, line: 2270, baseType: !958, size: 64, align: 64, offset: 3520)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1207, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1207, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1207, file: !14, line: 2367, baseType: !1472, size: 64, align: 64, offset: 3648)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!949, !1397, !985, !949}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1207, file: !14, line: 2383, baseType: !949, size: 32, align: 32, offset: 3712)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1207, file: !14, line: 2386, baseType: !1407, size: 32, align: 32, offset: 3744)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1207, file: !14, line: 2387, baseType: !1407, size: 32, align: 32, offset: 3776)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1207, file: !14, line: 2394, baseType: !949, size: 32, align: 32, offset: 3808)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1207, file: !14, line: 2401, baseType: !949, size: 32, align: 32, offset: 3840)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1207, file: !14, line: 2408, baseType: !949, size: 32, align: 32, offset: 3872)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1207, file: !14, line: 2415, baseType: !949, size: 32, align: 32, offset: 3904)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1207, file: !14, line: 2422, baseType: !949, size: 32, align: 32, offset: 3936)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1207, file: !14, line: 2423, baseType: !1484, size: 64, align: 64, offset: 3968)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1486, file: !14, line: 827, baseType: !949, size: 32, align: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1486, file: !14, line: 828, baseType: !949, size: 32, align: 32, offset: 32)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1486, file: !14, line: 829, baseType: !949, size: 32, align: 32, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1486, file: !14, line: 830, baseType: !1407, size: 32, align: 32, offset: 96)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1207, file: !14, line: 2430, baseType: !950, size: 64, align: 64, offset: 4032)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1207, file: !14, line: 2437, baseType: !950, size: 64, align: 64, offset: 4096)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1207, file: !14, line: 2444, baseType: !1407, size: 32, align: 32, offset: 4160)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1207, file: !14, line: 2451, baseType: !1407, size: 32, align: 32, offset: 4192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1207, file: !14, line: 2458, baseType: !949, size: 32, align: 32, offset: 4224)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1207, file: !14, line: 2469, baseType: !949, size: 32, align: 32, offset: 4256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1207, file: !14, line: 2475, baseType: !949, size: 32, align: 32, offset: 4288)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1207, file: !14, line: 2481, baseType: !949, size: 32, align: 32, offset: 4320)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1207, file: !14, line: 2485, baseType: !949, size: 32, align: 32, offset: 4352)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1207, file: !14, line: 2489, baseType: !949, size: 32, align: 32, offset: 4384)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1207, file: !14, line: 2493, baseType: !949, size: 32, align: 32, offset: 4416)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1207, file: !14, line: 2501, baseType: !949, size: 32, align: 32, offset: 4448)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1207, file: !14, line: 2506, baseType: !949, size: 32, align: 32, offset: 4480)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1207, file: !14, line: 2510, baseType: !949, size: 32, align: 32, offset: 4512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1207, file: !14, line: 2514, baseType: !950, size: 64, align: 64, offset: 4544)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1207, file: !14, line: 2528, baseType: !1508, size: 64, align: 64, offset: 4608)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1397, !948, !949, !949}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1207, file: !14, line: 2534, baseType: !949, size: 32, align: 32, offset: 4672)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1207, file: !14, line: 2545, baseType: !949, size: 32, align: 32, offset: 4704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1207, file: !14, line: 2547, baseType: !949, size: 32, align: 32, offset: 4736)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1207, file: !14, line: 2549, baseType: !949, size: 32, align: 32, offset: 4768)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1207, file: !14, line: 2551, baseType: !949, size: 32, align: 32, offset: 4800)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1207, file: !14, line: 2553, baseType: !949, size: 32, align: 32, offset: 4832)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1207, file: !14, line: 2555, baseType: !949, size: 32, align: 32, offset: 4864)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1207, file: !14, line: 2557, baseType: !949, size: 32, align: 32, offset: 4896)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1207, file: !14, line: 2559, baseType: !949, size: 32, align: 32, offset: 4928)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1207, file: !14, line: 2563, baseType: !949, size: 32, align: 32, offset: 4960)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1207, file: !14, line: 2571, baseType: !1522, size: 64, align: 64, offset: 4992)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1207, file: !14, line: 2579, baseType: !1522, size: 64, align: 64, offset: 5056)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1207, file: !14, line: 2586, baseType: !949, size: 32, align: 32, offset: 5120)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1207, file: !14, line: 2615, baseType: !949, size: 32, align: 32, offset: 5152)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1207, file: !14, line: 2627, baseType: !949, size: 32, align: 32, offset: 5184)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1207, file: !14, line: 2637, baseType: !949, size: 32, align: 32, offset: 5216)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1207, file: !14, line: 2681, baseType: !949, size: 32, align: 32, offset: 5248)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1207, file: !14, line: 2709, baseType: !950, size: 64, align: 64, offset: 5312)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1207, file: !14, line: 2716, baseType: !1531, size: 64, align: 64, offset: 5376)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1533)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1534)
!1534 = !{!1535, !1536, !1537, !1538, !1539, !1540, !1544, !1550, !1554, !1555, !1556, !1557, !1563, !1564, !1565, !1566, !1567}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1533, file: !14, line: 3642, baseType: !1093, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1533, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1533, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1533, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1533, file: !14, line: 3669, baseType: !949, size: 32, align: 32, offset: 160)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1533, file: !14, line: 3682, baseType: !1541, size: 64, align: 64, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!949, !1205, !985}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1533, file: !14, line: 3698, baseType: !1545, size: 64, align: 64, offset: 256)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!949, !1205, !1548, !965}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1533, file: !14, line: 3712, baseType: !1551, size: 64, align: 64, offset: 320)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!949, !1205, !949, !1548, !965}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1533, file: !14, line: 3726, baseType: !1545, size: 64, align: 64, offset: 384)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1533, file: !14, line: 3737, baseType: !1202, size: 64, align: 64, offset: 448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1533, file: !14, line: 3746, baseType: !949, size: 32, align: 32, offset: 512)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1533, file: !14, line: 3757, baseType: !1558, size: 64, align: 64, offset: 576)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !1561}
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1533, file: !14, line: 3766, baseType: !1202, size: 64, align: 64, offset: 640)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1533, file: !14, line: 3774, baseType: !1202, size: 64, align: 64, offset: 704)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1533, file: !14, line: 3780, baseType: !949, size: 32, align: 32, offset: 768)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1533, file: !14, line: 3785, baseType: !949, size: 32, align: 32, offset: 800)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1533, file: !14, line: 3795, baseType: !1568, size: 64, align: 64, offset: 832)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!949, !1205, !1028}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1207, file: !14, line: 2728, baseType: !948, size: 64, align: 64, offset: 5440)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1207, file: !14, line: 2735, baseType: !1018, size: 512, align: 64, offset: 5504)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1207, file: !14, line: 2742, baseType: !949, size: 32, align: 32, offset: 6016)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1207, file: !14, line: 2755, baseType: !949, size: 32, align: 32, offset: 6048)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1207, file: !14, line: 2776, baseType: !949, size: 32, align: 32, offset: 6080)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1207, file: !14, line: 2783, baseType: !949, size: 32, align: 32, offset: 6112)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1207, file: !14, line: 2791, baseType: !949, size: 32, align: 32, offset: 6144)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1207, file: !14, line: 2802, baseType: !985, size: 64, align: 64, offset: 6208)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1207, file: !14, line: 2811, baseType: !949, size: 32, align: 32, offset: 6272)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1207, file: !14, line: 2821, baseType: !949, size: 32, align: 32, offset: 6304)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1207, file: !14, line: 2830, baseType: !949, size: 32, align: 32, offset: 6336)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1207, file: !14, line: 2840, baseType: !949, size: 32, align: 32, offset: 6368)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1207, file: !14, line: 2851, baseType: !1584, size: 64, align: 64, offset: 6400)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{!949, !1397, !1587, !948, !1400, !949, !949}
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!949, !1397, !948}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1207, file: !14, line: 2871, baseType: !1591, size: 64, align: 64, offset: 6464)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{!949, !1397, !1594, !948, !1400, !949}
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!949, !1397, !948, !949, !949}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1207, file: !14, line: 2878, baseType: !949, size: 32, align: 32, offset: 6528)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1207, file: !14, line: 2885, baseType: !949, size: 32, align: 32, offset: 6560)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1207, file: !14, line: 3005, baseType: !949, size: 32, align: 32, offset: 6592)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1207, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1207, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1207, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1207, file: !14, line: 3037, baseType: !974, size: 64, align: 64, offset: 6720)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1207, file: !14, line: 3038, baseType: !949, size: 32, align: 32, offset: 6784)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1207, file: !14, line: 3050, baseType: !958, size: 64, align: 64, offset: 6848)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1207, file: !14, line: 3065, baseType: !949, size: 32, align: 32, offset: 6912)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1207, file: !14, line: 3083, baseType: !949, size: 32, align: 32, offset: 6944)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1207, file: !14, line: 3092, baseType: !1004, size: 64, align: 32, offset: 6976)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1207, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1207, file: !14, line: 3106, baseType: !1004, size: 64, align: 32, offset: 7072)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1207, file: !14, line: 3113, baseType: !1612, size: 64, align: 64, offset: 7168)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1614)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621, !1622, !1625}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1615, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1615, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1615, file: !14, line: 720, baseType: !1093, size: 64, align: 64, offset: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1615, file: !14, line: 724, baseType: !1093, size: 64, align: 64, offset: 128)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1615, file: !14, line: 728, baseType: !949, size: 32, align: 32, offset: 192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1615, file: !14, line: 734, baseType: !1623, size: 64, align: 64, offset: 256)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1615, file: !14, line: 739, baseType: !1626, size: 64, align: 64, offset: 320)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1193)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1207, file: !14, line: 3129, baseType: !950, size: 64, align: 64, offset: 7232)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1207, file: !14, line: 3130, baseType: !950, size: 64, align: 64, offset: 7296)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1207, file: !14, line: 3131, baseType: !950, size: 64, align: 64, offset: 7360)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1207, file: !14, line: 3132, baseType: !950, size: 64, align: 64, offset: 7424)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1207, file: !14, line: 3139, baseType: !1522, size: 64, align: 64, offset: 7488)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1207, file: !14, line: 3147, baseType: !949, size: 32, align: 32, offset: 7552)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1207, file: !14, line: 3165, baseType: !949, size: 32, align: 32, offset: 7584)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1207, file: !14, line: 3172, baseType: !949, size: 32, align: 32, offset: 7616)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1207, file: !14, line: 3180, baseType: !949, size: 32, align: 32, offset: 7648)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1207, file: !14, line: 3191, baseType: !1085, size: 64, align: 64, offset: 7680)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1207, file: !14, line: 3199, baseType: !974, size: 64, align: 64, offset: 7744)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1207, file: !14, line: 3207, baseType: !1522, size: 64, align: 64, offset: 7808)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1207, file: !14, line: 3214, baseType: !960, size: 32, align: 32, offset: 7872)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1207, file: !14, line: 3224, baseType: !1266, size: 64, align: 64, offset: 7936)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1207, file: !14, line: 3225, baseType: !949, size: 32, align: 32, offset: 8000)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1207, file: !14, line: 3249, baseType: !1028, size: 64, align: 64, offset: 8064)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1207, file: !14, line: 3256, baseType: !949, size: 32, align: 32, offset: 8128)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1207, file: !14, line: 3271, baseType: !949, size: 32, align: 32, offset: 8160)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1207, file: !14, line: 3279, baseType: !950, size: 64, align: 64, offset: 8192)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1207, file: !14, line: 3301, baseType: !1028, size: 64, align: 64, offset: 8256)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1207, file: !14, line: 3310, baseType: !949, size: 32, align: 32, offset: 8320)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1207, file: !14, line: 3337, baseType: !949, size: 32, align: 32, offset: 8352)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1207, file: !14, line: 3351, baseType: !949, size: 32, align: 32, offset: 8384)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1207, file: !14, line: 3359, baseType: !949, size: 32, align: 32, offset: 8416)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1090, file: !14, line: 3535, baseType: !1653, size: 64, align: 64, offset: 1024)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!949, !1205, !1656}
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1206)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1090, file: !14, line: 3541, baseType: !1659, size: 64, align: 64, offset: 1088)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1661)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1221, line: 223, size: 128, align: 64, elements: !1663)
!1663 = !{!1664, !1665}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1662, file: !1221, line: 224, baseType: !1548, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1662, file: !1221, line: 225, baseType: !1548, size: 64, align: 64, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1090, file: !14, line: 3549, baseType: !1667, size: 64, align: 64, offset: 1152)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{null, !1200}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1090, file: !14, line: 3551, baseType: !1202, size: 64, align: 64, offset: 1216)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1090, file: !14, line: 3552, baseType: !1672, size: 64, align: 64, offset: 1280)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!949, !1205, !974, !949, !1675}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1677)
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1678)
!1678 = !{!1679, !1680, !1681, !1682, !1683, !1707}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1677, file: !14, line: 3921, baseType: !983, size: 16, align: 16)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1677, file: !14, line: 3922, baseType: !965, size: 32, align: 32, offset: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1677, file: !14, line: 3923, baseType: !965, size: 32, align: 32, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1677, file: !14, line: 3924, baseType: !960, size: 32, align: 32, offset: 96)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1677, file: !14, line: 3925, baseType: !1684, size: 64, align: 64, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1687)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1688)
!1688 = !{!1689, !1690, !1691, !1692, !1693, !1694, !1700, !1702, !1703, !1704, !1705, !1706}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1687, file: !14, line: 3886, baseType: !949, size: 32, align: 32)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1687, file: !14, line: 3887, baseType: !949, size: 32, align: 32, offset: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1687, file: !14, line: 3888, baseType: !949, size: 32, align: 32, offset: 64)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1687, file: !14, line: 3889, baseType: !949, size: 32, align: 32, offset: 96)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1687, file: !14, line: 3890, baseType: !949, size: 32, align: 32, offset: 128)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1687, file: !14, line: 3897, baseType: !1695, size: 768, align: 64, offset: 192)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1696)
!1696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1697)
!1697 = !{!1698, !1699}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1696, file: !14, line: 3855, baseType: !990, size: 512, align: 64)
