; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--prores_metadata_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--prores_metadata_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!588 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!589 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!590 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!591 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !525, line: 538, size: 32, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!595 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!596 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!597 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!598 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!599 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!600 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!601 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!604 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!605 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!606 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!607 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!608 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!609 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!610 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!611 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!612 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!613 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!614 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!615 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!616 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!617 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!618 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!619 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!620 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!621 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!622 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!623 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!624 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!625 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!626 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!627 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!628 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!629 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!630 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!631 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!632 = !{!633, !634, !635, !643}
!633 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!634 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !638, line: 221, size: 32, align: 8, elements: !639)
!638 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !637, file: !638, line: 221, baseType: !641, size: 32, align: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !642, line: 51, baseType: !634)
!642 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !638, line: 222, size: 16, align: 8, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !645, file: !638, line: 222, baseType: !648, size: 16, align: 16)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !642, line: 49, baseType: !649)
!649 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!650 = !{!651, !849, !853, !854}
!651 = distinct !DIGlobalVariable(name: "ff_prores_metadata_bsf", scope: !0, file: !652, line: 165, type: !653, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_prores_metadata_bsf)
!652 = !DIFile(filename: "libavcodec/prores_metadata_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !656)
!656 = !{!657, !661, !664, !746, !747, !806, !844, !848}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !655, file: !4, line: 5797, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !655, file: !4, line: 5804, baseType: !662, size: 64, align: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !655, file: !4, line: 5815, baseType: !665, size: 64, align: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !669)
!669 = !{!670, !671, !676, !705, !706, !707, !708, !712, !718, !720, !724}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !668, file: !486, line: 72, baseType: !658, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !668, file: !486, line: 78, baseType: !672, size: 64, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!658, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !668, file: !486, line: 85, baseType: !677, size: 64, align: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !701, !702, !703, !704}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !464, line: 247, baseType: !658, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !679, file: !464, line: 253, baseType: !658, size: 64, align: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !679, file: !464, line: 259, baseType: !633, size: 32, align: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !679, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !679, file: !464, line: 271, baseType: !686, size: 64, align: 64, offset: 192)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !679, file: !464, line: 265, size: 64, align: 64, elements: !687)
!687 = !{!688, !691, !693, !694}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !686, file: !464, line: 266, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !642, line: 40, baseType: !690)
!690 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !686, file: !464, line: 267, baseType: !692, size: 64, align: 64)
!692 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !686, file: !464, line: 268, baseType: !658, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !686, file: !464, line: 270, baseType: !695, size: 64, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !696, line: 61, baseType: !697)
!696 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !696, line: 58, size: 64, align: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !697, file: !696, line: 59, baseType: !633, size: 32, align: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !697, file: !696, line: 60, baseType: !633, size: 32, align: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !679, file: !464, line: 272, baseType: !692, size: 64, align: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !679, file: !464, line: 273, baseType: !692, size: 64, align: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !679, file: !464, line: 275, baseType: !633, size: 32, align: 32, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !679, file: !464, line: 300, baseType: !658, size: 64, align: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !668, file: !486, line: 93, baseType: !633, size: 32, align: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !668, file: !486, line: 99, baseType: !633, size: 32, align: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !668, file: !486, line: 108, baseType: !633, size: 32, align: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !668, file: !486, line: 113, baseType: !709, size: 64, align: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!675, !675, !675}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !668, file: !486, line: 123, baseType: !713, size: 64, align: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !668, file: !486, line: 130, baseType: !719, size: 32, align: 32, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !668, file: !486, line: 136, baseType: !721, size: 64, align: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!719, !675}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !668, file: !486, line: 142, baseType: !725, size: 64, align: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!633, !728, !675, !658, !633}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !731)
!731 = !{!732, !744, !745}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !730, file: !464, line: 360, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !736, file: !464, line: 307, baseType: !658, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !736, file: !464, line: 313, baseType: !692, size: 64, align: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !736, file: !464, line: 313, baseType: !692, size: 64, align: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !736, file: !464, line: 318, baseType: !692, size: 64, align: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !736, file: !464, line: 318, baseType: !692, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !736, file: !464, line: 323, baseType: !633, size: 32, align: 32, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !730, file: !464, line: 364, baseType: !633, size: 32, align: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !730, file: !464, line: 368, baseType: !633, size: 32, align: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !655, file: !4, line: 5825, baseType: !633, size: 32, align: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !655, file: !4, line: 5826, baseType: !748, size: 64, align: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!633, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !754)
!754 = !{!755, !756, !759, !763, !764, !803, !804, !805}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !753, file: !4, line: 5751, baseType: !665, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !753, file: !4, line: 5756, baseType: !757, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !753, file: !4, line: 5762, baseType: !760, size: 64, align: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !753, file: !4, line: 5768, baseType: !675, size: 64, align: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !753, file: !4, line: 5775, baseType: !765, size: 64, align: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !768)
!768 = !{!769, !770, !771, !772, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !796, !797, !798, !799, !800, !801, !802}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !767, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !767, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !767, file: !4, line: 3948, baseType: !641, size: 32, align: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !767, file: !4, line: 3958, baseType: !773, size: 64, align: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !642, line: 48, baseType: !775)
!775 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !767, file: !4, line: 3962, baseType: !633, size: 32, align: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !767, file: !4, line: 3968, baseType: !633, size: 32, align: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !767, file: !4, line: 3973, baseType: !689, size: 64, align: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !767, file: !4, line: 3986, baseType: !633, size: 32, align: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !767, file: !4, line: 3999, baseType: !633, size: 32, align: 32, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !767, file: !4, line: 4004, baseType: !633, size: 32, align: 32, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !767, file: !4, line: 4005, baseType: !633, size: 32, align: 32, offset: 416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !767, file: !4, line: 4010, baseType: !633, size: 32, align: 32, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !767, file: !4, line: 4011, baseType: !633, size: 32, align: 32, offset: 480)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !767, file: !4, line: 4020, baseType: !695, size: 64, align: 32, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !767, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !767, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !767, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !767, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !767, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !767, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !767, file: !4, line: 4039, baseType: !633, size: 32, align: 32, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !767, file: !4, line: 4046, baseType: !794, size: 64, align: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !642, line: 55, baseType: !795)
!795 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !767, file: !4, line: 4050, baseType: !633, size: 32, align: 32, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !767, file: !4, line: 4054, baseType: !633, size: 32, align: 32, offset: 928)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !767, file: !4, line: 4061, baseType: !633, size: 32, align: 32, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !767, file: !4, line: 4065, baseType: !633, size: 32, align: 32, offset: 992)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !767, file: !4, line: 4073, baseType: !633, size: 32, align: 32, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !767, file: !4, line: 4080, baseType: !633, size: 32, align: 32, offset: 1056)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !767, file: !4, line: 4084, baseType: !633, size: 32, align: 32, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !753, file: !4, line: 5781, baseType: !765, size: 64, align: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !753, file: !4, line: 5787, baseType: !695, size: 64, align: 32, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !753, file: !4, line: 5793, baseType: !695, size: 64, align: 32, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !655, file: !4, line: 5827, baseType: !807, size: 64, align: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!633, !751, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !813)
!813 = !{!814, !826, !827, !828, !829, !830, !831, !832, !840, !841, !842, !843}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !812, file: !4, line: 1451, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !817, line: 94, baseType: !818)
!817 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !817, line: 81, size: 192, align: 64, elements: !819)
!819 = !{!820, !824, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !818, file: !817, line: 82, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !817, line: 73, baseType: !823)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !817, line: 73, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !818, file: !817, line: 89, baseType: !773, size: 64, align: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !818, file: !817, line: 93, baseType: !633, size: 32, align: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !812, file: !4, line: 1461, baseType: !689, size: 64, align: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !812, file: !4, line: 1467, baseType: !689, size: 64, align: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !4, line: 1468, baseType: !773, size: 64, align: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !812, file: !4, line: 1469, baseType: !633, size: 32, align: 32, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !812, file: !4, line: 1470, baseType: !633, size: 32, align: 32, offset: 288)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !812, file: !4, line: 1474, baseType: !633, size: 32, align: 32, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !812, file: !4, line: 1479, baseType: !833, size: 64, align: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !835, file: !4, line: 1412, baseType: !773, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !835, file: !4, line: 1413, baseType: !633, size: 32, align: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !835, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !812, file: !4, line: 1480, baseType: !633, size: 32, align: 32, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !812, file: !4, line: 1486, baseType: !689, size: 64, align: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !812, file: !4, line: 1488, baseType: !689, size: 64, align: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !812, file: !4, line: 1497, baseType: !689, size: 64, align: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !655, file: !4, line: 5828, baseType: !845, size: 64, align: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, align: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !751}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !655, file: !4, line: 5829, baseType: !845, size: 64, align: 64, offset: 448)
!849 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !652, line: 92, type: !850, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 64, align: 32, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 2)
!853 = distinct !DIGlobalVariable(name: "prores_metadata_class", scope: !0, file: !652, line: 158, type: !666, isLocal: true, isDefinition: true, variable: %struct.AVClass* @prores_metadata_class)
!854 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !652, line: 132, type: !855, isLocal: true, isDefinition: true, variable: [20 x %struct.AVOption]* @options)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 10240, align: 64, elements: !858)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !679)
!858 = !{!859}
!859 = !DISubrange(count: 20)
!860 = !{i32 2, !"Dwarf Version", i32 4}
!861 = !{i32 2, !"Debug Info Version", i32 3}
!862 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!863 = distinct !DISubprogram(name: "prores_metadata_init", scope: !652, file: !652, line: 96, type: !749, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !864)
!864 = !{}
!865 = !DILocalVariable(name: "bsf", arg: 1, scope: !863, file: !652, line: 96, type: !751)
!866 = !DIExpression()
!867 = !DILocation(line: 96, column: 47, scope: !863)
!868 = !DILocalVariable(name: "ctx", scope: !863, file: !652, line: 98, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProresMetadataContext", file: !652, line: 39, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProresMetadataContext", file: !652, line: 33, size: 192, align: 64, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !871, file: !652, line: 34, baseType: !665, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !871, file: !652, line: 36, baseType: !633, size: 32, align: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !871, file: !652, line: 37, baseType: !633, size: 32, align: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !871, file: !652, line: 38, baseType: !633, size: 32, align: 32, offset: 128)
!877 = !DILocation(line: 98, column: 28, scope: !863)
!878 = !DILocation(line: 98, column: 34, scope: !863)
!879 = !DILocation(line: 98, column: 39, scope: !863)
!880 = !DILocation(line: 100, column: 13, scope: !863)
!881 = !DILocation(line: 100, column: 18, scope: !863)
!882 = !DILocation(line: 100, column: 5, scope: !863)
!883 = !DILocation(line: 109, column: 9, scope: !884)
!884 = distinct !DILexicalBlock(scope: !863, file: !652, line: 100, column: 35)
!885 = !DILocation(line: 111, column: 16, scope: !884)
!886 = !DILocation(line: 111, column: 70, scope: !884)
!887 = !DILocation(line: 111, column: 75, scope: !884)
!888 = !DILocation(line: 111, column: 9, scope: !884)
!889 = !DILocation(line: 112, column: 9, scope: !884)
!890 = !DILocation(line: 115, column: 13, scope: !863)
!891 = !DILocation(line: 115, column: 18, scope: !863)
!892 = !DILocation(line: 115, column: 5, scope: !863)
!893 = !DILocation(line: 121, column: 9, scope: !894)
!894 = distinct !DILexicalBlock(scope: !863, file: !652, line: 115, column: 39)
!895 = !DILocation(line: 123, column: 16, scope: !894)
!896 = !DILocation(line: 123, column: 65, scope: !894)
!897 = !DILocation(line: 123, column: 70, scope: !894)
!898 = !DILocation(line: 123, column: 9, scope: !894)
!899 = !DILocation(line: 124, column: 9, scope: !894)
!900 = !DILocation(line: 127, column: 5, scope: !863)
!901 = !DILocation(line: 128, column: 1, scope: !863)
!902 = distinct !DISubprogram(name: "prores_metadata", scope: !652, file: !652, line: 41, type: !808, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !864)
!903 = !DILocalVariable(name: "x", arg: 1, scope: !904, file: !905, line: 58, type: !648)
!904 = distinct !DISubprogram(name: "av_bswap16", scope: !905, file: !905, line: 58, type: !906, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !864)
!905 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!906 = !DISubroutineType(types: !907)
!907 = !{!648, !648}
!908 = !DILocation(line: 58, column: 98, scope: !904, inlinedAt: !909)
!909 = distinct !DILocation(line: 72, column: 9, scope: !910)
!910 = distinct !DILexicalBlock(scope: !902, file: !652, line: 72, column: 9)
!911 = !DILocalVariable(name: "bsf", arg: 1, scope: !902, file: !652, line: 41, type: !751)
!912 = !DILocation(line: 41, column: 42, scope: !902)
!913 = !DILocalVariable(name: "pkt", arg: 2, scope: !902, file: !652, line: 41, type: !810)
!914 = !DILocation(line: 41, column: 57, scope: !902)
!915 = !DILocalVariable(name: "ctx", scope: !902, file: !652, line: 43, type: !869)
!916 = !DILocation(line: 43, column: 28, scope: !902)
!917 = !DILocation(line: 43, column: 34, scope: !902)
!918 = !DILocation(line: 43, column: 39, scope: !902)
!919 = !DILocalVariable(name: "ret", scope: !902, file: !652, line: 44, type: !633)
!920 = !DILocation(line: 44, column: 9, scope: !902)
!921 = !DILocalVariable(name: "buf_size", scope: !902, file: !652, line: 45, type: !633)
!922 = !DILocation(line: 45, column: 9, scope: !902)
!923 = !DILocalVariable(name: "buf", scope: !902, file: !652, line: 46, type: !773)
!924 = !DILocation(line: 46, column: 14, scope: !902)
!925 = !DILocation(line: 48, column: 33, scope: !902)
!926 = !DILocation(line: 48, column: 38, scope: !902)
!927 = !DILocation(line: 48, column: 11, scope: !902)
!928 = !DILocation(line: 48, column: 9, scope: !902)
!929 = !DILocation(line: 49, column: 9, scope: !930)
!930 = distinct !DILexicalBlock(scope: !902, file: !652, line: 49, column: 9)
!931 = !DILocation(line: 49, column: 13, scope: !930)
!932 = !DILocation(line: 49, column: 9, scope: !902)
!933 = !DILocation(line: 50, column: 16, scope: !930)
!934 = !DILocation(line: 50, column: 9, scope: !930)
