; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacps_float.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacps_float.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i8*, i8*, i32, i32 }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }

!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 58, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/aacps.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "huff_iid_df1", value: 0)
!891 = !DIEnumerator(name: "huff_iid_dt1", value: 1)
!892 = !DIEnumerator(name: "huff_iid_df0", value: 2)
!893 = !DIEnumerator(name: "huff_iid_dt0", value: 3)
!894 = !DIEnumerator(name: "huff_icc_df", value: 4)
!895 = !DIEnumerator(name: "huff_icc_dt", value: 5)
!896 = !DIEnumerator(name: "huff_ipd_df", value: 6)
!897 = !DIEnumerator(name: "huff_ipd_dt", value: 7)
!898 = !DIEnumerator(name: "huff_opd_df", value: 8)
!899 = !DIEnumerator(name: "huff_opd_dt", value: 9)
!900 = !{!901, !910, !919, !921, !918, !922, !926, !904, !906, !927}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 2048, align: 32, elements: !907)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !905, line: 86, baseType: !906)
!905 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!906 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!907 = !{!908, !909}
!908 = !DISubrange(count: 32)
!909 = !DISubrange(count: 2)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !913, line: 221, size: 32, align: 8, elements: !914)
!913 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !912, file: !913, line: 221, baseType: !916, size: 32, align: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !917, line: 51, baseType: !918)
!917 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !917, line: 48, baseType: !920)
!920 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!921 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 512, align: 32, elements: !924)
!924 = !{!925, !909}
!925 = !DISubrange(count: 8)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64FLOAT", file: !905, line: 88, baseType: !906)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, align: 32, elements: !929)
!929 = !{!909}
!930 = !{!931, !949, !955, !959, !963, !967, !971, !972, !976, !977, !978, !979, !991, !998, !999, !1003, !1006, !1010, !1012, !1013, !1018, !1021, !1024, !1025, !1029, !1033, !1037, !1038, !1039, !1043, !1047, !1048, !1052, !1053, !1054, !1057, !1058, !1063, !1066, !1071, !1072, !1076, !1078, !1079, !1080, !1084, !1086, !1087, !1088, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1102, !1103, !1106, !1107, !1108, !1109, !1112, !1115, !1117, !1118, !1119}
!931 = distinct !DIGlobalVariable(name: "ps_tmp", scope: !932, file: !888, line: 1016, type: !936, isLocal: true, isDefinition: true, variable: [10 x %struct.anon]* @ff_ps_init.ps_tmp)
!932 = distinct !DISubprogram(name: "ff_ps_init", scope: !888, file: !888, line: 1011, type: !933, isLocal: false, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{null}
!935 = !{}
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 1920, align: 64, elements: !947)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !932, file: !888, line: 1013, size: 192, align: 64, elements: !939)
!939 = !{!940, !943, !944, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ps_codes", scope: !938, file: !888, line: 1014, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ps_bits", scope: !938, file: !888, line: 1014, baseType: !941, size: 64, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !938, file: !888, line: 1015, baseType: !945, size: 32, align: 32, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !938, file: !888, line: 1015, baseType: !945, size: 32, align: 32, offset: 160)
!947 = !{!948}
!948 = !DISubrange(count: 10)
!949 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1029, type: !950, isLocal: true, isDefinition: true, variable: [1544 x [2 x i16]]* @ff_ps_init.table)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 49408, align: 16, elements: !953)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !917, line: 37, baseType: !952)
!952 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!953 = !{!954, !909}
!954 = !DISubrange(count: 1544)
!955 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1030, type: !956, isLocal: true, isDefinition: true, variable: [832 x [2 x i16]]* @ff_ps_init.table.7)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 26624, align: 16, elements: !957)
!957 = !{!958, !909}
!958 = !DISubrange(count: 832)
!959 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1031, type: !960, isLocal: true, isDefinition: true, variable: [1024 x [2 x i16]]* @ff_ps_init.table.8)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 32768, align: 16, elements: !961)
!961 = !{!962, !909}
!962 = !DISubrange(count: 1024)
!963 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1032, type: !964, isLocal: true, isDefinition: true, variable: [1036 x [2 x i16]]* @ff_ps_init.table.9)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 33152, align: 16, elements: !965)
!965 = !{!966, !909}
!966 = !DISubrange(count: 1036)
!967 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1033, type: !968, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_ps_init.table.10)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 17408, align: 16, elements: !969)
!969 = !{!970, !909}
!970 = !DISubrange(count: 544)
!971 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1034, type: !968, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_ps_init.table.11)
!972 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1035, type: !973, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init.table.12)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 16384, align: 16, elements: !974)
!974 = !{!975, !909}
!975 = !DISubrange(count: 512)
!976 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1036, type: !973, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init.table.13)
!977 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1037, type: !973, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init.table.14)
!978 = distinct !DIGlobalVariable(name: "table", scope: !932, file: !888, line: 1038, type: !973, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init.table.15)
!979 = distinct !DIGlobalVariable(name: "vlc_ps", scope: !0, file: !888, line: 78, type: !980, isLocal: true, isDefinition: true, variable: [10 x %struct.VLC]* @vlc_ps)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 1920, align: 64, elements: !947)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !982, line: 30, baseType: !983)
!982 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !982, line: 26, size: 192, align: 64, elements: !984)
!984 = !{!985, !986, !989, !990}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !983, file: !982, line: 27, baseType: !921, size: 32, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !983, file: !982, line: 28, baseType: !987, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 32, align: 16, elements: !929)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !983, file: !982, line: 29, baseType: !921, size: 32, align: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !983, file: !982, line: 29, baseType: !921, size: 32, align: 32, offset: 160)
!991 = distinct !DIGlobalVariable(name: "nr_iidicc_par_tab", scope: !0, file: !888, line: 50, type: !992, isLocal: true, isDefinition: true, variable: [6 x i8]* @nr_iidicc_par_tab)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 48, align: 8, elements: !996)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !917, line: 36, baseType: !995)
!995 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!996 = !{!997}
!997 = !DISubrange(count: 6)
!998 = distinct !DIGlobalVariable(name: "nr_iidopd_par_tab", scope: !0, file: !888, line: 54, type: !992, isLocal: true, isDefinition: true, variable: [6 x i8]* @nr_iidopd_par_tab)
!999 = distinct !DIGlobalVariable(name: "num_env_tab", scope: !0, file: !888, line: 45, type: !1000, isLocal: true, isDefinition: true, variable: [2 x [4 x i8]]* @num_env_tab)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 64, align: 8, elements: !1001)
!1001 = !{!909, !1002}
!1002 = !DISubrange(count: 4)
!1003 = distinct !DIGlobalVariable(name: "huff_offset", scope: !0, file: !1004, line: 136, type: !1005, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_offset)
!1004 = !DIFile(filename: "libavcodec/aacpsdata.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 80, align: 8, elements: !947)
!1006 = distinct !DIGlobalVariable(name: "huff_iid", scope: !0, file: !888, line: 71, type: !1007, isLocal: true, isDefinition: true, variable: [4 x i32]* @huff_iid)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 128, align: 32, elements: !1009)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1009 = !{!1002}
!1010 = distinct !DIGlobalVariable(name: "NR_BANDS", scope: !0, file: !888, line: 455, type: !1011, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_BANDS)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 64, align: 32, elements: !929)
!1012 = distinct !DIGlobalVariable(name: "NR_ALLPASS_BANDS", scope: !0, file: !888, line: 459, type: !1011, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_ALLPASS_BANDS)
!1013 = distinct !DIGlobalVariable(name: "f34_0_12", scope: !0, file: !1014, line: 47, type: !1015, isLocal: true, isDefinition: true, variable: [12 x [8 x [2 x float]]]* @f34_0_12)
!1014 = !DIFile(filename: "libavcodec/aacps_tablegen.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 6144, align: 32, elements: !1016)
!1016 = !{!1017, !925, !909}
!1017 = !DISubrange(count: 12)
!1018 = distinct !DIGlobalVariable(name: "f34_1_8", scope: !0, file: !1014, line: 48, type: !1019, isLocal: true, isDefinition: true, variable: [8 x [8 x [2 x float]]]* @f34_1_8)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 4096, align: 32, elements: !1020)
!1020 = !{!925, !925, !909}
!1021 = distinct !DIGlobalVariable(name: "f34_2_4", scope: !0, file: !1014, line: 49, type: !1022, isLocal: true, isDefinition: true, variable: [4 x [8 x [2 x float]]]* @f34_2_4)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 2048, align: 32, elements: !1023)
!1023 = !{!1002, !925, !909}
!1024 = distinct !DIGlobalVariable(name: "f20_0_8", scope: !0, file: !1014, line: 46, type: !1019, isLocal: true, isDefinition: true, variable: [8 x [8 x [2 x float]]]* @f20_0_8)
!1025 = distinct !DIGlobalVariable(name: "g1_Q2", scope: !0, file: !1004, line: 160, type: !1026, isLocal: true, isDefinition: true, variable: [7 x float]* @g1_Q2)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 224, align: 32, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 7)
!1029 = distinct !DIGlobalVariable(name: "k_to_i_34", scope: !0, file: !1004, line: 152, type: !1030, isLocal: true, isDefinition: true, variable: [91 x i8]* @k_to_i_34)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 728, align: 8, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 91)
!1033 = distinct !DIGlobalVariable(name: "k_to_i_20", scope: !0, file: !1004, line: 145, type: !1034, isLocal: true, isDefinition: true, variable: [71 x i8]* @k_to_i_20)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 568, align: 8, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 71)
!1037 = distinct !DIGlobalVariable(name: "NR_PAR_BANDS", scope: !0, file: !888, line: 452, type: !1011, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_PAR_BANDS)
!1038 = distinct !DIGlobalVariable(name: "DECAY_CUTOFF", scope: !0, file: !888, line: 457, type: !1011, isLocal: true, isDefinition: true, variable: [2 x i32]* @DECAY_CUTOFF)
!1039 = distinct !DIGlobalVariable(name: "phi_fract", scope: !0, file: !1014, line: 51, type: !1040, isLocal: true, isDefinition: true, variable: [2 x [50 x [2 x float]]]* @phi_fract)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 6400, align: 32, elements: !1041)
!1041 = !{!909, !1042, !909}
!1042 = !DISubrange(count: 50)
!1043 = distinct !DIGlobalVariable(name: "Q_fract_allpass", scope: !0, file: !1014, line: 50, type: !1044, isLocal: true, isDefinition: true, variable: [2 x [50 x [3 x [2 x float]]]]* @Q_fract_allpass)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 19200, align: 32, elements: !1045)
!1045 = !{!909, !1042, !1046, !909}
!1046 = !DISubrange(count: 3)
!1047 = distinct !DIGlobalVariable(name: "SHORT_DELAY_BAND", scope: !0, file: !888, line: 461, type: !1011, isLocal: true, isDefinition: true, variable: [2 x i32]* @SHORT_DELAY_BAND)
!1048 = distinct !DIGlobalVariable(name: "HA", scope: !0, file: !1014, line: 44, type: !1049, isLocal: true, isDefinition: true, variable: [46 x [8 x [4 x float]]]* @HA)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 47104, align: 32, elements: !1050)
!1050 = !{!1051, !925, !1002}
!1051 = !DISubrange(count: 46)
!1052 = distinct !DIGlobalVariable(name: "HB", scope: !0, file: !1014, line: 45, type: !1049, isLocal: true, isDefinition: true, variable: [46 x [8 x [4 x float]]]* @HB)
!1053 = distinct !DIGlobalVariable(name: "NR_IPDOPD_BANDS", scope: !0, file: !888, line: 453, type: !1011, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_IPDOPD_BANDS)
!1054 = distinct !DIGlobalVariable(name: "pd_re_smooth", scope: !0, file: !1014, line: 42, type: !1055, isLocal: true, isDefinition: true, variable: [512 x float]* @pd_re_smooth)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 16384, align: 32, elements: !1056)
!1056 = !{!975}
!1057 = distinct !DIGlobalVariable(name: "pd_im_smooth", scope: !0, file: !1014, line: 43, type: !1055, isLocal: true, isDefinition: true, variable: [512 x float]* @pd_im_smooth)
!1058 = distinct !DIGlobalVariable(name: "huff_iid_df1_codes", scope: !0, file: !1004, line: 29, type: !1059, isLocal: true, isDefinition: true, variable: [61 x i32]* @huff_iid_df1_codes)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 1952, align: 32, elements: !1061)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1061 = !{!1062}
!1062 = !DISubrange(count: 61)
!1063 = distinct !DIGlobalVariable(name: "huff_iid_df1_bits", scope: !0, file: !1004, line: 22, type: !1064, isLocal: true, isDefinition: true, variable: [61 x i8]* @huff_iid_df1_bits)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 488, align: 8, elements: !1061)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!1066 = distinct !DIGlobalVariable(name: "huff_iid_dt1_codes", scope: !0, file: !1004, line: 48, type: !1067, isLocal: true, isDefinition: true, variable: [61 x i16]* @huff_iid_dt1_codes)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 976, align: 16, elements: !1061)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !917, line: 49, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1071 = distinct !DIGlobalVariable(name: "huff_iid_dt1_bits", scope: !0, file: !1004, line: 41, type: !1064, isLocal: true, isDefinition: true, variable: [61 x i8]* @huff_iid_dt1_bits)
!1072 = distinct !DIGlobalVariable(name: "huff_iid_df0_codes", scope: !0, file: !1004, line: 65, type: !1073, isLocal: true, isDefinition: true, variable: [29 x i32]* @huff_iid_df0_codes)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 928, align: 32, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 29)
!1076 = distinct !DIGlobalVariable(name: "huff_iid_df0_bits", scope: !0, file: !1004, line: 60, type: !1077, isLocal: true, isDefinition: true, variable: [29 x i8]* @huff_iid_df0_bits)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 232, align: 8, elements: !1074)
!1078 = distinct !DIGlobalVariable(name: "huff_iid_dt0_codes", scope: !0, file: !1004, line: 78, type: !1073, isLocal: true, isDefinition: true, variable: [29 x i32]* @huff_iid_dt0_codes)
!1079 = distinct !DIGlobalVariable(name: "huff_iid_dt0_bits", scope: !0, file: !1004, line: 73, type: !1077, isLocal: true, isDefinition: true, variable: [29 x i8]* @huff_iid_dt0_bits)
!1080 = distinct !DIGlobalVariable(name: "huff_icc_df_codes", scope: !0, file: !1004, line: 90, type: !1081, isLocal: true, isDefinition: true, variable: [15 x i16]* @huff_icc_df_codes)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 240, align: 16, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 15)
!1084 = distinct !DIGlobalVariable(name: "huff_icc_df_bits", scope: !0, file: !1004, line: 86, type: !1085, isLocal: true, isDefinition: true, variable: [15 x i8]* @huff_icc_df_bits)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 120, align: 8, elements: !1082)
!1086 = distinct !DIGlobalVariable(name: "huff_icc_dt_codes", scope: !0, file: !1004, line: 99, type: !1081, isLocal: true, isDefinition: true, variable: [15 x i16]* @huff_icc_dt_codes)
!1087 = distinct !DIGlobalVariable(name: "huff_icc_dt_bits", scope: !0, file: !1004, line: 95, type: !1085, isLocal: true, isDefinition: true, variable: [15 x i8]* @huff_icc_dt_bits)
!1088 = distinct !DIGlobalVariable(name: "huff_ipd_df_codes", scope: !0, file: !1004, line: 108, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_df_codes)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 64, align: 8, elements: !1090)
!1090 = !{!925}
!1091 = distinct !DIGlobalVariable(name: "huff_ipd_df_bits", scope: !0, file: !1004, line: 104, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_df_bits)
!1092 = distinct !DIGlobalVariable(name: "huff_ipd_dt_codes", scope: !0, file: !1004, line: 116, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_dt_codes)
!1093 = distinct !DIGlobalVariable(name: "huff_ipd_dt_bits", scope: !0, file: !1004, line: 112, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_dt_bits)
!1094 = distinct !DIGlobalVariable(name: "huff_opd_df_codes", scope: !0, file: !1004, line: 124, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_df_codes)
!1095 = distinct !DIGlobalVariable(name: "huff_opd_df_bits", scope: !0, file: !1004, line: 120, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_df_bits)
!1096 = distinct !DIGlobalVariable(name: "huff_opd_dt_codes", scope: !0, file: !1004, line: 132, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_dt_codes)
!1097 = distinct !DIGlobalVariable(name: "huff_opd_dt_bits", scope: !0, file: !1004, line: 128, type: !1089, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_dt_bits)
!1098 = distinct !DIGlobalVariable(name: "ipdopd_sin", scope: !1099, file: !1014, line: 87, type: !1100, isLocal: true, isDefinition: true, variable: [8 x float]* @ps_tableinit.ipdopd_sin)
!1099 = distinct !DISubprogram(name: "ps_tableinit", scope: !1014, file: !1014, line: 85, type: !933, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !935)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 256, align: 32, elements: !1090)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!1102 = distinct !DIGlobalVariable(name: "ipdopd_cos", scope: !1099, file: !1014, line: 88, type: !1100, isLocal: true, isDefinition: true, variable: [8 x float]* @ps_tableinit.ipdopd_cos)
!1103 = distinct !DIGlobalVariable(name: "iid_par_dequant", scope: !1099, file: !1014, line: 91, type: !1104, isLocal: true, isDefinition: true, variable: [46 x float]* @ps_tableinit.iid_par_dequant)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 1472, align: 32, elements: !1105)
!1105 = !{!1051}
!1106 = distinct !DIGlobalVariable(name: "icc_invq", scope: !1099, file: !1014, line: 107, type: !1100, isLocal: true, isDefinition: true, variable: [8 x float]* @ps_tableinit.icc_invq)
!1107 = distinct !DIGlobalVariable(name: "acos_icc_invq", scope: !1099, file: !1014, line: 110, type: !1100, isLocal: true, isDefinition: true, variable: [8 x float]* @ps_tableinit.acos_icc_invq)
!1108 = distinct !DIGlobalVariable(name: "f_center_20", scope: !1099, file: !1014, line: 116, type: !1005, isLocal: true, isDefinition: true, variable: [10 x i8]* @ps_tableinit.f_center_20)
!1109 = distinct !DIGlobalVariable(name: "f_center_34", scope: !1099, file: !1014, line: 119, type: !1110, isLocal: true, isDefinition: true, variable: [32 x i8]* @ps_tableinit.f_center_34)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 256, align: 8, elements: !1111)
!1111 = !{!908}
!1112 = distinct !DIGlobalVariable(name: "fractional_delay_links", scope: !1099, file: !1014, line: 125, type: !1113, isLocal: true, isDefinition: true, variable: [3 x float]* @ps_tableinit.fractional_delay_links)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 96, align: 32, elements: !1114)
!1114 = !{!1046}
!1115 = distinct !DIGlobalVariable(name: "g0_Q8", scope: !0, file: !1014, line: 53, type: !1116, isLocal: true, isDefinition: true, variable: [7 x float]* @g0_Q8)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 224, align: 32, elements: !1027)
!1117 = distinct !DIGlobalVariable(name: "g0_Q12", scope: !0, file: !1014, line: 58, type: !1116, isLocal: true, isDefinition: true, variable: [7 x float]* @g0_Q12)
!1118 = distinct !DIGlobalVariable(name: "g1_Q8", scope: !0, file: !1014, line: 63, type: !1116, isLocal: true, isDefinition: true, variable: [7 x float]* @g1_Q8)
!1119 = distinct !DIGlobalVariable(name: "g2_Q4", scope: !0, file: !1014, line: 68, type: !1116, isLocal: true, isDefinition: true, variable: [7 x float]* @g2_Q4)
!1120 = !{i32 2, !"Dwarf Version", i32 4}
!1121 = !{i32 2, !"Debug Info Version", i32 3}
!1122 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1123 = distinct !DISubprogram(name: "ff_ps_read_data", scope: !888, file: !888, line: 158, type: !1124, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !935)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!921, !1126, !1710, !1720, !921}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1129)
!1129 = !{!1130, !1175, !1176, !1177, !1435, !1436, !1437, !1438, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1648, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1128, file: !35, line: 1561, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1135)
!1135 = !{!1136, !1140, !1145, !1149, !1150, !1151, !1152, !1156, !1162, !1164, !1168}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1134, file: !4, line: 72, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1134, file: !4, line: 78, baseType: !1141, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!1137, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1134, file: !4, line: 85, baseType: !1146, size: 64, align: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1148)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1134, file: !4, line: 93, baseType: !921, size: 32, align: 32, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1134, file: !4, line: 99, baseType: !921, size: 32, align: 32, offset: 224)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1134, file: !4, line: 108, baseType: !921, size: 32, align: 32, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1134, file: !4, line: 113, baseType: !1153, size: 64, align: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!1144, !1144, !1144}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1134, file: !4, line: 123, baseType: !1157, size: 64, align: 64, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!1160, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1134, file: !4, line: 130, baseType: !1163, size: 32, align: 32, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1134, file: !4, line: 136, baseType: !1165, size: 64, align: 64, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!1163, !1144}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1134, file: !4, line: 142, baseType: !1169, size: 64, align: 64, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!921, !1172, !1144, !1137, !921}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1128, file: !35, line: 1562, baseType: !921, size: 32, align: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1128, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1128, file: !35, line: 1565, baseType: !1178, size: 64, align: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1196, !1199, !1201, !1204, !1209, !1210, !1211, !1219, !1220, !1221, !1223, !1227, !1233, !1238, !1242, !1243, !1287, !1406, !1410, !1411, !1415, !1419, !1424, !1428, !1429, !1430}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1180, file: !35, line: 3475, baseType: !1137, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1180, file: !35, line: 3480, baseType: !1137, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1180, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1180, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1180, file: !35, line: 3487, baseType: !921, size: 32, align: 32, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1180, file: !35, line: 3488, baseType: !1188, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1191, line: 61, baseType: !1192)
!1191 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1191, line: 58, size: 64, align: 32, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1192, file: !1191, line: 59, baseType: !921, size: 32, align: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1192, file: !1191, line: 60, baseType: !921, size: 32, align: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1180, file: !35, line: 3489, baseType: !1197, size: 64, align: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1180, file: !35, line: 3490, baseType: !1200, size: 64, align: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1180, file: !35, line: 3491, baseType: !1202, size: 64, align: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1180, file: !35, line: 3492, baseType: !1205, size: 64, align: 64, offset: 512)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !917, line: 55, baseType: !1208)
!1208 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1180, file: !35, line: 3493, baseType: !919, size: 8, align: 8, offset: 576)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1180, file: !35, line: 3494, baseType: !1131, size: 64, align: 64, offset: 640)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1180, file: !35, line: 3495, baseType: !1212, size: 64, align: 64, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1216)
!1216 = !{!1217, !1218}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1215, file: !35, line: 3402, baseType: !921, size: 32, align: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1215, file: !35, line: 3403, baseType: !1137, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1180, file: !35, line: 3507, baseType: !1137, size: 64, align: 64, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1180, file: !35, line: 3516, baseType: !921, size: 32, align: 32, offset: 832)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1180, file: !35, line: 3517, baseType: !1222, size: 64, align: 64, offset: 896)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1180, file: !35, line: 3527, baseType: !1224, size: 64, align: 64, offset: 960)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!921, !1126}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1180, file: !35, line: 3535, baseType: !1228, size: 64, align: 64, offset: 1024)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!921, !1126, !1231}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1180, file: !35, line: 3541, baseType: !1234, size: 64, align: 64, offset: 1088)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1237)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1180, file: !35, line: 3549, baseType: !1239, size: 64, align: 64, offset: 1152)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !1222}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1180, file: !35, line: 3551, baseType: !1224, size: 64, align: 64, offset: 1216)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1180, file: !35, line: 3552, baseType: !1244, size: 64, align: 64, offset: 1280)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!921, !1126, !1247, !921, !1248}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1284}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1250, file: !35, line: 3921, baseType: !1069, size: 16, align: 16)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1250, file: !35, line: 3922, baseType: !916, size: 32, align: 32, offset: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1250, file: !35, line: 3923, baseType: !916, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1250, file: !35, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1250, file: !35, line: 3925, baseType: !1257, size: 64, align: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1275, !1277, !1279, !1280, !1282, !1283}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1260, file: !35, line: 3886, baseType: !921, size: 32, align: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1260, file: !35, line: 3887, baseType: !921, size: 32, align: 32, offset: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1260, file: !35, line: 3888, baseType: !921, size: 32, align: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1260, file: !35, line: 3889, baseType: !921, size: 32, align: 32, offset: 96)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1260, file: !35, line: 3890, baseType: !921, size: 32, align: 32, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1260, file: !35, line: 3897, baseType: !1268, size: 768, align: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1270)
!1270 = !{!1271, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1269, file: !35, line: 3855, baseType: !1272, size: 512, align: 64)
!1272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1247, size: 512, align: 64, elements: !1090)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1269, file: !35, line: 3857, baseType: !1274, size: 256, align: 32, offset: 512)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 256, align: 32, elements: !1090)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1260, file: !35, line: 3903, baseType: !1276, size: 256, align: 64, offset: 960)
!1276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1247, size: 256, align: 64, elements: !1009)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1260, file: !35, line: 3904, baseType: !1278, size: 128, align: 32, offset: 1216)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 128, align: 32, elements: !1009)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1260, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1260, file: !35, line: 3908, baseType: !1281, size: 64, align: 64, offset: 1408)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1260, file: !35, line: 3915, baseType: !1281, size: 64, align: 64, offset: 1472)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1260, file: !35, line: 3917, baseType: !921, size: 32, align: 32, offset: 1536)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1250, file: !35, line: 3926, baseType: !1285, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !917, line: 40, baseType: !1286)
!1286 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1180, file: !35, line: 3564, baseType: !1288, size: 64, align: 64, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!921, !1126, !1291, !1325, !1405}
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1294)
!1294 = !{!1295, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1321, !1322, !1323, !1324}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1293, file: !35, line: 1451, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1298, line: 94, baseType: !1299)
!1298 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1298, line: 81, size: 192, align: 64, elements: !1300)
!1300 = !{!1301, !1305, !1306}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1299, file: !1298, line: 82, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1298, line: 73, baseType: !1304)
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1298, line: 73, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1299, file: !1298, line: 89, baseType: !1247, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1299, file: !1298, line: 93, baseType: !921, size: 32, align: 32, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1293, file: !35, line: 1461, baseType: !1285, size: 64, align: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1293, file: !35, line: 1467, baseType: !1285, size: 64, align: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1293, file: !35, line: 1468, baseType: !1247, size: 64, align: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1293, file: !35, line: 1469, baseType: !921, size: 32, align: 32, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1293, file: !35, line: 1470, baseType: !921, size: 32, align: 32, offset: 288)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1293, file: !35, line: 1474, baseType: !921, size: 32, align: 32, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1293, file: !35, line: 1479, baseType: !1314, size: 64, align: 64, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1316, file: !35, line: 1412, baseType: !1247, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1316, file: !35, line: 1413, baseType: !921, size: 32, align: 32, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1316, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1293, file: !35, line: 1480, baseType: !921, size: 32, align: 32, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1293, file: !35, line: 1486, baseType: !1285, size: 64, align: 64, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1293, file: !35, line: 1488, baseType: !1285, size: 64, align: 64, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1293, file: !35, line: 1497, baseType: !1285, size: 64, align: 64, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1359, !1361, !1362, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1393, !1394, !1395, !1396, !1397, !1398, !1401, !1402, !1403, !1404}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1328, file: !758, line: 282, baseType: !1272, size: 512, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1328, file: !758, line: 299, baseType: !1274, size: 256, align: 32, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1328, file: !758, line: 315, baseType: !1333, size: 64, align: 64, offset: 768)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1328, file: !758, line: 326, baseType: !921, size: 32, align: 32, offset: 832)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1328, file: !758, line: 326, baseType: !921, size: 32, align: 32, offset: 864)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1328, file: !758, line: 334, baseType: !921, size: 32, align: 32, offset: 896)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1328, file: !758, line: 341, baseType: !921, size: 32, align: 32, offset: 928)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1328, file: !758, line: 346, baseType: !921, size: 32, align: 32, offset: 960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1328, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1328, file: !758, line: 356, baseType: !1190, size: 64, align: 32, offset: 1024)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1328, file: !758, line: 361, baseType: !1285, size: 64, align: 64, offset: 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1328, file: !758, line: 369, baseType: !1285, size: 64, align: 64, offset: 1152)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1328, file: !758, line: 377, baseType: !1285, size: 64, align: 64, offset: 1216)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1328, file: !758, line: 382, baseType: !921, size: 32, align: 32, offset: 1280)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1328, file: !758, line: 386, baseType: !921, size: 32, align: 32, offset: 1312)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1328, file: !758, line: 391, baseType: !921, size: 32, align: 32, offset: 1344)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1328, file: !758, line: 396, baseType: !1144, size: 64, align: 64, offset: 1408)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1328, file: !758, line: 403, baseType: !1349, size: 512, align: 64, offset: 1472)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 512, align: 64, elements: !1090)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1328, file: !758, line: 410, baseType: !921, size: 32, align: 32, offset: 1984)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1328, file: !758, line: 415, baseType: !921, size: 32, align: 32, offset: 2016)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1328, file: !758, line: 420, baseType: !921, size: 32, align: 32, offset: 2048)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1328, file: !758, line: 425, baseType: !921, size: 32, align: 32, offset: 2080)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1328, file: !758, line: 435, baseType: !1285, size: 64, align: 64, offset: 2112)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1328, file: !758, line: 440, baseType: !921, size: 32, align: 32, offset: 2176)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1328, file: !758, line: 445, baseType: !1207, size: 64, align: 64, offset: 2240)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1328, file: !758, line: 459, baseType: !1358, size: 512, align: 64, offset: 2304)
!1358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1296, size: 512, align: 64, elements: !1090)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1328, file: !758, line: 473, baseType: !1360, size: 64, align: 64, offset: 2816)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1328, file: !758, line: 477, baseType: !921, size: 32, align: 32, offset: 2880)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1328, file: !758, line: 479, baseType: !1363, size: 64, align: 64, offset: 2944)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1376}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1366, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1366, file: !758, line: 203, baseType: !1247, size: 64, align: 64, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1366, file: !758, line: 204, baseType: !921, size: 32, align: 32, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1366, file: !758, line: 205, baseType: !1372, size: 64, align: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1374, line: 86, baseType: !1375)
!1374 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1374, line: 86, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1366, file: !758, line: 206, baseType: !1296, size: 64, align: 64, offset: 256)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1328, file: !758, line: 480, baseType: !921, size: 32, align: 32, offset: 3008)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1328, file: !758, line: 505, baseType: !921, size: 32, align: 32, offset: 3040)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1328, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1328, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1328, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1328, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1328, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1328, file: !758, line: 532, baseType: !1285, size: 64, align: 64, offset: 3264)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1328, file: !758, line: 539, baseType: !1285, size: 64, align: 64, offset: 3328)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1328, file: !758, line: 547, baseType: !1285, size: 64, align: 64, offset: 3392)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1328, file: !758, line: 554, baseType: !1372, size: 64, align: 64, offset: 3456)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1328, file: !758, line: 563, baseType: !921, size: 32, align: 32, offset: 3520)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1328, file: !758, line: 572, baseType: !921, size: 32, align: 32, offset: 3552)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1328, file: !758, line: 581, baseType: !921, size: 32, align: 32, offset: 3584)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1328, file: !758, line: 588, baseType: !1392, size: 64, align: 64, offset: 3648)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1328, file: !758, line: 593, baseType: !921, size: 32, align: 32, offset: 3712)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1328, file: !758, line: 596, baseType: !921, size: 32, align: 32, offset: 3744)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1328, file: !758, line: 599, baseType: !1296, size: 64, align: 64, offset: 3776)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1328, file: !758, line: 605, baseType: !1296, size: 64, align: 64, offset: 3840)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1328, file: !758, line: 616, baseType: !1296, size: 64, align: 64, offset: 3904)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1328, file: !758, line: 626, baseType: !1399, size: 64, align: 64, offset: 3968)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1400, line: 216, baseType: !1208)
!1400 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1328, file: !758, line: 627, baseType: !1399, size: 64, align: 64, offset: 4032)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1328, file: !758, line: 628, baseType: !1399, size: 64, align: 64, offset: 4096)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1328, file: !758, line: 629, baseType: !1399, size: 64, align: 64, offset: 4160)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1328, file: !758, line: 645, baseType: !1296, size: 64, align: 64, offset: 4224)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1180, file: !35, line: 3566, baseType: !1407, size: 64, align: 64, offset: 1408)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!921, !1126, !1144, !1405, !1291}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1180, file: !35, line: 3567, baseType: !1224, size: 64, align: 64, offset: 1472)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1180, file: !35, line: 3576, baseType: !1412, size: 64, align: 64, offset: 1536)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!921, !1126, !1325}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1180, file: !35, line: 3577, baseType: !1416, size: 64, align: 64, offset: 1600)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!921, !1126, !1291}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1180, file: !35, line: 3584, baseType: !1420, size: 64, align: 64, offset: 1664)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!921, !1126, !1423}
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1180, file: !35, line: 3589, baseType: !1425, size: 64, align: 64, offset: 1728)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{null, !1126}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1180, file: !35, line: 3594, baseType: !921, size: 32, align: 32, offset: 1792)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1180, file: !35, line: 3600, baseType: !1137, size: 64, align: 64, offset: 1856)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1180, file: !35, line: 3609, baseType: !1431, size: 64, align: 64, offset: 1920)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1128, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1128, file: !35, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1128, file: !35, line: 1583, baseType: !1144, size: 64, align: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1128, file: !35, line: 1591, baseType: !1439, size: 64, align: 64, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1128, file: !35, line: 1598, baseType: !1144, size: 64, align: 64, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1128, file: !35, line: 1606, baseType: !1285, size: 64, align: 64, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1128, file: !35, line: 1614, baseType: !921, size: 32, align: 32, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1128, file: !35, line: 1622, baseType: !921, size: 32, align: 32, offset: 544)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1128, file: !35, line: 1628, baseType: !921, size: 32, align: 32, offset: 576)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !35, line: 1636, baseType: !921, size: 32, align: 32, offset: 608)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1128, file: !35, line: 1643, baseType: !921, size: 32, align: 32, offset: 640)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1128, file: !35, line: 1657, baseType: !1247, size: 64, align: 64, offset: 704)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1128, file: !35, line: 1658, baseType: !921, size: 32, align: 32, offset: 768)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1128, file: !35, line: 1679, baseType: !1190, size: 64, align: 32, offset: 800)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1128, file: !35, line: 1688, baseType: !921, size: 32, align: 32, offset: 864)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1128, file: !35, line: 1712, baseType: !921, size: 32, align: 32, offset: 896)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1128, file: !35, line: 1729, baseType: !921, size: 32, align: 32, offset: 928)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1128, file: !35, line: 1729, baseType: !921, size: 32, align: 32, offset: 960)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1128, file: !35, line: 1744, baseType: !921, size: 32, align: 32, offset: 992)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1128, file: !35, line: 1744, baseType: !921, size: 32, align: 32, offset: 1024)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1128, file: !35, line: 1751, baseType: !921, size: 32, align: 32, offset: 1056)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1128, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1128, file: !35, line: 1791, baseType: !1460, size: 64, align: 64, offset: 1152)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{null, !1463, !1325, !1405, !921, !921, !921}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1128, file: !35, line: 1808, baseType: !1465, size: 64, align: 64, offset: 1216)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!494, !1463, !1197}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1128, file: !35, line: 1816, baseType: !921, size: 32, align: 32, offset: 1280)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1128, file: !35, line: 1825, baseType: !906, size: 32, align: 32, offset: 1312)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1128, file: !35, line: 1830, baseType: !921, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1128, file: !35, line: 1838, baseType: !906, size: 32, align: 32, offset: 1376)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1128, file: !35, line: 1846, baseType: !921, size: 32, align: 32, offset: 1408)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1128, file: !35, line: 1851, baseType: !921, size: 32, align: 32, offset: 1440)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1128, file: !35, line: 1861, baseType: !906, size: 32, align: 32, offset: 1472)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1128, file: !35, line: 1868, baseType: !906, size: 32, align: 32, offset: 1504)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1128, file: !35, line: 1875, baseType: !906, size: 32, align: 32, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1128, file: !35, line: 1882, baseType: !906, size: 32, align: 32, offset: 1568)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1128, file: !35, line: 1889, baseType: !906, size: 32, align: 32, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1128, file: !35, line: 1896, baseType: !906, size: 32, align: 32, offset: 1632)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1128, file: !35, line: 1903, baseType: !906, size: 32, align: 32, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1128, file: !35, line: 1910, baseType: !921, size: 32, align: 32, offset: 1696)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1128, file: !35, line: 1915, baseType: !921, size: 32, align: 32, offset: 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1128, file: !35, line: 1926, baseType: !1405, size: 64, align: 64, offset: 1792)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1128, file: !35, line: 1935, baseType: !1190, size: 64, align: 32, offset: 1856)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1128, file: !35, line: 1942, baseType: !921, size: 32, align: 32, offset: 1920)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1128, file: !35, line: 1948, baseType: !921, size: 32, align: 32, offset: 1952)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1128, file: !35, line: 1954, baseType: !921, size: 32, align: 32, offset: 1984)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1128, file: !35, line: 1960, baseType: !921, size: 32, align: 32, offset: 2016)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1128, file: !35, line: 1984, baseType: !921, size: 32, align: 32, offset: 2048)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1128, file: !35, line: 1991, baseType: !921, size: 32, align: 32, offset: 2080)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1128, file: !35, line: 1996, baseType: !921, size: 32, align: 32, offset: 2112)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1128, file: !35, line: 2004, baseType: !921, size: 32, align: 32, offset: 2144)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1128, file: !35, line: 2011, baseType: !921, size: 32, align: 32, offset: 2176)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1128, file: !35, line: 2018, baseType: !921, size: 32, align: 32, offset: 2208)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1128, file: !35, line: 2027, baseType: !921, size: 32, align: 32, offset: 2240)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1128, file: !35, line: 2034, baseType: !921, size: 32, align: 32, offset: 2272)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1128, file: !35, line: 2044, baseType: !921, size: 32, align: 32, offset: 2304)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1128, file: !35, line: 2054, baseType: !1499, size: 64, align: 64, offset: 2368)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1128, file: !35, line: 2061, baseType: !1499, size: 64, align: 64, offset: 2432)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1128, file: !35, line: 2066, baseType: !921, size: 32, align: 32, offset: 2496)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1128, file: !35, line: 2070, baseType: !921, size: 32, align: 32, offset: 2528)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1128, file: !35, line: 2078, baseType: !921, size: 32, align: 32, offset: 2560)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1128, file: !35, line: 2085, baseType: !921, size: 32, align: 32, offset: 2592)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1128, file: !35, line: 2092, baseType: !921, size: 32, align: 32, offset: 2624)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1128, file: !35, line: 2099, baseType: !921, size: 32, align: 32, offset: 2656)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1128, file: !35, line: 2106, baseType: !921, size: 32, align: 32, offset: 2688)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1128, file: !35, line: 2113, baseType: !921, size: 32, align: 32, offset: 2720)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1128, file: !35, line: 2120, baseType: !921, size: 32, align: 32, offset: 2752)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1128, file: !35, line: 2125, baseType: !921, size: 32, align: 32, offset: 2784)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1128, file: !35, line: 2133, baseType: !921, size: 32, align: 32, offset: 2816)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1128, file: !35, line: 2140, baseType: !921, size: 32, align: 32, offset: 2848)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1128, file: !35, line: 2145, baseType: !921, size: 32, align: 32, offset: 2880)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1128, file: !35, line: 2153, baseType: !921, size: 32, align: 32, offset: 2912)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1128, file: !35, line: 2158, baseType: !921, size: 32, align: 32, offset: 2944)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1128, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1128, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1128, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1128, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1128, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1128, file: !35, line: 2203, baseType: !921, size: 32, align: 32, offset: 3136)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1128, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1128, file: !35, line: 2212, baseType: !921, size: 32, align: 32, offset: 3200)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1128, file: !35, line: 2213, baseType: !921, size: 32, align: 32, offset: 3232)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1128, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1128, file: !35, line: 2232, baseType: !921, size: 32, align: 32, offset: 3296)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1128, file: !35, line: 2243, baseType: !921, size: 32, align: 32, offset: 3328)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1128, file: !35, line: 2249, baseType: !921, size: 32, align: 32, offset: 3360)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1128, file: !35, line: 2256, baseType: !921, size: 32, align: 32, offset: 3392)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1128, file: !35, line: 2263, baseType: !1207, size: 64, align: 64, offset: 3456)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1128, file: !35, line: 2270, baseType: !1207, size: 64, align: 64, offset: 3520)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1128, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1128, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1128, file: !35, line: 2367, baseType: !1535, size: 64, align: 64, offset: 3648)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!921, !1463, !1423, !921}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1128, file: !35, line: 2383, baseType: !921, size: 32, align: 32, offset: 3712)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1128, file: !35, line: 2386, baseType: !906, size: 32, align: 32, offset: 3744)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1128, file: !35, line: 2387, baseType: !906, size: 32, align: 32, offset: 3776)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1128, file: !35, line: 2394, baseType: !921, size: 32, align: 32, offset: 3808)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1128, file: !35, line: 2401, baseType: !921, size: 32, align: 32, offset: 3840)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1128, file: !35, line: 2408, baseType: !921, size: 32, align: 32, offset: 3872)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1128, file: !35, line: 2415, baseType: !921, size: 32, align: 32, offset: 3904)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1128, file: !35, line: 2422, baseType: !921, size: 32, align: 32, offset: 3936)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1128, file: !35, line: 2423, baseType: !1547, size: 64, align: 64, offset: 3968)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1549)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1550)
!1550 = !{!1551, !1552, !1553, !1554}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1549, file: !35, line: 827, baseType: !921, size: 32, align: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1549, file: !35, line: 828, baseType: !921, size: 32, align: 32, offset: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1549, file: !35, line: 829, baseType: !921, size: 32, align: 32, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1549, file: !35, line: 830, baseType: !906, size: 32, align: 32, offset: 96)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1128, file: !35, line: 2430, baseType: !1285, size: 64, align: 64, offset: 4032)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1128, file: !35, line: 2437, baseType: !1285, size: 64, align: 64, offset: 4096)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1128, file: !35, line: 2444, baseType: !906, size: 32, align: 32, offset: 4160)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1128, file: !35, line: 2451, baseType: !906, size: 32, align: 32, offset: 4192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1128, file: !35, line: 2458, baseType: !921, size: 32, align: 32, offset: 4224)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1128, file: !35, line: 2469, baseType: !921, size: 32, align: 32, offset: 4256)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1128, file: !35, line: 2475, baseType: !921, size: 32, align: 32, offset: 4288)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1128, file: !35, line: 2481, baseType: !921, size: 32, align: 32, offset: 4320)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1128, file: !35, line: 2485, baseType: !921, size: 32, align: 32, offset: 4352)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1128, file: !35, line: 2489, baseType: !921, size: 32, align: 32, offset: 4384)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1128, file: !35, line: 2493, baseType: !921, size: 32, align: 32, offset: 4416)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1128, file: !35, line: 2501, baseType: !921, size: 32, align: 32, offset: 4448)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1128, file: !35, line: 2506, baseType: !921, size: 32, align: 32, offset: 4480)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1128, file: !35, line: 2510, baseType: !921, size: 32, align: 32, offset: 4512)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1128, file: !35, line: 2514, baseType: !1285, size: 64, align: 64, offset: 4544)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1128, file: !35, line: 2528, baseType: !1571, size: 64, align: 64, offset: 4608)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{null, !1463, !1144, !921, !921}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1128, file: !35, line: 2534, baseType: !921, size: 32, align: 32, offset: 4672)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1128, file: !35, line: 2545, baseType: !921, size: 32, align: 32, offset: 4704)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1128, file: !35, line: 2547, baseType: !921, size: 32, align: 32, offset: 4736)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1128, file: !35, line: 2549, baseType: !921, size: 32, align: 32, offset: 4768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1128, file: !35, line: 2551, baseType: !921, size: 32, align: 32, offset: 4800)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1128, file: !35, line: 2553, baseType: !921, size: 32, align: 32, offset: 4832)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1128, file: !35, line: 2555, baseType: !921, size: 32, align: 32, offset: 4864)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1128, file: !35, line: 2557, baseType: !921, size: 32, align: 32, offset: 4896)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1128, file: !35, line: 2559, baseType: !921, size: 32, align: 32, offset: 4928)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1128, file: !35, line: 2563, baseType: !921, size: 32, align: 32, offset: 4960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1128, file: !35, line: 2571, baseType: !1281, size: 64, align: 64, offset: 4992)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1128, file: !35, line: 2579, baseType: !1281, size: 64, align: 64, offset: 5056)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1128, file: !35, line: 2586, baseType: !921, size: 32, align: 32, offset: 5120)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1128, file: !35, line: 2615, baseType: !921, size: 32, align: 32, offset: 5152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1128, file: !35, line: 2627, baseType: !921, size: 32, align: 32, offset: 5184)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1128, file: !35, line: 2637, baseType: !921, size: 32, align: 32, offset: 5216)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1128, file: !35, line: 2681, baseType: !921, size: 32, align: 32, offset: 5248)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1128, file: !35, line: 2709, baseType: !1285, size: 64, align: 64, offset: 5312)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1128, file: !35, line: 2716, baseType: !1593, size: 64, align: 64, offset: 5376)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1603, !1608, !1612, !1613, !1614, !1615, !1621, !1622, !1623, !1624, !1625}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !35, line: 3642, baseType: !1137, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1595, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1595, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1595, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1595, file: !35, line: 3669, baseType: !921, size: 32, align: 32, offset: 160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1595, file: !35, line: 3682, baseType: !1420, size: 64, align: 64, offset: 192)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1595, file: !35, line: 3698, baseType: !1604, size: 64, align: 64, offset: 256)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!921, !1126, !1607, !916}
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1595, file: !35, line: 3712, baseType: !1609, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!921, !1126, !921, !1607, !916}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1595, file: !35, line: 3726, baseType: !1604, size: 64, align: 64, offset: 384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1595, file: !35, line: 3737, baseType: !1224, size: 64, align: 64, offset: 448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1595, file: !35, line: 3746, baseType: !921, size: 32, align: 32, offset: 512)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1595, file: !35, line: 3757, baseType: !1616, size: 64, align: 64, offset: 576)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !1619}
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1595, file: !35, line: 3766, baseType: !1224, size: 64, align: 64, offset: 640)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1595, file: !35, line: 3774, baseType: !1224, size: 64, align: 64, offset: 704)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1595, file: !35, line: 3780, baseType: !921, size: 32, align: 32, offset: 768)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1595, file: !35, line: 3785, baseType: !921, size: 32, align: 32, offset: 800)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1595, file: !35, line: 3795, baseType: !1626, size: 64, align: 64, offset: 832)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!921, !1126, !1296}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1128, file: !35, line: 2728, baseType: !1144, size: 64, align: 64, offset: 5440)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1128, file: !35, line: 2735, baseType: !1349, size: 512, align: 64, offset: 5504)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1128, file: !35, line: 2742, baseType: !921, size: 32, align: 32, offset: 6016)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1128, file: !35, line: 2755, baseType: !921, size: 32, align: 32, offset: 6048)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1128, file: !35, line: 2776, baseType: !921, size: 32, align: 32, offset: 6080)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1128, file: !35, line: 2783, baseType: !921, size: 32, align: 32, offset: 6112)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1128, file: !35, line: 2791, baseType: !921, size: 32, align: 32, offset: 6144)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1128, file: !35, line: 2802, baseType: !1423, size: 64, align: 64, offset: 6208)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1128, file: !35, line: 2811, baseType: !921, size: 32, align: 32, offset: 6272)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1128, file: !35, line: 2821, baseType: !921, size: 32, align: 32, offset: 6304)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1128, file: !35, line: 2830, baseType: !921, size: 32, align: 32, offset: 6336)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1128, file: !35, line: 2840, baseType: !921, size: 32, align: 32, offset: 6368)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1128, file: !35, line: 2851, baseType: !1642, size: 64, align: 64, offset: 6400)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!921, !1463, !1645, !1144, !1405, !921, !921}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!921, !1463, !1144}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1128, file: !35, line: 2871, baseType: !1649, size: 64, align: 64, offset: 6464)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!921, !1463, !1652, !1144, !1405, !921}
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!921, !1463, !1144, !921, !921}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1128, file: !35, line: 2878, baseType: !921, size: 32, align: 32, offset: 6528)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1128, file: !35, line: 2885, baseType: !921, size: 32, align: 32, offset: 6560)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1128, file: !35, line: 3005, baseType: !921, size: 32, align: 32, offset: 6592)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1128, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1128, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1128, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1128, file: !35, line: 3037, baseType: !1247, size: 64, align: 64, offset: 6720)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1128, file: !35, line: 3038, baseType: !921, size: 32, align: 32, offset: 6784)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1128, file: !35, line: 3050, baseType: !1207, size: 64, align: 64, offset: 6848)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1128, file: !35, line: 3065, baseType: !921, size: 32, align: 32, offset: 6912)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1128, file: !35, line: 3083, baseType: !921, size: 32, align: 32, offset: 6944)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1128, file: !35, line: 3092, baseType: !1190, size: 64, align: 32, offset: 6976)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1128, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1128, file: !35, line: 3106, baseType: !1190, size: 64, align: 32, offset: 7072)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1128, file: !35, line: 3113, baseType: !1670, size: 64, align: 64, offset: 7168)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1672)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1673)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1674)
!1674 = !{!1675, !1676, !1677, !1678, !1679, !1680, !1683}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1673, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1673, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1673, file: !35, line: 720, baseType: !1137, size: 64, align: 64, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1673, file: !35, line: 724, baseType: !1137, size: 64, align: 64, offset: 128)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1673, file: !35, line: 728, baseType: !921, size: 32, align: 32, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1673, file: !35, line: 734, baseType: !1681, size: 64, align: 64, offset: 256)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1673, file: !35, line: 739, baseType: !1684, size: 64, align: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1128, file: !35, line: 3129, baseType: !1285, size: 64, align: 64, offset: 7232)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1128, file: !35, line: 3130, baseType: !1285, size: 64, align: 64, offset: 7296)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1128, file: !35, line: 3131, baseType: !1285, size: 64, align: 64, offset: 7360)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1128, file: !35, line: 3132, baseType: !1285, size: 64, align: 64, offset: 7424)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1128, file: !35, line: 3139, baseType: !1281, size: 64, align: 64, offset: 7488)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1128, file: !35, line: 3147, baseType: !921, size: 32, align: 32, offset: 7552)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1128, file: !35, line: 3165, baseType: !921, size: 32, align: 32, offset: 7584)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1128, file: !35, line: 3172, baseType: !921, size: 32, align: 32, offset: 7616)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1128, file: !35, line: 3180, baseType: !921, size: 32, align: 32, offset: 7648)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1128, file: !35, line: 3191, baseType: !1499, size: 64, align: 64, offset: 7680)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1128, file: !35, line: 3199, baseType: !1247, size: 64, align: 64, offset: 7744)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1128, file: !35, line: 3207, baseType: !1281, size: 64, align: 64, offset: 7808)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1128, file: !35, line: 3214, baseType: !918, size: 32, align: 32, offset: 7872)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1128, file: !35, line: 3224, baseType: !1314, size: 64, align: 64, offset: 7936)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1128, file: !35, line: 3225, baseType: !921, size: 32, align: 32, offset: 8000)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1128, file: !35, line: 3249, baseType: !1296, size: 64, align: 64, offset: 8064)
