; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h261data.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h261data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }

@ff_h261_mba_code = constant [35 x i8] c"\01\03\02\03\02\03\02\07\06\0B\0A\09\08\07\06\17\16\15\14\13\12#\22! \1F\1E\1D\1C\1B\1A\19\18\0F\01", align 16
@ff_h261_mba_bits = constant [35 x i8] c"\01\03\03\04\04\05\05\07\07\08\08\08\08\08\08\0A\0A\0A\0A\0A\0A\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\0B\10", align 16
@ff_h261_mtype_code = constant [10 x i8] c"\01\01\01\01\01\01\01\01\01\01", align 1
@ff_h261_mtype_bits = constant [10 x i8] c"\04\07\01\05\09\08\0A\03\02\06", align 1
@ff_h261_mtype_map = constant [10 x i32] [i32 1, i32 65537, i32 131072, i32 196608, i32 8, i32 131080, i32 196616, i32 8388616, i32 8519688, i32 8585224], align 16
@ff_h261_mv_tab = constant [17 x [2 x i8]] [[2 x i8] c"\01\01", [2 x i8] c"\01\02", [2 x i8] c"\01\03", [2 x i8] c"\01\04", [2 x i8] c"\03\06", [2 x i8] c"\05\07", [2 x i8] c"\04\07", [2 x i8] c"\03\07", [2 x i8] c"\0B\09", [2 x i8] c"\0A\09", [2 x i8] c"\09\09", [2 x i8] c"\11\0A", [2 x i8] c"\10\0A", [2 x i8] c"\0F\0A", [2 x i8] c"\0E\0A", [2 x i8] c"\0D\0A", [2 x i8] c"\0C\0A"], align 16
@ff_h261_cbp_tab = constant [63 x [2 x i8]] [[2 x i8] c"\0B\05", [2 x i8] c"\09\05", [2 x i8] c"\0D\06", [2 x i8] c"\0D\04", [2 x i8] c"\17\07", [2 x i8] c"\13\07", [2 x i8] c"\1F\08", [2 x i8] c"\0C\04", [2 x i8] c"\16\07", [2 x i8] c"\12\07", [2 x i8] c"\1E\08", [2 x i8] c"\13\05", [2 x i8] c"\1B\08", [2 x i8] c"\17\08", [2 x i8] c"\13\08", [2 x i8] c"\0B\04", [2 x i8] c"\15\07", [2 x i8] c"\11\07", [2 x i8] c"\1D\08", [2 x i8] c"\11\05", [2 x i8] c"\19\08", [2 x i8] c"\15\08", [2 x i8] c"\11\08", [2 x i8] c"\0F\06", [2 x i8] c"\0F\08", [2 x i8] c"\0D\08", [2 x i8] c"\03\09", [2 x i8] c"\0F\05", [2 x i8] c"\0B\08", [2 x i8] c"\07\08", [2 x i8] c"\07\09", [2 x i8] c"\0A\04", [2 x i8] c"\14\07", [2 x i8] c"\10\07", [2 x i8] c"\1C\08", [2 x i8] c"\0E\06", [2 x i8] c"\0E\08", [2 x i8] c"\0C\08", [2 x i8] c"\02\09", [2 x i8] c"\10\05", [2 x i8] c"\18\08", [2 x i8] c"\14\08", [2 x i8] c"\10\08", [2 x i8] c"\0E\05", [2 x i8] c"\0A\08", [2 x i8] c"\06\08", [2 x i8] c"\06\09", [2 x i8] c"\12\05", [2 x i8] c"\1A\08", [2 x i8] c"\16\08", [2 x i8] c"\12\08", [2 x i8] c"\0D\05", [2 x i8] c"\09\08", [2 x i8] c"\05\08", [2 x i8] c"\05\09", [2 x i8] c"\0C\05", [2 x i8] c"\08\08", [2 x i8] c"\04\08", [2 x i8] c"\04\09", [2 x i8] c"\07\03", [2 x i8] c"\0A\05", [2 x i8] c"\08\05", [2 x i8] c"\0C\06"], align 16
@h261_tcoeff_vlc = internal constant [65 x [2 x i16]] [[2 x i16] [i16 2, i16 2], [2 x i16] [i16 3, i16 2], [2 x i16] [i16 4, i16 4], [2 x i16] [i16 5, i16 5], [2 x i16] [i16 6, i16 7], [2 x i16] [i16 38, i16 8], [2 x i16] [i16 33, i16 8], [2 x i16] [i16 10, i16 10], [2 x i16] [i16 29, i16 12], [2 x i16] [i16 24, i16 12], [2 x i16] [i16 19, i16 12], [2 x i16] [i16 16, i16 12], [2 x i16] [i16 26, i16 13], [2 x i16] [i16 25, i16 13], [2 x i16] [i16 24, i16 13], [2 x i16] [i16 23, i16 13], [2 x i16] [i16 3, i16 3], [2 x i16] [i16 6, i16 6], [2 x i16] [i16 37, i16 8], [2 x i16] [i16 12, i16 10], [2 x i16] [i16 27, i16 12], [2 x i16] [i16 22, i16 13], [2 x i16] [i16 21, i16 13], [2 x i16] [i16 5, i16 4], [2 x i16] [i16 4, i16 7], [2 x i16] [i16 11, i16 10], [2 x i16] [i16 20, i16 12], [2 x i16] [i16 20, i16 13], [2 x i16] [i16 7, i16 5], [2 x i16] [i16 36, i16 8], [2 x i16] [i16 28, i16 12], [2 x i16] [i16 19, i16 13], [2 x i16] [i16 6, i16 5], [2 x i16] [i16 15, i16 10], [2 x i16] [i16 18, i16 12], [2 x i16] [i16 7, i16 6], [2 x i16] [i16 9, i16 10], [2 x i16] [i16 18, i16 13], [2 x i16] [i16 5, i16 6], [2 x i16] [i16 30, i16 12], [2 x i16] [i16 4, i16 6], [2 x i16] [i16 21, i16 12], [2 x i16] [i16 7, i16 7], [2 x i16] [i16 17, i16 12], [2 x i16] [i16 5, i16 7], [2 x i16] [i16 17, i16 13], [2 x i16] [i16 39, i16 8], [2 x i16] [i16 16, i16 13], [2 x i16] [i16 35, i16 8], [2 x i16] [i16 34, i16 8], [2 x i16] [i16 32, i16 8], [2 x i16] [i16 14, i16 10], [2 x i16] [i16 13, i16 10], [2 x i16] [i16 8, i16 10], [2 x i16] [i16 31, i16 12], [2 x i16] [i16 26, i16 12], [2 x i16] [i16 25, i16 12], [2 x i16] [i16 23, i16 12], [2 x i16] [i16 22, i16 12], [2 x i16] [i16 31, i16 13], [2 x i16] [i16 30, i16 13], [2 x i16] [i16 29, i16 13], [2 x i16] [i16 28, i16 13], [2 x i16] [i16 27, i16 13], [2 x i16] [i16 1, i16 6]], align 16
@h261_tcoeff_run = internal constant [64 x i8] c"\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\01\01\01\01\01\01\01\02\02\02\02\02\03\03\03\03\04\04\04\05\05\05\06\06\07\07\08\08\09\09\0A\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A", align 16
@h261_tcoeff_level = internal constant [64 x i8] c"\00\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\01\02\03\04\05\06\07\01\02\03\04\05\01\02\03\04\01\02\03\01\02\03\01\02\01\02\01\02\01\02\01\02\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01", align 16
@ff_h261_rl_tcoeff = global %struct.RLTable { i32 64, i32 64, [2 x i16]* getelementptr inbounds ([65 x [2 x i16]], [65 x [2 x i16]]* @h261_tcoeff_vlc, i32 0, i32 0), i8* getelementptr inbounds ([64 x i8], [64 x i8]* @h261_tcoeff_run, i32 0, i32 0), i8* getelementptr inbounds ([64 x i8], [64 x i8]* @h261_tcoeff_level, i32 0, i32 0), [2 x i8*] zeroinitializer, [2 x i8*] zeroinitializer, [2 x i8*] zeroinitializer, [32 x %struct.RL_VLC_ELEM*] zeroinitializer }, align 8

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!82, !83}
!llvm.ident = !{!84}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h261data.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !13, !14, !18, !19, !23, !28, !32, !73, !77, !81}
!4 = distinct !DIGlobalVariable(name: "ff_h261_mba_code", scope: !0, file: !5, line: 34, type: !6, isLocal: false, isDefinition: true, variable: [35 x i8]* @ff_h261_mba_code)
!5 = !DIFile(filename: "libavcodec/h261data.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 280, align: 8, elements: !11)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 48, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12}
!12 = !DISubrange(count: 35)
!13 = distinct !DIGlobalVariable(name: "ff_h261_mba_bits", scope: !0, file: !5, line: 48, type: !6, isLocal: false, isDefinition: true, variable: [35 x i8]* @ff_h261_mba_bits)
!14 = distinct !DIGlobalVariable(name: "ff_h261_mtype_code", scope: !0, file: !5, line: 63, type: !15, isLocal: false, isDefinition: true, variable: [10 x i8]* @ff_h261_mtype_code)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 80, align: 8, elements: !16)
!16 = !{!17}
!17 = !DISubrange(count: 10)
!18 = distinct !DIGlobalVariable(name: "ff_h261_mtype_bits", scope: !0, file: !5, line: 69, type: !15, isLocal: false, isDefinition: true, variable: [10 x i8]* @ff_h261_mtype_bits)
!19 = distinct !DIGlobalVariable(name: "ff_h261_mtype_map", scope: !0, file: !5, line: 75, type: !20, isLocal: false, isDefinition: true, variable: [10 x i32]* @ff_h261_mtype_map)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 320, align: 32, elements: !16)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = distinct !DIGlobalVariable(name: "ff_h261_mv_tab", scope: !0, file: !5, line: 89, type: !24, isLocal: false, isDefinition: true, variable: [17 x [2 x i8]]* @ff_h261_mv_tab)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 272, align: 8, elements: !25)
!25 = !{!26, !27}
!26 = !DISubrange(count: 17)
!27 = !DISubrange(count: 2)
!28 = distinct !DIGlobalVariable(name: "ff_h261_cbp_tab", scope: !0, file: !5, line: 95, type: !29, isLocal: false, isDefinition: true, variable: [63 x [2 x i8]]* @ff_h261_cbp_tab)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1008, align: 8, elements: !30)
!30 = !{!31, !27}
!31 = !DISubrange(count: 63)
!32 = distinct !DIGlobalVariable(name: "ff_h261_rl_tcoeff", scope: !0, file: !5, line: 150, type: !33, isLocal: false, isDefinition: true, variable: %struct.RLTable* @ff_h261_rl_tcoeff)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "RLTable", file: !34, line: 49, baseType: !35)
!34 = !DIFile(filename: "libavcodec/rl.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RLTable", file: !34, line: 39, size: 2688, align: 64, elements: !36)
!36 = !{!37, !38, !39, !46, !51, !52, !55, !58, !59}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !35, file: !34, line: 40, baseType: !22, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !35, file: !34, line: 41, baseType: !22, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "table_vlc", scope: !35, file: !34, line: 42, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, align: 16, elements: !45)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 49, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !{!27}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "table_run", scope: !35, file: !34, line: 43, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !9, line: 36, baseType: !50)
!50 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "table_level", scope: !35, file: !34, line: 44, baseType: !47, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "index_run", scope: !35, file: !34, line: 45, baseType: !53, size: 128, align: 64, offset: 256)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, align: 64, elements: !45)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max_level", scope: !35, file: !34, line: 46, baseType: !56, size: 128, align: 64, offset: 384)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, align: 64, elements: !45)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "max_run", scope: !35, file: !34, line: 47, baseType: !56, size: 128, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rl_vlc", scope: !35, file: !34, line: 48, baseType: !60, size: 2048, align: 64, offset: 640)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, align: 64, elements: !71)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "RL_VLC_ELEM", file: !63, line: 36, baseType: !64)
!63 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RL_VLC_ELEM", file: !63, line: 32, size: 32, align: 16, elements: !65)
!65 = !{!66, !69, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !64, file: !63, line: 33, baseType: !67, size: 16, align: 16)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !9, line: 37, baseType: !68)
!68 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, file: !63, line: 34, baseType: !49, size: 8, align: 8, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !64, file: !63, line: 35, baseType: !8, size: 8, align: 8, offset: 24)
!71 = !{!72}
!72 = !DISubrange(count: 32)
!73 = distinct !DIGlobalVariable(name: "h261_tcoeff_vlc", scope: !0, file: !5, line: 107, type: !74, isLocal: true, isDefinition: true, variable: [65 x [2 x i16]]* @h261_tcoeff_vlc)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2080, align: 16, elements: !75)
!75 = !{!76, !27}
!76 = !DISubrange(count: 65)
!77 = distinct !DIGlobalVariable(name: "h261_tcoeff_run", scope: !0, file: !5, line: 138, type: !78, isLocal: true, isDefinition: true, variable: [64 x i8]* @h261_tcoeff_run)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = distinct !DIGlobalVariable(name: "h261_tcoeff_level", scope: !0, file: !5, line: 127, type: !78, isLocal: true, isDefinition: true, variable: [64 x i8]* @h261_tcoeff_level)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
