; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_slice.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_slice.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!938 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME", value: 0)
!939 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_FIELD", value: 1)
!940 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_FIELD", value: 2)
!941 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_BOTTOM", value: 3)
!942 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_TOP", value: 4)
!943 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_BOTTOM_TOP", value: 5)
!944 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_TOP_BOTTOM", value: 6)
!945 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_DOUBLING", value: 7)
!946 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_TRIPLING", value: 8)
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 60, size: 32, align: 32, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955}
!949 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_CHECKERBOARD", value: 0)
!950 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_COLUMN", value: 1)
!951 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_ROW", value: 2)
!952 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_SIDE_BY_SIDE", value: 3)
!953 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_TOP_BOTTOM", value: 4)
!954 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_TEMPORAL", value: 5)
!955 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_2D", value: 6)
!956 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !957, line: 33, size: 32, align: 32, elements: !958)
!957 = !DIFile(filename: "libavcodec/h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990}
!959 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED", value: 0)
!960 = !DIEnumerator(name: "H264_NAL_SLICE", value: 1)
!961 = !DIEnumerator(name: "H264_NAL_DPA", value: 2)
!962 = !DIEnumerator(name: "H264_NAL_DPB", value: 3)
!963 = !DIEnumerator(name: "H264_NAL_DPC", value: 4)
!964 = !DIEnumerator(name: "H264_NAL_IDR_SLICE", value: 5)
!965 = !DIEnumerator(name: "H264_NAL_SEI", value: 6)
!966 = !DIEnumerator(name: "H264_NAL_SPS", value: 7)
!967 = !DIEnumerator(name: "H264_NAL_PPS", value: 8)
!968 = !DIEnumerator(name: "H264_NAL_AUD", value: 9)
!969 = !DIEnumerator(name: "H264_NAL_END_SEQUENCE", value: 10)
!970 = !DIEnumerator(name: "H264_NAL_END_STREAM", value: 11)
!971 = !DIEnumerator(name: "H264_NAL_FILLER_DATA", value: 12)
!972 = !DIEnumerator(name: "H264_NAL_SPS_EXT", value: 13)
!973 = !DIEnumerator(name: "H264_NAL_PREFIX", value: 14)
!974 = !DIEnumerator(name: "H264_NAL_SUB_SPS", value: 15)
!975 = !DIEnumerator(name: "H264_NAL_DPS", value: 16)
!976 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!977 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!978 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!979 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!980 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!981 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!982 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!983 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!984 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!985 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!986 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!987 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!988 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!989 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!990 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!991 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DType", file: !992, line: 51, size: 32, align: 32, elements: !993)
!992 = !DIFile(filename: "./libavutil/stereo3d.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001}
!994 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!995 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!996 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!997 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!998 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!999 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!1000 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!1001 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !992, line: 147, size: 32, align: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!1005 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!1006 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!1007 = !{!1008, !1078, !1017, !1015, !1149, !1150, !1037, !1062, !1156, !1159, !1162, !1163, !1166, !1167, !1169, !1192, !1193, !1205, !1207, !1218, !1219, !1226, !1227, !1228}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPS", file: !1011, line: 136, baseType: !1012)
!1011 = !DIFile(filename: "libavcodec/h264_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PPS", file: !1011, line: 109, size: 1391104, align: 64, elements: !1013)
!1013 = !{!1014, !1016, !1018, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1031, !1032, !1033, !1034, !1035, !1043, !1047, !1051, !1052, !1056, !1060, !1064, !1067, !1073}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !1012, file: !1011, line: 110, baseType: !1015, size: 32, align: 32)
!1015 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !1012, file: !1011, line: 111, baseType: !1017, size: 32, align: 32, offset: 32)
!1017 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present", scope: !1012, file: !1011, line: 112, baseType: !1017, size: 32, align: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_count", scope: !1012, file: !1011, line: 113, baseType: !1017, size: 32, align: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mb_slice_group_map_type", scope: !1012, file: !1011, line: 114, baseType: !1017, size: 32, align: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1012, file: !1011, line: 115, baseType: !1022, size: 64, align: 32, offset: 160)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 64, align: 32, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 2)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred", scope: !1012, file: !1011, line: 116, baseType: !1017, size: 32, align: 32, offset: 224)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !1012, file: !1011, line: 117, baseType: !1017, size: 32, align: 32, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "init_qp", scope: !1012, file: !1011, line: 118, baseType: !1017, size: 32, align: 32, offset: 288)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init_qs", scope: !1012, file: !1011, line: 119, baseType: !1017, size: 32, align: 32, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !1012, file: !1011, line: 120, baseType: !1030, size: 64, align: 32, offset: 352)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 64, align: 32, elements: !1023)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_parameters_present", scope: !1012, file: !1011, line: 121, baseType: !1017, size: 32, align: 32, offset: 416)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred", scope: !1012, file: !1011, line: 122, baseType: !1017, size: 32, align: 32, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present", scope: !1012, file: !1011, line: 123, baseType: !1017, size: 32, align: 32, offset: 480)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode", scope: !1012, file: !1011, line: 124, baseType: !1017, size: 32, align: 32, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !1012, file: !1011, line: 125, baseType: !1036, size: 768, align: 8, offset: 544)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 768, align: 8, elements: !1040)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1038, line: 48, baseType: !1039)
!1038 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1039 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1040 = !{!1041, !1042}
!1041 = !DISubrange(count: 6)
!1042 = !DISubrange(count: 16)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !1012, file: !1011, line: 126, baseType: !1044, size: 3072, align: 8, offset: 1312)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 3072, align: 8, elements: !1045)
!1045 = !{!1041, !1046}
!1046 = !DISubrange(count: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !1012, file: !1011, line: 127, baseType: !1048, size: 1408, align: 8, offset: 4384)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 1408, align: 8, elements: !1049)
!1049 = !{!1024, !1050}
!1050 = !DISubrange(count: 88)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_diff", scope: !1012, file: !1011, line: 128, baseType: !1017, size: 32, align: 32, offset: 5792)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1012, file: !1011, line: 129, baseType: !1053, size: 32768, align: 8, offset: 5824)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 32768, align: 8, elements: !1054)
!1054 = !{!1055}
!1055 = !DISubrange(count: 4096)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1012, file: !1011, line: 130, baseType: !1057, size: 64, align: 64, offset: 38592)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1058, line: 216, baseType: !1059)
!1058 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1059 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_buffer", scope: !1012, file: !1011, line: 132, baseType: !1061, size: 270336, align: 32, offset: 38656)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 270336, align: 32, elements: !1063)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1038, line: 51, baseType: !1015)
!1063 = !{!1041, !1050, !1042}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_buffer", scope: !1012, file: !1011, line: 133, baseType: !1065, size: 1081344, align: 32, offset: 308992)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 1081344, align: 32, elements: !1066)
!1066 = !{!1041, !1050, !1046}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_coeff", scope: !1012, file: !1011, line: 134, baseType: !1068, size: 384, align: 64, offset: 1390336)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 384, align: 64, elements: !1072)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 512, align: 32, elements: !1071)
!1071 = !{!1042}
!1072 = !{!1041}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_coeff", scope: !1012, file: !1011, line: 135, baseType: !1074, size: 384, align: 64, offset: 1390720)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 384, align: 64, elements: !1072)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 2048, align: 32, elements: !1077)
!1077 = !{!1046}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPS", file: !1011, line: 104, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SPS", file: !1011, line: 44, size: 42432, align: 64, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !1081, file: !1011, line: 45, baseType: !1015, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !1081, file: !1011, line: 46, baseType: !1017, size: 32, align: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !1081, file: !1011, line: 47, baseType: !1017, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !1081, file: !1011, line: 48, baseType: !1017, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "transform_bypass", scope: !1081, file: !1011, line: 49, baseType: !1017, size: 32, align: 32, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num", scope: !1081, file: !1011, line: 50, baseType: !1017, size: 32, align: 32, offset: 160)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "poc_type", scope: !1081, file: !1011, line: 51, baseType: !1017, size: 32, align: 32, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !1081, file: !1011, line: 52, baseType: !1017, size: 32, align: 32, offset: 224)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !1081, file: !1011, line: 53, baseType: !1017, size: 32, align: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !1081, file: !1011, line: 54, baseType: !1017, size: 32, align: 32, offset: 288)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !1081, file: !1011, line: 55, baseType: !1017, size: 32, align: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "poc_cycle_length", scope: !1081, file: !1011, line: 56, baseType: !1017, size: 32, align: 32, offset: 352)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_count", scope: !1081, file: !1011, line: 57, baseType: !1017, size: 32, align: 32, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_allowed_flag", scope: !1081, file: !1011, line: 58, baseType: !1017, size: 32, align: 32, offset: 416)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1081, file: !1011, line: 59, baseType: !1017, size: 32, align: 32, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1081, file: !1011, line: 61, baseType: !1017, size: 32, align: 32, offset: 480)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !1081, file: !1011, line: 62, baseType: !1017, size: 32, align: 32, offset: 512)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff", scope: !1081, file: !1011, line: 63, baseType: !1017, size: 32, align: 32, offset: 544)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !1081, file: !1011, line: 64, baseType: !1017, size: 32, align: 32, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1081, file: !1011, line: 65, baseType: !1017, size: 32, align: 32, offset: 608)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1081, file: !1011, line: 68, baseType: !1015, size: 32, align: 32, offset: 640)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1081, file: !1011, line: 69, baseType: !1015, size: 32, align: 32, offset: 672)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1081, file: !1011, line: 70, baseType: !1015, size: 32, align: 32, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1081, file: !1011, line: 71, baseType: !1015, size: 32, align: 32, offset: 736)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !1081, file: !1011, line: 72, baseType: !1017, size: 32, align: 32, offset: 768)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !1081, file: !1011, line: 73, baseType: !1109, size: 64, align: 32, offset: 800)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1110, line: 61, baseType: !1111)
!1110 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1110, line: 58, size: 64, align: 32, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1111, file: !1110, line: 59, baseType: !1017, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1111, file: !1110, line: 60, baseType: !1017, size: 32, align: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !1081, file: !1011, line: 74, baseType: !1017, size: 32, align: 32, offset: 864)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "full_range", scope: !1081, file: !1011, line: 75, baseType: !1017, size: 32, align: 32, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !1081, file: !1011, line: 76, baseType: !1017, size: 32, align: 32, offset: 928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1081, file: !1011, line: 77, baseType: !809, size: 32, align: 32, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1081, file: !1011, line: 78, baseType: !827, size: 32, align: 32, offset: 992)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1081, file: !1011, line: 79, baseType: !851, size: 32, align: 32, offset: 1024)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !1081, file: !1011, line: 80, baseType: !1017, size: 32, align: 32, offset: 1056)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !1081, file: !1011, line: 81, baseType: !1062, size: 32, align: 32, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !1081, file: !1011, line: 82, baseType: !1062, size: 32, align: 32, offset: 1120)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !1081, file: !1011, line: 83, baseType: !1017, size: 32, align: 32, offset: 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !1081, file: !1011, line: 84, baseType: !1126, size: 4096, align: 16, offset: 1184)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 4096, align: 16, elements: !1128)
!1127 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1128 = !{!1129}
!1129 = !DISubrange(count: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !1081, file: !1011, line: 85, baseType: !1017, size: 32, align: 32, offset: 5280)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !1081, file: !1011, line: 86, baseType: !1017, size: 32, align: 32, offset: 5312)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix_present", scope: !1081, file: !1011, line: 87, baseType: !1017, size: 32, align: 32, offset: 5344)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !1081, file: !1011, line: 88, baseType: !1036, size: 768, align: 8, offset: 5376)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !1081, file: !1011, line: 89, baseType: !1044, size: 3072, align: 8, offset: 6144)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !1081, file: !1011, line: 90, baseType: !1017, size: 32, align: 32, offset: 9216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !1081, file: !1011, line: 91, baseType: !1017, size: 32, align: 32, offset: 9248)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !1081, file: !1011, line: 92, baseType: !1017, size: 32, align: 32, offset: 9280)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !1081, file: !1011, line: 93, baseType: !1017, size: 32, align: 32, offset: 9312)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !1081, file: !1011, line: 94, baseType: !1017, size: 32, align: 32, offset: 9344)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length", scope: !1081, file: !1011, line: 95, baseType: !1017, size: 32, align: 32, offset: 9376)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length", scope: !1081, file: !1011, line: 96, baseType: !1017, size: 32, align: 32, offset: 9408)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length", scope: !1081, file: !1011, line: 97, baseType: !1017, size: 32, align: 32, offset: 9440)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma", scope: !1081, file: !1011, line: 98, baseType: !1017, size: 32, align: 32, offset: 9472)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !1081, file: !1011, line: 99, baseType: !1017, size: 32, align: 32, offset: 9504)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "residual_color_transform_flag", scope: !1081, file: !1011, line: 100, baseType: !1017, size: 32, align: 32, offset: 9536)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set_flags", scope: !1081, file: !1011, line: 101, baseType: !1017, size: 32, align: 32, offset: 9568)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !1011, line: 102, baseType: !1053, size: 32768, align: 8, offset: 9600)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1081, file: !1011, line: 103, baseType: !1057, size: 64, align: 64, offset: 42368)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1153, line: 221, size: 32, align: 8, elements: !1154)
!1153 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1154 = !{!1155}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1152, file: !1153, line: 221, baseType: !1062, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1160, line: 197, baseType: !1161)
!1160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1161 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 32, align: 16, elements: !1023)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1160, line: 195, baseType: !1127)
!1166 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1160, line: 196, baseType: !1017)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias64", file: !1153, line: 34, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1153, line: 27, size: 64, align: 64, elements: !1173)
!1173 = !{!1174, !1176, !1178, !1184, !1188, !1189}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !1172, file: !1153, line: 28, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1038, line: 55, baseType: !1059)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !1172, file: !1153, line: 29, baseType: !1177, size: 64, align: 32)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 64, align: 32, elements: !1023)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !1172, file: !1153, line: 30, baseType: !1179, size: 64, align: 16)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 64, align: 16, elements: !1182)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1038, line: 49, baseType: !1181)
!1181 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1182 = !{!1183}
!1183 = !DISubrange(count: 4)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !1172, file: !1153, line: 31, baseType: !1185, size: 64, align: 8)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 64, align: 8, elements: !1186)
!1186 = !{!1187}
!1187 = !DISubrange(count: 8)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "f64", scope: !1172, file: !1153, line: 32, baseType: !1166, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !1172, file: !1153, line: 33, baseType: !1190, size: 64, align: 32)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 64, align: 32, elements: !1023)
!1191 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v", scope: !1196, file: !1195, line: 69, size: 128, align: 64, elements: !1202)
!1195 = !DIFile(filename: "./libavutil/x86/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1196 = distinct !DISubprogram(name: "AV_COPY128", scope: !1195, file: !1195, line: 67, type: !1197, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1201)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !1149, !1199}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1201 = !{}
!1202 = !{!1203}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1194, file: !1195, line: 69, baseType: !1204, size: 128, align: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 128, align: 64, elements: !1023)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias32", file: !1153, line: 41, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1153, line: 36, size: 32, align: 32, elements: !1211)
!1211 = !{!1212, !1213, !1215, !1217}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !1210, file: !1153, line: 37, baseType: !1062, size: 32, align: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !1210, file: !1153, line: 38, baseType: !1214, size: 32, align: 16)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 32, align: 16, elements: !1023)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !1210, file: !1153, line: 39, baseType: !1216, size: 32, align: 8)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 32, align: 8, elements: !1182)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !1210, file: !1153, line: 40, baseType: !1191, size: 32, align: 32)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v", scope: !1221, file: !1195, line: 85, size: 128, align: 64, elements: !1224)
!1221 = distinct !DISubprogram(name: "AV_ZERO128", scope: !1195, file: !1195, line: 83, type: !1222, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1201)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null, !1149}
!1224 = !{!1225}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1220, file: !1195, line: 85, baseType: !1204, size: 128, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1229 = !{!1230, !1235, !1239, !1240, !1241}
!1230 = distinct !DIGlobalVariable(name: "field_scan", scope: !0, file: !1231, line: 51, type: !1232, isLocal: true, isDefinition: true, variable: [17 x i8]* @field_scan)
!1231 = !DIFile(filename: "libavcodec/h264_slice.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 136, align: 8, elements: !1233)
!1233 = !{!1234}
!1234 = !DISubrange(count: 17)
!1235 = distinct !DIGlobalVariable(name: "zigzag_scan8x8_cavlc", scope: !0, file: !1231, line: 97, type: !1236, isLocal: true, isDefinition: true, variable: [65 x i8]* @zigzag_scan8x8_cavlc)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 520, align: 8, elements: !1237)
!1237 = !{!1238}
!1238 = !DISubrange(count: 65)
!1239 = distinct !DIGlobalVariable(name: "field_scan8x8", scope: !0, file: !1231, line: 58, type: !1236, isLocal: true, isDefinition: true, variable: [65 x i8]* @field_scan8x8)
!1240 = distinct !DIGlobalVariable(name: "field_scan8x8_cavlc", scope: !0, file: !1231, line: 77, type: !1236, isLocal: true, isDefinition: true, variable: [65 x i8]* @field_scan8x8_cavlc)
!1241 = distinct !DIGlobalVariable(name: "scan8", scope: !0, file: !926, line: 644, type: !1242, isLocal: true, isDefinition: true, variable: [51 x i8]* @scan8)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 408, align: 8, elements: !1243)
!1243 = !{!1244}
!1244 = !DISubrange(count: 51)
!1245 = !{i32 2, !"Dwarf Version", i32 4}
!1246 = !{i32 2, !"Debug Info Version", i32 3}
!1247 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1248 = distinct !DISubprogram(name: "ff_h264_update_thread_context", scope: !1231, file: !1231, line: 288, type: !1249, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1201)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!1017, !1251, !2858}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1254)
!1254 = !{!1255, !1330, !1331, !1332, !1580, !1581, !1582, !1583, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1736, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2796, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1253, file: !57, line: 1561, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1260)
!1260 = !{!1261, !1265, !1269, !1289, !1290, !1291, !1292, !1296, !1302, !1304, !1308}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1259, file: !26, line: 72, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1264 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1259, file: !26, line: 78, baseType: !1266, size: 64, align: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!1262, !1149}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1259, file: !26, line: 85, baseType: !1270, size: 64, align: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1285, !1286, !1287, !1288}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1272, file: !4, line: 247, baseType: !1262, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1272, file: !4, line: 253, baseType: !1262, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1272, file: !4, line: 259, baseType: !1017, size: 32, align: 32, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1272, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1272, file: !4, line: 271, baseType: !1279, size: 64, align: 64, offset: 192)
!1279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1272, file: !4, line: 265, size: 64, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1279, file: !4, line: 266, baseType: !1159, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1279, file: !4, line: 267, baseType: !1166, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1279, file: !4, line: 268, baseType: !1262, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1279, file: !4, line: 270, baseType: !1109, size: 64, align: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1272, file: !4, line: 272, baseType: !1166, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1272, file: !4, line: 273, baseType: !1166, size: 64, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1272, file: !4, line: 275, baseType: !1017, size: 32, align: 32, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1272, file: !4, line: 300, baseType: !1262, size: 64, align: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1259, file: !26, line: 93, baseType: !1017, size: 32, align: 32, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1259, file: !26, line: 99, baseType: !1017, size: 32, align: 32, offset: 224)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1259, file: !26, line: 108, baseType: !1017, size: 32, align: 32, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1259, file: !26, line: 113, baseType: !1293, size: 64, align: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1149, !1149, !1149}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1259, file: !26, line: 123, baseType: !1297, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!1300, !1300}
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1259, file: !26, line: 130, baseType: !1303, size: 32, align: 32, offset: 448)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1259, file: !26, line: 136, baseType: !1305, size: 64, align: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!1303, !1149}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1259, file: !26, line: 142, baseType: !1309, size: 64, align: 64, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!1017, !1312, !1149, !1262, !1017}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1315)
!1315 = !{!1316, !1328, !1329}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1314, file: !4, line: 360, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1320, file: !4, line: 307, baseType: !1262, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1320, file: !4, line: 313, baseType: !1166, size: 64, align: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1320, file: !4, line: 313, baseType: !1166, size: 64, align: 64, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1320, file: !4, line: 318, baseType: !1166, size: 64, align: 64, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1320, file: !4, line: 318, baseType: !1166, size: 64, align: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1320, file: !4, line: 323, baseType: !1017, size: 32, align: 32, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1314, file: !4, line: 364, baseType: !1017, size: 32, align: 32, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1314, file: !4, line: 368, baseType: !1017, size: 32, align: 32, offset: 96)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1253, file: !57, line: 1562, baseType: !1017, size: 32, align: 32, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1253, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1253, file: !57, line: 1565, baseType: !1333, size: 64, align: 64, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341, !1342, !1345, !1348, !1351, !1354, !1357, !1358, !1359, !1367, !1368, !1369, !1371, !1375, !1377, !1386, !1390, !1391, !1432, !1551, !1555, !1556, !1560, !1564, !1569, !1573, !1574, !1575}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1335, file: !57, line: 3475, baseType: !1262, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1335, file: !57, line: 3480, baseType: !1262, size: 64, align: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1335, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1335, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1335, file: !57, line: 3487, baseType: !1017, size: 32, align: 32, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1335, file: !57, line: 3488, baseType: !1343, size: 64, align: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1335, file: !57, line: 3489, baseType: !1346, size: 64, align: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1335, file: !57, line: 3490, baseType: !1349, size: 64, align: 64, offset: 384)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1335, file: !57, line: 3491, baseType: !1352, size: 64, align: 64, offset: 448)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1335, file: !57, line: 3492, baseType: !1355, size: 64, align: 64, offset: 512)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1175)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1335, file: !57, line: 3493, baseType: !1037, size: 8, align: 8, offset: 576)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1335, file: !57, line: 3494, baseType: !1256, size: 64, align: 64, offset: 640)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1335, file: !57, line: 3495, baseType: !1360, size: 64, align: 64, offset: 704)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1364)
!1364 = !{!1365, !1366}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1363, file: !57, line: 3402, baseType: !1017, size: 32, align: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1363, file: !57, line: 3403, baseType: !1262, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1335, file: !57, line: 3507, baseType: !1262, size: 64, align: 64, offset: 768)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1335, file: !57, line: 3516, baseType: !1017, size: 32, align: 32, offset: 832)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1335, file: !57, line: 3517, baseType: !1370, size: 64, align: 64, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1335, file: !57, line: 3527, baseType: !1372, size: 64, align: 64, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!1017, !1251}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1335, file: !57, line: 3535, baseType: !1376, size: 64, align: 64, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1335, file: !57, line: 3541, baseType: !1378, size: 64, align: 64, offset: 1088)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1380)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1382, line: 223, size: 128, align: 64, elements: !1383)
!1382 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1383 = !{!1384, !1385}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1381, file: !1382, line: 224, baseType: !1157, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1381, file: !1382, line: 225, baseType: !1157, size: 64, align: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1335, file: !57, line: 3549, baseType: !1387, size: 64, align: 64, offset: 1152)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !1370}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1335, file: !57, line: 3551, baseType: !1372, size: 64, align: 64, offset: 1216)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1335, file: !57, line: 3552, baseType: !1392, size: 64, align: 64, offset: 1280)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!1017, !1251, !1226, !1017, !1395}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1402, !1403, !1431}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1397, file: !57, line: 3921, baseType: !1180, size: 16, align: 16)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1397, file: !57, line: 3922, baseType: !1062, size: 32, align: 32, offset: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1397, file: !57, line: 3923, baseType: !1062, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1397, file: !57, line: 3924, baseType: !1015, size: 32, align: 32, offset: 96)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1397, file: !57, line: 3925, baseType: !1404, size: 64, align: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1413, !1414, !1422, !1424, !1426, !1427, !1429, !1430}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1407, file: !57, line: 3886, baseType: !1017, size: 32, align: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1407, file: !57, line: 3887, baseType: !1017, size: 32, align: 32, offset: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1407, file: !57, line: 3888, baseType: !1017, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1407, file: !57, line: 3889, baseType: !1017, size: 32, align: 32, offset: 96)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1407, file: !57, line: 3890, baseType: !1017, size: 32, align: 32, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1407, file: !57, line: 3897, baseType: !1415, size: 768, align: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1417)
!1417 = !{!1418, !1420}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1416, file: !57, line: 3855, baseType: !1419, size: 512, align: 64)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 512, align: 64, elements: !1186)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1416, file: !57, line: 3857, baseType: !1421, size: 256, align: 32, offset: 512)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 256, align: 32, elements: !1186)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1407, file: !57, line: 3903, baseType: !1423, size: 256, align: 64, offset: 960)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 256, align: 64, elements: !1182)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1407, file: !57, line: 3904, baseType: !1425, size: 128, align: 32, offset: 1216)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 128, align: 32, elements: !1182)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1407, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1407, file: !57, line: 3908, baseType: !1428, size: 64, align: 64, offset: 1408)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1407, file: !57, line: 3915, baseType: !1428, size: 64, align: 64, offset: 1472)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1407, file: !57, line: 3917, baseType: !1017, size: 32, align: 32, offset: 1536)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1397, file: !57, line: 3926, baseType: !1159, size: 64, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1335, file: !57, line: 3564, baseType: !1433, size: 64, align: 64, offset: 1344)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!1017, !1251, !1436, !1470, !1550}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1439)
!1439 = !{!1440, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1466, !1467, !1468, !1469}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1438, file: !57, line: 1451, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1443, line: 94, baseType: !1444)
!1443 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1443, line: 81, size: 192, align: 64, elements: !1445)
!1445 = !{!1446, !1450, !1451}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1444, file: !1443, line: 82, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1443, line: 73, baseType: !1449)
!1449 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1443, line: 73, flags: DIFlagFwdDecl)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1444, file: !1443, line: 89, baseType: !1226, size: 64, align: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1444, file: !1443, line: 93, baseType: !1017, size: 32, align: 32, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1438, file: !57, line: 1461, baseType: !1159, size: 64, align: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1438, file: !57, line: 1467, baseType: !1159, size: 64, align: 64, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1438, file: !57, line: 1468, baseType: !1226, size: 64, align: 64, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1438, file: !57, line: 1469, baseType: !1017, size: 32, align: 32, offset: 256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1438, file: !57, line: 1470, baseType: !1017, size: 32, align: 32, offset: 288)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1438, file: !57, line: 1474, baseType: !1017, size: 32, align: 32, offset: 320)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1438, file: !57, line: 1479, baseType: !1459, size: 64, align: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1462)
!1462 = !{!1463, !1464, !1465}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1461, file: !57, line: 1412, baseType: !1226, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1461, file: !57, line: 1413, baseType: !1017, size: 32, align: 32, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1461, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1438, file: !57, line: 1480, baseType: !1017, size: 32, align: 32, offset: 448)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1438, file: !57, line: 1486, baseType: !1159, size: 64, align: 64, offset: 512)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1438, file: !57, line: 1488, baseType: !1159, size: 64, align: 64, offset: 576)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1438, file: !57, line: 1497, baseType: !1159, size: 64, align: 64, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1472)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1504, !1506, !1507, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1473, file: !780, line: 282, baseType: !1419, size: 512, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1473, file: !780, line: 299, baseType: !1421, size: 256, align: 32, offset: 512)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1473, file: !780, line: 315, baseType: !1478, size: 64, align: 64, offset: 768)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1473, file: !780, line: 326, baseType: !1017, size: 32, align: 32, offset: 832)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1473, file: !780, line: 326, baseType: !1017, size: 32, align: 32, offset: 864)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1473, file: !780, line: 334, baseType: !1017, size: 32, align: 32, offset: 896)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1473, file: !780, line: 341, baseType: !1017, size: 32, align: 32, offset: 928)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1473, file: !780, line: 346, baseType: !1017, size: 32, align: 32, offset: 960)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1473, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1473, file: !780, line: 356, baseType: !1109, size: 64, align: 32, offset: 1024)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1473, file: !780, line: 361, baseType: !1159, size: 64, align: 64, offset: 1088)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1473, file: !780, line: 369, baseType: !1159, size: 64, align: 64, offset: 1152)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1473, file: !780, line: 377, baseType: !1159, size: 64, align: 64, offset: 1216)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1473, file: !780, line: 382, baseType: !1017, size: 32, align: 32, offset: 1280)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1473, file: !780, line: 386, baseType: !1017, size: 32, align: 32, offset: 1312)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1473, file: !780, line: 391, baseType: !1017, size: 32, align: 32, offset: 1344)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1473, file: !780, line: 396, baseType: !1149, size: 64, align: 64, offset: 1408)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1473, file: !780, line: 403, baseType: !1494, size: 512, align: 64, offset: 1472)
!1494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 512, align: 64, elements: !1186)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1473, file: !780, line: 410, baseType: !1017, size: 32, align: 32, offset: 1984)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1473, file: !780, line: 415, baseType: !1017, size: 32, align: 32, offset: 2016)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1473, file: !780, line: 420, baseType: !1017, size: 32, align: 32, offset: 2048)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1473, file: !780, line: 425, baseType: !1017, size: 32, align: 32, offset: 2080)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1473, file: !780, line: 435, baseType: !1159, size: 64, align: 64, offset: 2112)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1473, file: !780, line: 440, baseType: !1017, size: 32, align: 32, offset: 2176)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1473, file: !780, line: 445, baseType: !1175, size: 64, align: 64, offset: 2240)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1473, file: !780, line: 459, baseType: !1503, size: 512, align: 64, offset: 2304)
!1503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1441, size: 512, align: 64, elements: !1186)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1473, file: !780, line: 473, baseType: !1505, size: 64, align: 64, offset: 2816)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1473, file: !780, line: 477, baseType: !1017, size: 32, align: 32, offset: 2880)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1473, file: !780, line: 479, baseType: !1508, size: 64, align: 64, offset: 2944)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1511)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1516, !1521}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1511, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1511, file: !780, line: 203, baseType: !1226, size: 64, align: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1511, file: !780, line: 204, baseType: !1017, size: 32, align: 32, offset: 128)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1511, file: !780, line: 205, baseType: !1517, size: 64, align: 64, offset: 192)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1519, line: 86, baseType: !1520)
!1519 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1520 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1519, line: 86, flags: DIFlagFwdDecl)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1511, file: !780, line: 206, baseType: !1441, size: 64, align: 64, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1473, file: !780, line: 480, baseType: !1017, size: 32, align: 32, offset: 3008)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1473, file: !780, line: 505, baseType: !1017, size: 32, align: 32, offset: 3040)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1473, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1473, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1473, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1473, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1473, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1473, file: !780, line: 532, baseType: !1159, size: 64, align: 64, offset: 3264)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1473, file: !780, line: 539, baseType: !1159, size: 64, align: 64, offset: 3328)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1473, file: !780, line: 547, baseType: !1159, size: 64, align: 64, offset: 3392)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1473, file: !780, line: 554, baseType: !1517, size: 64, align: 64, offset: 3456)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1473, file: !780, line: 563, baseType: !1017, size: 32, align: 32, offset: 3520)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1473, file: !780, line: 572, baseType: !1017, size: 32, align: 32, offset: 3552)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1473, file: !780, line: 581, baseType: !1017, size: 32, align: 32, offset: 3584)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1473, file: !780, line: 588, baseType: !1537, size: 64, align: 64, offset: 3648)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1160, line: 194, baseType: !1539)
!1539 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1473, file: !780, line: 593, baseType: !1017, size: 32, align: 32, offset: 3712)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1473, file: !780, line: 596, baseType: !1017, size: 32, align: 32, offset: 3744)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1473, file: !780, line: 599, baseType: !1441, size: 64, align: 64, offset: 3776)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1473, file: !780, line: 605, baseType: !1441, size: 64, align: 64, offset: 3840)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1473, file: !780, line: 616, baseType: !1441, size: 64, align: 64, offset: 3904)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1473, file: !780, line: 626, baseType: !1057, size: 64, align: 64, offset: 3968)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1473, file: !780, line: 627, baseType: !1057, size: 64, align: 64, offset: 4032)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1473, file: !780, line: 628, baseType: !1057, size: 64, align: 64, offset: 4096)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1473, file: !780, line: 629, baseType: !1057, size: 64, align: 64, offset: 4160)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1473, file: !780, line: 645, baseType: !1441, size: 64, align: 64, offset: 4224)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1335, file: !57, line: 3566, baseType: !1552, size: 64, align: 64, offset: 1408)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!1017, !1251, !1149, !1550, !1436}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1335, file: !57, line: 3567, baseType: !1372, size: 64, align: 64, offset: 1472)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1335, file: !57, line: 3576, baseType: !1557, size: 64, align: 64, offset: 1536)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!1017, !1251, !1470}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1335, file: !57, line: 3577, baseType: !1561, size: 64, align: 64, offset: 1600)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!1017, !1251, !1436}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1335, file: !57, line: 3584, baseType: !1565, size: 64, align: 64, offset: 1664)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!1017, !1251, !1568}
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1335, file: !57, line: 3589, baseType: !1570, size: 64, align: 64, offset: 1728)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1251}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1335, file: !57, line: 3594, baseType: !1017, size: 32, align: 32, offset: 1792)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1335, file: !57, line: 3600, baseType: !1262, size: 64, align: 64, offset: 1856)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1335, file: !57, line: 3609, baseType: !1576, size: 64, align: 64, offset: 1920)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1579)
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1253, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1253, file: !57, line: 1581, baseType: !1015, size: 32, align: 32, offset: 224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1253, file: !57, line: 1583, baseType: !1149, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1253, file: !57, line: 1591, baseType: !1584, size: 64, align: 64, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1382, line: 129, size: 1664, align: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1609, !1610, !1616, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1585, file: !1382, line: 136, baseType: !1017, size: 32, align: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1585, file: !1382, line: 151, baseType: !1017, size: 32, align: 32, offset: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1585, file: !1382, line: 157, baseType: !1017, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1585, file: !1382, line: 159, baseType: !1568, size: 64, align: 64, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1585, file: !1382, line: 161, baseType: !1592, size: 64, align: 64, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1382, line: 117, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1382, line: 100, size: 832, align: 64, elements: !1595)
!1595 = !{!1596, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1594, file: !1382, line: 105, baseType: !1597, size: 256, align: 64)
!1597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1598, size: 256, align: 64, elements: !1182)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1443, line: 238, baseType: !1600)
!1600 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1443, line: 238, flags: DIFlagFwdDecl)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1594, file: !1382, line: 110, baseType: !1017, size: 32, align: 32, offset: 256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1594, file: !1382, line: 111, baseType: !1017, size: 32, align: 32, offset: 288)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1594, file: !1382, line: 111, baseType: !1017, size: 32, align: 32, offset: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1594, file: !1382, line: 112, baseType: !1421, size: 256, align: 32, offset: 352)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1594, file: !1382, line: 113, baseType: !1425, size: 128, align: 32, offset: 608)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1594, file: !1382, line: 114, baseType: !1017, size: 32, align: 32, offset: 736)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1594, file: !1382, line: 115, baseType: !1017, size: 32, align: 32, offset: 768)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1594, file: !1382, line: 116, baseType: !1017, size: 32, align: 32, offset: 800)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1585, file: !1382, line: 163, baseType: !1149, size: 64, align: 64, offset: 256)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1585, file: !1382, line: 165, baseType: !1611, size: 128, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1382, line: 122, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1382, line: 119, size: 128, align: 64, elements: !1613)
!1613 = !{!1614, !1615}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1612, file: !1382, line: 120, baseType: !1436, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1612, file: !1382, line: 121, baseType: !1568, size: 64, align: 64, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1585, file: !1382, line: 166, baseType: !1617, size: 128, align: 64, offset: 448)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1382, line: 127, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1382, line: 124, size: 128, align: 64, elements: !1619)
!1619 = !{!1620, !1693}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1618, file: !1382, line: 125, baseType: !1621, size: 64, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1624)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1625)
!1625 = !{!1626, !1627, !1651, !1655, !1656, !1690, !1691, !1692}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1624, file: !57, line: 5751, baseType: !1256, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1624, file: !57, line: 5756, baseType: !1628, size: 64, align: 64, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1631)
!1631 = !{!1632, !1633, !1636, !1637, !1638, !1642, !1646, !1650}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1630, file: !57, line: 5797, baseType: !1262, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1630, file: !57, line: 5804, baseType: !1634, size: 64, align: 64, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1630, file: !57, line: 5815, baseType: !1256, size: 64, align: 64, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1630, file: !57, line: 5825, baseType: !1017, size: 32, align: 32, offset: 192)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1630, file: !57, line: 5826, baseType: !1639, size: 64, align: 64, offset: 256)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!1017, !1622}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1630, file: !57, line: 5827, baseType: !1643, size: 64, align: 64, offset: 320)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!1017, !1622, !1436}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1630, file: !57, line: 5828, baseType: !1647, size: 64, align: 64, offset: 384)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1622}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1630, file: !57, line: 5829, baseType: !1647, size: 64, align: 64, offset: 448)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1624, file: !57, line: 5762, baseType: !1652, size: 64, align: 64, offset: 128)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1654)
!1654 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1624, file: !57, line: 5768, baseType: !1149, size: 64, align: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1624, file: !57, line: 5775, baseType: !1657, size: 64, align: 64, offset: 256)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1659, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1659, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1659, file: !57, line: 3948, baseType: !1062, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1659, file: !57, line: 3958, baseType: !1226, size: 64, align: 64, offset: 128)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1659, file: !57, line: 3962, baseType: !1017, size: 32, align: 32, offset: 192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1659, file: !57, line: 3968, baseType: !1017, size: 32, align: 32, offset: 224)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1659, file: !57, line: 3973, baseType: !1159, size: 64, align: 64, offset: 256)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1659, file: !57, line: 3986, baseType: !1017, size: 32, align: 32, offset: 320)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1659, file: !57, line: 3999, baseType: !1017, size: 32, align: 32, offset: 352)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1659, file: !57, line: 4004, baseType: !1017, size: 32, align: 32, offset: 384)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1659, file: !57, line: 4005, baseType: !1017, size: 32, align: 32, offset: 416)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1659, file: !57, line: 4010, baseType: !1017, size: 32, align: 32, offset: 448)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1659, file: !57, line: 4011, baseType: !1017, size: 32, align: 32, offset: 480)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1659, file: !57, line: 4020, baseType: !1109, size: 64, align: 32, offset: 512)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1659, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1659, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1659, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1659, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1659, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1659, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1659, file: !57, line: 4039, baseType: !1017, size: 32, align: 32, offset: 768)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1659, file: !57, line: 4046, baseType: !1175, size: 64, align: 64, offset: 832)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1659, file: !57, line: 4050, baseType: !1017, size: 32, align: 32, offset: 896)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1659, file: !57, line: 4054, baseType: !1017, size: 32, align: 32, offset: 928)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1659, file: !57, line: 4061, baseType: !1017, size: 32, align: 32, offset: 960)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1659, file: !57, line: 4065, baseType: !1017, size: 32, align: 32, offset: 992)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1659, file: !57, line: 4073, baseType: !1017, size: 32, align: 32, offset: 1024)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1659, file: !57, line: 4080, baseType: !1017, size: 32, align: 32, offset: 1056)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1659, file: !57, line: 4084, baseType: !1017, size: 32, align: 32, offset: 1088)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1624, file: !57, line: 5781, baseType: !1657, size: 64, align: 64, offset: 320)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1624, file: !57, line: 5787, baseType: !1109, size: 64, align: 32, offset: 384)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1624, file: !57, line: 5793, baseType: !1109, size: 64, align: 32, offset: 448)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1618, file: !1382, line: 126, baseType: !1017, size: 32, align: 32, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1585, file: !1382, line: 172, baseType: !1436, size: 64, align: 64, offset: 576)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1585, file: !1382, line: 177, baseType: !1226, size: 64, align: 64, offset: 640)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1585, file: !1382, line: 178, baseType: !1015, size: 32, align: 32, offset: 704)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1585, file: !1382, line: 180, baseType: !1149, size: 64, align: 64, offset: 768)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1585, file: !1382, line: 185, baseType: !1017, size: 32, align: 32, offset: 832)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1585, file: !1382, line: 190, baseType: !1149, size: 64, align: 64, offset: 896)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1585, file: !1382, line: 195, baseType: !1017, size: 32, align: 32, offset: 960)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1585, file: !1382, line: 200, baseType: !1436, size: 64, align: 64, offset: 1024)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1585, file: !1382, line: 201, baseType: !1017, size: 32, align: 32, offset: 1088)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1585, file: !1382, line: 202, baseType: !1568, size: 64, align: 64, offset: 1152)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1585, file: !1382, line: 203, baseType: !1017, size: 32, align: 32, offset: 1216)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1585, file: !1382, line: 205, baseType: !1017, size: 32, align: 32, offset: 1248)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1585, file: !1382, line: 206, baseType: !1017, size: 32, align: 32, offset: 1280)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1585, file: !1382, line: 209, baseType: !1057, size: 64, align: 64, offset: 1344)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1585, file: !1382, line: 212, baseType: !1057, size: 64, align: 64, offset: 1408)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1585, file: !1382, line: 213, baseType: !1568, size: 64, align: 64, offset: 1472)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1585, file: !1382, line: 215, baseType: !1017, size: 32, align: 32, offset: 1536)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1585, file: !1382, line: 217, baseType: !1017, size: 32, align: 32, offset: 1568)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1585, file: !1382, line: 220, baseType: !1017, size: 32, align: 32, offset: 1600)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1253, file: !57, line: 1598, baseType: !1149, size: 64, align: 64, offset: 384)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1253, file: !57, line: 1606, baseType: !1159, size: 64, align: 64, offset: 448)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1253, file: !57, line: 1614, baseType: !1017, size: 32, align: 32, offset: 512)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1253, file: !57, line: 1622, baseType: !1017, size: 32, align: 32, offset: 544)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1253, file: !57, line: 1628, baseType: !1017, size: 32, align: 32, offset: 576)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1253, file: !57, line: 1636, baseType: !1017, size: 32, align: 32, offset: 608)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1253, file: !57, line: 1643, baseType: !1017, size: 32, align: 32, offset: 640)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1253, file: !57, line: 1657, baseType: !1226, size: 64, align: 64, offset: 704)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1253, file: !57, line: 1658, baseType: !1017, size: 32, align: 32, offset: 768)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1253, file: !57, line: 1679, baseType: !1109, size: 64, align: 32, offset: 800)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1253, file: !57, line: 1688, baseType: !1017, size: 32, align: 32, offset: 864)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1253, file: !57, line: 1712, baseType: !1017, size: 32, align: 32, offset: 896)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1253, file: !57, line: 1729, baseType: !1017, size: 32, align: 32, offset: 928)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1253, file: !57, line: 1729, baseType: !1017, size: 32, align: 32, offset: 960)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1253, file: !57, line: 1744, baseType: !1017, size: 32, align: 32, offset: 992)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1253, file: !57, line: 1744, baseType: !1017, size: 32, align: 32, offset: 1024)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1253, file: !57, line: 1751, baseType: !1017, size: 32, align: 32, offset: 1056)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1253, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1253, file: !57, line: 1791, baseType: !1732, size: 64, align: 64, offset: 1152)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{null, !1735, !1470, !1550, !1017, !1017, !1017}
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1253, file: !57, line: 1808, baseType: !1737, size: 64, align: 64, offset: 1216)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DISubroutineType(types: !1739)
!1739 = !{!516, !1735, !1346}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1253, file: !57, line: 1816, baseType: !1017, size: 32, align: 32, offset: 1280)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1253, file: !57, line: 1825, baseType: !1191, size: 32, align: 32, offset: 1312)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1253, file: !57, line: 1830, baseType: !1017, size: 32, align: 32, offset: 1344)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1253, file: !57, line: 1838, baseType: !1191, size: 32, align: 32, offset: 1376)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1253, file: !57, line: 1846, baseType: !1017, size: 32, align: 32, offset: 1408)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1253, file: !57, line: 1851, baseType: !1017, size: 32, align: 32, offset: 1440)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1253, file: !57, line: 1861, baseType: !1191, size: 32, align: 32, offset: 1472)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1253, file: !57, line: 1868, baseType: !1191, size: 32, align: 32, offset: 1504)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1253, file: !57, line: 1875, baseType: !1191, size: 32, align: 32, offset: 1536)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1253, file: !57, line: 1882, baseType: !1191, size: 32, align: 32, offset: 1568)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1253, file: !57, line: 1889, baseType: !1191, size: 32, align: 32, offset: 1600)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1253, file: !57, line: 1896, baseType: !1191, size: 32, align: 32, offset: 1632)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1253, file: !57, line: 1903, baseType: !1191, size: 32, align: 32, offset: 1664)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1253, file: !57, line: 1910, baseType: !1017, size: 32, align: 32, offset: 1696)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1253, file: !57, line: 1915, baseType: !1017, size: 32, align: 32, offset: 1728)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1253, file: !57, line: 1926, baseType: !1550, size: 64, align: 64, offset: 1792)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1253, file: !57, line: 1935, baseType: !1109, size: 64, align: 32, offset: 1856)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1253, file: !57, line: 1942, baseType: !1017, size: 32, align: 32, offset: 1920)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1253, file: !57, line: 1948, baseType: !1017, size: 32, align: 32, offset: 1952)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1253, file: !57, line: 1954, baseType: !1017, size: 32, align: 32, offset: 1984)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1253, file: !57, line: 1960, baseType: !1017, size: 32, align: 32, offset: 2016)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1253, file: !57, line: 1984, baseType: !1017, size: 32, align: 32, offset: 2048)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1253, file: !57, line: 1991, baseType: !1017, size: 32, align: 32, offset: 2080)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1253, file: !57, line: 1996, baseType: !1017, size: 32, align: 32, offset: 2112)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1253, file: !57, line: 2004, baseType: !1017, size: 32, align: 32, offset: 2144)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1253, file: !57, line: 2011, baseType: !1017, size: 32, align: 32, offset: 2176)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1253, file: !57, line: 2018, baseType: !1017, size: 32, align: 32, offset: 2208)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1253, file: !57, line: 2027, baseType: !1017, size: 32, align: 32, offset: 2240)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1253, file: !57, line: 2034, baseType: !1017, size: 32, align: 32, offset: 2272)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1253, file: !57, line: 2044, baseType: !1017, size: 32, align: 32, offset: 2304)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1253, file: !57, line: 2054, baseType: !1227, size: 64, align: 64, offset: 2368)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1253, file: !57, line: 2061, baseType: !1227, size: 64, align: 64, offset: 2432)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1253, file: !57, line: 2066, baseType: !1017, size: 32, align: 32, offset: 2496)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1253, file: !57, line: 2070, baseType: !1017, size: 32, align: 32, offset: 2528)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1253, file: !57, line: 2078, baseType: !1017, size: 32, align: 32, offset: 2560)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1253, file: !57, line: 2085, baseType: !1017, size: 32, align: 32, offset: 2592)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1253, file: !57, line: 2092, baseType: !1017, size: 32, align: 32, offset: 2624)
