; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--bitstream_filter.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--bitstream_filter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }

!863 = !DIEnumerator(name: "AV_PICTURE_TYPE_BI", value: 7)
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFrameSideDataType", file: !865, line: 48, size: 32, align: 32, elements: !866)
!865 = !DIFile(filename: "./libavutil/frame.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!867 = !DIEnumerator(name: "AV_FRAME_DATA_PANSCAN", value: 0)
!868 = !DIEnumerator(name: "AV_FRAME_DATA_A53_CC", value: 1)
!869 = !DIEnumerator(name: "AV_FRAME_DATA_STEREO3D", value: 2)
!870 = !DIEnumerator(name: "AV_FRAME_DATA_MATRIXENCODING", value: 3)
!871 = !DIEnumerator(name: "AV_FRAME_DATA_DOWNMIX_INFO", value: 4)
!872 = !DIEnumerator(name: "AV_FRAME_DATA_REPLAYGAIN", value: 5)
!873 = !DIEnumerator(name: "AV_FRAME_DATA_DISPLAYMATRIX", value: 6)
!874 = !DIEnumerator(name: "AV_FRAME_DATA_AFD", value: 7)
!875 = !DIEnumerator(name: "AV_FRAME_DATA_MOTION_VECTORS", value: 8)
!876 = !DIEnumerator(name: "AV_FRAME_DATA_SKIP_SAMPLES", value: 9)
!877 = !DIEnumerator(name: "AV_FRAME_DATA_AUDIO_SERVICE_TYPE", value: 10)
!878 = !DIEnumerator(name: "AV_FRAME_DATA_MASTERING_DISPLAY_METADATA", value: 11)
!879 = !DIEnumerator(name: "AV_FRAME_DATA_GOP_TIMECODE", value: 12)
!880 = !DIEnumerator(name: "AV_FRAME_DATA_SPHERICAL", value: 13)
!881 = !DIEnumerator(name: "AV_FRAME_DATA_CONTENT_LIGHT_LEVEL", value: 14)
!882 = !DIEnumerator(name: "AV_FRAME_DATA_ICC_PROFILE", value: 15)
!883 = !DIEnumerator(name: "AV_FRAME_DATA_QP_TABLE_PROPERTIES", value: 16)
!884 = !DIEnumerator(name: "AV_FRAME_DATA_QP_TABLE_DATA", value: 17)
!885 = !DIEnumerator(name: "AV_FRAME_DATA_S12M_TIMECODE", value: 18)
!886 = !DIEnumerator(name: "AV_FRAME_DATA_DYNAMIC_HDR_PLUS", value: 19)
!887 = !DIEnumerator(name: "AV_FRAME_DATA_REGIONS_OF_INTEREST", value: 20)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914}
!911 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!912 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!913 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!914 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!915 = !{!916, !917, !921, !922}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !919, line: 48, baseType: !920)
!919 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!920 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!921 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!922 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!923 = !{i32 2, !"Dwarf Version", i32 4}
!924 = !{i32 2, !"Debug Info Version", i32 3}
!925 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!926 = distinct !DISubprogram(name: "av_bitstream_filter_next", scope: !927, file: !927, line: 31, type: !928, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!927 = !DIFile(filename: "libavcodec/bitstream_filter.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !DISubroutineType(types: !929)
!929 = !{!930, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !934)
!934 = !{!935, !939, !942, !1023, !1024, !1081, !1119, !1123}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !933, file: !4, line: 5797, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !933, file: !4, line: 5804, baseType: !940, size: 64, align: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !933, file: !4, line: 5815, baseType: !943, size: 64, align: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !947)
!947 = !{!948, !949, !953, !982, !983, !984, !985, !989, !995, !997, !1001}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !946, file: !486, line: 72, baseType: !936, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !946, file: !486, line: 78, baseType: !950, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!936, !916}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !946, file: !486, line: 85, baseType: !954, size: 64, align: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !978, !979, !980, !981}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !464, line: 247, baseType: !936, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !956, file: !464, line: 253, baseType: !936, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !956, file: !464, line: 259, baseType: !921, size: 32, align: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !956, file: !464, line: 271, baseType: !963, size: 64, align: 64, offset: 192)
!963 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !956, file: !464, line: 265, size: 64, align: 64, elements: !964)
!964 = !{!965, !968, !970, !971}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !963, file: !464, line: 266, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !919, line: 40, baseType: !967)
!967 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !963, file: !464, line: 267, baseType: !969, size: 64, align: 64)
!969 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !963, file: !464, line: 268, baseType: !936, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !963, file: !464, line: 270, baseType: !972, size: 64, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !973, line: 61, baseType: !974)
!973 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !973, line: 58, size: 64, align: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !974, file: !973, line: 59, baseType: !921, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !974, file: !973, line: 60, baseType: !921, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !956, file: !464, line: 272, baseType: !969, size: 64, align: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !956, file: !464, line: 273, baseType: !969, size: 64, align: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !464, line: 275, baseType: !921, size: 32, align: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !956, file: !464, line: 300, baseType: !936, size: 64, align: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !946, file: !486, line: 93, baseType: !921, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !946, file: !486, line: 99, baseType: !921, size: 32, align: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !946, file: !486, line: 108, baseType: !921, size: 32, align: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !946, file: !486, line: 113, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!916, !916, !916}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !946, file: !486, line: 123, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !946, file: !486, line: 130, baseType: !996, size: 32, align: 32, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !946, file: !486, line: 136, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!996, !916}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !946, file: !486, line: 142, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!921, !1005, !916, !936, !921}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1008)
!1008 = !{!1009, !1021, !1022}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1007, file: !464, line: 360, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1013, file: !464, line: 307, baseType: !936, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1013, file: !464, line: 313, baseType: !969, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1013, file: !464, line: 313, baseType: !969, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1013, file: !464, line: 318, baseType: !969, size: 64, align: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1013, file: !464, line: 318, baseType: !969, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1013, file: !464, line: 323, baseType: !921, size: 32, align: 32, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1007, file: !464, line: 364, baseType: !921, size: 32, align: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1007, file: !464, line: 368, baseType: !921, size: 32, align: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !933, file: !4, line: 5825, baseType: !921, size: 32, align: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !933, file: !4, line: 5826, baseType: !1025, size: 64, align: 64, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!921, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1036, !1040, !1041, !1078, !1079, !1080}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1030, file: !4, line: 5751, baseType: !943, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1030, file: !4, line: 5756, baseType: !1034, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1030, file: !4, line: 5762, baseType: !1037, size: 64, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1039)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1030, file: !4, line: 5768, baseType: !916, size: 64, align: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1030, file: !4, line: 5775, baseType: !1042, size: 64, align: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1044, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1044, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1044, file: !4, line: 3948, baseType: !1049, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !919, line: 51, baseType: !922)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1044, file: !4, line: 3958, baseType: !917, size: 64, align: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1044, file: !4, line: 3962, baseType: !921, size: 32, align: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1044, file: !4, line: 3968, baseType: !921, size: 32, align: 32, offset: 224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1044, file: !4, line: 3973, baseType: !966, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1044, file: !4, line: 3986, baseType: !921, size: 32, align: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1044, file: !4, line: 3999, baseType: !921, size: 32, align: 32, offset: 352)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1044, file: !4, line: 4004, baseType: !921, size: 32, align: 32, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1044, file: !4, line: 4005, baseType: !921, size: 32, align: 32, offset: 416)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1044, file: !4, line: 4010, baseType: !921, size: 32, align: 32, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1044, file: !4, line: 4011, baseType: !921, size: 32, align: 32, offset: 480)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1044, file: !4, line: 4020, baseType: !972, size: 64, align: 32, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1044, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1044, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1044, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1044, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1044, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1044, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1044, file: !4, line: 4039, baseType: !921, size: 32, align: 32, offset: 768)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1044, file: !4, line: 4046, baseType: !1069, size: 64, align: 64, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !919, line: 55, baseType: !1070)
!1070 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1044, file: !4, line: 4050, baseType: !921, size: 32, align: 32, offset: 896)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1044, file: !4, line: 4054, baseType: !921, size: 32, align: 32, offset: 928)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1044, file: !4, line: 4061, baseType: !921, size: 32, align: 32, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1044, file: !4, line: 4065, baseType: !921, size: 32, align: 32, offset: 992)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1044, file: !4, line: 4073, baseType: !921, size: 32, align: 32, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1044, file: !4, line: 4080, baseType: !921, size: 32, align: 32, offset: 1056)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1044, file: !4, line: 4084, baseType: !921, size: 32, align: 32, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1030, file: !4, line: 5781, baseType: !1042, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1030, file: !4, line: 5787, baseType: !972, size: 64, align: 32, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1030, file: !4, line: 5793, baseType: !972, size: 64, align: 32, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !933, file: !4, line: 5827, baseType: !1082, size: 64, align: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!921, !1028, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1088)
!1088 = !{!1089, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1115, !1116, !1117, !1118}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1087, file: !4, line: 1451, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1092, line: 94, baseType: !1093)
!1092 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1092, line: 81, size: 192, align: 64, elements: !1094)
!1094 = !{!1095, !1099, !1100}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1093, file: !1092, line: 82, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1092, line: 73, baseType: !1098)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1092, line: 73, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1093, file: !1092, line: 89, baseType: !917, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1093, file: !1092, line: 93, baseType: !921, size: 32, align: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1087, file: !4, line: 1461, baseType: !966, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1087, file: !4, line: 1467, baseType: !966, size: 64, align: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !4, line: 1468, baseType: !917, size: 64, align: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !4, line: 1469, baseType: !921, size: 32, align: 32, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1087, file: !4, line: 1470, baseType: !921, size: 32, align: 32, offset: 288)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1087, file: !4, line: 1474, baseType: !921, size: 32, align: 32, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1087, file: !4, line: 1479, baseType: !1108, size: 64, align: 64, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1110, file: !4, line: 1412, baseType: !917, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !4, line: 1413, baseType: !921, size: 32, align: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1110, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1087, file: !4, line: 1480, baseType: !921, size: 32, align: 32, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1087, file: !4, line: 1486, baseType: !966, size: 64, align: 64, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1087, file: !4, line: 1488, baseType: !966, size: 64, align: 64, offset: 576)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1087, file: !4, line: 1497, baseType: !966, size: 64, align: 64, offset: 640)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !933, file: !4, line: 5828, baseType: !1120, size: 64, align: 64, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !1028}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !933, file: !4, line: 5829, baseType: !1120, size: 64, align: 64, offset: 448)
!1124 = !{}
!1125 = !DILocalVariable(name: "f", arg: 1, scope: !926, file: !927, line: 31, type: !930)
!1126 = !DIExpression()
!1127 = !DILocation(line: 31, column: 76, scope: !926)
!1128 = !DILocalVariable(name: "filter", scope: !926, file: !927, line: 33, type: !930)
!1129 = !DILocation(line: 33, column: 30, scope: !926)
!1130 = !DILocalVariable(name: "opaque", scope: !926, file: !927, line: 34, type: !916)
!1131 = !DILocation(line: 34, column: 11, scope: !926)
!1132 = !DILocation(line: 36, column: 5, scope: !926)
!1133 = !DILocation(line: 36, column: 12, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !926, file: !927, discriminator: 1)
!1135 = !DILocation(line: 36, column: 22, scope: !1134)
!1136 = !DILocation(line: 36, column: 19, scope: !1134)
!1137 = !DILocation(line: 36, column: 5, scope: !1134)
!1138 = !DILocation(line: 37, column: 18, scope: !926)
!1139 = !DILocation(line: 37, column: 16, scope: !926)
!1140 = !DILocation(line: 36, column: 5, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !926, file: !927, discriminator: 2)
!1142 = distinct !{!1142, !1132}
!1143 = !DILocation(line: 39, column: 12, scope: !926)
!1144 = !DILocation(line: 39, column: 5, scope: !926)
!1145 = distinct !DISubprogram(name: "av_register_bitstream_filter", scope: !927, file: !927, line: 42, type: !1146, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1149 = !DILocalVariable(name: "bsf", arg: 1, scope: !1145, file: !927, line: 42, type: !1148)
!1150 = !DILocation(line: 42, column: 54, scope: !1145)
!1151 = !DILocation(line: 44, column: 1, scope: !1145)
!1152 = distinct !DISubprogram(name: "av_bitstream_filter_init", scope: !927, file: !927, line: 51, type: !1153, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1124)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!1155, !936}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilterContext", file: !4, line: 5732, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilterContext", file: !4, line: 5722, size: 320, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1735, !1737}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1157, file: !4, line: 5723, baseType: !916, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1157, file: !4, line: 5724, baseType: !1034, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !1157, file: !4, line: 5725, baseType: !1162, size: 64, align: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !1165)
!1165 = !{!1166, !1167, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1164, file: !4, line: 5093, baseType: !916, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !1164, file: !4, line: 5094, baseType: !1168, size: 64, align: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !1170)
!1170 = !{!1171, !1175, !1176, !1180, !1691, !1695, !1699}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1169, file: !4, line: 5260, baseType: !1172, size: 160, align: 32)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 160, align: 32, elements: !1173)
!1173 = !{!1174}
!1174 = !DISubrange(count: 5)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1169, file: !4, line: 5261, baseType: !921, size: 32, align: 32, offset: 160)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !1169, file: !4, line: 5262, baseType: !1177, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!921, !1162}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !1169, file: !4, line: 5265, baseType: !1181, size: 64, align: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!921, !1162, !1184, !1690, !1383, !1586, !921}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1413, !1414, !1415, !1416, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1442, !1446, !1447, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1628, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1186, file: !4, line: 1561, baseType: !943, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1186, file: !4, line: 1562, baseType: !921, size: 32, align: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1186, file: !4, line: 1564, baseType: !506, size: 32, align: 32, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1186, file: !4, line: 1565, baseType: !1192, size: 64, align: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1200, !1201, !1204, !1207, !1210, !1213, !1216, !1217, !1218, !1226, !1227, !1228, !1230, !1234, !1240, !1245, !1249, !1250, !1297, !1384, !1388, !1389, !1393, !1397, !1402, !1406, !1407, !1408}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1194, file: !4, line: 3475, baseType: !936, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1194, file: !4, line: 3480, baseType: !936, size: 64, align: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1194, file: !4, line: 3481, baseType: !506, size: 32, align: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1194, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1194, file: !4, line: 3487, baseType: !921, size: 32, align: 32, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1194, file: !4, line: 3488, baseType: !1202, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1194, file: !4, line: 3489, baseType: !1205, size: 64, align: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1194, file: !4, line: 3490, baseType: !1208, size: 64, align: 64, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1194, file: !4, line: 3491, baseType: !1211, size: 64, align: 64, offset: 448)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1194, file: !4, line: 3492, baseType: !1214, size: 64, align: 64, offset: 512)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1194, file: !4, line: 3493, baseType: !918, size: 8, align: 8, offset: 576)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1194, file: !4, line: 3494, baseType: !943, size: 64, align: 64, offset: 640)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1194, file: !4, line: 3495, baseType: !1219, size: 64, align: 64, offset: 704)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1223)
!1223 = !{!1224, !1225}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1222, file: !4, line: 3402, baseType: !921, size: 32, align: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1222, file: !4, line: 3403, baseType: !936, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1194, file: !4, line: 3507, baseType: !936, size: 64, align: 64, offset: 768)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1194, file: !4, line: 3516, baseType: !921, size: 32, align: 32, offset: 832)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1194, file: !4, line: 3517, baseType: !1229, size: 64, align: 64, offset: 896)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1194, file: !4, line: 3527, baseType: !1231, size: 64, align: 64, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!921, !1184}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1194, file: !4, line: 3535, baseType: !1235, size: 64, align: 64, offset: 1024)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!921, !1184, !1238}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1194, file: !4, line: 3541, baseType: !1241, size: 64, align: 64, offset: 1088)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1244)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1194, file: !4, line: 3549, baseType: !1246, size: 64, align: 64, offset: 1152)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !1229}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1194, file: !4, line: 3551, baseType: !1231, size: 64, align: 64, offset: 1216)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1194, file: !4, line: 3552, baseType: !1251, size: 64, align: 64, offset: 1280)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!921, !1184, !917, !921, !1254}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1257)
!1257 = !{!1258, !1261, !1262, !1263, !1264, !1296}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1256, file: !4, line: 3921, baseType: !1259, size: 16, align: 16)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !919, line: 49, baseType: !1260)
!1260 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1256, file: !4, line: 3922, baseType: !1049, size: 32, align: 32, offset: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1256, file: !4, line: 3923, baseType: !1049, size: 32, align: 32, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1256, file: !4, line: 3924, baseType: !922, size: 32, align: 32, offset: 96)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1256, file: !4, line: 3925, baseType: !1265, size: 64, align: 64, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274, !1275, !1285, !1289, !1291, !1292, !1294, !1295}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1268, file: !4, line: 3886, baseType: !921, size: 32, align: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1268, file: !4, line: 3887, baseType: !921, size: 32, align: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1268, file: !4, line: 3888, baseType: !921, size: 32, align: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1268, file: !4, line: 3889, baseType: !921, size: 32, align: 32, offset: 96)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1268, file: !4, line: 3890, baseType: !921, size: 32, align: 32, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1268, file: !4, line: 3897, baseType: !1276, size: 768, align: 64, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1278)
!1278 = !{!1279, !1283}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1277, file: !4, line: 3855, baseType: !1280, size: 512, align: 64)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 512, align: 64, elements: !1281)
!1281 = !{!1282}
!1282 = !DISubrange(count: 8)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1277, file: !4, line: 3857, baseType: !1284, size: 256, align: 32, offset: 512)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 256, align: 32, elements: !1281)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !4, line: 3903, baseType: !1286, size: 256, align: 64, offset: 960)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 64, elements: !1287)
!1287 = !{!1288}
!1288 = !DISubrange(count: 4)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1268, file: !4, line: 3904, baseType: !1290, size: 128, align: 32, offset: 1216)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 128, align: 32, elements: !1287)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !4, line: 3906, baseType: !848, size: 32, align: 32, offset: 1344)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1268, file: !4, line: 3908, baseType: !1293, size: 64, align: 64, offset: 1408)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1268, file: !4, line: 3915, baseType: !1293, size: 64, align: 64, offset: 1472)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1268, file: !4, line: 3917, baseType: !921, size: 32, align: 32, offset: 1536)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1256, file: !4, line: 3926, baseType: !966, size: 64, align: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1194, file: !4, line: 3564, baseType: !1298, size: 64, align: 64, offset: 1344)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!921, !1184, !1085, !1301, !1383}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1303)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !865, line: 646, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !865, line: 268, size: 4288, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1335, !1337, !1338, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1371, !1372, !1373, !1374, !1375, !1376, !1379, !1380, !1381, !1382}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1304, file: !865, line: 282, baseType: !1280, size: 512, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1304, file: !865, line: 299, baseType: !1284, size: 256, align: 32, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1304, file: !865, line: 315, baseType: !1309, size: 64, align: 64, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1304, file: !865, line: 326, baseType: !921, size: 32, align: 32, offset: 832)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1304, file: !865, line: 326, baseType: !921, size: 32, align: 32, offset: 864)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1304, file: !865, line: 334, baseType: !921, size: 32, align: 32, offset: 896)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1304, file: !865, line: 341, baseType: !921, size: 32, align: 32, offset: 928)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1304, file: !865, line: 346, baseType: !921, size: 32, align: 32, offset: 960)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1304, file: !865, line: 351, baseType: !854, size: 32, align: 32, offset: 992)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1304, file: !865, line: 356, baseType: !972, size: 64, align: 32, offset: 1024)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1304, file: !865, line: 361, baseType: !966, size: 64, align: 64, offset: 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1304, file: !865, line: 369, baseType: !966, size: 64, align: 64, offset: 1152)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1304, file: !865, line: 377, baseType: !966, size: 64, align: 64, offset: 1216)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1304, file: !865, line: 382, baseType: !921, size: 32, align: 32, offset: 1280)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1304, file: !865, line: 386, baseType: !921, size: 32, align: 32, offset: 1312)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1304, file: !865, line: 391, baseType: !921, size: 32, align: 32, offset: 1344)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1304, file: !865, line: 396, baseType: !916, size: 64, align: 64, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1304, file: !865, line: 403, baseType: !1325, size: 512, align: 64, offset: 1472)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 512, align: 64, elements: !1281)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1304, file: !865, line: 410, baseType: !921, size: 32, align: 32, offset: 1984)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1304, file: !865, line: 415, baseType: !921, size: 32, align: 32, offset: 2016)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1304, file: !865, line: 420, baseType: !921, size: 32, align: 32, offset: 2048)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1304, file: !865, line: 425, baseType: !921, size: 32, align: 32, offset: 2080)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1304, file: !865, line: 435, baseType: !966, size: 64, align: 64, offset: 2112)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1304, file: !865, line: 440, baseType: !921, size: 32, align: 32, offset: 2176)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1304, file: !865, line: 445, baseType: !1069, size: 64, align: 64, offset: 2240)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1304, file: !865, line: 459, baseType: !1334, size: 512, align: 64, offset: 2304)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 512, align: 64, elements: !1281)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1304, file: !865, line: 473, baseType: !1336, size: 64, align: 64, offset: 2816)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1304, file: !865, line: 477, baseType: !921, size: 32, align: 32, offset: 2880)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1304, file: !865, line: 479, baseType: !1339, size: 64, align: 64, offset: 2944)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !865, line: 207, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !865, line: 201, size: 320, align: 64, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1347, !1352}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1342, file: !865, line: 202, baseType: !864, size: 32, align: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1342, file: !865, line: 203, baseType: !917, size: 64, align: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1342, file: !865, line: 204, baseType: !921, size: 32, align: 32, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1342, file: !865, line: 205, baseType: !1348, size: 64, align: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1350, line: 86, baseType: !1351)
!1350 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1351 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1350, line: 86, flags: DIFlagFwdDecl)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1342, file: !865, line: 206, baseType: !1090, size: 64, align: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1304, file: !865, line: 480, baseType: !921, size: 32, align: 32, offset: 3008)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1304, file: !865, line: 505, baseType: !921, size: 32, align: 32, offset: 3040)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1304, file: !865, line: 512, baseType: !524, size: 32, align: 32, offset: 3072)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1304, file: !865, line: 514, baseType: !531, size: 32, align: 32, offset: 3104)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1304, file: !865, line: 516, baseType: !549, size: 32, align: 32, offset: 3136)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1304, file: !865, line: 523, baseType: !573, size: 32, align: 32, offset: 3168)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1304, file: !865, line: 525, baseType: !592, size: 32, align: 32, offset: 3200)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1304, file: !865, line: 532, baseType: !966, size: 64, align: 64, offset: 3264)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1304, file: !865, line: 539, baseType: !966, size: 64, align: 64, offset: 3328)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1304, file: !865, line: 547, baseType: !966, size: 64, align: 64, offset: 3392)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1304, file: !865, line: 554, baseType: !1348, size: 64, align: 64, offset: 3456)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1304, file: !865, line: 563, baseType: !921, size: 32, align: 32, offset: 3520)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1304, file: !865, line: 572, baseType: !921, size: 32, align: 32, offset: 3552)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1304, file: !865, line: 581, baseType: !921, size: 32, align: 32, offset: 3584)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1304, file: !865, line: 588, baseType: !1368, size: 64, align: 64, offset: 3648)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !919, line: 36, baseType: !1370)
!1370 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1304, file: !865, line: 593, baseType: !921, size: 32, align: 32, offset: 3712)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1304, file: !865, line: 596, baseType: !921, size: 32, align: 32, offset: 3744)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1304, file: !865, line: 599, baseType: !1090, size: 64, align: 64, offset: 3776)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1304, file: !865, line: 605, baseType: !1090, size: 64, align: 64, offset: 3840)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1304, file: !865, line: 616, baseType: !1090, size: 64, align: 64, offset: 3904)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1304, file: !865, line: 626, baseType: !1377, size: 64, align: 64, offset: 3968)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1378, line: 216, baseType: !1070)
!1378 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1304, file: !865, line: 627, baseType: !1377, size: 64, align: 64, offset: 4032)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1304, file: !865, line: 628, baseType: !1377, size: 64, align: 64, offset: 4096)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1304, file: !865, line: 629, baseType: !1377, size: 64, align: 64, offset: 4160)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1304, file: !865, line: 645, baseType: !1090, size: 64, align: 64, offset: 4224)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1194, file: !4, line: 3566, baseType: !1385, size: 64, align: 64, offset: 1408)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!921, !1184, !916, !1383, !1085}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1194, file: !4, line: 3567, baseType: !1231, size: 64, align: 64, offset: 1472)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1194, file: !4, line: 3576, baseType: !1390, size: 64, align: 64, offset: 1536)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!921, !1184, !1301}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1194, file: !4, line: 3577, baseType: !1394, size: 64, align: 64, offset: 1600)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!921, !1184, !1085}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1194, file: !4, line: 3584, baseType: !1398, size: 64, align: 64, offset: 1664)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!921, !1184, !1401}
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1194, file: !4, line: 3589, baseType: !1403, size: 64, align: 64, offset: 1728)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{null, !1184}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1194, file: !4, line: 3594, baseType: !921, size: 32, align: 32, offset: 1792)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1194, file: !4, line: 3600, baseType: !936, size: 64, align: 64, offset: 1856)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1194, file: !4, line: 3609, baseType: !1409, size: 64, align: 64, offset: 1920)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1186, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1186, file: !4, line: 1581, baseType: !922, size: 32, align: 32, offset: 224)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1186, file: !4, line: 1583, baseType: !916, size: 64, align: 64, offset: 256)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1186, file: !4, line: 1591, baseType: !1417, size: 64, align: 64, offset: 320)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1186, file: !4, line: 1598, baseType: !916, size: 64, align: 64, offset: 384)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1186, file: !4, line: 1606, baseType: !966, size: 64, align: 64, offset: 448)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1186, file: !4, line: 1614, baseType: !921, size: 32, align: 32, offset: 512)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1186, file: !4, line: 1622, baseType: !921, size: 32, align: 32, offset: 544)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1186, file: !4, line: 1628, baseType: !921, size: 32, align: 32, offset: 576)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1186, file: !4, line: 1636, baseType: !921, size: 32, align: 32, offset: 608)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1186, file: !4, line: 1643, baseType: !921, size: 32, align: 32, offset: 640)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1186, file: !4, line: 1657, baseType: !917, size: 64, align: 64, offset: 704)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1186, file: !4, line: 1658, baseType: !921, size: 32, align: 32, offset: 768)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1186, file: !4, line: 1679, baseType: !972, size: 64, align: 32, offset: 800)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1186, file: !4, line: 1688, baseType: !921, size: 32, align: 32, offset: 864)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1186, file: !4, line: 1712, baseType: !921, size: 32, align: 32, offset: 896)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1186, file: !4, line: 1729, baseType: !921, size: 32, align: 32, offset: 928)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1186, file: !4, line: 1729, baseType: !921, size: 32, align: 32, offset: 960)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1186, file: !4, line: 1744, baseType: !921, size: 32, align: 32, offset: 992)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1186, file: !4, line: 1744, baseType: !921, size: 32, align: 32, offset: 1024)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1186, file: !4, line: 1751, baseType: !921, size: 32, align: 32, offset: 1056)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1186, file: !4, line: 1766, baseType: !632, size: 32, align: 32, offset: 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1186, file: !4, line: 1791, baseType: !1438, size: 64, align: 64, offset: 1152)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{null, !1441, !1301, !1383, !921, !921, !921}
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1186, file: !4, line: 1808, baseType: !1443, size: 64, align: 64, offset: 1216)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!632, !1441, !1205}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1186, file: !4, line: 1816, baseType: !921, size: 32, align: 32, offset: 1280)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1186, file: !4, line: 1825, baseType: !1448, size: 32, align: 32, offset: 1312)
!1448 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1186, file: !4, line: 1830, baseType: !921, size: 32, align: 32, offset: 1344)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1186, file: !4, line: 1838, baseType: !1448, size: 32, align: 32, offset: 1376)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1186, file: !4, line: 1846, baseType: !921, size: 32, align: 32, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1186, file: !4, line: 1851, baseType: !921, size: 32, align: 32, offset: 1440)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1186, file: !4, line: 1861, baseType: !1448, size: 32, align: 32, offset: 1472)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1186, file: !4, line: 1868, baseType: !1448, size: 32, align: 32, offset: 1504)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1186, file: !4, line: 1875, baseType: !1448, size: 32, align: 32, offset: 1536)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1186, file: !4, line: 1882, baseType: !1448, size: 32, align: 32, offset: 1568)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1186, file: !4, line: 1889, baseType: !1448, size: 32, align: 32, offset: 1600)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1186, file: !4, line: 1896, baseType: !1448, size: 32, align: 32, offset: 1632)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1186, file: !4, line: 1903, baseType: !1448, size: 32, align: 32, offset: 1664)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1186, file: !4, line: 1910, baseType: !921, size: 32, align: 32, offset: 1696)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1186, file: !4, line: 1915, baseType: !921, size: 32, align: 32, offset: 1728)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1186, file: !4, line: 1926, baseType: !1383, size: 64, align: 64, offset: 1792)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1186, file: !4, line: 1935, baseType: !972, size: 64, align: 32, offset: 1856)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1186, file: !4, line: 1942, baseType: !921, size: 32, align: 32, offset: 1920)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1186, file: !4, line: 1948, baseType: !921, size: 32, align: 32, offset: 1952)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1186, file: !4, line: 1954, baseType: !921, size: 32, align: 32, offset: 1984)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1186, file: !4, line: 1960, baseType: !921, size: 32, align: 32, offset: 2016)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1186, file: !4, line: 1984, baseType: !921, size: 32, align: 32, offset: 2048)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1186, file: !4, line: 1991, baseType: !921, size: 32, align: 32, offset: 2080)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1186, file: !4, line: 1996, baseType: !921, size: 32, align: 32, offset: 2112)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1186, file: !4, line: 2004, baseType: !921, size: 32, align: 32, offset: 2144)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1186, file: !4, line: 2011, baseType: !921, size: 32, align: 32, offset: 2176)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1186, file: !4, line: 2018, baseType: !921, size: 32, align: 32, offset: 2208)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1186, file: !4, line: 2027, baseType: !921, size: 32, align: 32, offset: 2240)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1186, file: !4, line: 2034, baseType: !921, size: 32, align: 32, offset: 2272)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1186, file: !4, line: 2044, baseType: !921, size: 32, align: 32, offset: 2304)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1186, file: !4, line: 2054, baseType: !1478, size: 64, align: 64, offset: 2368)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1186, file: !4, line: 2061, baseType: !1478, size: 64, align: 64, offset: 2432)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1186, file: !4, line: 2066, baseType: !921, size: 32, align: 32, offset: 2496)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1186, file: !4, line: 2070, baseType: !921, size: 32, align: 32, offset: 2528)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1186, file: !4, line: 2078, baseType: !921, size: 32, align: 32, offset: 2560)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1186, file: !4, line: 2085, baseType: !921, size: 32, align: 32, offset: 2592)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1186, file: !4, line: 2092, baseType: !921, size: 32, align: 32, offset: 2624)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1186, file: !4, line: 2099, baseType: !921, size: 32, align: 32, offset: 2656)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1186, file: !4, line: 2106, baseType: !921, size: 32, align: 32, offset: 2688)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1186, file: !4, line: 2113, baseType: !921, size: 32, align: 32, offset: 2720)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1186, file: !4, line: 2120, baseType: !921, size: 32, align: 32, offset: 2752)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1186, file: !4, line: 2125, baseType: !921, size: 32, align: 32, offset: 2784)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1186, file: !4, line: 2133, baseType: !921, size: 32, align: 32, offset: 2816)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1186, file: !4, line: 2140, baseType: !921, size: 32, align: 32, offset: 2848)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1186, file: !4, line: 2145, baseType: !921, size: 32, align: 32, offset: 2880)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1186, file: !4, line: 2153, baseType: !921, size: 32, align: 32, offset: 2912)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1186, file: !4, line: 2158, baseType: !921, size: 32, align: 32, offset: 2944)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1186, file: !4, line: 2166, baseType: !531, size: 32, align: 32, offset: 2976)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1186, file: !4, line: 2173, baseType: !549, size: 32, align: 32, offset: 3008)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1186, file: !4, line: 2180, baseType: !573, size: 32, align: 32, offset: 3040)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1186, file: !4, line: 2187, baseType: !524, size: 32, align: 32, offset: 3072)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1186, file: !4, line: 2194, baseType: !592, size: 32, align: 32, offset: 3104)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1186, file: !4, line: 2203, baseType: !921, size: 32, align: 32, offset: 3136)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1186, file: !4, line: 2209, baseType: !516, size: 32, align: 32, offset: 3168)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1186, file: !4, line: 2212, baseType: !921, size: 32, align: 32, offset: 3200)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1186, file: !4, line: 2213, baseType: !921, size: 32, align: 32, offset: 3232)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1186, file: !4, line: 2220, baseType: !831, size: 32, align: 32, offset: 3264)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1186, file: !4, line: 2232, baseType: !921, size: 32, align: 32, offset: 3296)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1186, file: !4, line: 2243, baseType: !921, size: 32, align: 32, offset: 3328)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1186, file: !4, line: 2249, baseType: !921, size: 32, align: 32, offset: 3360)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1186, file: !4, line: 2256, baseType: !921, size: 32, align: 32, offset: 3392)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1186, file: !4, line: 2263, baseType: !1069, size: 64, align: 64, offset: 3456)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1186, file: !4, line: 2270, baseType: !1069, size: 64, align: 64, offset: 3520)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1186, file: !4, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1186, file: !4, line: 2285, baseType: !831, size: 32, align: 32, offset: 3616)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1186, file: !4, line: 2367, baseType: !1514, size: 64, align: 64, offset: 3648)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!921, !1441, !1401, !921}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1186, file: !4, line: 2383, baseType: !921, size: 32, align: 32, offset: 3712)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1186, file: !4, line: 2386, baseType: !1448, size: 32, align: 32, offset: 3744)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1186, file: !4, line: 2387, baseType: !1448, size: 32, align: 32, offset: 3776)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1186, file: !4, line: 2394, baseType: !921, size: 32, align: 32, offset: 3808)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1186, file: !4, line: 2401, baseType: !921, size: 32, align: 32, offset: 3840)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1186, file: !4, line: 2408, baseType: !921, size: 32, align: 32, offset: 3872)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1186, file: !4, line: 2415, baseType: !921, size: 32, align: 32, offset: 3904)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1186, file: !4, line: 2422, baseType: !921, size: 32, align: 32, offset: 3936)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1186, file: !4, line: 2423, baseType: !1526, size: 64, align: 64, offset: 3968)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1529)
!1529 = !{!1530, !1531, !1532, !1533}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1528, file: !4, line: 827, baseType: !921, size: 32, align: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1528, file: !4, line: 828, baseType: !921, size: 32, align: 32, offset: 32)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1528, file: !4, line: 829, baseType: !921, size: 32, align: 32, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1528, file: !4, line: 830, baseType: !1448, size: 32, align: 32, offset: 96)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1186, file: !4, line: 2430, baseType: !966, size: 64, align: 64, offset: 4032)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1186, file: !4, line: 2437, baseType: !966, size: 64, align: 64, offset: 4096)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1186, file: !4, line: 2444, baseType: !1448, size: 32, align: 32, offset: 4160)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1186, file: !4, line: 2451, baseType: !1448, size: 32, align: 32, offset: 4192)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1186, file: !4, line: 2458, baseType: !921, size: 32, align: 32, offset: 4224)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1186, file: !4, line: 2469, baseType: !921, size: 32, align: 32, offset: 4256)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1186, file: !4, line: 2475, baseType: !921, size: 32, align: 32, offset: 4288)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1186, file: !4, line: 2481, baseType: !921, size: 32, align: 32, offset: 4320)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1186, file: !4, line: 2485, baseType: !921, size: 32, align: 32, offset: 4352)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1186, file: !4, line: 2489, baseType: !921, size: 32, align: 32, offset: 4384)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1186, file: !4, line: 2493, baseType: !921, size: 32, align: 32, offset: 4416)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1186, file: !4, line: 2501, baseType: !921, size: 32, align: 32, offset: 4448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1186, file: !4, line: 2506, baseType: !921, size: 32, align: 32, offset: 4480)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1186, file: !4, line: 2510, baseType: !921, size: 32, align: 32, offset: 4512)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1186, file: !4, line: 2514, baseType: !966, size: 64, align: 64, offset: 4544)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1186, file: !4, line: 2528, baseType: !1550, size: 64, align: 64, offset: 4608)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{null, !1441, !916, !921, !921}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1186, file: !4, line: 2534, baseType: !921, size: 32, align: 32, offset: 4672)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1186, file: !4, line: 2545, baseType: !921, size: 32, align: 32, offset: 4704)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1186, file: !4, line: 2547, baseType: !921, size: 32, align: 32, offset: 4736)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1186, file: !4, line: 2549, baseType: !921, size: 32, align: 32, offset: 4768)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1186, file: !4, line: 2551, baseType: !921, size: 32, align: 32, offset: 4800)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1186, file: !4, line: 2553, baseType: !921, size: 32, align: 32, offset: 4832)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1186, file: !4, line: 2555, baseType: !921, size: 32, align: 32, offset: 4864)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1186, file: !4, line: 2557, baseType: !921, size: 32, align: 32, offset: 4896)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1186, file: !4, line: 2559, baseType: !921, size: 32, align: 32, offset: 4928)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1186, file: !4, line: 2563, baseType: !921, size: 32, align: 32, offset: 4960)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1186, file: !4, line: 2571, baseType: !1293, size: 64, align: 64, offset: 4992)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1186, file: !4, line: 2579, baseType: !1293, size: 64, align: 64, offset: 5056)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1186, file: !4, line: 2586, baseType: !921, size: 32, align: 32, offset: 5120)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1186, file: !4, line: 2615, baseType: !921, size: 32, align: 32, offset: 5152)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1186, file: !4, line: 2627, baseType: !921, size: 32, align: 32, offset: 5184)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1186, file: !4, line: 2637, baseType: !921, size: 32, align: 32, offset: 5216)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1186, file: !4, line: 2681, baseType: !921, size: 32, align: 32, offset: 5248)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1186, file: !4, line: 2709, baseType: !966, size: 64, align: 64, offset: 5312)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1186, file: !4, line: 2716, baseType: !1572, size: 64, align: 64, offset: 5376)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579, !1580, !1581, !1582, !1588, !1592, !1593, !1594, !1595, !1601, !1602, !1603, !1604, !1605}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1574, file: !4, line: 3642, baseType: !936, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1574, file: !4, line: 3649, baseType: !506, size: 32, align: 32, offset: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1574, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1574, file: !4, line: 3663, baseType: !632, size: 32, align: 32, offset: 128)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1574, file: !4, line: 3669, baseType: !921, size: 32, align: 32, offset: 160)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1574, file: !4, line: 3682, baseType: !1398, size: 64, align: 64, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1574, file: !4, line: 3698, baseType: !1583, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!921, !1184, !1586, !1049}
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1574, file: !4, line: 3712, baseType: !1589, size: 64, align: 64, offset: 320)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!921, !1184, !921, !1586, !1049}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1574, file: !4, line: 3726, baseType: !1583, size: 64, align: 64, offset: 384)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1574, file: !4, line: 3737, baseType: !1231, size: 64, align: 64, offset: 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1574, file: !4, line: 3746, baseType: !921, size: 32, align: 32, offset: 512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1574, file: !4, line: 3757, baseType: !1596, size: 64, align: 64, offset: 576)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1599}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1574, file: !4, line: 3766, baseType: !1231, size: 64, align: 64, offset: 640)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1574, file: !4, line: 3774, baseType: !1231, size: 64, align: 64, offset: 704)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1574, file: !4, line: 3780, baseType: !921, size: 32, align: 32, offset: 768)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1574, file: !4, line: 3785, baseType: !921, size: 32, align: 32, offset: 800)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1574, file: !4, line: 3795, baseType: !1606, size: 64, align: 64, offset: 832)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!921, !1184, !1090}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1186, file: !4, line: 2728, baseType: !916, size: 64, align: 64, offset: 5440)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1186, file: !4, line: 2735, baseType: !1325, size: 512, align: 64, offset: 5504)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1186, file: !4, line: 2742, baseType: !921, size: 32, align: 32, offset: 6016)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1186, file: !4, line: 2755, baseType: !921, size: 32, align: 32, offset: 6048)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1186, file: !4, line: 2776, baseType: !921, size: 32, align: 32, offset: 6080)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1186, file: !4, line: 2783, baseType: !921, size: 32, align: 32, offset: 6112)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1186, file: !4, line: 2791, baseType: !921, size: 32, align: 32, offset: 6144)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1186, file: !4, line: 2802, baseType: !1401, size: 64, align: 64, offset: 6208)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1186, file: !4, line: 2811, baseType: !921, size: 32, align: 32, offset: 6272)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1186, file: !4, line: 2821, baseType: !921, size: 32, align: 32, offset: 6304)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1186, file: !4, line: 2830, baseType: !921, size: 32, align: 32, offset: 6336)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1186, file: !4, line: 2840, baseType: !921, size: 32, align: 32, offset: 6368)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1186, file: !4, line: 2851, baseType: !1622, size: 64, align: 64, offset: 6400)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!921, !1441, !1625, !916, !1383, !921, !921}
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!921, !1441, !916}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1186, file: !4, line: 2871, baseType: !1629, size: 64, align: 64, offset: 6464)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!921, !1441, !1632, !916, !1383, !921}
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!921, !1441, !916, !921, !921}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1186, file: !4, line: 2878, baseType: !921, size: 32, align: 32, offset: 6528)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1186, file: !4, line: 2885, baseType: !921, size: 32, align: 32, offset: 6560)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1186, file: !4, line: 3005, baseType: !921, size: 32, align: 32, offset: 6592)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1186, file: !4, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1186, file: !4, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1186, file: !4, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1186, file: !4, line: 3037, baseType: !917, size: 64, align: 64, offset: 6720)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1186, file: !4, line: 3038, baseType: !921, size: 32, align: 32, offset: 6784)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1186, file: !4, line: 3050, baseType: !1069, size: 64, align: 64, offset: 6848)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1186, file: !4, line: 3065, baseType: !921, size: 32, align: 32, offset: 6912)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1186, file: !4, line: 3083, baseType: !921, size: 32, align: 32, offset: 6944)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1186, file: !4, line: 3092, baseType: !972, size: 64, align: 32, offset: 6976)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1186, file: !4, line: 3099, baseType: !632, size: 32, align: 32, offset: 7040)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1186, file: !4, line: 3106, baseType: !972, size: 64, align: 32, offset: 7072)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1186, file: !4, line: 3113, baseType: !1650, size: 64, align: 64, offset: 7168)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1652)
!1652 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1653)
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1654)
!1654 = !{!1655, !1656, !1657, !1658, !1659, !1660, !1663}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1653, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1653, file: !4, line: 714, baseType: !506, size: 32, align: 32, offset: 32)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1653, file: !4, line: 720, baseType: !936, size: 64, align: 64, offset: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1653, file: !4, line: 724, baseType: !936, size: 64, align: 64, offset: 128)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1653, file: !4, line: 728, baseType: !921, size: 32, align: 32, offset: 192)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1653, file: !4, line: 734, baseType: !1661, size: 64, align: 64, offset: 256)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1653, file: !4, line: 739, baseType: !1664, size: 64, align: 64, offset: 320)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1222)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1186, file: !4, line: 3129, baseType: !966, size: 64, align: 64, offset: 7232)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1186, file: !4, line: 3130, baseType: !966, size: 64, align: 64, offset: 7296)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1186, file: !4, line: 3131, baseType: !966, size: 64, align: 64, offset: 7360)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1186, file: !4, line: 3132, baseType: !966, size: 64, align: 64, offset: 7424)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1186, file: !4, line: 3139, baseType: !1293, size: 64, align: 64, offset: 7488)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1186, file: !4, line: 3147, baseType: !921, size: 32, align: 32, offset: 7552)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1186, file: !4, line: 3165, baseType: !921, size: 32, align: 32, offset: 7584)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1186, file: !4, line: 3172, baseType: !921, size: 32, align: 32, offset: 7616)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1186, file: !4, line: 3180, baseType: !921, size: 32, align: 32, offset: 7648)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1186, file: !4, line: 3191, baseType: !1478, size: 64, align: 64, offset: 7680)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1186, file: !4, line: 3199, baseType: !917, size: 64, align: 64, offset: 7744)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1186, file: !4, line: 3207, baseType: !1293, size: 64, align: 64, offset: 7808)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1186, file: !4, line: 3214, baseType: !922, size: 32, align: 32, offset: 7872)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1186, file: !4, line: 3224, baseType: !1108, size: 64, align: 64, offset: 7936)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1186, file: !4, line: 3225, baseType: !921, size: 32, align: 32, offset: 8000)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1186, file: !4, line: 3249, baseType: !1090, size: 64, align: 64, offset: 8064)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1186, file: !4, line: 3256, baseType: !921, size: 32, align: 32, offset: 8128)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1186, file: !4, line: 3271, baseType: !921, size: 32, align: 32, offset: 8160)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1186, file: !4, line: 3279, baseType: !966, size: 64, align: 64, offset: 8192)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1186, file: !4, line: 3301, baseType: !1090, size: 64, align: 64, offset: 8256)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1186, file: !4, line: 3310, baseType: !921, size: 32, align: 32, offset: 8320)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1186, file: !4, line: 3337, baseType: !921, size: 32, align: 32, offset: 8352)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1186, file: !4, line: 3351, baseType: !921, size: 32, align: 32, offset: 8384)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1186, file: !4, line: 3359, baseType: !921, size: 32, align: 32, offset: 8416)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !1169, file: !4, line: 5269, baseType: !1692, size: 64, align: 64, offset: 320)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{null, !1162}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !1169, file: !4, line: 5270, baseType: !1696, size: 64, align: 64, offset: 384)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
