; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fft_float.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fft_float.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CosTabsInitOnce = type { void ()*, i32 }
%struct.FFTComplex = type { float, float }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }

@ff_cos_16 = common global [8 x float] zeroinitializer, align 32
@ff_cos_32 = common global [16 x float] zeroinitializer, align 32
@ff_cos_64 = common global [32 x float] zeroinitializer, align 32
@ff_cos_128 = common global [64 x float] zeroinitializer, align 32
@ff_cos_256 = common global [128 x float] zeroinitializer, align 32
@ff_cos_512 = common global [256 x float] zeroinitializer, align 32
@ff_cos_1024 = common global [512 x float] zeroinitializer, align 32
@ff_cos_2048 = common global [1024 x float] zeroinitializer, align 32
@ff_cos_4096 = common global [2048 x float] zeroinitializer, align 32

!16 = distinct !DIGlobalVariable(name: "ff_cos_tabs", scope: !0, file: !17, line: 124, type: !18, isLocal: false, isDefinition: true, variable: [18 x float*]* @ff_cos_tabs)
!17 = !DIFile(filename: "libavcodec/fft_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1152, align: 64, elements: !23)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !22, line: 35, baseType: !14)
!22 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!23 = !{!24}
!24 = !DISubrange(count: 18)
!25 = distinct !DIGlobalVariable(name: "ff_cos_16", scope: !0, file: !17, line: 49, type: !26, isLocal: false, isDefinition: true, variable: [8 x float]* @ff_cos_16)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, align: 32, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 8)
!29 = distinct !DIGlobalVariable(name: "ff_cos_32", scope: !0, file: !17, line: 50, type: !30, isLocal: false, isDefinition: true, variable: [16 x float]* @ff_cos_32)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 32, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 16)
!33 = distinct !DIGlobalVariable(name: "ff_cos_64", scope: !0, file: !17, line: 51, type: !34, isLocal: false, isDefinition: true, variable: [32 x float]* @ff_cos_64)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, align: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 32)
!37 = distinct !DIGlobalVariable(name: "ff_cos_128", scope: !0, file: !17, line: 52, type: !38, isLocal: false, isDefinition: true, variable: [64 x float]* @ff_cos_128)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, align: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 64)
!41 = distinct !DIGlobalVariable(name: "ff_cos_256", scope: !0, file: !17, line: 53, type: !42, isLocal: false, isDefinition: true, variable: [128 x float]* @ff_cos_256)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 4096, align: 32, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 128)
!45 = distinct !DIGlobalVariable(name: "ff_cos_512", scope: !0, file: !17, line: 54, type: !46, isLocal: false, isDefinition: true, variable: [256 x float]* @ff_cos_512)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 256)
!49 = distinct !DIGlobalVariable(name: "ff_cos_1024", scope: !0, file: !17, line: 55, type: !50, isLocal: false, isDefinition: true, variable: [512 x float]* @ff_cos_1024)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 16384, align: 32, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 512)
!53 = distinct !DIGlobalVariable(name: "ff_cos_2048", scope: !0, file: !17, line: 56, type: !54, isLocal: false, isDefinition: true, variable: [1024 x float]* @ff_cos_2048)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32768, align: 32, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 1024)
!57 = distinct !DIGlobalVariable(name: "ff_cos_4096", scope: !0, file: !17, line: 57, type: !58, isLocal: false, isDefinition: true, variable: [2048 x float]* @ff_cos_4096)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 65536, align: 32, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 2048)
!61 = distinct !DIGlobalVariable(name: "ff_cos_8192", scope: !0, file: !17, line: 58, type: !62, isLocal: false, isDefinition: true, variable: [4096 x float]* @ff_cos_8192)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 131072, align: 32, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 4096)
!65 = distinct !DIGlobalVariable(name: "ff_cos_16384", scope: !0, file: !17, line: 59, type: !66, isLocal: false, isDefinition: true, variable: [8192 x float]* @ff_cos_16384)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 262144, align: 32, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 8192)
!69 = distinct !DIGlobalVariable(name: "ff_cos_32768", scope: !0, file: !17, line: 60, type: !70, isLocal: false, isDefinition: true, variable: [16384 x float]* @ff_cos_32768)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 524288, align: 32, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 16384)
!73 = distinct !DIGlobalVariable(name: "ff_cos_65536", scope: !0, file: !17, line: 61, type: !74, isLocal: false, isDefinition: true, variable: [32768 x float]* @ff_cos_65536)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1048576, align: 32, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 32768)
!77 = distinct !DIGlobalVariable(name: "ff_cos_131072", scope: !0, file: !17, line: 62, type: !78, isLocal: false, isDefinition: true, variable: [65536 x float]* @ff_cos_131072)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2097152, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 65536)
!81 = distinct !DIGlobalVariable(name: "cos_tabs_init_once", scope: !0, file: !17, line: 102, type: !82, isLocal: true, isDefinition: true, variable: [18 x %struct.CosTabsInitOnce]* @cos_tabs_init_once)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2304, align: 64, elements: !23)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "CosTabsInitOnce", file: !17, line: 79, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CosTabsInitOnce", file: !17, line: 76, size: 128, align: 64, elements: !85)
!85 = !{!86, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !84, file: !17, line: 77, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !84, file: !17, line: 78, baseType: !91, size: 32, align: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !92, line: 168, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!93 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!94 = distinct !DIGlobalVariable(name: "avx_tab", scope: !0, file: !17, line: 165, type: !95, isLocal: true, isDefinition: true, variable: [16 x i32]* @avx_tab)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 512, align: 32, elements: !31)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!97 = distinct !DIGlobalVariable(name: "fft_dispatch", scope: !0, file: !17, line: 630, type: !98, isLocal: true, isDefinition: true, variable: [16 x void (%struct.FFTComplex*)*]* @fft_dispatch)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 1024, align: 64, elements: !31)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !22, line: 39, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !22, line: 37, size: 64, align: 32, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !105, file: !22, line: 38, baseType: !21, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !105, file: !22, line: 38, baseType: !21, size: 32, align: 32, offset: 32)
!109 = !{i32 2, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!112 = distinct !DISubprogram(name: "ff_init_ff_cos_tabs", scope: !17, file: !17, line: 158, type: !113, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !93}
!115 = !{}
!116 = !DILocalVariable(name: "index", arg: 1, scope: !112, file: !17, line: 158, type: !93)
!117 = !DIExpression()
!118 = !DILocation(line: 158, column: 52, scope: !112)
!119 = !DILocation(line: 161, column: 38, scope: !112)
!120 = !DILocation(line: 161, column: 19, scope: !112)
!121 = !DILocation(line: 161, column: 45, scope: !112)
!122 = !DILocation(line: 161, column: 73, scope: !112)
!123 = !DILocation(line: 161, column: 54, scope: !112)
!124 = !DILocation(line: 161, column: 80, scope: !112)
!125 = !DILocation(line: 161, column: 5, scope: !112)
!126 = !DILocation(line: 163, column: 1, scope: !112)
!127 = distinct !DISubprogram(name: "ff_fft_init", scope: !17, file: !17, line: 203, type: !128, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!128 = !DISubroutineType(types: !129)
!129 = !{!93, !130, !93, !93}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !22, line: 41, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !133)
!133 = !{!134, !135, !136, !141, !142, !143, !144, !145, !146, !151, !152, !158, !159, !160, !166, !167, !168}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !132, file: !4, line: 89, baseType: !93, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !132, file: !4, line: 90, baseType: !93, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !132, file: !4, line: 91, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !139, line: 49, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!140 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !132, file: !4, line: 92, baseType: !103, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !132, file: !4, line: 93, baseType: !93, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !132, file: !4, line: 94, baseType: !93, size: 32, align: 32, offset: 224)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !132, file: !4, line: 96, baseType: !20, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !132, file: !4, line: 97, baseType: !20, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !132, file: !4, line: 101, baseType: !147, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !150, !103}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !132, file: !4, line: 106, baseType: !147, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !132, file: !4, line: 107, baseType: !153, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !150, !20, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !132, file: !4, line: 108, baseType: !153, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !132, file: !4, line: 109, baseType: !153, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !132, file: !4, line: 110, baseType: !161, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !150, !164, !156}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !14)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !132, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !132, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !132, file: !4, line: 113, baseType: !169, size: 64, align: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !139, line: 51, baseType: !171)
!171 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!172 = !DILocalVariable(name: "s", arg: 1, scope: !127, file: !17, line: 203, type: !130)
!173 = !DILocation(line: 203, column: 51, scope: !127)
!174 = !DILocalVariable(name: "nbits", arg: 2, scope: !127, file: !17, line: 203, type: !93)
!175 = !DILocation(line: 203, column: 58, scope: !127)
!176 = !DILocalVariable(name: "inverse", arg: 3, scope: !127, file: !17, line: 203, type: !93)
!177 = !DILocation(line: 203, column: 69, scope: !127)
!178 = !DILocalVariable(name: "i", scope: !127, file: !17, line: 205, type: !93)
!179 = !DILocation(line: 205, column: 9, scope: !127)
!180 = !DILocalVariable(name: "j", scope: !127, file: !17, line: 205, type: !93)
!181 = !DILocation(line: 205, column: 12, scope: !127)
!182 = !DILocalVariable(name: "n", scope: !127, file: !17, line: 205, type: !93)
!183 = !DILocation(line: 205, column: 15, scope: !127)
!184 = !DILocation(line: 207, column: 5, scope: !127)
!185 = !DILocation(line: 207, column: 8, scope: !127)
!186 = !DILocation(line: 207, column: 15, scope: !127)
!187 = !DILocation(line: 208, column: 5, scope: !127)
!188 = !DILocation(line: 208, column: 8, scope: !127)
!189 = !DILocation(line: 208, column: 17, scope: !127)
!190 = !DILocation(line: 210, column: 9, scope: !191)
!191 = distinct !DILexicalBlock(scope: !127, file: !17, line: 210, column: 9)
!192 = !DILocation(line: 210, column: 15, scope: !191)
!193 = !DILocation(line: 210, column: 19, scope: !191)
!194 = !DILocation(line: 210, column: 22, scope: !195)
!195 = !DILexicalBlockFile(scope: !191, file: !17, discriminator: 1)
!196 = !DILocation(line: 210, column: 28, scope: !195)
!197 = !DILocation(line: 210, column: 9, scope: !195)
!198 = !DILocation(line: 211, column: 9, scope: !191)
!199 = !DILocation(line: 212, column: 16, scope: !127)
!200 = !DILocation(line: 212, column: 5, scope: !127)
!201 = !DILocation(line: 212, column: 8, scope: !127)
!202 = !DILocation(line: 212, column: 14, scope: !127)
!203 = !DILocation(line: 213, column: 14, scope: !127)
!204 = !DILocation(line: 213, column: 11, scope: !127)
!205 = !DILocation(line: 213, column: 7, scope: !127)
!206 = !DILocation(line: 215, column: 9, scope: !207)
!207 = distinct !DILexicalBlock(scope: !127, file: !17, line: 215, column: 9)
!208 = !DILocation(line: 215, column: 15, scope: !207)
!209 = !DILocation(line: 215, column: 9, scope: !127)
!210 = !DILocation(line: 216, column: 31, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !17, line: 215, column: 22)
!212 = !DILocation(line: 216, column: 33, scope: !211)
!213 = !DILocation(line: 216, column: 21, scope: !211)
!214 = !DILocation(line: 216, column: 9, scope: !211)
!215 = !DILocation(line: 216, column: 12, scope: !211)
!216 = !DILocation(line: 216, column: 19, scope: !211)
!217 = !DILocation(line: 217, column: 14, scope: !218)
!218 = distinct !DILexicalBlock(scope: !211, file: !17, line: 217, column: 13)
!219 = !DILocation(line: 217, column: 17, scope: !218)
!220 = !DILocation(line: 217, column: 13, scope: !211)
!221 = !DILocation(line: 218, column: 13, scope: !218)
!222 = !DILocation(line: 219, column: 5, scope: !211)
!223 = !DILocation(line: 220, column: 33, scope: !224)
!224 = distinct !DILexicalBlock(scope: !207, file: !17, line: 219, column: 12)
!225 = !DILocation(line: 220, column: 35, scope: !224)
!226 = !DILocation(line: 220, column: 23, scope: !224)
!227 = !DILocation(line: 220, column: 9, scope: !224)
!228 = !DILocation(line: 220, column: 12, scope: !224)
!229 = !DILocation(line: 220, column: 21, scope: !224)
!230 = !DILocation(line: 221, column: 14, scope: !231)
