; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--alacenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--alacenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFLPCType", file: !910, line: 43, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIEnumerator(name: "FF_LPC_TYPE_DEFAULT", value: -1)
!913 = !DIEnumerator(name: "FF_LPC_TYPE_NONE", value: 0)
!914 = !DIEnumerator(name: "FF_LPC_TYPE_FIXED", value: 1)
!915 = !DIEnumerator(name: "FF_LPC_TYPE_LEVINSON", value: 2)
!916 = !DIEnumerator(name: "FF_LPC_TYPE_CHOLESKY", value: 3)
!917 = !DIEnumerator(name: "FF_LPC_TYPE_NB", value: 4)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlacRawDataBlockType", file: !919, line: 26, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavcodec/alac_data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928}
!921 = !DIEnumerator(name: "TYPE_SCE", value: 0)
!922 = !DIEnumerator(name: "TYPE_CPE", value: 1)
!923 = !DIEnumerator(name: "TYPE_CCE", value: 2)
!924 = !DIEnumerator(name: "TYPE_LFE", value: 3)
!925 = !DIEnumerator(name: "TYPE_DSE", value: 4)
!926 = !DIEnumerator(name: "TYPE_PCE", value: 5)
!927 = !DIEnumerator(name: "TYPE_FIL", value: 6)
!928 = !DIEnumerator(name: "TYPE_END", value: 7)
!929 = !{!930, !937, !938, !941, !945, !949, !951}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !932, line: 221, size: 32, align: 8, elements: !933)
!932 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !931, file: !932, line: 221, baseType: !935, size: 32, align: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !936, line: 51, baseType: !937)
!936 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!937 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !936, line: 48, baseType: !940)
!940 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !936, line: 38, baseType: !944)
!944 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !936, line: 37, baseType: !948)
!948 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !936, line: 55, baseType: !950)
!950 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!952 = !{!953, !1710, !1711}
!953 = distinct !DIGlobalVariable(name: "ff_alac_encoder", scope: !0, file: !954, line: 670, type: !955, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_alac_encoder)
!954 = !DIFile(filename: "libavcodec/alacenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !957)
!957 = !{!958, !962, !963, !964, !965, !966, !975, !978, !981, !984, !987, !988, !1063, !1071, !1072, !1073, !1075, !1625, !1631, !1639, !1643, !1644, !1681, !1685, !1689, !1690, !1694, !1698, !1699, !1703, !1704, !1705}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !14, line: 3475, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !956, file: !14, line: 3480, baseType: !959, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !956, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !956, file: !14, line: 3487, baseType: !944, size: 32, align: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !956, file: !14, line: 3488, baseType: !967, size: 64, align: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !970, line: 61, baseType: !971)
!970 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !970, line: 58, size: 64, align: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !971, file: !970, line: 59, baseType: !944, size: 32, align: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !971, file: !970, line: 60, baseType: !944, size: 32, align: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !956, file: !14, line: 3489, baseType: !976, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !956, file: !14, line: 3490, baseType: !979, size: 64, align: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !956, file: !14, line: 3491, baseType: !982, size: 64, align: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !956, file: !14, line: 3492, baseType: !985, size: 64, align: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !956, file: !14, line: 3493, baseType: !939, size: 8, align: 8, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !956, file: !14, line: 3494, baseType: !989, size: 64, align: 64, offset: 640)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !993)
!993 = !{!994, !995, !999, !1022, !1023, !1024, !1025, !1029, !1035, !1037, !1041}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !992, file: !713, line: 72, baseType: !959, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !992, file: !713, line: 78, baseType: !996, size: 64, align: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!959, !951}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !992, file: !713, line: 85, baseType: !1000, size: 64, align: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1018, !1019, !1020, !1021}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !691, line: 247, baseType: !959, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1002, file: !691, line: 253, baseType: !959, size: 64, align: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1002, file: !691, line: 259, baseType: !944, size: 32, align: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1002, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1002, file: !691, line: 271, baseType: !1009, size: 64, align: 64, offset: 192)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1002, file: !691, line: 265, size: 64, align: 64, elements: !1010)
!1010 = !{!1011, !1014, !1016, !1017}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1009, file: !691, line: 266, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !936, line: 40, baseType: !1013)
!1013 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1009, file: !691, line: 267, baseType: !1015, size: 64, align: 64)
!1015 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1009, file: !691, line: 268, baseType: !959, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1009, file: !691, line: 270, baseType: !969, size: 64, align: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1002, file: !691, line: 272, baseType: !1015, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1002, file: !691, line: 273, baseType: !1015, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1002, file: !691, line: 275, baseType: !944, size: 32, align: 32, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1002, file: !691, line: 300, baseType: !959, size: 64, align: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !992, file: !713, line: 93, baseType: !944, size: 32, align: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !992, file: !713, line: 99, baseType: !944, size: 32, align: 32, offset: 224)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !992, file: !713, line: 108, baseType: !944, size: 32, align: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !992, file: !713, line: 113, baseType: !1026, size: 64, align: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!951, !951, !951}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !992, file: !713, line: 123, baseType: !1030, size: 64, align: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1033, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !992, file: !713, line: 130, baseType: !1036, size: 32, align: 32, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !992, file: !713, line: 136, baseType: !1038, size: 64, align: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1036, !951}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !992, file: !713, line: 142, baseType: !1042, size: 64, align: 64, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!944, !1045, !951, !959, !944}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1048)
!1048 = !{!1049, !1061, !1062}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1047, file: !691, line: 360, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1053, file: !691, line: 307, baseType: !959, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1053, file: !691, line: 313, baseType: !1015, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1053, file: !691, line: 313, baseType: !1015, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1053, file: !691, line: 318, baseType: !1015, size: 64, align: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1053, file: !691, line: 318, baseType: !1015, size: 64, align: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1053, file: !691, line: 323, baseType: !944, size: 32, align: 32, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1047, file: !691, line: 364, baseType: !944, size: 32, align: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1047, file: !691, line: 368, baseType: !944, size: 32, align: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !956, file: !14, line: 3495, baseType: !1064, size: 64, align: 64, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1067, file: !14, line: 3402, baseType: !944, size: 32, align: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !14, line: 3403, baseType: !959, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !956, file: !14, line: 3507, baseType: !959, size: 64, align: 64, offset: 768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !956, file: !14, line: 3516, baseType: !944, size: 32, align: 32, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !14, line: 3517, baseType: !1074, size: 64, align: 64, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !956, file: !14, line: 3527, baseType: !1076, size: 64, align: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!944, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1089, !1090, !1091, !1092, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1371, !1375, !1376, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1563, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1081, file: !14, line: 1561, baseType: !989, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1081, file: !14, line: 1562, baseType: !944, size: 32, align: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1081, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1081, file: !14, line: 1565, baseType: !1087, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1081, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1081, file: !14, line: 1581, baseType: !937, size: 32, align: 32, offset: 224)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1081, file: !14, line: 1583, baseType: !951, size: 64, align: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1081, file: !14, line: 1591, baseType: !1093, size: 64, align: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1095, line: 129, size: 1664, align: 64, elements: !1096)
!1095 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1096 = !{!1097, !1098, !1099, !1100, !1197, !1218, !1219, !1248, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1094, file: !1095, line: 136, baseType: !944, size: 32, align: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1094, file: !1095, line: 151, baseType: !944, size: 32, align: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1094, file: !1095, line: 157, baseType: !944, size: 32, align: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1094, file: !1095, line: 159, baseType: !1101, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1104)
!1104 = !{!1105, !1109, !1111, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1149, !1151, !1152, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1185, !1186, !1187, !1188, !1189, !1190, !1193, !1194, !1195, !1196}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !744, line: 282, baseType: !1106, size: 512, align: 64)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 512, align: 64, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 8)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1103, file: !744, line: 299, baseType: !1110, size: 256, align: 32, offset: 512)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 32, elements: !1107)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1103, file: !744, line: 315, baseType: !1112, size: 64, align: 64, offset: 768)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1103, file: !744, line: 326, baseType: !944, size: 32, align: 32, offset: 832)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1103, file: !744, line: 326, baseType: !944, size: 32, align: 32, offset: 864)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1103, file: !744, line: 334, baseType: !944, size: 32, align: 32, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1103, file: !744, line: 341, baseType: !944, size: 32, align: 32, offset: 928)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1103, file: !744, line: 346, baseType: !944, size: 32, align: 32, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1103, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1103, file: !744, line: 356, baseType: !969, size: 64, align: 32, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1103, file: !744, line: 361, baseType: !1012, size: 64, align: 64, offset: 1088)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1103, file: !744, line: 369, baseType: !1012, size: 64, align: 64, offset: 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1103, file: !744, line: 377, baseType: !1012, size: 64, align: 64, offset: 1216)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1103, file: !744, line: 382, baseType: !944, size: 32, align: 32, offset: 1280)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1103, file: !744, line: 386, baseType: !944, size: 32, align: 32, offset: 1312)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1103, file: !744, line: 391, baseType: !944, size: 32, align: 32, offset: 1344)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1103, file: !744, line: 396, baseType: !951, size: 64, align: 64, offset: 1408)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1103, file: !744, line: 403, baseType: !1128, size: 512, align: 64, offset: 1472)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 512, align: 64, elements: !1107)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1103, file: !744, line: 410, baseType: !944, size: 32, align: 32, offset: 1984)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1103, file: !744, line: 415, baseType: !944, size: 32, align: 32, offset: 2016)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1103, file: !744, line: 420, baseType: !944, size: 32, align: 32, offset: 2048)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1103, file: !744, line: 425, baseType: !944, size: 32, align: 32, offset: 2080)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1103, file: !744, line: 435, baseType: !1012, size: 64, align: 64, offset: 2112)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1103, file: !744, line: 440, baseType: !944, size: 32, align: 32, offset: 2176)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1103, file: !744, line: 445, baseType: !949, size: 64, align: 64, offset: 2240)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1103, file: !744, line: 459, baseType: !1137, size: 512, align: 64, offset: 2304)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 512, align: 64, elements: !1107)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1140, line: 94, baseType: !1141)
!1140 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1140, line: 81, size: 192, align: 64, elements: !1142)
!1142 = !{!1143, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1141, file: !1140, line: 82, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1140, line: 73, baseType: !1146)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1140, line: 73, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !1140, line: 89, baseType: !938, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !1140, line: 93, baseType: !944, size: 32, align: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1103, file: !744, line: 473, baseType: !1150, size: 64, align: 64, offset: 2816)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1103, file: !744, line: 477, baseType: !944, size: 32, align: 32, offset: 2880)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1103, file: !744, line: 479, baseType: !1153, size: 64, align: 64, offset: 2944)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1166}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !744, line: 203, baseType: !938, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !744, line: 204, baseType: !944, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1156, file: !744, line: 205, baseType: !1162, size: 64, align: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1164, line: 86, baseType: !1165)
!1164 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1164, line: 86, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1156, file: !744, line: 206, baseType: !1138, size: 64, align: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1103, file: !744, line: 480, baseType: !944, size: 32, align: 32, offset: 3008)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !744, line: 505, baseType: !944, size: 32, align: 32, offset: 3040)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1103, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1103, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1103, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1103, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1103, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1103, file: !744, line: 532, baseType: !1012, size: 64, align: 64, offset: 3264)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1103, file: !744, line: 539, baseType: !1012, size: 64, align: 64, offset: 3328)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1103, file: !744, line: 547, baseType: !1012, size: 64, align: 64, offset: 3392)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1103, file: !744, line: 554, baseType: !1162, size: 64, align: 64, offset: 3456)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1103, file: !744, line: 563, baseType: !944, size: 32, align: 32, offset: 3520)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1103, file: !744, line: 572, baseType: !944, size: 32, align: 32, offset: 3552)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1103, file: !744, line: 581, baseType: !944, size: 32, align: 32, offset: 3584)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1103, file: !744, line: 588, baseType: !1182, size: 64, align: 64, offset: 3648)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !936, line: 36, baseType: !1184)
!1184 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1103, file: !744, line: 593, baseType: !944, size: 32, align: 32, offset: 3712)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1103, file: !744, line: 596, baseType: !944, size: 32, align: 32, offset: 3744)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1103, file: !744, line: 599, baseType: !1138, size: 64, align: 64, offset: 3776)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1103, file: !744, line: 605, baseType: !1138, size: 64, align: 64, offset: 3840)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1103, file: !744, line: 616, baseType: !1138, size: 64, align: 64, offset: 3904)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1103, file: !744, line: 626, baseType: !1191, size: 64, align: 64, offset: 3968)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1192, line: 216, baseType: !950)
!1192 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1103, file: !744, line: 627, baseType: !1191, size: 64, align: 64, offset: 4032)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1103, file: !744, line: 628, baseType: !1191, size: 64, align: 64, offset: 4096)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1103, file: !744, line: 629, baseType: !1191, size: 64, align: 64, offset: 4160)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1103, file: !744, line: 645, baseType: !1138, size: 64, align: 64, offset: 4224)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1094, file: !1095, line: 161, baseType: !1198, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1095, line: 117, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1095, line: 100, size: 832, align: 64, elements: !1201)
!1201 = !{!1202, !1209, !1210, !1211, !1212, !1213, !1215, !1216, !1217}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1200, file: !1095, line: 105, baseType: !1203, size: 256, align: 64)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1204, size: 256, align: 64, elements: !1207)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1140, line: 238, baseType: !1206)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1140, line: 238, flags: DIFlagFwdDecl)
!1207 = !{!1208}
!1208 = !DISubrange(count: 4)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1200, file: !1095, line: 110, baseType: !944, size: 32, align: 32, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1200, file: !1095, line: 111, baseType: !944, size: 32, align: 32, offset: 288)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1200, file: !1095, line: 111, baseType: !944, size: 32, align: 32, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1200, file: !1095, line: 112, baseType: !1110, size: 256, align: 32, offset: 352)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1200, file: !1095, line: 113, baseType: !1214, size: 128, align: 32, offset: 608)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 128, align: 32, elements: !1207)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1200, file: !1095, line: 114, baseType: !944, size: 32, align: 32, offset: 736)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1200, file: !1095, line: 115, baseType: !944, size: 32, align: 32, offset: 768)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1200, file: !1095, line: 116, baseType: !944, size: 32, align: 32, offset: 800)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1094, file: !1095, line: 163, baseType: !951, size: 64, align: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1094, file: !1095, line: 165, baseType: !1220, size: 128, align: 64, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1095, line: 122, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1095, line: 119, size: 128, align: 64, elements: !1222)
!1222 = !{!1223, !1247}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1221, file: !1095, line: 120, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1243, !1244, !1245, !1246}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1226, file: !14, line: 1451, baseType: !1138, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1226, file: !14, line: 1461, baseType: !1012, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1226, file: !14, line: 1467, baseType: !1012, size: 64, align: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1226, file: !14, line: 1468, baseType: !938, size: 64, align: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1226, file: !14, line: 1469, baseType: !944, size: 32, align: 32, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1226, file: !14, line: 1470, baseType: !944, size: 32, align: 32, offset: 288)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1226, file: !14, line: 1474, baseType: !944, size: 32, align: 32, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1226, file: !14, line: 1479, baseType: !1236, size: 64, align: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !14, line: 1412, baseType: !938, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1238, file: !14, line: 1413, baseType: !944, size: 32, align: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1238, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1226, file: !14, line: 1480, baseType: !944, size: 32, align: 32, offset: 448)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1226, file: !14, line: 1486, baseType: !1012, size: 64, align: 64, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1226, file: !14, line: 1488, baseType: !1012, size: 64, align: 64, offset: 576)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1226, file: !14, line: 1497, baseType: !1012, size: 64, align: 64, offset: 640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1221, file: !1095, line: 121, baseType: !1101, size: 64, align: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1094, file: !1095, line: 166, baseType: !1249, size: 128, align: 64, offset: 448)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1095, line: 127, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1095, line: 124, size: 128, align: 64, elements: !1251)
!1251 = !{!1252, !1325}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1250, file: !1095, line: 125, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1257)
!1257 = !{!1258, !1259, !1283, !1287, !1288, !1322, !1323, !1324}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1256, file: !14, line: 5751, baseType: !989, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1256, file: !14, line: 5756, baseType: !1260, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1263)
!1263 = !{!1264, !1265, !1268, !1269, !1270, !1274, !1278, !1282}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1262, file: !14, line: 5797, baseType: !959, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1262, file: !14, line: 5804, baseType: !1266, size: 64, align: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1262, file: !14, line: 5815, baseType: !989, size: 64, align: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1262, file: !14, line: 5825, baseType: !944, size: 32, align: 32, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1262, file: !14, line: 5826, baseType: !1271, size: 64, align: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!944, !1254}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1262, file: !14, line: 5827, baseType: !1275, size: 64, align: 64, offset: 320)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!944, !1254, !1224}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1262, file: !14, line: 5828, baseType: !1279, size: 64, align: 64, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{null, !1254}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1262, file: !14, line: 5829, baseType: !1279, size: 64, align: 64, offset: 448)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1256, file: !14, line: 5762, baseType: !1284, size: 64, align: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1286)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1256, file: !14, line: 5768, baseType: !951, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1256, file: !14, line: 5775, baseType: !1289, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1291, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1291, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1291, file: !14, line: 3948, baseType: !935, size: 32, align: 32, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1291, file: !14, line: 3958, baseType: !938, size: 64, align: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1291, file: !14, line: 3962, baseType: !944, size: 32, align: 32, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1291, file: !14, line: 3968, baseType: !944, size: 32, align: 32, offset: 224)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1291, file: !14, line: 3973, baseType: !1012, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1291, file: !14, line: 3986, baseType: !944, size: 32, align: 32, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1291, file: !14, line: 3999, baseType: !944, size: 32, align: 32, offset: 352)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1291, file: !14, line: 4004, baseType: !944, size: 32, align: 32, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1291, file: !14, line: 4005, baseType: !944, size: 32, align: 32, offset: 416)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1291, file: !14, line: 4010, baseType: !944, size: 32, align: 32, offset: 448)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1291, file: !14, line: 4011, baseType: !944, size: 32, align: 32, offset: 480)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1291, file: !14, line: 4020, baseType: !969, size: 64, align: 32, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1291, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1291, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1291, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1291, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1291, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1291, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1291, file: !14, line: 4039, baseType: !944, size: 32, align: 32, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1291, file: !14, line: 4046, baseType: !949, size: 64, align: 64, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1291, file: !14, line: 4050, baseType: !944, size: 32, align: 32, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1291, file: !14, line: 4054, baseType: !944, size: 32, align: 32, offset: 928)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1291, file: !14, line: 4061, baseType: !944, size: 32, align: 32, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1291, file: !14, line: 4065, baseType: !944, size: 32, align: 32, offset: 992)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1291, file: !14, line: 4073, baseType: !944, size: 32, align: 32, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1291, file: !14, line: 4080, baseType: !944, size: 32, align: 32, offset: 1056)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1291, file: !14, line: 4084, baseType: !944, size: 32, align: 32, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1256, file: !14, line: 5781, baseType: !1289, size: 64, align: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1256, file: !14, line: 5787, baseType: !969, size: 64, align: 32, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1256, file: !14, line: 5793, baseType: !969, size: 64, align: 32, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1250, file: !1095, line: 126, baseType: !944, size: 32, align: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1094, file: !1095, line: 172, baseType: !1224, size: 64, align: 64, offset: 576)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1094, file: !1095, line: 177, baseType: !938, size: 64, align: 64, offset: 640)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1094, file: !1095, line: 178, baseType: !937, size: 32, align: 32, offset: 704)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1094, file: !1095, line: 180, baseType: !951, size: 64, align: 64, offset: 768)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1094, file: !1095, line: 185, baseType: !944, size: 32, align: 32, offset: 832)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1094, file: !1095, line: 190, baseType: !951, size: 64, align: 64, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1094, file: !1095, line: 195, baseType: !944, size: 32, align: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1094, file: !1095, line: 200, baseType: !1224, size: 64, align: 64, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1094, file: !1095, line: 201, baseType: !944, size: 32, align: 32, offset: 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1094, file: !1095, line: 202, baseType: !1101, size: 64, align: 64, offset: 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1094, file: !1095, line: 203, baseType: !944, size: 32, align: 32, offset: 1216)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1094, file: !1095, line: 205, baseType: !944, size: 32, align: 32, offset: 1248)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1094, file: !1095, line: 206, baseType: !944, size: 32, align: 32, offset: 1280)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1094, file: !1095, line: 209, baseType: !1191, size: 64, align: 64, offset: 1344)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1094, file: !1095, line: 212, baseType: !1191, size: 64, align: 64, offset: 1408)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1094, file: !1095, line: 213, baseType: !1101, size: 64, align: 64, offset: 1472)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1094, file: !1095, line: 215, baseType: !944, size: 32, align: 32, offset: 1536)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1094, file: !1095, line: 217, baseType: !944, size: 32, align: 32, offset: 1568)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1094, file: !1095, line: 220, baseType: !944, size: 32, align: 32, offset: 1600)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1081, file: !14, line: 1598, baseType: !951, size: 64, align: 64, offset: 384)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1081, file: !14, line: 1606, baseType: !1012, size: 64, align: 64, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1081, file: !14, line: 1614, baseType: !944, size: 32, align: 32, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1081, file: !14, line: 1622, baseType: !944, size: 32, align: 32, offset: 544)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1081, file: !14, line: 1628, baseType: !944, size: 32, align: 32, offset: 576)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1081, file: !14, line: 1636, baseType: !944, size: 32, align: 32, offset: 608)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1081, file: !14, line: 1643, baseType: !944, size: 32, align: 32, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1081, file: !14, line: 1657, baseType: !938, size: 64, align: 64, offset: 704)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1081, file: !14, line: 1658, baseType: !944, size: 32, align: 32, offset: 768)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1081, file: !14, line: 1679, baseType: !969, size: 64, align: 32, offset: 800)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1081, file: !14, line: 1688, baseType: !944, size: 32, align: 32, offset: 864)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1081, file: !14, line: 1712, baseType: !944, size: 32, align: 32, offset: 896)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1081, file: !14, line: 1729, baseType: !944, size: 32, align: 32, offset: 928)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1081, file: !14, line: 1729, baseType: !944, size: 32, align: 32, offset: 960)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1081, file: !14, line: 1744, baseType: !944, size: 32, align: 32, offset: 992)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1081, file: !14, line: 1744, baseType: !944, size: 32, align: 32, offset: 1024)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1081, file: !14, line: 1751, baseType: !944, size: 32, align: 32, offset: 1056)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1081, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1081, file: !14, line: 1791, baseType: !1364, size: 64, align: 64, offset: 1152)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{null, !1367, !1368, !1370, !944, !944, !944}
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1081, file: !14, line: 1808, baseType: !1372, size: 64, align: 64, offset: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!473, !1367, !976}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1081, file: !14, line: 1816, baseType: !944, size: 32, align: 32, offset: 1280)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1081, file: !14, line: 1825, baseType: !1377, size: 32, align: 32, offset: 1312)
!1377 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1081, file: !14, line: 1830, baseType: !944, size: 32, align: 32, offset: 1344)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1081, file: !14, line: 1838, baseType: !1377, size: 32, align: 32, offset: 1376)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1081, file: !14, line: 1846, baseType: !944, size: 32, align: 32, offset: 1408)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1081, file: !14, line: 1851, baseType: !944, size: 32, align: 32, offset: 1440)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1081, file: !14, line: 1861, baseType: !1377, size: 32, align: 32, offset: 1472)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1081, file: !14, line: 1868, baseType: !1377, size: 32, align: 32, offset: 1504)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1081, file: !14, line: 1875, baseType: !1377, size: 32, align: 32, offset: 1536)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1081, file: !14, line: 1882, baseType: !1377, size: 32, align: 32, offset: 1568)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1081, file: !14, line: 1889, baseType: !1377, size: 32, align: 32, offset: 1600)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1081, file: !14, line: 1896, baseType: !1377, size: 32, align: 32, offset: 1632)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1081, file: !14, line: 1903, baseType: !1377, size: 32, align: 32, offset: 1664)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1081, file: !14, line: 1910, baseType: !944, size: 32, align: 32, offset: 1696)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1081, file: !14, line: 1915, baseType: !944, size: 32, align: 32, offset: 1728)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1081, file: !14, line: 1926, baseType: !1370, size: 64, align: 64, offset: 1792)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1081, file: !14, line: 1935, baseType: !969, size: 64, align: 32, offset: 1856)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1081, file: !14, line: 1942, baseType: !944, size: 32, align: 32, offset: 1920)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1081, file: !14, line: 1948, baseType: !944, size: 32, align: 32, offset: 1952)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1081, file: !14, line: 1954, baseType: !944, size: 32, align: 32, offset: 1984)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1081, file: !14, line: 1960, baseType: !944, size: 32, align: 32, offset: 2016)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1081, file: !14, line: 1984, baseType: !944, size: 32, align: 32, offset: 2048)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1081, file: !14, line: 1991, baseType: !944, size: 32, align: 32, offset: 2080)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1081, file: !14, line: 1996, baseType: !944, size: 32, align: 32, offset: 2112)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1081, file: !14, line: 2004, baseType: !944, size: 32, align: 32, offset: 2144)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1081, file: !14, line: 2011, baseType: !944, size: 32, align: 32, offset: 2176)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1081, file: !14, line: 2018, baseType: !944, size: 32, align: 32, offset: 2208)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1081, file: !14, line: 2027, baseType: !944, size: 32, align: 32, offset: 2240)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1081, file: !14, line: 2034, baseType: !944, size: 32, align: 32, offset: 2272)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1081, file: !14, line: 2044, baseType: !944, size: 32, align: 32, offset: 2304)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1081, file: !14, line: 2054, baseType: !1407, size: 64, align: 64, offset: 2368)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !936, line: 49, baseType: !1409)
!1409 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1081, file: !14, line: 2061, baseType: !1407, size: 64, align: 64, offset: 2432)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1081, file: !14, line: 2066, baseType: !944, size: 32, align: 32, offset: 2496)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1081, file: !14, line: 2070, baseType: !944, size: 32, align: 32, offset: 2528)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1081, file: !14, line: 2078, baseType: !944, size: 32, align: 32, offset: 2560)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1081, file: !14, line: 2085, baseType: !944, size: 32, align: 32, offset: 2592)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1081, file: !14, line: 2092, baseType: !944, size: 32, align: 32, offset: 2624)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1081, file: !14, line: 2099, baseType: !944, size: 32, align: 32, offset: 2656)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1081, file: !14, line: 2106, baseType: !944, size: 32, align: 32, offset: 2688)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1081, file: !14, line: 2113, baseType: !944, size: 32, align: 32, offset: 2720)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1081, file: !14, line: 2120, baseType: !944, size: 32, align: 32, offset: 2752)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1081, file: !14, line: 2125, baseType: !944, size: 32, align: 32, offset: 2784)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1081, file: !14, line: 2133, baseType: !944, size: 32, align: 32, offset: 2816)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1081, file: !14, line: 2140, baseType: !944, size: 32, align: 32, offset: 2848)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1081, file: !14, line: 2145, baseType: !944, size: 32, align: 32, offset: 2880)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1081, file: !14, line: 2153, baseType: !944, size: 32, align: 32, offset: 2912)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1081, file: !14, line: 2158, baseType: !944, size: 32, align: 32, offset: 2944)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1081, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1081, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1081, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1081, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1081, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1081, file: !14, line: 2203, baseType: !944, size: 32, align: 32, offset: 3136)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1081, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1081, file: !14, line: 2212, baseType: !944, size: 32, align: 32, offset: 3200)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1081, file: !14, line: 2213, baseType: !944, size: 32, align: 32, offset: 3232)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1081, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1081, file: !14, line: 2232, baseType: !944, size: 32, align: 32, offset: 3296)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1081, file: !14, line: 2243, baseType: !944, size: 32, align: 32, offset: 3328)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1081, file: !14, line: 2249, baseType: !944, size: 32, align: 32, offset: 3360)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1081, file: !14, line: 2256, baseType: !944, size: 32, align: 32, offset: 3392)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1081, file: !14, line: 2263, baseType: !949, size: 64, align: 64, offset: 3456)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1081, file: !14, line: 2270, baseType: !949, size: 64, align: 64, offset: 3520)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1081, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1081, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1081, file: !14, line: 2367, baseType: !1445, size: 64, align: 64, offset: 3648)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!944, !1367, !1101, !944}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1081, file: !14, line: 2383, baseType: !944, size: 32, align: 32, offset: 3712)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1081, file: !14, line: 2386, baseType: !1377, size: 32, align: 32, offset: 3744)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1081, file: !14, line: 2387, baseType: !1377, size: 32, align: 32, offset: 3776)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1081, file: !14, line: 2394, baseType: !944, size: 32, align: 32, offset: 3808)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1081, file: !14, line: 2401, baseType: !944, size: 32, align: 32, offset: 3840)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1081, file: !14, line: 2408, baseType: !944, size: 32, align: 32, offset: 3872)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1081, file: !14, line: 2415, baseType: !944, size: 32, align: 32, offset: 3904)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1081, file: !14, line: 2422, baseType: !944, size: 32, align: 32, offset: 3936)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1081, file: !14, line: 2423, baseType: !1457, size: 64, align: 64, offset: 3968)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1460)
!1460 = !{!1461, !1462, !1463, !1464}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1459, file: !14, line: 827, baseType: !944, size: 32, align: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1459, file: !14, line: 828, baseType: !944, size: 32, align: 32, offset: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1459, file: !14, line: 829, baseType: !944, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1459, file: !14, line: 830, baseType: !1377, size: 32, align: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1081, file: !14, line: 2430, baseType: !1012, size: 64, align: 64, offset: 4032)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1081, file: !14, line: 2437, baseType: !1012, size: 64, align: 64, offset: 4096)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1081, file: !14, line: 2444, baseType: !1377, size: 32, align: 32, offset: 4160)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1081, file: !14, line: 2451, baseType: !1377, size: 32, align: 32, offset: 4192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1081, file: !14, line: 2458, baseType: !944, size: 32, align: 32, offset: 4224)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1081, file: !14, line: 2469, baseType: !944, size: 32, align: 32, offset: 4256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1081, file: !14, line: 2475, baseType: !944, size: 32, align: 32, offset: 4288)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1081, file: !14, line: 2481, baseType: !944, size: 32, align: 32, offset: 4320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1081, file: !14, line: 2485, baseType: !944, size: 32, align: 32, offset: 4352)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1081, file: !14, line: 2489, baseType: !944, size: 32, align: 32, offset: 4384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1081, file: !14, line: 2493, baseType: !944, size: 32, align: 32, offset: 4416)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1081, file: !14, line: 2501, baseType: !944, size: 32, align: 32, offset: 4448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1081, file: !14, line: 2506, baseType: !944, size: 32, align: 32, offset: 4480)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1081, file: !14, line: 2510, baseType: !944, size: 32, align: 32, offset: 4512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1081, file: !14, line: 2514, baseType: !1012, size: 64, align: 64, offset: 4544)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1081, file: !14, line: 2528, baseType: !1481, size: 64, align: 64, offset: 4608)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1367, !951, !944, !944}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1081, file: !14, line: 2534, baseType: !944, size: 32, align: 32, offset: 4672)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1081, file: !14, line: 2545, baseType: !944, size: 32, align: 32, offset: 4704)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1081, file: !14, line: 2547, baseType: !944, size: 32, align: 32, offset: 4736)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1081, file: !14, line: 2549, baseType: !944, size: 32, align: 32, offset: 4768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1081, file: !14, line: 2551, baseType: !944, size: 32, align: 32, offset: 4800)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1081, file: !14, line: 2553, baseType: !944, size: 32, align: 32, offset: 4832)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1081, file: !14, line: 2555, baseType: !944, size: 32, align: 32, offset: 4864)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1081, file: !14, line: 2557, baseType: !944, size: 32, align: 32, offset: 4896)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1081, file: !14, line: 2559, baseType: !944, size: 32, align: 32, offset: 4928)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1081, file: !14, line: 2563, baseType: !944, size: 32, align: 32, offset: 4960)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1081, file: !14, line: 2571, baseType: !1495, size: 64, align: 64, offset: 4992)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1081, file: !14, line: 2579, baseType: !1495, size: 64, align: 64, offset: 5056)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1081, file: !14, line: 2586, baseType: !944, size: 32, align: 32, offset: 5120)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1081, file: !14, line: 2615, baseType: !944, size: 32, align: 32, offset: 5152)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1081, file: !14, line: 2627, baseType: !944, size: 32, align: 32, offset: 5184)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1081, file: !14, line: 2637, baseType: !944, size: 32, align: 32, offset: 5216)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1081, file: !14, line: 2681, baseType: !944, size: 32, align: 32, offset: 5248)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1081, file: !14, line: 2709, baseType: !1012, size: 64, align: 64, offset: 5312)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1081, file: !14, line: 2716, baseType: !1504, size: 64, align: 64, offset: 5376)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1506)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511, !1512, !1513, !1517, !1523, !1527, !1528, !1529, !1530, !1536, !1537, !1538, !1539, !1540}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1506, file: !14, line: 3642, baseType: !959, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1506, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1506, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1506, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1506, file: !14, line: 3669, baseType: !944, size: 32, align: 32, offset: 160)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1506, file: !14, line: 3682, baseType: !1514, size: 64, align: 64, offset: 192)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!944, !1079, !1101}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1506, file: !14, line: 3698, baseType: !1518, size: 64, align: 64, offset: 256)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!944, !1079, !1521, !935}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1506, file: !14, line: 3712, baseType: !1524, size: 64, align: 64, offset: 320)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!944, !1079, !944, !1521, !935}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1506, file: !14, line: 3726, baseType: !1518, size: 64, align: 64, offset: 384)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1506, file: !14, line: 3737, baseType: !1076, size: 64, align: 64, offset: 448)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1506, file: !14, line: 3746, baseType: !944, size: 32, align: 32, offset: 512)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1506, file: !14, line: 3757, baseType: !1531, size: 64, align: 64, offset: 576)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{null, !1534}
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1506, file: !14, line: 3766, baseType: !1076, size: 64, align: 64, offset: 640)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1506, file: !14, line: 3774, baseType: !1076, size: 64, align: 64, offset: 704)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1506, file: !14, line: 3780, baseType: !944, size: 32, align: 32, offset: 768)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1506, file: !14, line: 3785, baseType: !944, size: 32, align: 32, offset: 800)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1506, file: !14, line: 3795, baseType: !1541, size: 64, align: 64, offset: 832)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!944, !1079, !1138}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1081, file: !14, line: 2728, baseType: !951, size: 64, align: 64, offset: 5440)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1081, file: !14, line: 2735, baseType: !1128, size: 512, align: 64, offset: 5504)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1081, file: !14, line: 2742, baseType: !944, size: 32, align: 32, offset: 6016)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1081, file: !14, line: 2755, baseType: !944, size: 32, align: 32, offset: 6048)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1081, file: !14, line: 2776, baseType: !944, size: 32, align: 32, offset: 6080)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1081, file: !14, line: 2783, baseType: !944, size: 32, align: 32, offset: 6112)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1081, file: !14, line: 2791, baseType: !944, size: 32, align: 32, offset: 6144)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1081, file: !14, line: 2802, baseType: !1101, size: 64, align: 64, offset: 6208)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1081, file: !14, line: 2811, baseType: !944, size: 32, align: 32, offset: 6272)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1081, file: !14, line: 2821, baseType: !944, size: 32, align: 32, offset: 6304)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1081, file: !14, line: 2830, baseType: !944, size: 32, align: 32, offset: 6336)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1081, file: !14, line: 2840, baseType: !944, size: 32, align: 32, offset: 6368)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1081, file: !14, line: 2851, baseType: !1557, size: 64, align: 64, offset: 6400)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!944, !1367, !1560, !951, !1370, !944, !944}
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!944, !1367, !951}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1081, file: !14, line: 2871, baseType: !1564, size: 64, align: 64, offset: 6464)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!944, !1367, !1567, !951, !1370, !944}
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!944, !1367, !951, !944, !944}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1081, file: !14, line: 2878, baseType: !944, size: 32, align: 32, offset: 6528)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1081, file: !14, line: 2885, baseType: !944, size: 32, align: 32, offset: 6560)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1081, file: !14, line: 3005, baseType: !944, size: 32, align: 32, offset: 6592)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1081, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1081, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1081, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1081, file: !14, line: 3037, baseType: !938, size: 64, align: 64, offset: 6720)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1081, file: !14, line: 3038, baseType: !944, size: 32, align: 32, offset: 6784)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1081, file: !14, line: 3050, baseType: !949, size: 64, align: 64, offset: 6848)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1081, file: !14, line: 3065, baseType: !944, size: 32, align: 32, offset: 6912)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1081, file: !14, line: 3083, baseType: !944, size: 32, align: 32, offset: 6944)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1081, file: !14, line: 3092, baseType: !969, size: 64, align: 32, offset: 6976)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1081, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1081, file: !14, line: 3106, baseType: !969, size: 64, align: 32, offset: 7072)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1081, file: !14, line: 3113, baseType: !1585, size: 64, align: 64, offset: 7168)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1587)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1589)
!1589 = !{!1590, !1591, !1592, !1593, !1594, !1595, !1598}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1588, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1588, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1588, file: !14, line: 720, baseType: !959, size: 64, align: 64, offset: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1588, file: !14, line: 724, baseType: !959, size: 64, align: 64, offset: 128)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1588, file: !14, line: 728, baseType: !944, size: 32, align: 32, offset: 192)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1588, file: !14, line: 734, baseType: !1596, size: 64, align: 64, offset: 256)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1588, file: !14, line: 739, baseType: !1599, size: 64, align: 64, offset: 320)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1081, file: !14, line: 3129, baseType: !1012, size: 64, align: 64, offset: 7232)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1081, file: !14, line: 3130, baseType: !1012, size: 64, align: 64, offset: 7296)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1081, file: !14, line: 3131, baseType: !1012, size: 64, align: 64, offset: 7360)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1081, file: !14, line: 3132, baseType: !1012, size: 64, align: 64, offset: 7424)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1081, file: !14, line: 3139, baseType: !1495, size: 64, align: 64, offset: 7488)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1081, file: !14, line: 3147, baseType: !944, size: 32, align: 32, offset: 7552)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1081, file: !14, line: 3165, baseType: !944, size: 32, align: 32, offset: 7584)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1081, file: !14, line: 3172, baseType: !944, size: 32, align: 32, offset: 7616)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1081, file: !14, line: 3180, baseType: !944, size: 32, align: 32, offset: 7648)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1081, file: !14, line: 3191, baseType: !1407, size: 64, align: 64, offset: 7680)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1081, file: !14, line: 3199, baseType: !938, size: 64, align: 64, offset: 7744)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1081, file: !14, line: 3207, baseType: !1495, size: 64, align: 64, offset: 7808)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1081, file: !14, line: 3214, baseType: !937, size: 32, align: 32, offset: 7872)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1081, file: !14, line: 3224, baseType: !1236, size: 64, align: 64, offset: 7936)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1081, file: !14, line: 3225, baseType: !944, size: 32, align: 32, offset: 8000)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1081, file: !14, line: 3249, baseType: !1138, size: 64, align: 64, offset: 8064)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1081, file: !14, line: 3256, baseType: !944, size: 32, align: 32, offset: 8128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1081, file: !14, line: 3271, baseType: !944, size: 32, align: 32, offset: 8160)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1081, file: !14, line: 3279, baseType: !1012, size: 64, align: 64, offset: 8192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1081, file: !14, line: 3301, baseType: !1138, size: 64, align: 64, offset: 8256)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1081, file: !14, line: 3310, baseType: !944, size: 32, align: 32, offset: 8320)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1081, file: !14, line: 3337, baseType: !944, size: 32, align: 32, offset: 8352)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1081, file: !14, line: 3351, baseType: !944, size: 32, align: 32, offset: 8384)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1081, file: !14, line: 3359, baseType: !944, size: 32, align: 32, offset: 8416)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !956, file: !14, line: 3535, baseType: !1626, size: 64, align: 64, offset: 1024)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!944, !1079, !1629}
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !956, file: !14, line: 3541, baseType: !1632, size: 64, align: 64, offset: 1088)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1634)
!1634 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1635)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1095, line: 223, size: 128, align: 64, elements: !1636)
!1636 = !{!1637, !1638}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1635, file: !1095, line: 224, baseType: !1521, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1635, file: !1095, line: 225, baseType: !1521, size: 64, align: 64, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !956, file: !14, line: 3549, baseType: !1640, size: 64, align: 64, offset: 1152)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{null, !1074}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !956, file: !14, line: 3551, baseType: !1076, size: 64, align: 64, offset: 1216)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !956, file: !14, line: 3552, baseType: !1645, size: 64, align: 64, offset: 1280)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!944, !1079, !938, !944, !1648}
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1680}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1650, file: !14, line: 3921, baseType: !1408, size: 16, align: 16)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1650, file: !14, line: 3922, baseType: !935, size: 32, align: 32, offset: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1650, file: !14, line: 3923, baseType: !935, size: 32, align: 32, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1650, file: !14, line: 3924, baseType: !937, size: 32, align: 32, offset: 96)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1650, file: !14, line: 3925, baseType: !1657, size: 64, align: 64, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1673, !1675, !1676, !1677, !1678, !1679}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1660, file: !14, line: 3886, baseType: !944, size: 32, align: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1660, file: !14, line: 3887, baseType: !944, size: 32, align: 32, offset: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1660, file: !14, line: 3888, baseType: !944, size: 32, align: 32, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1660, file: !14, line: 3889, baseType: !944, size: 32, align: 32, offset: 96)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1660, file: !14, line: 3890, baseType: !944, size: 32, align: 32, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1660, file: !14, line: 3897, baseType: !1668, size: 768, align: 64, offset: 192)
!1668 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1669)
!1669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1670)
!1670 = !{!1671, !1672}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1669, file: !14, line: 3855, baseType: !1106, size: 512, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1669, file: !14, line: 3857, baseType: !1110, size: 256, align: 32, offset: 512)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1660, file: !14, line: 3903, baseType: !1674, size: 256, align: 64, offset: 960)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 256, align: 64, elements: !1207)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1660, file: !14, line: 3904, baseType: !1214, size: 128, align: 32, offset: 1216)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1660, file: !14, line: 3908, baseType: !1495, size: 64, align: 64, offset: 1408)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1660, file: !14, line: 3915, baseType: !1495, size: 64, align: 64, offset: 1472)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1660, file: !14, line: 3917, baseType: !944, size: 32, align: 32, offset: 1536)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1650, file: !14, line: 3926, baseType: !1012, size: 64, align: 64, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !956, file: !14, line: 3564, baseType: !1682, size: 64, align: 64, offset: 1344)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!944, !1079, !1224, !1368, !1370}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !956, file: !14, line: 3566, baseType: !1686, size: 64, align: 64, offset: 1408)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!944, !1079, !951, !1370, !1224}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !956, file: !14, line: 3567, baseType: !1076, size: 64, align: 64, offset: 1472)
