; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus_pvq.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus_pvq.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CeltPVQ = type { [256 x i32], [256 x float], float (float*, i32*, i32, i32)*, i32 (%struct.CeltPVQ*, %struct.CeltFrame*, %struct.OpusRangeCoder*, i32, float*, float*, i32, i32, i32, float*, i32, float*, i32, float, float*, i32)*, [16 x i8] }
%struct.CeltFrame = type { %struct.AVCodecContext*, [4 x %struct.MDCT15Context*], %struct.AVFloatDSPContext*, [16 x i8], [2 x %struct.CeltBlock], %struct.CeltPVQ*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [21 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, [21 x i32], [21 x i32], [21 x i32], [21 x i32], [21 x i32], [12 x i8] }

!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltBlockSize", file: !898, line: 56, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/opus_celt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!899 = !{!900, !901, !902, !903, !904}
!900 = !DIEnumerator(name: "CELT_BLOCK_120", value: 0)
!901 = !DIEnumerator(name: "CELT_BLOCK_240", value: 1)
!902 = !DIEnumerator(name: "CELT_BLOCK_480", value: 2)
!903 = !DIEnumerator(name: "CELT_BLOCK_960", value: 3)
!904 = !DIEnumerator(name: "CELT_BLOCK_NB", value: 4)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltSpread", file: !898, line: 49, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "CELT_SPREAD_NONE", value: 0)
!908 = !DIEnumerator(name: "CELT_SPREAD_LIGHT", value: 1)
!909 = !DIEnumerator(name: "CELT_SPREAD_NORMAL", value: 2)
!910 = !DIEnumerator(name: "CELT_SPREAD_AGGRESSIVE", value: 3)
!911 = !{!912, !913}
!912 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !914, line: 38, baseType: !915)
!914 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!915 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!916 = !{i32 2, !"Dwarf Version", i32 4}
!917 = !{i32 2, !"Debug Info Version", i32 3}
!918 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!919 = distinct !DISubprogram(name: "ff_celt_pvq_init", scope: !920, file: !920, line: 897, type: !921, isLocal: false, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1785)
!920 = !DIFile(filename: "libavcodec/opus_pvq.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!921 = !DISubroutineType(types: !922)
!922 = !{!915, !923, !915}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "CeltPVQ", file: !898, line: 47, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CeltPVQ", file: !927, line: 35, size: 16640, align: 256, elements: !928)
!927 = !DIFile(filename: "libavcodec/opus_pvq.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !{!929, !933, !935, !941}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "qcoeff", scope: !926, file: !927, line: 36, baseType: !930, size: 8192, align: 32)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 8192, align: 32, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard_tmp", scope: !926, file: !927, line: 37, baseType: !934, size: 8192, align: 32, offset: 8192)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 8192, align: 32, elements: !931)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pvq_search", scope: !926, file: !927, line: 39, baseType: !936, size: 64, align: 64, offset: 16384)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!912, !939, !940, !915, !915}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "quant_band", scope: !926, file: !927, line: 40, baseType: !942, size: 64, align: 64, offset: 16448)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !947, !948, !1751, !1029, !939, !939, !915, !915, !945, !939, !915, !939, !915, !912, !939, !915}
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !914, line: 51, baseType: !946)
!946 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "CeltFrame", file: !950, line: 82, baseType: !951)
!950 = !DIFile(filename: "libavcodec/opus.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CeltFrame", file: !898, line: 92, size: 275968, align: 256, elements: !952)
!952 = !{!953, !1549, !1630, !1673, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !951, file: !898, line: 94, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !957)
!957 = !{!958, !1003, !1004, !1005, !1273, !1274, !1275, !1276, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1302, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1487, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !956, file: !35, line: 1561, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !963)
!963 = !{!964, !968, !973, !977, !978, !979, !980, !984, !990, !992, !996}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !962, file: !4, line: 72, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !962, file: !4, line: 78, baseType: !969, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!965, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !962, file: !4, line: 85, baseType: !974, size: 64, align: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !962, file: !4, line: 93, baseType: !915, size: 32, align: 32, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !962, file: !4, line: 99, baseType: !915, size: 32, align: 32, offset: 224)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !962, file: !4, line: 108, baseType: !915, size: 32, align: 32, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !962, file: !4, line: 113, baseType: !981, size: 64, align: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!972, !972, !972}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !962, file: !4, line: 123, baseType: !985, size: 64, align: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!988, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !962, file: !4, line: 130, baseType: !991, size: 32, align: 32, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !962, file: !4, line: 136, baseType: !993, size: 64, align: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!991, !972}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !962, file: !4, line: 142, baseType: !997, size: 64, align: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!915, !1000, !972, !965, !915}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !956, file: !35, line: 1562, baseType: !915, size: 32, align: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !956, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !956, file: !35, line: 1565, baseType: !1006, size: 64, align: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1024, !1027, !1030, !1033, !1038, !1041, !1042, !1050, !1051, !1052, !1054, !1058, !1064, !1069, !1073, !1074, !1124, !1244, !1248, !1249, !1253, !1257, !1262, !1266, !1267, !1268}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !35, line: 3475, baseType: !965, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1008, file: !35, line: 3480, baseType: !965, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1008, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1008, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1008, file: !35, line: 3487, baseType: !915, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1008, file: !35, line: 3488, baseType: !1016, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1019, line: 61, baseType: !1020)
!1019 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1019, line: 58, size: 64, align: 32, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1020, file: !1019, line: 59, baseType: !915, size: 32, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1020, file: !1019, line: 60, baseType: !915, size: 32, align: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1008, file: !35, line: 3489, baseType: !1025, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1008, file: !35, line: 3490, baseType: !1028, size: 64, align: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1008, file: !35, line: 3491, baseType: !1031, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1008, file: !35, line: 3492, baseType: !1034, size: 64, align: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !914, line: 55, baseType: !1037)
!1037 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1008, file: !35, line: 3493, baseType: !1039, size: 8, align: 8, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !914, line: 48, baseType: !1040)
!1040 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1008, file: !35, line: 3494, baseType: !959, size: 64, align: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1008, file: !35, line: 3495, baseType: !1043, size: 64, align: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1046, file: !35, line: 3402, baseType: !915, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1046, file: !35, line: 3403, baseType: !965, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1008, file: !35, line: 3507, baseType: !965, size: 64, align: 64, offset: 768)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1008, file: !35, line: 3516, baseType: !915, size: 32, align: 32, offset: 832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1008, file: !35, line: 3517, baseType: !1053, size: 64, align: 64, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1008, file: !35, line: 3527, baseType: !1055, size: 64, align: 64, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!915, !954}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1008, file: !35, line: 3535, baseType: !1059, size: 64, align: 64, offset: 1024)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!915, !954, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1008, file: !35, line: 3541, baseType: !1065, size: 64, align: 64, offset: 1088)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1068)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1008, file: !35, line: 3549, baseType: !1070, size: 64, align: 64, offset: 1152)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !1053}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1008, file: !35, line: 3551, baseType: !1055, size: 64, align: 64, offset: 1216)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1008, file: !35, line: 3552, baseType: !1075, size: 64, align: 64, offset: 1280)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!915, !954, !1078, !915, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1082)
!1082 = !{!1083, !1086, !1087, !1088, !1089, !1121}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1081, file: !35, line: 3921, baseType: !1084, size: 16, align: 16)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !914, line: 49, baseType: !1085)
!1085 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1081, file: !35, line: 3922, baseType: !945, size: 32, align: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1081, file: !35, line: 3923, baseType: !945, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1081, file: !35, line: 3924, baseType: !946, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1081, file: !35, line: 3925, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1110, !1114, !1116, !1117, !1119, !1120}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1093, file: !35, line: 3886, baseType: !915, size: 32, align: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1093, file: !35, line: 3887, baseType: !915, size: 32, align: 32, offset: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1093, file: !35, line: 3888, baseType: !915, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1093, file: !35, line: 3889, baseType: !915, size: 32, align: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1093, file: !35, line: 3890, baseType: !915, size: 32, align: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1093, file: !35, line: 3897, baseType: !1101, size: 768, align: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1103)
!1103 = !{!1104, !1108}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1102, file: !35, line: 3855, baseType: !1105, size: 512, align: 64)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 512, align: 64, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 8)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1102, file: !35, line: 3857, baseType: !1109, size: 256, align: 32, offset: 512)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 256, align: 32, elements: !1106)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1093, file: !35, line: 3903, baseType: !1111, size: 256, align: 64, offset: 960)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 256, align: 64, elements: !1112)
!1112 = !{!1113}
!1113 = !DISubrange(count: 4)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1093, file: !35, line: 3904, baseType: !1115, size: 128, align: 32, offset: 1216)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 128, align: 32, elements: !1112)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1093, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1093, file: !35, line: 3908, baseType: !1118, size: 64, align: 64, offset: 1408)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1093, file: !35, line: 3915, baseType: !1118, size: 64, align: 64, offset: 1472)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !35, line: 3917, baseType: !915, size: 32, align: 32, offset: 1536)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1081, file: !35, line: 3926, baseType: !1122, size: 64, align: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !914, line: 40, baseType: !1123)
!1123 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1008, file: !35, line: 3564, baseType: !1125, size: 64, align: 64, offset: 1344)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!915, !954, !1128, !1162, !940}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1131)
!1131 = !{!1132, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1158, !1159, !1160, !1161}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1130, file: !35, line: 1451, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1135, line: 94, baseType: !1136)
!1135 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1135, line: 81, size: 192, align: 64, elements: !1137)
!1137 = !{!1138, !1142, !1143}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1136, file: !1135, line: 82, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1135, line: 73, baseType: !1141)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1135, line: 73, flags: DIFlagFwdDecl)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1136, file: !1135, line: 89, baseType: !1078, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1136, file: !1135, line: 93, baseType: !915, size: 32, align: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1130, file: !35, line: 1461, baseType: !1122, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1130, file: !35, line: 1467, baseType: !1122, size: 64, align: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1130, file: !35, line: 1468, baseType: !1078, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !35, line: 1469, baseType: !915, size: 32, align: 32, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1130, file: !35, line: 1470, baseType: !915, size: 32, align: 32, offset: 288)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1130, file: !35, line: 1474, baseType: !915, size: 32, align: 32, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1130, file: !35, line: 1479, baseType: !1151, size: 64, align: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !35, line: 1412, baseType: !1078, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !35, line: 1413, baseType: !915, size: 32, align: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1153, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1130, file: !35, line: 1480, baseType: !915, size: 32, align: 32, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1130, file: !35, line: 1486, baseType: !1122, size: 64, align: 64, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1130, file: !35, line: 1488, baseType: !1122, size: 64, align: 64, offset: 576)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1130, file: !35, line: 1497, baseType: !1122, size: 64, align: 64, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196, !1198, !1199, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1232, !1233, !1234, !1235, !1236, !1237, !1240, !1241, !1242, !1243}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1165, file: !758, line: 282, baseType: !1105, size: 512, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1165, file: !758, line: 299, baseType: !1109, size: 256, align: 32, offset: 512)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1165, file: !758, line: 315, baseType: !1170, size: 64, align: 64, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1165, file: !758, line: 326, baseType: !915, size: 32, align: 32, offset: 832)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1165, file: !758, line: 326, baseType: !915, size: 32, align: 32, offset: 864)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1165, file: !758, line: 334, baseType: !915, size: 32, align: 32, offset: 896)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1165, file: !758, line: 341, baseType: !915, size: 32, align: 32, offset: 928)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1165, file: !758, line: 346, baseType: !915, size: 32, align: 32, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1165, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1165, file: !758, line: 356, baseType: !1018, size: 64, align: 32, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1165, file: !758, line: 361, baseType: !1122, size: 64, align: 64, offset: 1088)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1165, file: !758, line: 369, baseType: !1122, size: 64, align: 64, offset: 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1165, file: !758, line: 377, baseType: !1122, size: 64, align: 64, offset: 1216)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1165, file: !758, line: 382, baseType: !915, size: 32, align: 32, offset: 1280)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1165, file: !758, line: 386, baseType: !915, size: 32, align: 32, offset: 1312)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1165, file: !758, line: 391, baseType: !915, size: 32, align: 32, offset: 1344)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1165, file: !758, line: 396, baseType: !972, size: 64, align: 64, offset: 1408)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1165, file: !758, line: 403, baseType: !1186, size: 512, align: 64, offset: 1472)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 512, align: 64, elements: !1106)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1165, file: !758, line: 410, baseType: !915, size: 32, align: 32, offset: 1984)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1165, file: !758, line: 415, baseType: !915, size: 32, align: 32, offset: 2016)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1165, file: !758, line: 420, baseType: !915, size: 32, align: 32, offset: 2048)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1165, file: !758, line: 425, baseType: !915, size: 32, align: 32, offset: 2080)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1165, file: !758, line: 435, baseType: !1122, size: 64, align: 64, offset: 2112)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1165, file: !758, line: 440, baseType: !915, size: 32, align: 32, offset: 2176)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1165, file: !758, line: 445, baseType: !1036, size: 64, align: 64, offset: 2240)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1165, file: !758, line: 459, baseType: !1195, size: 512, align: 64, offset: 2304)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 512, align: 64, elements: !1106)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1165, file: !758, line: 473, baseType: !1197, size: 64, align: 64, offset: 2816)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1165, file: !758, line: 477, baseType: !915, size: 32, align: 32, offset: 2880)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1165, file: !758, line: 479, baseType: !1200, size: 64, align: 64, offset: 2944)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1213}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1203, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1203, file: !758, line: 203, baseType: !1078, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !758, line: 204, baseType: !915, size: 32, align: 32, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1203, file: !758, line: 205, baseType: !1209, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1211, line: 86, baseType: !1212)
!1211 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1211, line: 86, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1203, file: !758, line: 206, baseType: !1133, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1165, file: !758, line: 480, baseType: !915, size: 32, align: 32, offset: 3008)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1165, file: !758, line: 505, baseType: !915, size: 32, align: 32, offset: 3040)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1165, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1165, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1165, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1165, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1165, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1165, file: !758, line: 532, baseType: !1122, size: 64, align: 64, offset: 3264)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1165, file: !758, line: 539, baseType: !1122, size: 64, align: 64, offset: 3328)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1165, file: !758, line: 547, baseType: !1122, size: 64, align: 64, offset: 3392)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1165, file: !758, line: 554, baseType: !1209, size: 64, align: 64, offset: 3456)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1165, file: !758, line: 563, baseType: !915, size: 32, align: 32, offset: 3520)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1165, file: !758, line: 572, baseType: !915, size: 32, align: 32, offset: 3552)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1165, file: !758, line: 581, baseType: !915, size: 32, align: 32, offset: 3584)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1165, file: !758, line: 588, baseType: !1229, size: 64, align: 64, offset: 3648)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !914, line: 36, baseType: !1231)
!1231 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1165, file: !758, line: 593, baseType: !915, size: 32, align: 32, offset: 3712)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1165, file: !758, line: 596, baseType: !915, size: 32, align: 32, offset: 3744)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1165, file: !758, line: 599, baseType: !1133, size: 64, align: 64, offset: 3776)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1165, file: !758, line: 605, baseType: !1133, size: 64, align: 64, offset: 3840)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1165, file: !758, line: 616, baseType: !1133, size: 64, align: 64, offset: 3904)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1165, file: !758, line: 626, baseType: !1238, size: 64, align: 64, offset: 3968)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1239, line: 216, baseType: !1037)
!1239 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1165, file: !758, line: 627, baseType: !1238, size: 64, align: 64, offset: 4032)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1165, file: !758, line: 628, baseType: !1238, size: 64, align: 64, offset: 4096)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1165, file: !758, line: 629, baseType: !1238, size: 64, align: 64, offset: 4160)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1165, file: !758, line: 645, baseType: !1133, size: 64, align: 64, offset: 4224)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1008, file: !35, line: 3566, baseType: !1245, size: 64, align: 64, offset: 1408)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!915, !954, !972, !940, !1128}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1008, file: !35, line: 3567, baseType: !1055, size: 64, align: 64, offset: 1472)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1008, file: !35, line: 3576, baseType: !1250, size: 64, align: 64, offset: 1536)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!915, !954, !1162}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1008, file: !35, line: 3577, baseType: !1254, size: 64, align: 64, offset: 1600)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!915, !954, !1128}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1008, file: !35, line: 3584, baseType: !1258, size: 64, align: 64, offset: 1664)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!915, !954, !1261}
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1008, file: !35, line: 3589, baseType: !1263, size: 64, align: 64, offset: 1728)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !954}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1008, file: !35, line: 3594, baseType: !915, size: 32, align: 32, offset: 1792)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1008, file: !35, line: 3600, baseType: !965, size: 64, align: 64, offset: 1856)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1008, file: !35, line: 3609, baseType: !1269, size: 64, align: 64, offset: 1920)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !956, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !956, file: !35, line: 1581, baseType: !946, size: 32, align: 32, offset: 224)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !956, file: !35, line: 1583, baseType: !972, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !956, file: !35, line: 1591, baseType: !1277, size: 64, align: 64, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !956, file: !35, line: 1598, baseType: !972, size: 64, align: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !956, file: !35, line: 1606, baseType: !1122, size: 64, align: 64, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !956, file: !35, line: 1614, baseType: !915, size: 32, align: 32, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !956, file: !35, line: 1622, baseType: !915, size: 32, align: 32, offset: 544)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !956, file: !35, line: 1628, baseType: !915, size: 32, align: 32, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !35, line: 1636, baseType: !915, size: 32, align: 32, offset: 608)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !956, file: !35, line: 1643, baseType: !915, size: 32, align: 32, offset: 640)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !956, file: !35, line: 1657, baseType: !1078, size: 64, align: 64, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !956, file: !35, line: 1658, baseType: !915, size: 32, align: 32, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !956, file: !35, line: 1679, baseType: !1018, size: 64, align: 32, offset: 800)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !956, file: !35, line: 1688, baseType: !915, size: 32, align: 32, offset: 864)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !956, file: !35, line: 1712, baseType: !915, size: 32, align: 32, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !956, file: !35, line: 1729, baseType: !915, size: 32, align: 32, offset: 928)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !956, file: !35, line: 1729, baseType: !915, size: 32, align: 32, offset: 960)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !956, file: !35, line: 1744, baseType: !915, size: 32, align: 32, offset: 992)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !956, file: !35, line: 1744, baseType: !915, size: 32, align: 32, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !956, file: !35, line: 1751, baseType: !915, size: 32, align: 32, offset: 1056)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !956, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !956, file: !35, line: 1791, baseType: !1298, size: 64, align: 64, offset: 1152)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !1301, !1162, !940, !915, !915, !915}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !956, file: !35, line: 1808, baseType: !1303, size: 64, align: 64, offset: 1216)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!494, !1301, !1025}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !956, file: !35, line: 1816, baseType: !915, size: 32, align: 32, offset: 1280)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !956, file: !35, line: 1825, baseType: !912, size: 32, align: 32, offset: 1312)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !956, file: !35, line: 1830, baseType: !915, size: 32, align: 32, offset: 1344)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !956, file: !35, line: 1838, baseType: !912, size: 32, align: 32, offset: 1376)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !956, file: !35, line: 1846, baseType: !915, size: 32, align: 32, offset: 1408)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !956, file: !35, line: 1851, baseType: !915, size: 32, align: 32, offset: 1440)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !956, file: !35, line: 1861, baseType: !912, size: 32, align: 32, offset: 1472)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !956, file: !35, line: 1868, baseType: !912, size: 32, align: 32, offset: 1504)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !956, file: !35, line: 1875, baseType: !912, size: 32, align: 32, offset: 1536)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !956, file: !35, line: 1882, baseType: !912, size: 32, align: 32, offset: 1568)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !956, file: !35, line: 1889, baseType: !912, size: 32, align: 32, offset: 1600)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !956, file: !35, line: 1896, baseType: !912, size: 32, align: 32, offset: 1632)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !956, file: !35, line: 1903, baseType: !912, size: 32, align: 32, offset: 1664)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !956, file: !35, line: 1910, baseType: !915, size: 32, align: 32, offset: 1696)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !956, file: !35, line: 1915, baseType: !915, size: 32, align: 32, offset: 1728)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !956, file: !35, line: 1926, baseType: !940, size: 64, align: 64, offset: 1792)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !956, file: !35, line: 1935, baseType: !1018, size: 64, align: 32, offset: 1856)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !956, file: !35, line: 1942, baseType: !915, size: 32, align: 32, offset: 1920)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !956, file: !35, line: 1948, baseType: !915, size: 32, align: 32, offset: 1952)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !956, file: !35, line: 1954, baseType: !915, size: 32, align: 32, offset: 1984)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !956, file: !35, line: 1960, baseType: !915, size: 32, align: 32, offset: 2016)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !956, file: !35, line: 1984, baseType: !915, size: 32, align: 32, offset: 2048)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !956, file: !35, line: 1991, baseType: !915, size: 32, align: 32, offset: 2080)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !956, file: !35, line: 1996, baseType: !915, size: 32, align: 32, offset: 2112)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !956, file: !35, line: 2004, baseType: !915, size: 32, align: 32, offset: 2144)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !956, file: !35, line: 2011, baseType: !915, size: 32, align: 32, offset: 2176)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !956, file: !35, line: 2018, baseType: !915, size: 32, align: 32, offset: 2208)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !956, file: !35, line: 2027, baseType: !915, size: 32, align: 32, offset: 2240)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !956, file: !35, line: 2034, baseType: !915, size: 32, align: 32, offset: 2272)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !956, file: !35, line: 2044, baseType: !915, size: 32, align: 32, offset: 2304)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !956, file: !35, line: 2054, baseType: !1337, size: 64, align: 64, offset: 2368)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !956, file: !35, line: 2061, baseType: !1337, size: 64, align: 64, offset: 2432)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !956, file: !35, line: 2066, baseType: !915, size: 32, align: 32, offset: 2496)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !956, file: !35, line: 2070, baseType: !915, size: 32, align: 32, offset: 2528)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !956, file: !35, line: 2078, baseType: !915, size: 32, align: 32, offset: 2560)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !956, file: !35, line: 2085, baseType: !915, size: 32, align: 32, offset: 2592)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !956, file: !35, line: 2092, baseType: !915, size: 32, align: 32, offset: 2624)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !956, file: !35, line: 2099, baseType: !915, size: 32, align: 32, offset: 2656)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !956, file: !35, line: 2106, baseType: !915, size: 32, align: 32, offset: 2688)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !956, file: !35, line: 2113, baseType: !915, size: 32, align: 32, offset: 2720)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !956, file: !35, line: 2120, baseType: !915, size: 32, align: 32, offset: 2752)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !956, file: !35, line: 2125, baseType: !915, size: 32, align: 32, offset: 2784)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !956, file: !35, line: 2133, baseType: !915, size: 32, align: 32, offset: 2816)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !956, file: !35, line: 2140, baseType: !915, size: 32, align: 32, offset: 2848)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !956, file: !35, line: 2145, baseType: !915, size: 32, align: 32, offset: 2880)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !956, file: !35, line: 2153, baseType: !915, size: 32, align: 32, offset: 2912)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !956, file: !35, line: 2158, baseType: !915, size: 32, align: 32, offset: 2944)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !956, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !956, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !956, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !956, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !956, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !956, file: !35, line: 2203, baseType: !915, size: 32, align: 32, offset: 3136)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !956, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !956, file: !35, line: 2212, baseType: !915, size: 32, align: 32, offset: 3200)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !956, file: !35, line: 2213, baseType: !915, size: 32, align: 32, offset: 3232)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !956, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !956, file: !35, line: 2232, baseType: !915, size: 32, align: 32, offset: 3296)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !956, file: !35, line: 2243, baseType: !915, size: 32, align: 32, offset: 3328)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !956, file: !35, line: 2249, baseType: !915, size: 32, align: 32, offset: 3360)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !956, file: !35, line: 2256, baseType: !915, size: 32, align: 32, offset: 3392)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !956, file: !35, line: 2263, baseType: !1036, size: 64, align: 64, offset: 3456)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !956, file: !35, line: 2270, baseType: !1036, size: 64, align: 64, offset: 3520)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !956, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !956, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !956, file: !35, line: 2367, baseType: !1373, size: 64, align: 64, offset: 3648)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!915, !1301, !1261, !915}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !956, file: !35, line: 2383, baseType: !915, size: 32, align: 32, offset: 3712)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !956, file: !35, line: 2386, baseType: !912, size: 32, align: 32, offset: 3744)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !956, file: !35, line: 2387, baseType: !912, size: 32, align: 32, offset: 3776)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !956, file: !35, line: 2394, baseType: !915, size: 32, align: 32, offset: 3808)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !956, file: !35, line: 2401, baseType: !915, size: 32, align: 32, offset: 3840)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !956, file: !35, line: 2408, baseType: !915, size: 32, align: 32, offset: 3872)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !956, file: !35, line: 2415, baseType: !915, size: 32, align: 32, offset: 3904)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !956, file: !35, line: 2422, baseType: !915, size: 32, align: 32, offset: 3936)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !956, file: !35, line: 2423, baseType: !1385, size: 64, align: 64, offset: 3968)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1387, file: !35, line: 827, baseType: !915, size: 32, align: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1387, file: !35, line: 828, baseType: !915, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1387, file: !35, line: 829, baseType: !915, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1387, file: !35, line: 830, baseType: !912, size: 32, align: 32, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !956, file: !35, line: 2430, baseType: !1122, size: 64, align: 64, offset: 4032)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !956, file: !35, line: 2437, baseType: !1122, size: 64, align: 64, offset: 4096)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !956, file: !35, line: 2444, baseType: !912, size: 32, align: 32, offset: 4160)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !956, file: !35, line: 2451, baseType: !912, size: 32, align: 32, offset: 4192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !956, file: !35, line: 2458, baseType: !915, size: 32, align: 32, offset: 4224)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !956, file: !35, line: 2469, baseType: !915, size: 32, align: 32, offset: 4256)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !956, file: !35, line: 2475, baseType: !915, size: 32, align: 32, offset: 4288)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !956, file: !35, line: 2481, baseType: !915, size: 32, align: 32, offset: 4320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !956, file: !35, line: 2485, baseType: !915, size: 32, align: 32, offset: 4352)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !956, file: !35, line: 2489, baseType: !915, size: 32, align: 32, offset: 4384)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !956, file: !35, line: 2493, baseType: !915, size: 32, align: 32, offset: 4416)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !956, file: !35, line: 2501, baseType: !915, size: 32, align: 32, offset: 4448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !956, file: !35, line: 2506, baseType: !915, size: 32, align: 32, offset: 4480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !956, file: !35, line: 2510, baseType: !915, size: 32, align: 32, offset: 4512)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !956, file: !35, line: 2514, baseType: !1122, size: 64, align: 64, offset: 4544)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !956, file: !35, line: 2528, baseType: !1409, size: 64, align: 64, offset: 4608)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{null, !1301, !972, !915, !915}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !956, file: !35, line: 2534, baseType: !915, size: 32, align: 32, offset: 4672)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !956, file: !35, line: 2545, baseType: !915, size: 32, align: 32, offset: 4704)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !956, file: !35, line: 2547, baseType: !915, size: 32, align: 32, offset: 4736)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !956, file: !35, line: 2549, baseType: !915, size: 32, align: 32, offset: 4768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !956, file: !35, line: 2551, baseType: !915, size: 32, align: 32, offset: 4800)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !956, file: !35, line: 2553, baseType: !915, size: 32, align: 32, offset: 4832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !956, file: !35, line: 2555, baseType: !915, size: 32, align: 32, offset: 4864)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !956, file: !35, line: 2557, baseType: !915, size: 32, align: 32, offset: 4896)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !956, file: !35, line: 2559, baseType: !915, size: 32, align: 32, offset: 4928)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !956, file: !35, line: 2563, baseType: !915, size: 32, align: 32, offset: 4960)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !956, file: !35, line: 2571, baseType: !1118, size: 64, align: 64, offset: 4992)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !956, file: !35, line: 2579, baseType: !1118, size: 64, align: 64, offset: 5056)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !956, file: !35, line: 2586, baseType: !915, size: 32, align: 32, offset: 5120)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !956, file: !35, line: 2615, baseType: !915, size: 32, align: 32, offset: 5152)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !956, file: !35, line: 2627, baseType: !915, size: 32, align: 32, offset: 5184)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !956, file: !35, line: 2637, baseType: !915, size: 32, align: 32, offset: 5216)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !956, file: !35, line: 2681, baseType: !915, size: 32, align: 32, offset: 5248)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !956, file: !35, line: 2709, baseType: !1122, size: 64, align: 64, offset: 5312)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !956, file: !35, line: 2716, baseType: !1431, size: 64, align: 64, offset: 5376)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438, !1439, !1440, !1441, !1447, !1451, !1452, !1453, !1454, !1460, !1461, !1462, !1463, !1464}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1433, file: !35, line: 3642, baseType: !965, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1433, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1433, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1433, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1433, file: !35, line: 3669, baseType: !915, size: 32, align: 32, offset: 160)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1433, file: !35, line: 3682, baseType: !1258, size: 64, align: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1433, file: !35, line: 3698, baseType: !1442, size: 64, align: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!915, !954, !1445, !945}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1433, file: !35, line: 3712, baseType: !1448, size: 64, align: 64, offset: 320)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!915, !954, !915, !1445, !945}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1433, file: !35, line: 3726, baseType: !1442, size: 64, align: 64, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1433, file: !35, line: 3737, baseType: !1055, size: 64, align: 64, offset: 448)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1433, file: !35, line: 3746, baseType: !915, size: 32, align: 32, offset: 512)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1433, file: !35, line: 3757, baseType: !1455, size: 64, align: 64, offset: 576)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{null, !1458}
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1433, file: !35, line: 3766, baseType: !1055, size: 64, align: 64, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1433, file: !35, line: 3774, baseType: !1055, size: 64, align: 64, offset: 704)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1433, file: !35, line: 3780, baseType: !915, size: 32, align: 32, offset: 768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1433, file: !35, line: 3785, baseType: !915, size: 32, align: 32, offset: 800)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1433, file: !35, line: 3795, baseType: !1465, size: 64, align: 64, offset: 832)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!915, !954, !1133}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !956, file: !35, line: 2728, baseType: !972, size: 64, align: 64, offset: 5440)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !956, file: !35, line: 2735, baseType: !1186, size: 512, align: 64, offset: 5504)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !956, file: !35, line: 2742, baseType: !915, size: 32, align: 32, offset: 6016)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !956, file: !35, line: 2755, baseType: !915, size: 32, align: 32, offset: 6048)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !956, file: !35, line: 2776, baseType: !915, size: 32, align: 32, offset: 6080)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !956, file: !35, line: 2783, baseType: !915, size: 32, align: 32, offset: 6112)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !956, file: !35, line: 2791, baseType: !915, size: 32, align: 32, offset: 6144)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !956, file: !35, line: 2802, baseType: !1261, size: 64, align: 64, offset: 6208)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !956, file: !35, line: 2811, baseType: !915, size: 32, align: 32, offset: 6272)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !956, file: !35, line: 2821, baseType: !915, size: 32, align: 32, offset: 6304)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !956, file: !35, line: 2830, baseType: !915, size: 32, align: 32, offset: 6336)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !956, file: !35, line: 2840, baseType: !915, size: 32, align: 32, offset: 6368)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !956, file: !35, line: 2851, baseType: !1481, size: 64, align: 64, offset: 6400)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!915, !1301, !1484, !972, !940, !915, !915}
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!915, !1301, !972}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !956, file: !35, line: 2871, baseType: !1488, size: 64, align: 64, offset: 6464)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!915, !1301, !1491, !972, !940, !915}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!915, !1301, !972, !915, !915}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !956, file: !35, line: 2878, baseType: !915, size: 32, align: 32, offset: 6528)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !956, file: !35, line: 2885, baseType: !915, size: 32, align: 32, offset: 6560)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !956, file: !35, line: 3005, baseType: !915, size: 32, align: 32, offset: 6592)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !956, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !956, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !956, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !956, file: !35, line: 3037, baseType: !1078, size: 64, align: 64, offset: 6720)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !956, file: !35, line: 3038, baseType: !915, size: 32, align: 32, offset: 6784)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !956, file: !35, line: 3050, baseType: !1036, size: 64, align: 64, offset: 6848)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !956, file: !35, line: 3065, baseType: !915, size: 32, align: 32, offset: 6912)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !956, file: !35, line: 3083, baseType: !915, size: 32, align: 32, offset: 6944)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !956, file: !35, line: 3092, baseType: !1018, size: 64, align: 32, offset: 6976)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !956, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !956, file: !35, line: 3106, baseType: !1018, size: 64, align: 32, offset: 7072)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !956, file: !35, line: 3113, baseType: !1509, size: 64, align: 64, offset: 7168)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1511)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1513)
!1513 = !{!1514, !1515, !1516, !1517, !1518, !1519, !1522}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1512, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1512, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1512, file: !35, line: 720, baseType: !965, size: 64, align: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1512, file: !35, line: 724, baseType: !965, size: 64, align: 64, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1512, file: !35, line: 728, baseType: !915, size: 32, align: 32, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1512, file: !35, line: 734, baseType: !1520, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1512, file: !35, line: 739, baseType: !1523, size: 64, align: 64, offset: 320)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !956, file: !35, line: 3129, baseType: !1122, size: 64, align: 64, offset: 7232)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !956, file: !35, line: 3130, baseType: !1122, size: 64, align: 64, offset: 7296)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !956, file: !35, line: 3131, baseType: !1122, size: 64, align: 64, offset: 7360)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !956, file: !35, line: 3132, baseType: !1122, size: 64, align: 64, offset: 7424)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !956, file: !35, line: 3139, baseType: !1118, size: 64, align: 64, offset: 7488)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !956, file: !35, line: 3147, baseType: !915, size: 32, align: 32, offset: 7552)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !956, file: !35, line: 3165, baseType: !915, size: 32, align: 32, offset: 7584)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !956, file: !35, line: 3172, baseType: !915, size: 32, align: 32, offset: 7616)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !956, file: !35, line: 3180, baseType: !915, size: 32, align: 32, offset: 7648)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !956, file: !35, line: 3191, baseType: !1337, size: 64, align: 64, offset: 7680)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !956, file: !35, line: 3199, baseType: !1078, size: 64, align: 64, offset: 7744)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !956, file: !35, line: 3207, baseType: !1118, size: 64, align: 64, offset: 7808)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !956, file: !35, line: 3214, baseType: !946, size: 32, align: 32, offset: 7872)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !956, file: !35, line: 3224, baseType: !1151, size: 64, align: 64, offset: 7936)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !956, file: !35, line: 3225, baseType: !915, size: 32, align: 32, offset: 8000)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !956, file: !35, line: 3249, baseType: !1133, size: 64, align: 64, offset: 8064)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !956, file: !35, line: 3256, baseType: !915, size: 32, align: 32, offset: 8128)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !956, file: !35, line: 3271, baseType: !915, size: 32, align: 32, offset: 8160)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !956, file: !35, line: 3279, baseType: !1122, size: 64, align: 64, offset: 8192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !956, file: !35, line: 3301, baseType: !1133, size: 64, align: 64, offset: 8256)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !956, file: !35, line: 3310, baseType: !915, size: 32, align: 32, offset: 8320)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !956, file: !35, line: 3337, baseType: !915, size: 32, align: 32, offset: 8352)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !956, file: !35, line: 3351, baseType: !915, size: 32, align: 32, offset: 8384)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !956, file: !35, line: 3359, baseType: !915, size: 32, align: 32, offset: 8416)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "imdct", scope: !951, file: !898, line: 95, baseType: !1550, size: 256, align: 64, offset: 64)
!1550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1551, size: 256, align: 64, elements: !1112)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDCT15Context", file: !1553, line: 54, baseType: !1554)
!1553 = !DIFile(filename: "libavcodec/mdct15.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDCT15Context", file: !1553, line: 28, size: 5632, align: 256, elements: !1555)
!1555 = !{!1556, !1557, !1558, !1559, !1560, !1561, !1562, !1607, !1608, !1609, !1613, !1618, !1622, !1629}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "fft_n", scope: !1554, file: !1553, line: 29, baseType: !915, size: 32, align: 32)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "len2", scope: !1554, file: !1553, line: 30, baseType: !915, size: 32, align: 32, offset: 32)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "len4", scope: !1554, file: !1553, line: 31, baseType: !915, size: 32, align: 32, offset: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1554, file: !1553, line: 32, baseType: !915, size: 32, align: 32, offset: 96)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_prereindex", scope: !1554, file: !1553, line: 33, baseType: !940, size: 64, align: 64, offset: 128)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_postreindex", scope: !1554, file: !1553, line: 34, baseType: !940, size: 64, align: 64, offset: 192)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "ptwo_fft", scope: !1554, file: !1553, line: 36, baseType: !1563, size: 896, align: 64, offset: 256)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1564, line: 41, baseType: !1565)
!1564 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !888, line: 88, size: 896, align: 64, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570, !1578, !1579, !1580, !1582, !1583, !1588, !1589, !1595, !1596, !1597, !1603, !1604, !1605}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1565, file: !888, line: 89, baseType: !915, size: 32, align: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1565, file: !888, line: 90, baseType: !915, size: 32, align: 32, offset: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1565, file: !888, line: 91, baseType: !1337, size: 64, align: 64, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1565, file: !888, line: 92, baseType: !1571, size: 64, align: 64, offset: 128)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1564, line: 39, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1564, line: 37, size: 64, align: 32, elements: !1574)
!1574 = !{!1575, !1577}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1573, file: !1564, line: 38, baseType: !1576, size: 32, align: 32)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1564, line: 35, baseType: !912)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1573, file: !1564, line: 38, baseType: !1576, size: 32, align: 32, offset: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1565, file: !888, line: 93, baseType: !915, size: 32, align: 32, offset: 192)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1565, file: !888, line: 94, baseType: !915, size: 32, align: 32, offset: 224)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1565, file: !888, line: 96, baseType: !1581, size: 64, align: 64, offset: 256)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1565, file: !888, line: 97, baseType: !1581, size: 64, align: 64, offset: 320)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1565, file: !888, line: 101, baseType: !1584, size: 64, align: 64, offset: 384)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DISubroutineType(types: !1586)
!1586 = !{null, !1587, !1571}
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1565, file: !888, line: 106, baseType: !1584, size: 64, align: 64, offset: 448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1565, file: !888, line: 107, baseType: !1590, size: 64, align: 64, offset: 512)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{null, !1587, !1581, !1593}
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1576)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1565, file: !888, line: 108, baseType: !1590, size: 64, align: 64, offset: 576)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1565, file: !888, line: 109, baseType: !1590, size: 64, align: 64, offset: 640)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1565, file: !888, line: 110, baseType: !1598, size: 64, align: 64, offset: 704)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{null, !1587, !1601, !1593}
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !888, line: 43, baseType: !912)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1565, file: !888, line: 111, baseType: !887, size: 32, align: 32, offset: 768)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1565, file: !888, line: 112, baseType: !893, size: 32, align: 32, offset: 800)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1565, file: !888, line: 113, baseType: !1606, size: 64, align: 64, offset: 832)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1554, file: !1553, line: 37, baseType: !1571, size: 64, align: 64, offset: 1152)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "twiddle_exptab", scope: !1554, file: !1553, line: 38, baseType: !1571, size: 64, align: 64, offset: 1216)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "exptab", scope: !1554, file: !1553, line: 40, baseType: !1610, size: 4096, align: 32, offset: 1280)
!1610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1572, size: 4096, align: 32, elements: !1611)
!1611 = !{!1612}
!1612 = !DISubrange(count: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "fft15", scope: !1554, file: !1553, line: 43, baseType: !1614, size: 64, align: 64, offset: 5376)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{null, !1571, !1571, !1571, !1617}
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1239, line: 149, baseType: !1123)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "postreindex", scope: !1554, file: !1553, line: 46, baseType: !1619, size: 64, align: 64, offset: 5440)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1571, !1571, !1571, !940, !1617}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1554, file: !1553, line: 49, baseType: !1623, size: 64, align: 64, offset: 5504)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{null, !1626, !939, !1627, !1617}
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1554, file: !1553, line: 52, baseType: !1623, size: 64, align: 64, offset: 5568)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !951, file: !898, line: 96, baseType: !1631, size: 64, align: 64, offset: 320)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1633, line: 192, baseType: !1634)
!1633 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1633, line: 24, size: 704, align: 64, elements: !1635)
!1635 = !{!1636, !1640, !1644, !1652, !1653, !1654, !1658, !1659, !1660, !1665, !1669}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1634, file: !1633, line: 38, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !939, !1627, !1627, !915}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1634, file: !1633, line: 54, baseType: !1641, size: 64, align: 64, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !939, !1627, !912, !915}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1634, file: !1633, line: 70, baseType: !1645, size: 64, align: 64, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !1648, !1650, !1649, !915}
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1649)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1634, file: !1633, line: 85, baseType: !1641, size: 64, align: 64, offset: 192)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1634, file: !1633, line: 100, baseType: !1645, size: 64, align: 64, offset: 256)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1634, file: !1633, line: 119, baseType: !1655, size: 64, align: 64, offset: 320)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{null, !939, !1627, !1627, !1627, !915}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1634, file: !1633, line: 137, baseType: !1655, size: 64, align: 64, offset: 384)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1634, file: !1633, line: 154, baseType: !1637, size: 64, align: 64, offset: 448)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1634, file: !1633, line: 164, baseType: !1661, size: 64, align: 64, offset: 512)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{null, !1664, !1664, !915}
!1664 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !939)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1634, file: !1633, line: 175, baseType: !1666, size: 64, align: 64, offset: 576)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!912, !1627, !1627, !915}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !1634, file: !1633, line: 190, baseType: !1670, size: 64, align: 64, offset: 640)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1648, !1650, !1650, !915}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !951, file: !898, line: 97, baseType: !1674, size: 270336, align: 256, offset: 512)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1675, size: 270336, align: 256, elements: !1713)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "CeltBlock", file: !898, line: 90, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CeltBlock", file: !898, line: 65, size: 135168, align: 256, elements: !1677)
!1677 = !{!1678, !1682, !1683, !1684, !1688, !1690, !1694, !1698, !1702, !1703, !1704, !1708, !1709, !1710, !1711, !1712}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !1676, file: !898, line: 66, baseType: !1679, size: 672, align: 32)
!1679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 672, align: 32, elements: !1680)
!1680 = !{!1681}
!1681 = !DISubrange(count: 21)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "lin_energy", scope: !1676, file: !898, line: 67, baseType: !1679, size: 672, align: 32, offset: 672)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "error_energy", scope: !1676, file: !898, line: 68, baseType: !1679, size: 672, align: 32, offset: 1344)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "prev_energy", scope: !1676, file: !898, line: 69, baseType: !1685, size: 1344, align: 32, offset: 2016)
!1685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 1344, align: 32, elements: !1686)
!1686 = !{!1687, !1681}
!1687 = !DISubrange(count: 2)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "collapse_masks", scope: !1676, file: !898, line: 71, baseType: !1689, size: 168, align: 8, offset: 3360)
!1689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 168, align: 8, elements: !1680)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1676, file: !898, line: 74, baseType: !1691, size: 65536, align: 32, offset: 3584)
!1691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 65536, align: 32, elements: !1692)
!1692 = !{!1693}
!1693 = !DISubrange(count: 2048)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !1676, file: !898, line: 75, baseType: !1695, size: 30720, align: 32, offset: 69120)
!1695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 30720, align: 32, elements: !1696)
!1696 = !{!1697}
!1697 = !DISubrange(count: 960)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1676, file: !898, line: 78, baseType: !1699, size: 4096, align: 32, offset: 99840)
!1699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 4096, align: 32, elements: !1700)
!1700 = !{!1701}
!1701 = !DISubrange(count: 128)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1676, file: !898, line: 79, baseType: !1695, size: 30720, align: 32, offset: 103936)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pf_period_new", scope: !1676, file: !898, line: 82, baseType: !915, size: 32, align: 32, offset: 134656)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gains_new", scope: !1676, file: !898, line: 83, baseType: !1705, size: 96, align: 32, offset: 134688)
!1705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 96, align: 32, elements: !1706)
!1706 = !{!1707}
!1707 = !DISubrange(count: 3)
