; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus_rc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus_rc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.OpusRangeCoder = type { %struct.GetBitContext, %struct.RawBitsContext, i32, i32, i32, [1287 x i8], i8*, i32, i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.RawBitsContext = type { i8*, i32, i32, i32 }
%union.unaligned_32 = type { i32 }

@.str = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"rc->rng_cur < rc->rb.position\00", align 1
@.str.2 = private unnamed_addr constant [21 x i8] c"libavcodec/opus_rc.c\00", align 1
@ff_sqrt_tab = external constant [256 x i8], align 16
@ff_inverse = external constant [257 x i32], align 16

; Function Attrs: nounwind uwtable
define i32 @ff_opus_rc_dec_cdf(%struct.OpusRangeCoder* %rc, i16* %cdf) #0 !dbg !24 {
entry:
  %rc.addr.i.i = alloca %struct.OpusRangeCoder*, align 8
  call void @llvm.dbg.declare(metadata %struct.OpusRangeCoder** %rc.addr.i.i, metadata !68, metadata !72), !dbg !73
  %rc.addr.i = alloca %struct.OpusRangeCoder*, align 8
  call void @llvm.dbg.declare(metadata %struct.OpusRangeCoder** %rc.addr.i, metadata !79, metadata !72), !dbg !80

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus_rc.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !12, !15, !9, !16, !18, !11, !19, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !6, line: 221, size: 32, align: 8, elements: !7)
!6 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!7 = !{!8}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !5, file: !6, line: 221, baseType: !9, size: 32, align: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 51, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !10, line: 48, baseType: !14)
!14 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !10, line: 55, baseType: !17)
!17 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!21 = !{i32 2, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!24 = distinct !DISubprogram(name: "ff_opus_rc_dec_cdf", scope: !25, file: !25, line: 90, type: !26, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!25 = !DIFile(filename: "libavcodec/opus_rc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!26 = !DISubroutineType(types: !27)
!27 = !{!9, !28, !64}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusRangeCoder", file: !30, line: 55, baseType: !31)
!30 = !DIFile(filename: "libavcodec/opus_rc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusRangeCoder", file: !30, line: 40, size: 11072, align: 64, elements: !32)
!32 = !{!33, !45, !53, !54, !55, !56, !60, !61, !62, !63}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !31, file: !30, line: 41, baseType: !34, size: 256, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !35, line: 70, baseType: !36)
!35 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !35, line: 61, size: 256, align: 64, elements: !37)
!37 = !{!38, !41, !42, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !36, file: !35, line: 62, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !36, file: !35, line: 62, baseType: !39, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !36, file: !35, line: 67, baseType: !18, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !36, file: !35, line: 68, baseType: !18, size: 32, align: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !36, file: !35, line: 69, baseType: !18, size: 32, align: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !31, file: !30, line: 42, baseType: !46, size: 192, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "RawBitsContext", file: !30, line: 38, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawBitsContext", file: !30, line: 33, size: 192, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !47, file: !30, line: 34, baseType: !39, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !47, file: !30, line: 35, baseType: !9, size: 32, align: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cachelen", scope: !47, file: !30, line: 36, baseType: !9, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cacheval", scope: !47, file: !30, line: 37, baseType: !9, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !31, file: !30, line: 43, baseType: !9, size: 32, align: 32, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !31, file: !30, line: 44, baseType: !9, size: 32, align: 32, offset: 480)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "total_bits", scope: !31, file: !30, line: 45, baseType: !9, size: 32, align: 32, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !31, file: !30, line: 48, baseType: !57, size: 10296, align: 8, offset: 544)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 10296, align: 8, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 1287)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rng_cur", scope: !31, file: !30, line: 49, baseType: !12, size: 64, align: 64, offset: 10880)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !31, file: !30, line: 50, baseType: !18, size: 32, align: 32, offset: 10944)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !31, file: !30, line: 51, baseType: !18, size: 32, align: 32, offset: 10976)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "waste", scope: !31, file: !30, line: 54, baseType: !18, size: 32, align: 32, offset: 11008)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 49, baseType: !67)
!67 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!68 = !DILocalVariable(name: "rc", arg: 1, scope: !69, file: !25, line: 47, type: !28)
!69 = distinct !DISubprogram(name: "opus_rc_dec_normalize", scope: !25, file: !25, line: 47, type: !70, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !28}
!72 = !DIExpression()
!73 = !DILocation(line: 47, column: 89, scope: !69, inlinedAt: !74)
!74 = distinct !DILocation(line: 73, column: 5, scope: !75, inlinedAt: !78)
!75 = distinct !DISubprogram(name: "opus_rc_dec_update", scope: !25, file: !25, line: 66, type: !76, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !28, !9, !9, !9, !9}
!78 = distinct !DILocation(line: 104, column: 5, scope: !24)
!79 = !DILocalVariable(name: "rc", arg: 1, scope: !75, file: !25, line: 66, type: !28)
!80 = !DILocation(line: 66, column: 86, scope: !75, inlinedAt: !78)
!81 = !DILocalVariable(name: "scale", arg: 2, scope: !75, file: !25, line: 66, type: !9)
!82 = !DILocation(line: 66, column: 99, scope: !75, inlinedAt: !78)
!83 = !DILocalVariable(name: "low", arg: 3, scope: !75, file: !25, line: 67, type: !9)
!84 = !DILocation(line: 67, column: 58, scope: !75, inlinedAt: !78)
!85 = !DILocalVariable(name: "high", arg: 4, scope: !75, file: !25, line: 67, type: !9)
!86 = !DILocation(line: 67, column: 72, scope: !75, inlinedAt: !78)
!87 = !DILocalVariable(name: "total", arg: 5, scope: !75, file: !25, line: 68, type: !9)
!88 = !DILocation(line: 68, column: 58, scope: !75, inlinedAt: !78)
!89 = !DILocalVariable(name: "rc", arg: 1, scope: !24, file: !25, line: 90, type: !28)
!90 = !DILocation(line: 90, column: 45, scope: !24)
!91 = !DILocalVariable(name: "cdf", arg: 2, scope: !24, file: !25, line: 90, type: !64)
!92 = !DILocation(line: 90, column: 65, scope: !24)
!93 = !DILocalVariable(name: "k", scope: !24, file: !25, line: 92, type: !11)
!94 = !DILocation(line: 92, column: 18, scope: !24)
!95 = !DILocalVariable(name: "scale", scope: !24, file: !25, line: 92, type: !11)
!96 = !DILocation(line: 92, column: 21, scope: !24)
!97 = !DILocalVariable(name: "total", scope: !24, file: !25, line: 92, type: !11)
!98 = !DILocation(line: 92, column: 28, scope: !24)
!99 = !DILocalVariable(name: "symbol", scope: !24, file: !25, line: 92, type: !11)
!100 = !DILocation(line: 92, column: 35, scope: !24)
!101 = !DILocalVariable(name: "low", scope: !24, file: !25, line: 92, type: !11)
!102 = !DILocation(line: 92, column: 43, scope: !24)
!103 = !DILocalVariable(name: "high", scope: !24, file: !25, line: 92, type: !11)
!104 = !DILocation(line: 92, column: 48, scope: !24)
!105 = !DILocation(line: 94, column: 17, scope: !24)
!106 = !DILocation(line: 94, column: 13, scope: !24)
!107 = !DILocation(line: 94, column: 11, scope: !24)
!108 = !DILocation(line: 96, column: 13, scope: !24)
!109 = !DILocation(line: 96, column: 17, scope: !24)
!110 = !DILocation(line: 96, column: 25, scope: !24)
!111 = !DILocation(line: 96, column: 23, scope: !24)
!112 = !DILocation(line: 96, column: 11, scope: !24)
!113 = !DILocation(line: 97, column: 14, scope: !24)
!114 = !DILocation(line: 97, column: 18, scope: !24)
!115 = !DILocation(line: 97, column: 26, scope: !24)
!116 = !DILocation(line: 97, column: 24, scope: !24)
!117 = !DILocation(line: 97, column: 32, scope: !24)
!118 = !DILocation(line: 97, column: 12, scope: !24)
!119 = !DILocation(line: 98, column: 14, scope: !24)
