; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AC3DSPContext = type { void (i8*, i32, i32)*, i32 (i16*, i32)*, void (i16*, i32, i32)*, void (i32*, i32, i32)*, void (i32*, float*, i32)*, void (i16*, i16*, i32, i32, i32, i32, i8*, i8*)*, void (i16*, i8*, i32)*, i32 ([16 x i16]*)*, void (i8*, i32*, i32)*, void (i64*, i32*, i32*, i32)*, void (float*, float*, float*, i32)*, i32, i32, void (float**, float**, i32)*, void (i32**, i16**, i32)*, void (i16*, i16*, i16*, i32)* }

@ff_ac3_bap_bits = constant [16 x i16] [i16 0, i16 0, i16 0, i16 3, i16 0, i16 4, i16 5, i16 6, i16 7, i16 8, i16 9, i16 10, i16 11, i16 12, i16 14, i16 16], align 16
@ff_ac3_bin_to_band_tab = external constant [253 x i8], align 16
@ff_ac3_band_start_tab = external constant [51 x i8], align 16

; Function Attrs: nounwind uwtable
define void @ff_ac3dsp_downmix_fixed(%struct.AC3DSPContext* %c, i32** %samples, i16** %matrix, i32 %out_ch, i32 %in_ch, i32 %len) #0 !dbg !25 {
entry:
  %c.addr = alloca %struct.AC3DSPContext*, align 8
  %samples.addr = alloca i32**, align 8
  %matrix.addr = alloca i16**, align 8
  %out_ch.addr = alloca i32, align 4
  %in_ch.addr = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !7, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 40, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!9 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 51, baseType: !12)
!12 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!13 = !{!14}
!14 = distinct !DIGlobalVariable(name: "ff_ac3_bap_bits", scope: !0, file: !15, line: 140, type: !16, isLocal: false, isDefinition: true, variable: [16 x i16]* @ff_ac3_bap_bits)
!15 = !DIFile(filename: "libavcodec/ac3dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, align: 16, elements: !20)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 49, baseType: !19)
!19 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!20 = !{!21}
!21 = !DISubrange(count: 16)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!25 = distinct !DISubprogram(name: "ff_ac3dsp_downmix_fixed", scope: !15, file: !15, line: 350, type: !26, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, !110, !111, !6, !6, !6}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "AC3DSPContext", file: !30, line: 153, baseType: !31)
!30 = !DIFile(filename: "libavcodec/ac3dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AC3DSPContext", file: !30, line: 33, size: 960, align: 64, elements: !32)
!32 = !{!33, !40, !48, !53, !59, !66, !72, !77, !83, !87, !94, !99, !100, !101, !106, !112}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ac3_exponent_min", scope: !31, file: !30, line: 43, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !6, !6}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 48, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ac3_max_msb_abs_int16", scope: !31, file: !30, line: 54, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!6, !44, !6}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !8, line: 37, baseType: !47)
!47 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ac3_lshift_int16", scope: !31, file: !30, line: 65, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !12, !12}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ac3_rshift_int32", scope: !31, file: !30, line: 76, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !57, !12, !12}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 38, baseType: !6)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "float_to_fixed24", scope: !31, file: !30, line: 89, baseType: !60, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !57, !63, !12}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bit_alloc_calc_bap", scope: !31, file: !30, line: 106, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !52, !52, !6, !6, !6, !6, !70, !37}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "update_bap_counts", scope: !31, file: !30, line: 117, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76, !37, !6}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "compute_mantissa_size", scope: !31, file: !30, line: 125, baseType: !78, size: 64, align: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!6, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, align: 16, elements: !20)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "extract_exponents", scope: !31, file: !30, line: 127, baseType: !84, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !37, !57, !6}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square_butterfly_int32", scope: !31, file: !30, line: 129, baseType: !88, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91, !92, !92, !6}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square_butterfly_float", scope: !31, file: !30, line: 132, baseType: !95, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !98, !63, !63, !6}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "out_channels", scope: !31, file: !30, line: 135, baseType: !6, size: 32, align: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "in_channels", scope: !31, file: !30, line: 136, baseType: !6, size: 32, align: 32, offset: 736)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "downmix", scope: !31, file: !30, line: 137, baseType: !102, size: 64, align: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !105, !6}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "downmix_fixed", scope: !31, file: !30, line: 138, baseType: !107, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, !111, !6}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "apply_window_int16", scope: !31, file: !30, line: 151, baseType: !113, size: 64, align: 64, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !52, !44, !44, !12}
!116 = !DILocalVariable(name: "c", arg: 1, scope: !25, file: !15, line: 350, type: !28)
!117 = !DIExpression()
!118 = !DILocation(line: 350, column: 45, scope: !25)
!119 = !DILocalVariable(name: "samples", arg: 2, scope: !25, file: !15, line: 350, type: !110)
!120 = !DILocation(line: 350, column: 58, scope: !25)
!121 = !DILocalVariable(name: "matrix", arg: 3, scope: !25, file: !15, line: 350, type: !111)
!122 = !DILocation(line: 350, column: 77, scope: !25)
!123 = !DILocalVariable(name: "out_ch", arg: 4, scope: !25, file: !15, line: 351, type: !6)
!124 = !DILocation(line: 351, column: 34, scope: !25)
!125 = !DILocalVariable(name: "in_ch", arg: 5, scope: !25, file: !15, line: 351, type: !6)
!126 = !DILocation(line: 351, column: 46, scope: !25)
!127 = !DILocalVariable(name: "len", arg: 6, scope: !25, file: !15, line: 351, type: !6)
!128 = !DILocation(line: 351, column: 57, scope: !25)
!129 = !DILocation(line: 353, column: 9, scope: !130)
!130 = distinct !DILexicalBlock(scope: !25, file: !15, line: 353, column: 9)
!131 = !DILocation(line: 353, column: 12, scope: !130)
!132 = !DILocation(line: 353, column: 27, scope: !130)
!133 = !DILocation(line: 353, column: 24, scope: !130)
!134 = !DILocation(line: 353, column: 33, scope: !130)
!135 = !DILocation(line: 353, column: 36, scope: !136)
!136 = !DILexicalBlockFile(scope: !130, file: !15, discriminator: 1)
!137 = !DILocation(line: 353, column: 39, scope: !136)
!138 = !DILocation(line: 353, column: 55, scope: !136)
!139 = !DILocation(line: 353, column: 52, scope: !136)
!140 = !DILocation(line: 353, column: 9, scope: !136)
!141 = !DILocation(line: 354, column: 26, scope: !142)
!142 = distinct !DILexicalBlock(scope: !130, file: !15, line: 353, column: 63)
!143 = !DILocation(line: 354, column: 9, scope: !142)
!144 = !DILocation(line: 354, column: 12, scope: !142)
!145 = !DILocation(line: 354, column: 24, scope: !142)
!146 = !DILocation(line: 355, column: 27, scope: !142)
!147 = !DILocation(line: 355, column: 9, scope: !142)
!148 = !DILocation(line: 355, column: 12, scope: !142)
!149 = !DILocation(line: 355, column: 25, scope: !142)
!150 = !DILocation(line: 356, column: 9, scope: !142)
!151 = !DILocation(line: 356, column: 12, scope: !142)
!152 = !DILocation(line: 356, column: 26, scope: !142)
!153 = !DILocation(line: 358, column: 13, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !15, line: 358, column: 13)
!155 = !DILocation(line: 358, column: 19, scope: !154)
!156 = !DILocation(line: 358, column: 24, scope: !154)
!157 = !DILocation(line: 358, column: 27, scope: !158)
!158 = !DILexicalBlockFile(scope: !154, file: !15, discriminator: 1)
!159 = !DILocation(line: 358, column: 34, scope: !158)
!160 = !DILocation(line: 358, column: 39, scope: !158)
!161 = !DILocation(line: 359, column: 15, scope: !154)
!162 = !DILocation(line: 359, column: 30, scope: !154)
!163 = !DILocation(line: 359, column: 28, scope: !154)
!164 = !DILocation(line: 360, column: 15, scope: !154)
!165 = !DILocation(line: 359, column: 43, scope: !154)
!166 = !DILocation(line: 360, column: 30, scope: !154)
!167 = !DILocation(line: 360, column: 28, scope: !154)
!168 = !DILocation(line: 361, column: 15, scope: !154)
!169 = !DILocation(line: 361, column: 30, scope: !154)
!170 = !DILocation(line: 361, column: 28, scope: !154)
!171 = !DILocation(line: 360, column: 43, scope: !154)
!172 = !DILocation(line: 362, column: 15, scope: !154)
!173 = !DILocation(line: 362, column: 30, scope: !154)
!174 = !DILocation(line: 362, column: 28, scope: !154)
!175 = !DILocation(line: 361, column: 44, scope: !154)
!176 = !DILocation(line: 358, column: 13, scope: !177)
!177 = !DILexicalBlockFile(scope: !142, file: !15, discriminator: 2)
