; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegvideo_motion.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpegvideo_motion.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !934, line: 48, baseType: !945)
!945 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!946 = !{!947}
!947 = !DISubrange(count: 4)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !930, file: !929, line: 40, baseType: !949, size: 32, align: 32)
!949 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!951 = !{!952, !963}
!952 = distinct !DIGlobalVariable(name: "h263_chroma_roundtab", scope: !953, file: !954, line: 104, type: !959, isLocal: true, isDefinition: true, variable: [16 x i8]* @ff_h263_round_chroma.h263_chroma_roundtab)
!953 = distinct !DISubprogram(name: "ff_h263_round_chroma", scope: !954, file: !954, line: 101, type: !955, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !958)
!954 = !DIFile(filename: "libavcodec/motion_est.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!955 = !DISubroutineType(types: !956)
!956 = !{!957, !957}
!957 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!958 = !{}
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 128, align: 8, elements: !961)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!961 = !{!962}
!962 = !DISubrange(count: 16)
!963 = distinct !DIGlobalVariable(name: "rtab", scope: !964, file: !965, line: 515, type: !2653, isLocal: true, isDefinition: true, variable: [8 x i32]* @qpel_motion.rtab)
!964 = distinct !DISubprogram(name: "qpel_motion", scope: !965, file: !965, line: 488, type: !966, isLocal: true, isDefinition: true, scopeLine: 497, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !958)
!965 = !DIFile(filename: "libavcodec/mpegvideo_motion.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !DISubroutineType(types: !967)
!967 = !{null, !968, !1160, !1160, !1160, !957, !957, !957, !1246, !2209, !2212, !957, !957, !957}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !970, line: 582, baseType: !971)
!970 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !970, line: 81, size: 86208, align: 64, elements: !972)
!972 = !{!973, !1058, !1059, !1060, !1061, !1065, !1066, !1077, !1078, !1079, !1080, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1782, !1783, !1836, !1838, !1839, !1840, !1841, !1842, !1853, !1854, !1855, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1871, !1873, !1875, !1876, !1877, !1878, !1879, !1880, !1883, !1885, !1886, !1887, !1888, !1889, !1890, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1917, !1918, !1919, !1920, !1936, !1943, !1955, !1971, !1993, !2033, !2046, !2073, !2088, !2102, !2115, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2136, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2149, !2151, !2152, !2153, !2154, !2155, !2156, !2159, !2161, !2163, !2164, !2167, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2233, !2234, !2236, !2237, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2259, !2260, !2261, !2264, !2265, !2266, !2267, !2269, !2271, !2272, !2273, !2274, !2275, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2357, !2358, !2359, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2529, !2530, !2531, !2532, !2536, !2537, !2541, !2545, !2549, !2550, !2554, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2569, !2570, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2588, !2589, !2590, !2640, !2641, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !971, file: !970, line: 82, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !982, !987, !1017, !1018, !1019, !1020, !1024, !1030, !1032, !1036}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !26, line: 72, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !26, line: 78, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!979, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !26, line: 85, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !1013, !1014, !1015, !1016}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !4, line: 247, baseType: !979, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !990, file: !4, line: 253, baseType: !979, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !990, file: !4, line: 259, baseType: !957, size: 32, align: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !990, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !990, file: !4, line: 271, baseType: !997, size: 64, align: 64, offset: 192)
!997 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !990, file: !4, line: 265, size: 64, align: 64, elements: !998)
!998 = !{!999, !1003, !1005, !1006}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !997, file: !4, line: 266, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1001, line: 197, baseType: !1002)
!1001 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1002 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !997, file: !4, line: 267, baseType: !1004, size: 64, align: 64)
!1004 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !997, file: !4, line: 268, baseType: !979, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !997, file: !4, line: 270, baseType: !1007, size: 64, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1008, line: 61, baseType: !1009)
!1008 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1008, line: 58, size: 64, align: 32, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1009, file: !1008, line: 59, baseType: !957, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1009, file: !1008, line: 60, baseType: !957, size: 32, align: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !990, file: !4, line: 272, baseType: !1004, size: 64, align: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !990, file: !4, line: 273, baseType: !1004, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !990, file: !4, line: 275, baseType: !957, size: 32, align: 32, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !990, file: !4, line: 300, baseType: !979, size: 64, align: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !26, line: 93, baseType: !957, size: 32, align: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !26, line: 99, baseType: !957, size: 32, align: 32, offset: 224)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !26, line: 108, baseType: !957, size: 32, align: 32, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !26, line: 113, baseType: !1021, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!986, !986, !986}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !26, line: 123, baseType: !1025, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1028, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !26, line: 130, baseType: !1031, size: 32, align: 32, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !26, line: 136, baseType: !1033, size: 64, align: 64, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1031, !986}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !26, line: 142, baseType: !1037, size: 64, align: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!957, !1040, !986, !979, !957}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1043)
!1043 = !{!1044, !1056, !1057}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1042, file: !4, line: 360, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1048, file: !4, line: 307, baseType: !979, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1048, file: !4, line: 313, baseType: !1004, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1048, file: !4, line: 313, baseType: !1004, size: 64, align: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1048, file: !4, line: 318, baseType: !1004, size: 64, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1048, file: !4, line: 318, baseType: !1004, size: 64, align: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1048, file: !4, line: 323, baseType: !957, size: 32, align: 32, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1042, file: !4, line: 364, baseType: !957, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1042, file: !4, line: 368, baseType: !957, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !971, file: !970, line: 84, baseType: !957, size: 32, align: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !971, file: !970, line: 84, baseType: !957, size: 32, align: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !971, file: !970, line: 85, baseType: !957, size: 32, align: 32, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !971, file: !970, line: 86, baseType: !1062, size: 384, align: 32, offset: 160)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 384, align: 32, elements: !1063)
!1063 = !{!1064}
!1064 = !DISubrange(count: 12)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !971, file: !970, line: 87, baseType: !957, size: 32, align: 32, offset: 544)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !971, file: !970, line: 90, baseType: !1067, size: 1088, align: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1069)
!1069 = !{!1070, !1072, !1076}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1068, file: !917, line: 32, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1068, file: !917, line: 33, baseType: !1073, size: 512, align: 8, offset: 64)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 512, align: 8, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1068, file: !917, line: 34, baseType: !1073, size: 512, align: 8, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !971, file: !970, line: 91, baseType: !1067, size: 1088, align: 64, offset: 1664)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !971, file: !970, line: 92, baseType: !1067, size: 1088, align: 64, offset: 2752)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !971, file: !970, line: 93, baseType: !1067, size: 1088, align: 64, offset: 3840)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !971, file: !970, line: 98, baseType: !1081, size: 64, align: 64, offset: 4928)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1083)
!1083 = !{!1084, !1087, !1088, !1089, !1350, !1351, !1352, !1353, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1505, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1687, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1082, file: !57, line: 1561, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1082, file: !57, line: 1562, baseType: !957, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1082, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1082, file: !57, line: 1565, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1102, !1105, !1108, !1111, !1116, !1117, !1118, !1126, !1127, !1128, !1130, !1136, !1142, !1151, !1155, !1156, !1200, !1321, !1325, !1326, !1330, !1334, !1339, !1343, !1344, !1345}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !57, line: 3475, baseType: !979, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1092, file: !57, line: 3480, baseType: !979, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1092, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1092, file: !57, line: 3487, baseType: !957, size: 32, align: 32, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1092, file: !57, line: 3488, baseType: !1100, size: 64, align: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1092, file: !57, line: 3489, baseType: !1103, size: 64, align: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1092, file: !57, line: 3490, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1092, file: !57, line: 3491, baseType: !1109, size: 64, align: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1092, file: !57, line: 3492, baseType: !1112, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !934, line: 55, baseType: !1115)
!1115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1092, file: !57, line: 3493, baseType: !944, size: 8, align: 8, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1092, file: !57, line: 3494, baseType: !1085, size: 64, align: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1092, file: !57, line: 3495, baseType: !1119, size: 64, align: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1122, file: !57, line: 3402, baseType: !957, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !57, line: 3403, baseType: !979, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1092, file: !57, line: 3507, baseType: !979, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1092, file: !57, line: 3516, baseType: !957, size: 32, align: 32, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !57, line: 3517, baseType: !1129, size: 64, align: 64, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1092, file: !57, line: 3527, baseType: !1131, size: 64, align: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!957, !1134}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1082)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1092, file: !57, line: 3535, baseType: !1137, size: 64, align: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!957, !1134, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1092, file: !57, line: 3541, baseType: !1143, size: 64, align: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1147, line: 223, size: 128, align: 64, elements: !1148)
!1147 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1146, file: !1147, line: 224, baseType: !1071, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1146, file: !1147, line: 225, baseType: !1071, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1092, file: !57, line: 3549, baseType: !1152, size: 64, align: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1129}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1092, file: !57, line: 3551, baseType: !1131, size: 64, align: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1092, file: !57, line: 3552, baseType: !1157, size: 64, align: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!957, !1134, !1160, !957, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1199}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1163, file: !57, line: 3921, baseType: !938, size: 16, align: 16)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1163, file: !57, line: 3922, baseType: !933, size: 32, align: 32, offset: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1163, file: !57, line: 3923, baseType: !933, size: 32, align: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1163, file: !57, line: 3924, baseType: !935, size: 32, align: 32, offset: 96)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1163, file: !57, line: 3925, baseType: !1170, size: 64, align: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1190, !1192, !1194, !1195, !1197, !1198}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1173, file: !57, line: 3886, baseType: !957, size: 32, align: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1173, file: !57, line: 3887, baseType: !957, size: 32, align: 32, offset: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1173, file: !57, line: 3888, baseType: !957, size: 32, align: 32, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1173, file: !57, line: 3889, baseType: !957, size: 32, align: 32, offset: 96)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1173, file: !57, line: 3890, baseType: !957, size: 32, align: 32, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1173, file: !57, line: 3897, baseType: !1181, size: 768, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1183)
!1183 = !{!1184, !1188}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !57, line: 3855, baseType: !1185, size: 512, align: 64)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 512, align: 64, elements: !1186)
!1186 = !{!1187}
!1187 = !DISubrange(count: 8)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1182, file: !57, line: 3857, baseType: !1189, size: 256, align: 32, offset: 512)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 256, align: 32, elements: !1186)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !57, line: 3903, baseType: !1191, size: 256, align: 64, offset: 960)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 256, align: 64, elements: !946)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1173, file: !57, line: 3904, baseType: !1193, size: 128, align: 32, offset: 1216)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 128, align: 32, elements: !946)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1173, file: !57, line: 3908, baseType: !1196, size: 64, align: 64, offset: 1408)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1173, file: !57, line: 3915, baseType: !1196, size: 64, align: 64, offset: 1472)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !57, line: 3917, baseType: !957, size: 32, align: 32, offset: 1536)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1163, file: !57, line: 3926, baseType: !1000, size: 64, align: 64, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1092, file: !57, line: 3564, baseType: !1201, size: 64, align: 64, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!957, !1134, !1204, !1238, !1320}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1207)
!1207 = !{!1208, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1234, !1235, !1236, !1237}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1206, file: !57, line: 1451, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1211, line: 94, baseType: !1212)
!1211 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1211, line: 81, size: 192, align: 64, elements: !1213)
!1213 = !{!1214, !1218, !1219}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1212, file: !1211, line: 82, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1211, line: 73, baseType: !1217)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1211, line: 73, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1212, file: !1211, line: 89, baseType: !1160, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !1211, line: 93, baseType: !957, size: 32, align: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1206, file: !57, line: 1461, baseType: !1000, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1206, file: !57, line: 1467, baseType: !1000, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1206, file: !57, line: 1468, baseType: !1160, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1206, file: !57, line: 1469, baseType: !957, size: 32, align: 32, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1206, file: !57, line: 1470, baseType: !957, size: 32, align: 32, offset: 288)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1206, file: !57, line: 1474, baseType: !957, size: 32, align: 32, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1206, file: !57, line: 1479, baseType: !1227, size: 64, align: 64, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1229, file: !57, line: 1412, baseType: !1160, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1229, file: !57, line: 1413, baseType: !957, size: 32, align: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1229, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1206, file: !57, line: 1480, baseType: !957, size: 32, align: 32, offset: 448)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1206, file: !57, line: 1486, baseType: !1000, size: 64, align: 64, offset: 512)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1206, file: !57, line: 1488, baseType: !1000, size: 64, align: 64, offset: 576)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1206, file: !57, line: 1497, baseType: !1000, size: 64, align: 64, offset: 640)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1272, !1274, !1275, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1308, !1309, !1310, !1311, !1312, !1313, !1316, !1317, !1318, !1319}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1241, file: !780, line: 282, baseType: !1185, size: 512, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1241, file: !780, line: 299, baseType: !1189, size: 256, align: 32, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1241, file: !780, line: 315, baseType: !1246, size: 64, align: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1241, file: !780, line: 326, baseType: !957, size: 32, align: 32, offset: 832)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1241, file: !780, line: 326, baseType: !957, size: 32, align: 32, offset: 864)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1241, file: !780, line: 334, baseType: !957, size: 32, align: 32, offset: 896)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1241, file: !780, line: 341, baseType: !957, size: 32, align: 32, offset: 928)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1241, file: !780, line: 346, baseType: !957, size: 32, align: 32, offset: 960)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1241, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1241, file: !780, line: 356, baseType: !1007, size: 64, align: 32, offset: 1024)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1241, file: !780, line: 361, baseType: !1000, size: 64, align: 64, offset: 1088)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1241, file: !780, line: 369, baseType: !1000, size: 64, align: 64, offset: 1152)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1241, file: !780, line: 377, baseType: !1000, size: 64, align: 64, offset: 1216)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1241, file: !780, line: 382, baseType: !957, size: 32, align: 32, offset: 1280)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1241, file: !780, line: 386, baseType: !957, size: 32, align: 32, offset: 1312)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1241, file: !780, line: 391, baseType: !957, size: 32, align: 32, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1241, file: !780, line: 396, baseType: !986, size: 64, align: 64, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1241, file: !780, line: 403, baseType: !1262, size: 512, align: 64, offset: 1472)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1186)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1241, file: !780, line: 410, baseType: !957, size: 32, align: 32, offset: 1984)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1241, file: !780, line: 415, baseType: !957, size: 32, align: 32, offset: 2016)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1241, file: !780, line: 420, baseType: !957, size: 32, align: 32, offset: 2048)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1241, file: !780, line: 425, baseType: !957, size: 32, align: 32, offset: 2080)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1241, file: !780, line: 435, baseType: !1000, size: 64, align: 64, offset: 2112)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1241, file: !780, line: 440, baseType: !957, size: 32, align: 32, offset: 2176)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1241, file: !780, line: 445, baseType: !1114, size: 64, align: 64, offset: 2240)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1241, file: !780, line: 459, baseType: !1271, size: 512, align: 64, offset: 2304)
!1271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 512, align: 64, elements: !1186)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1241, file: !780, line: 473, baseType: !1273, size: 64, align: 64, offset: 2816)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1241, file: !780, line: 477, baseType: !957, size: 32, align: 32, offset: 2880)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1241, file: !780, line: 479, baseType: !1276, size: 64, align: 64, offset: 2944)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284, !1289}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1279, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1279, file: !780, line: 203, baseType: !1160, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1279, file: !780, line: 204, baseType: !957, size: 32, align: 32, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1279, file: !780, line: 205, baseType: !1285, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1287, line: 86, baseType: !1288)
!1287 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1287, line: 86, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1279, file: !780, line: 206, baseType: !1209, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1241, file: !780, line: 480, baseType: !957, size: 32, align: 32, offset: 3008)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1241, file: !780, line: 505, baseType: !957, size: 32, align: 32, offset: 3040)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1241, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1241, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1241, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1241, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1241, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1241, file: !780, line: 532, baseType: !1000, size: 64, align: 64, offset: 3264)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1241, file: !780, line: 539, baseType: !1000, size: 64, align: 64, offset: 3328)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1241, file: !780, line: 547, baseType: !1000, size: 64, align: 64, offset: 3392)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1241, file: !780, line: 554, baseType: !1285, size: 64, align: 64, offset: 3456)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1241, file: !780, line: 563, baseType: !957, size: 32, align: 32, offset: 3520)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1241, file: !780, line: 572, baseType: !957, size: 32, align: 32, offset: 3552)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1241, file: !780, line: 581, baseType: !957, size: 32, align: 32, offset: 3584)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1241, file: !780, line: 588, baseType: !1305, size: 64, align: 64, offset: 3648)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1001, line: 194, baseType: !1307)
!1307 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1241, file: !780, line: 593, baseType: !957, size: 32, align: 32, offset: 3712)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1241, file: !780, line: 596, baseType: !957, size: 32, align: 32, offset: 3744)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1241, file: !780, line: 599, baseType: !1209, size: 64, align: 64, offset: 3776)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1241, file: !780, line: 605, baseType: !1209, size: 64, align: 64, offset: 3840)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1241, file: !780, line: 616, baseType: !1209, size: 64, align: 64, offset: 3904)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1241, file: !780, line: 626, baseType: !1314, size: 64, align: 64, offset: 3968)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1315, line: 216, baseType: !1115)
!1315 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1241, file: !780, line: 627, baseType: !1314, size: 64, align: 64, offset: 4032)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1241, file: !780, line: 628, baseType: !1314, size: 64, align: 64, offset: 4096)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1241, file: !780, line: 629, baseType: !1314, size: 64, align: 64, offset: 4160)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1241, file: !780, line: 645, baseType: !1209, size: 64, align: 64, offset: 4224)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1092, file: !57, line: 3566, baseType: !1322, size: 64, align: 64, offset: 1408)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!957, !1134, !986, !1320, !1204}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1092, file: !57, line: 3567, baseType: !1131, size: 64, align: 64, offset: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1092, file: !57, line: 3576, baseType: !1327, size: 64, align: 64, offset: 1536)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!957, !1134, !1238}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1092, file: !57, line: 3577, baseType: !1331, size: 64, align: 64, offset: 1600)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!957, !1134, !1204}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1092, file: !57, line: 3584, baseType: !1335, size: 64, align: 64, offset: 1664)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!957, !1134, !1338}
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1092, file: !57, line: 3589, baseType: !1340, size: 64, align: 64, offset: 1728)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{null, !1134}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1092, file: !57, line: 3594, baseType: !957, size: 32, align: 32, offset: 1792)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1092, file: !57, line: 3600, baseType: !979, size: 64, align: 64, offset: 1856)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1092, file: !57, line: 3609, baseType: !1346, size: 64, align: 64, offset: 1920)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1082, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1082, file: !57, line: 1581, baseType: !935, size: 32, align: 32, offset: 224)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1082, file: !57, line: 1583, baseType: !986, size: 64, align: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1082, file: !57, line: 1591, baseType: !1354, size: 64, align: 64, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1147, line: 129, size: 1664, align: 64, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1379, !1380, !1386, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1355, file: !1147, line: 136, baseType: !957, size: 32, align: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1355, file: !1147, line: 151, baseType: !957, size: 32, align: 32, offset: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1355, file: !1147, line: 157, baseType: !957, size: 32, align: 32, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1355, file: !1147, line: 159, baseType: !1338, size: 64, align: 64, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1355, file: !1147, line: 161, baseType: !1362, size: 64, align: 64, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1147, line: 117, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1147, line: 100, size: 832, align: 64, elements: !1365)
!1365 = !{!1366, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1364, file: !1147, line: 105, baseType: !1367, size: 256, align: 64)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 256, align: 64, elements: !946)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1211, line: 238, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1211, line: 238, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1364, file: !1147, line: 110, baseType: !957, size: 32, align: 32, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1364, file: !1147, line: 111, baseType: !957, size: 32, align: 32, offset: 288)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1364, file: !1147, line: 111, baseType: !957, size: 32, align: 32, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1364, file: !1147, line: 112, baseType: !1189, size: 256, align: 32, offset: 352)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1364, file: !1147, line: 113, baseType: !1193, size: 128, align: 32, offset: 608)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1364, file: !1147, line: 114, baseType: !957, size: 32, align: 32, offset: 736)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1364, file: !1147, line: 115, baseType: !957, size: 32, align: 32, offset: 768)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1364, file: !1147, line: 116, baseType: !957, size: 32, align: 32, offset: 800)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1355, file: !1147, line: 163, baseType: !986, size: 64, align: 64, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1355, file: !1147, line: 165, baseType: !1381, size: 128, align: 64, offset: 320)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1147, line: 122, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1147, line: 119, size: 128, align: 64, elements: !1383)
!1383 = !{!1384, !1385}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1382, file: !1147, line: 120, baseType: !1204, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1382, file: !1147, line: 121, baseType: !1338, size: 64, align: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1355, file: !1147, line: 166, baseType: !1387, size: 128, align: 64, offset: 448)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1147, line: 127, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1147, line: 124, size: 128, align: 64, elements: !1389)
!1389 = !{!1390, !1463}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1388, file: !1147, line: 125, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1395)
!1395 = !{!1396, !1397, !1421, !1425, !1426, !1460, !1461, !1462}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1394, file: !57, line: 5751, baseType: !1085, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1394, file: !57, line: 5756, baseType: !1398, size: 64, align: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1406, !1407, !1408, !1412, !1416, !1420}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1400, file: !57, line: 5797, baseType: !979, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1400, file: !57, line: 5804, baseType: !1404, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1400, file: !57, line: 5815, baseType: !1085, size: 64, align: 64, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1400, file: !57, line: 5825, baseType: !957, size: 32, align: 32, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1400, file: !57, line: 5826, baseType: !1409, size: 64, align: 64, offset: 256)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!957, !1392}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1400, file: !57, line: 5827, baseType: !1413, size: 64, align: 64, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!957, !1392, !1204}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1400, file: !57, line: 5828, baseType: !1417, size: 64, align: 64, offset: 384)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{null, !1392}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1400, file: !57, line: 5829, baseType: !1417, size: 64, align: 64, offset: 448)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1394, file: !57, line: 5762, baseType: !1422, size: 64, align: 64, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1424)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1394, file: !57, line: 5768, baseType: !986, size: 64, align: 64, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1394, file: !57, line: 5775, baseType: !1427, size: 64, align: 64, offset: 256)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1430)
!1430 = !{!1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1429, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1429, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1429, file: !57, line: 3948, baseType: !933, size: 32, align: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1429, file: !57, line: 3958, baseType: !1160, size: 64, align: 64, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1429, file: !57, line: 3962, baseType: !957, size: 32, align: 32, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1429, file: !57, line: 3968, baseType: !957, size: 32, align: 32, offset: 224)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1429, file: !57, line: 3973, baseType: !1000, size: 64, align: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1429, file: !57, line: 3986, baseType: !957, size: 32, align: 32, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1429, file: !57, line: 3999, baseType: !957, size: 32, align: 32, offset: 352)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1429, file: !57, line: 4004, baseType: !957, size: 32, align: 32, offset: 384)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1429, file: !57, line: 4005, baseType: !957, size: 32, align: 32, offset: 416)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1429, file: !57, line: 4010, baseType: !957, size: 32, align: 32, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1429, file: !57, line: 4011, baseType: !957, size: 32, align: 32, offset: 480)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1429, file: !57, line: 4020, baseType: !1007, size: 64, align: 32, offset: 512)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1429, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1429, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1429, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1429, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1429, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1429, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1429, file: !57, line: 4039, baseType: !957, size: 32, align: 32, offset: 768)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1429, file: !57, line: 4046, baseType: !1114, size: 64, align: 64, offset: 832)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1429, file: !57, line: 4050, baseType: !957, size: 32, align: 32, offset: 896)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1429, file: !57, line: 4054, baseType: !957, size: 32, align: 32, offset: 928)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1429, file: !57, line: 4061, baseType: !957, size: 32, align: 32, offset: 960)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1429, file: !57, line: 4065, baseType: !957, size: 32, align: 32, offset: 992)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1429, file: !57, line: 4073, baseType: !957, size: 32, align: 32, offset: 1024)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1429, file: !57, line: 4080, baseType: !957, size: 32, align: 32, offset: 1056)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1429, file: !57, line: 4084, baseType: !957, size: 32, align: 32, offset: 1088)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1394, file: !57, line: 5781, baseType: !1427, size: 64, align: 64, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1394, file: !57, line: 5787, baseType: !1007, size: 64, align: 32, offset: 384)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1394, file: !57, line: 5793, baseType: !1007, size: 64, align: 32, offset: 448)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1388, file: !1147, line: 126, baseType: !957, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1355, file: !1147, line: 172, baseType: !1204, size: 64, align: 64, offset: 576)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1355, file: !1147, line: 177, baseType: !1160, size: 64, align: 64, offset: 640)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1355, file: !1147, line: 178, baseType: !935, size: 32, align: 32, offset: 704)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1355, file: !1147, line: 180, baseType: !986, size: 64, align: 64, offset: 768)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1355, file: !1147, line: 185, baseType: !957, size: 32, align: 32, offset: 832)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1355, file: !1147, line: 190, baseType: !986, size: 64, align: 64, offset: 896)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1355, file: !1147, line: 195, baseType: !957, size: 32, align: 32, offset: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1355, file: !1147, line: 200, baseType: !1204, size: 64, align: 64, offset: 1024)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1355, file: !1147, line: 201, baseType: !957, size: 32, align: 32, offset: 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1355, file: !1147, line: 202, baseType: !1338, size: 64, align: 64, offset: 1152)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1355, file: !1147, line: 203, baseType: !957, size: 32, align: 32, offset: 1216)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1355, file: !1147, line: 205, baseType: !957, size: 32, align: 32, offset: 1248)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1355, file: !1147, line: 206, baseType: !957, size: 32, align: 32, offset: 1280)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1355, file: !1147, line: 209, baseType: !1314, size: 64, align: 64, offset: 1344)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1355, file: !1147, line: 212, baseType: !1314, size: 64, align: 64, offset: 1408)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1355, file: !1147, line: 213, baseType: !1338, size: 64, align: 64, offset: 1472)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1355, file: !1147, line: 215, baseType: !957, size: 32, align: 32, offset: 1536)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1355, file: !1147, line: 217, baseType: !957, size: 32, align: 32, offset: 1568)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1355, file: !1147, line: 220, baseType: !957, size: 32, align: 32, offset: 1600)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1082, file: !57, line: 1598, baseType: !986, size: 64, align: 64, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1082, file: !57, line: 1606, baseType: !1000, size: 64, align: 64, offset: 448)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1082, file: !57, line: 1614, baseType: !957, size: 32, align: 32, offset: 512)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1082, file: !57, line: 1622, baseType: !957, size: 32, align: 32, offset: 544)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1082, file: !57, line: 1628, baseType: !957, size: 32, align: 32, offset: 576)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !57, line: 1636, baseType: !957, size: 32, align: 32, offset: 608)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1082, file: !57, line: 1643, baseType: !957, size: 32, align: 32, offset: 640)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1082, file: !57, line: 1657, baseType: !1160, size: 64, align: 64, offset: 704)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1082, file: !57, line: 1658, baseType: !957, size: 32, align: 32, offset: 768)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1082, file: !57, line: 1679, baseType: !1007, size: 64, align: 32, offset: 800)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1082, file: !57, line: 1688, baseType: !957, size: 32, align: 32, offset: 864)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1082, file: !57, line: 1712, baseType: !957, size: 32, align: 32, offset: 896)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1082, file: !57, line: 1729, baseType: !957, size: 32, align: 32, offset: 928)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1082, file: !57, line: 1729, baseType: !957, size: 32, align: 32, offset: 960)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1082, file: !57, line: 1744, baseType: !957, size: 32, align: 32, offset: 992)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1082, file: !57, line: 1744, baseType: !957, size: 32, align: 32, offset: 1024)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1082, file: !57, line: 1751, baseType: !957, size: 32, align: 32, offset: 1056)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1082, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1082, file: !57, line: 1791, baseType: !1502, size: 64, align: 64, offset: 1152)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{null, !1081, !1238, !1320, !957, !957, !957}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1082, file: !57, line: 1808, baseType: !1506, size: 64, align: 64, offset: 1216)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!516, !1081, !1103}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1082, file: !57, line: 1816, baseType: !957, size: 32, align: 32, offset: 1280)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1082, file: !57, line: 1825, baseType: !949, size: 32, align: 32, offset: 1312)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1082, file: !57, line: 1830, baseType: !957, size: 32, align: 32, offset: 1344)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1082, file: !57, line: 1838, baseType: !949, size: 32, align: 32, offset: 1376)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1082, file: !57, line: 1846, baseType: !957, size: 32, align: 32, offset: 1408)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1082, file: !57, line: 1851, baseType: !957, size: 32, align: 32, offset: 1440)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1082, file: !57, line: 1861, baseType: !949, size: 32, align: 32, offset: 1472)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1082, file: !57, line: 1868, baseType: !949, size: 32, align: 32, offset: 1504)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1082, file: !57, line: 1875, baseType: !949, size: 32, align: 32, offset: 1536)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1082, file: !57, line: 1882, baseType: !949, size: 32, align: 32, offset: 1568)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1082, file: !57, line: 1889, baseType: !949, size: 32, align: 32, offset: 1600)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1082, file: !57, line: 1896, baseType: !949, size: 32, align: 32, offset: 1632)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1082, file: !57, line: 1903, baseType: !949, size: 32, align: 32, offset: 1664)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1082, file: !57, line: 1910, baseType: !957, size: 32, align: 32, offset: 1696)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1082, file: !57, line: 1915, baseType: !957, size: 32, align: 32, offset: 1728)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1082, file: !57, line: 1926, baseType: !1320, size: 64, align: 64, offset: 1792)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1082, file: !57, line: 1935, baseType: !1007, size: 64, align: 32, offset: 1856)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1082, file: !57, line: 1942, baseType: !957, size: 32, align: 32, offset: 1920)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1082, file: !57, line: 1948, baseType: !957, size: 32, align: 32, offset: 1952)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1082, file: !57, line: 1954, baseType: !957, size: 32, align: 32, offset: 1984)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1082, file: !57, line: 1960, baseType: !957, size: 32, align: 32, offset: 2016)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1082, file: !57, line: 1984, baseType: !957, size: 32, align: 32, offset: 2048)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1082, file: !57, line: 1991, baseType: !957, size: 32, align: 32, offset: 2080)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1082, file: !57, line: 1996, baseType: !957, size: 32, align: 32, offset: 2112)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1082, file: !57, line: 2004, baseType: !957, size: 32, align: 32, offset: 2144)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1082, file: !57, line: 2011, baseType: !957, size: 32, align: 32, offset: 2176)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1082, file: !57, line: 2018, baseType: !957, size: 32, align: 32, offset: 2208)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1082, file: !57, line: 2027, baseType: !957, size: 32, align: 32, offset: 2240)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1082, file: !57, line: 2034, baseType: !957, size: 32, align: 32, offset: 2272)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1082, file: !57, line: 2044, baseType: !957, size: 32, align: 32, offset: 2304)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1082, file: !57, line: 2054, baseType: !1540, size: 64, align: 64, offset: 2368)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1082, file: !57, line: 2061, baseType: !1540, size: 64, align: 64, offset: 2432)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1082, file: !57, line: 2066, baseType: !957, size: 32, align: 32, offset: 2496)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1082, file: !57, line: 2070, baseType: !957, size: 32, align: 32, offset: 2528)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1082, file: !57, line: 2078, baseType: !957, size: 32, align: 32, offset: 2560)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1082, file: !57, line: 2085, baseType: !957, size: 32, align: 32, offset: 2592)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1082, file: !57, line: 2092, baseType: !957, size: 32, align: 32, offset: 2624)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1082, file: !57, line: 2099, baseType: !957, size: 32, align: 32, offset: 2656)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1082, file: !57, line: 2106, baseType: !957, size: 32, align: 32, offset: 2688)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1082, file: !57, line: 2113, baseType: !957, size: 32, align: 32, offset: 2720)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1082, file: !57, line: 2120, baseType: !957, size: 32, align: 32, offset: 2752)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1082, file: !57, line: 2125, baseType: !957, size: 32, align: 32, offset: 2784)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1082, file: !57, line: 2133, baseType: !957, size: 32, align: 32, offset: 2816)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1082, file: !57, line: 2140, baseType: !957, size: 32, align: 32, offset: 2848)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1082, file: !57, line: 2145, baseType: !957, size: 32, align: 32, offset: 2880)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1082, file: !57, line: 2153, baseType: !957, size: 32, align: 32, offset: 2912)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1082, file: !57, line: 2158, baseType: !957, size: 32, align: 32, offset: 2944)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1082, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1082, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1082, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1082, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1082, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1082, file: !57, line: 2203, baseType: !957, size: 32, align: 32, offset: 3136)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1082, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1082, file: !57, line: 2212, baseType: !957, size: 32, align: 32, offset: 3200)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1082, file: !57, line: 2213, baseType: !957, size: 32, align: 32, offset: 3232)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1082, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1082, file: !57, line: 2232, baseType: !957, size: 32, align: 32, offset: 3296)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1082, file: !57, line: 2243, baseType: !957, size: 32, align: 32, offset: 3328)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1082, file: !57, line: 2249, baseType: !957, size: 32, align: 32, offset: 3360)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1082, file: !57, line: 2256, baseType: !957, size: 32, align: 32, offset: 3392)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1082, file: !57, line: 2263, baseType: !1114, size: 64, align: 64, offset: 3456)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1082, file: !57, line: 2270, baseType: !1114, size: 64, align: 64, offset: 3520)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1082, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1082, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1082, file: !57, line: 2367, baseType: !1576, size: 64, align: 64, offset: 3648)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!957, !1081, !1338, !957}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1082, file: !57, line: 2383, baseType: !957, size: 32, align: 32, offset: 3712)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1082, file: !57, line: 2386, baseType: !949, size: 32, align: 32, offset: 3744)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1082, file: !57, line: 2387, baseType: !949, size: 32, align: 32, offset: 3776)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1082, file: !57, line: 2394, baseType: !957, size: 32, align: 32, offset: 3808)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1082, file: !57, line: 2401, baseType: !957, size: 32, align: 32, offset: 3840)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1082, file: !57, line: 2408, baseType: !957, size: 32, align: 32, offset: 3872)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1082, file: !57, line: 2415, baseType: !957, size: 32, align: 32, offset: 3904)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1082, file: !57, line: 2422, baseType: !957, size: 32, align: 32, offset: 3936)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1082, file: !57, line: 2423, baseType: !1588, size: 64, align: 64, offset: 3968)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1590, file: !57, line: 827, baseType: !957, size: 32, align: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1590, file: !57, line: 828, baseType: !957, size: 32, align: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1590, file: !57, line: 829, baseType: !957, size: 32, align: 32, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1590, file: !57, line: 830, baseType: !949, size: 32, align: 32, offset: 96)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1082, file: !57, line: 2430, baseType: !1000, size: 64, align: 64, offset: 4032)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1082, file: !57, line: 2437, baseType: !1000, size: 64, align: 64, offset: 4096)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1082, file: !57, line: 2444, baseType: !949, size: 32, align: 32, offset: 4160)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1082, file: !57, line: 2451, baseType: !949, size: 32, align: 32, offset: 4192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1082, file: !57, line: 2458, baseType: !957, size: 32, align: 32, offset: 4224)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1082, file: !57, line: 2469, baseType: !957, size: 32, align: 32, offset: 4256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1082, file: !57, line: 2475, baseType: !957, size: 32, align: 32, offset: 4288)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1082, file: !57, line: 2481, baseType: !957, size: 32, align: 32, offset: 4320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1082, file: !57, line: 2485, baseType: !957, size: 32, align: 32, offset: 4352)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1082, file: !57, line: 2489, baseType: !957, size: 32, align: 32, offset: 4384)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1082, file: !57, line: 2493, baseType: !957, size: 32, align: 32, offset: 4416)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1082, file: !57, line: 2501, baseType: !957, size: 32, align: 32, offset: 4448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1082, file: !57, line: 2506, baseType: !957, size: 32, align: 32, offset: 4480)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1082, file: !57, line: 2510, baseType: !957, size: 32, align: 32, offset: 4512)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1082, file: !57, line: 2514, baseType: !1000, size: 64, align: 64, offset: 4544)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1082, file: !57, line: 2528, baseType: !1612, size: 64, align: 64, offset: 4608)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{null, !1081, !986, !957, !957}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1082, file: !57, line: 2534, baseType: !957, size: 32, align: 32, offset: 4672)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1082, file: !57, line: 2545, baseType: !957, size: 32, align: 32, offset: 4704)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1082, file: !57, line: 2547, baseType: !957, size: 32, align: 32, offset: 4736)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1082, file: !57, line: 2549, baseType: !957, size: 32, align: 32, offset: 4768)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1082, file: !57, line: 2551, baseType: !957, size: 32, align: 32, offset: 4800)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1082, file: !57, line: 2553, baseType: !957, size: 32, align: 32, offset: 4832)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1082, file: !57, line: 2555, baseType: !957, size: 32, align: 32, offset: 4864)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1082, file: !57, line: 2557, baseType: !957, size: 32, align: 32, offset: 4896)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1082, file: !57, line: 2559, baseType: !957, size: 32, align: 32, offset: 4928)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1082, file: !57, line: 2563, baseType: !957, size: 32, align: 32, offset: 4960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1082, file: !57, line: 2571, baseType: !1196, size: 64, align: 64, offset: 4992)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1082, file: !57, line: 2579, baseType: !1196, size: 64, align: 64, offset: 5056)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1082, file: !57, line: 2586, baseType: !957, size: 32, align: 32, offset: 5120)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1082, file: !57, line: 2615, baseType: !957, size: 32, align: 32, offset: 5152)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1082, file: !57, line: 2627, baseType: !957, size: 32, align: 32, offset: 5184)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1082, file: !57, line: 2637, baseType: !957, size: 32, align: 32, offset: 5216)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1082, file: !57, line: 2681, baseType: !957, size: 32, align: 32, offset: 5248)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1082, file: !57, line: 2709, baseType: !1000, size: 64, align: 64, offset: 5312)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1082, file: !57, line: 2716, baseType: !1634, size: 64, align: 64, offset: 5376)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641, !1642, !1643, !1644, !1648, !1652, !1653, !1654, !1655, !1660, !1661, !1662, !1663, !1664}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1636, file: !57, line: 3642, baseType: !979, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1636, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1636, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1636, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1636, file: !57, line: 3669, baseType: !957, size: 32, align: 32, offset: 160)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1636, file: !57, line: 3682, baseType: !1335, size: 64, align: 64, offset: 192)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1636, file: !57, line: 3698, baseType: !1645, size: 64, align: 64, offset: 256)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!957, !1134, !1071, !933}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1636, file: !57, line: 3712, baseType: !1649, size: 64, align: 64, offset: 320)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!957, !1134, !957, !1071, !933}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1636, file: !57, line: 3726, baseType: !1645, size: 64, align: 64, offset: 384)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1636, file: !57, line: 3737, baseType: !1131, size: 64, align: 64, offset: 448)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1636, file: !57, line: 3746, baseType: !957, size: 32, align: 32, offset: 512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1636, file: !57, line: 3757, baseType: !1656, size: 64, align: 64, offset: 576)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1659}
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1636, file: !57, line: 3766, baseType: !1131, size: 64, align: 64, offset: 640)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1636, file: !57, line: 3774, baseType: !1131, size: 64, align: 64, offset: 704)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1636, file: !57, line: 3780, baseType: !957, size: 32, align: 32, offset: 768)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1636, file: !57, line: 3785, baseType: !957, size: 32, align: 32, offset: 800)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1636, file: !57, line: 3795, baseType: !1665, size: 64, align: 64, offset: 832)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!957, !1134, !1209}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1082, file: !57, line: 2728, baseType: !986, size: 64, align: 64, offset: 5440)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1082, file: !57, line: 2735, baseType: !1262, size: 512, align: 64, offset: 5504)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1082, file: !57, line: 2742, baseType: !957, size: 32, align: 32, offset: 6016)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1082, file: !57, line: 2755, baseType: !957, size: 32, align: 32, offset: 6048)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1082, file: !57, line: 2776, baseType: !957, size: 32, align: 32, offset: 6080)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1082, file: !57, line: 2783, baseType: !957, size: 32, align: 32, offset: 6112)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1082, file: !57, line: 2791, baseType: !957, size: 32, align: 32, offset: 6144)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1082, file: !57, line: 2802, baseType: !1338, size: 64, align: 64, offset: 6208)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1082, file: !57, line: 2811, baseType: !957, size: 32, align: 32, offset: 6272)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1082, file: !57, line: 2821, baseType: !957, size: 32, align: 32, offset: 6304)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1082, file: !57, line: 2830, baseType: !957, size: 32, align: 32, offset: 6336)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1082, file: !57, line: 2840, baseType: !957, size: 32, align: 32, offset: 6368)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1082, file: !57, line: 2851, baseType: !1681, size: 64, align: 64, offset: 6400)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!957, !1081, !1684, !986, !1320, !957, !957}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!957, !1081, !986}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1082, file: !57, line: 2871, baseType: !1688, size: 64, align: 64, offset: 6464)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!957, !1081, !1691, !986, !1320, !957}
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!957, !1081, !986, !957, !957}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1082, file: !57, line: 2878, baseType: !957, size: 32, align: 32, offset: 6528)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1082, file: !57, line: 2885, baseType: !957, size: 32, align: 32, offset: 6560)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1082, file: !57, line: 3005, baseType: !957, size: 32, align: 32, offset: 6592)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1082, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1082, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1082, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1082, file: !57, line: 3037, baseType: !1160, size: 64, align: 64, offset: 6720)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1082, file: !57, line: 3038, baseType: !957, size: 32, align: 32, offset: 6784)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1082, file: !57, line: 3050, baseType: !1114, size: 64, align: 64, offset: 6848)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1082, file: !57, line: 3065, baseType: !957, size: 32, align: 32, offset: 6912)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1082, file: !57, line: 3083, baseType: !957, size: 32, align: 32, offset: 6944)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1082, file: !57, line: 3092, baseType: !1007, size: 64, align: 32, offset: 6976)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1082, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1082, file: !57, line: 3106, baseType: !1007, size: 64, align: 32, offset: 7072)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1082, file: !57, line: 3113, baseType: !1709, size: 64, align: 64, offset: 7168)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1711)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1712)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1713)
!1713 = !{!1714, !1715, !1716, !1717, !1718, !1719, !1722}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1712, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1712, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1712, file: !57, line: 720, baseType: !979, size: 64, align: 64, offset: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1712, file: !57, line: 724, baseType: !979, size: 64, align: 64, offset: 128)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1712, file: !57, line: 728, baseType: !957, size: 32, align: 32, offset: 192)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1712, file: !57, line: 734, baseType: !1720, size: 64, align: 64, offset: 256)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1712, file: !57, line: 739, baseType: !1723, size: 64, align: 64, offset: 320)
