; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!904 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!905 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FLACExtradataFormat", file: !888, line: 58, size: 32, align: 32, elements: !907)
!907 = !{!908, !909}
!908 = !DIEnumerator(name: "FLAC_EXTRADATA_FORMAT_STREAMINFO", value: 0)
!909 = !DIEnumerator(name: "FLAC_EXTRADATA_FORMAT_FULL_HEADER", value: 1)
!910 = !{!911, !912, !913, !921, !923}
!911 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!912 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !916, line: 221, size: 32, align: 8, elements: !917)
!916 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !915, file: !916, line: 221, baseType: !919, size: 32, align: 32)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !920, line: 51, baseType: !912)
!920 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !920, line: 48, baseType: !922)
!922 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !920, line: 55, baseType: !924)
!924 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!925 = !{!926, !934}
!926 = distinct !DIGlobalVariable(name: "sample_size_table", scope: !0, file: !927, line: 30, type: !928, isLocal: true, isDefinition: true, variable: [8 x i8]* @sample_size_table)
!927 = !DIFile(filename: "libavcodec/flac.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 64, align: 8, elements: !932)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !920, line: 36, baseType: !931)
!931 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!932 = !{!933}
!933 = !DISubrange(count: 8)
!934 = distinct !DIGlobalVariable(name: "flac_channel_layouts", scope: !0, file: !927, line: 32, type: !935, isLocal: true, isDefinition: true, variable: [8 x i64]* @flac_channel_layouts)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, align: 64, elements: !932)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!937 = !{i32 2, !"Dwarf Version", i32 4}
!938 = !{i32 2, !"Debug Info Version", i32 3}
!939 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!940 = distinct !DISubprogram(name: "ff_flac_decode_frame_header", scope: !927, file: !927, line: 50, type: !941, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1683)
!941 = !DISubroutineType(types: !942)
!942 = !{!911, !943, !1662, !1672, !911}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !946)
!946 = !{!947, !992, !993, !994, !1260, !1261, !1262, !1263, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1416, !1420, !1421, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1600, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !945, file: !35, line: 1561, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !952)
!952 = !{!953, !957, !962, !966, !967, !968, !969, !973, !979, !981, !985}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !951, file: !4, line: 72, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !951, file: !4, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!954, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !951, file: !4, line: 85, baseType: !963, size: 64, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !951, file: !4, line: 93, baseType: !911, size: 32, align: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !951, file: !4, line: 99, baseType: !911, size: 32, align: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !951, file: !4, line: 108, baseType: !911, size: 32, align: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !951, file: !4, line: 113, baseType: !970, size: 64, align: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!961, !961, !961}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !951, file: !4, line: 123, baseType: !974, size: 64, align: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!977, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !951, file: !4, line: 130, baseType: !980, size: 32, align: 32, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !951, file: !4, line: 136, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!980, !961}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !951, file: !4, line: 142, baseType: !986, size: 64, align: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!911, !989, !961, !954, !911}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !945, file: !35, line: 1562, baseType: !911, size: 32, align: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !945, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !945, file: !35, line: 1565, baseType: !995, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1013, !1016, !1019, !1022, !1024, !1025, !1026, !1034, !1035, !1036, !1038, !1042, !1048, !1059, !1063, !1064, !1112, !1231, !1235, !1236, !1240, !1244, !1249, !1253, !1254, !1255}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !35, line: 3475, baseType: !954, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !997, file: !35, line: 3480, baseType: !954, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !997, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !997, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !997, file: !35, line: 3487, baseType: !911, size: 32, align: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !997, file: !35, line: 3488, baseType: !1005, size: 64, align: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1008, line: 61, baseType: !1009)
!1008 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1008, line: 58, size: 64, align: 32, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1009, file: !1008, line: 59, baseType: !911, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1009, file: !1008, line: 60, baseType: !911, size: 32, align: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !997, file: !35, line: 3489, baseType: !1014, size: 64, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !997, file: !35, line: 3490, baseType: !1017, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !997, file: !35, line: 3491, baseType: !1020, size: 64, align: 64, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !997, file: !35, line: 3492, baseType: !1023, size: 64, align: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !997, file: !35, line: 3493, baseType: !921, size: 8, align: 8, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !997, file: !35, line: 3494, baseType: !948, size: 64, align: 64, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !997, file: !35, line: 3495, baseType: !1027, size: 64, align: 64, offset: 704)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1030, file: !35, line: 3402, baseType: !911, size: 32, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1030, file: !35, line: 3403, baseType: !954, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !997, file: !35, line: 3507, baseType: !954, size: 64, align: 64, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !997, file: !35, line: 3516, baseType: !911, size: 32, align: 32, offset: 832)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !35, line: 3517, baseType: !1037, size: 64, align: 64, offset: 896)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !997, file: !35, line: 3527, baseType: !1039, size: 64, align: 64, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!911, !943}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !997, file: !35, line: 3535, baseType: !1043, size: 64, align: 64, offset: 1024)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!911, !943, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !997, file: !35, line: 3541, baseType: !1049, size: 64, align: 64, offset: 1088)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1053, line: 223, size: 128, align: 64, elements: !1054)
!1053 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1054 = !{!1055, !1058}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1052, file: !1053, line: 224, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1052, file: !1053, line: 225, baseType: !1056, size: 64, align: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !997, file: !35, line: 3549, baseType: !1060, size: 64, align: 64, offset: 1152)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !1037}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !997, file: !35, line: 3551, baseType: !1039, size: 64, align: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !997, file: !35, line: 3552, baseType: !1065, size: 64, align: 64, offset: 1280)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!911, !943, !1068, !911, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1072)
!1072 = !{!1073, !1076, !1077, !1078, !1079, !1109}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1071, file: !35, line: 3921, baseType: !1074, size: 16, align: 16)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !920, line: 49, baseType: !1075)
!1075 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1071, file: !35, line: 3922, baseType: !919, size: 32, align: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1071, file: !35, line: 3923, baseType: !919, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1071, file: !35, line: 3924, baseType: !912, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1071, file: !35, line: 3925, baseType: !1080, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1098, !1102, !1104, !1105, !1107, !1108}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1083, file: !35, line: 3886, baseType: !911, size: 32, align: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1083, file: !35, line: 3887, baseType: !911, size: 32, align: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1083, file: !35, line: 3888, baseType: !911, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1083, file: !35, line: 3889, baseType: !911, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1083, file: !35, line: 3890, baseType: !911, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1083, file: !35, line: 3897, baseType: !1091, size: 768, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1093)
!1093 = !{!1094, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !35, line: 3855, baseType: !1095, size: 512, align: 64)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !932)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1092, file: !35, line: 3857, baseType: !1097, size: 256, align: 32, offset: 512)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 256, align: 32, elements: !932)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !35, line: 3903, baseType: !1099, size: 256, align: 64, offset: 960)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 256, align: 64, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 4)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1083, file: !35, line: 3904, baseType: !1103, size: 128, align: 32, offset: 1216)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 128, align: 32, elements: !1100)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1083, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1083, file: !35, line: 3908, baseType: !1106, size: 64, align: 64, offset: 1408)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1083, file: !35, line: 3915, baseType: !1106, size: 64, align: 64, offset: 1472)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1083, file: !35, line: 3917, baseType: !911, size: 32, align: 32, offset: 1536)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1071, file: !35, line: 3926, baseType: !1110, size: 64, align: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !920, line: 40, baseType: !1111)
!1111 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !997, file: !35, line: 3564, baseType: !1113, size: 64, align: 64, offset: 1344)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!911, !943, !1116, !1150, !1230}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1119)
!1119 = !{!1120, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1146, !1147, !1148, !1149}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !35, line: 1451, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1123, line: 94, baseType: !1124)
!1123 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1123, line: 81, size: 192, align: 64, elements: !1125)
!1125 = !{!1126, !1130, !1131}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1124, file: !1123, line: 82, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1123, line: 73, baseType: !1129)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1123, line: 73, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !1123, line: 89, baseType: !1068, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !1123, line: 93, baseType: !911, size: 32, align: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !35, line: 1461, baseType: !1110, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1118, file: !35, line: 1467, baseType: !1110, size: 64, align: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !35, line: 1468, baseType: !1068, size: 64, align: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !35, line: 1469, baseType: !911, size: 32, align: 32, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1118, file: !35, line: 1470, baseType: !911, size: 32, align: 32, offset: 288)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !35, line: 1474, baseType: !911, size: 32, align: 32, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !35, line: 1479, baseType: !1139, size: 64, align: 64, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !35, line: 1412, baseType: !1068, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !35, line: 1413, baseType: !911, size: 32, align: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1118, file: !35, line: 1480, baseType: !911, size: 32, align: 32, offset: 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1118, file: !35, line: 1486, baseType: !1110, size: 64, align: 64, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1118, file: !35, line: 1488, baseType: !1110, size: 64, align: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1118, file: !35, line: 1497, baseType: !1110, size: 64, align: 64, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1184, !1186, !1187, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1218, !1219, !1220, !1221, !1222, !1223, !1226, !1227, !1228, !1229}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !758, line: 282, baseType: !1095, size: 512, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1153, file: !758, line: 299, baseType: !1097, size: 256, align: 32, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1153, file: !758, line: 315, baseType: !1158, size: 64, align: 64, offset: 768)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1153, file: !758, line: 326, baseType: !911, size: 32, align: 32, offset: 832)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1153, file: !758, line: 326, baseType: !911, size: 32, align: 32, offset: 864)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1153, file: !758, line: 334, baseType: !911, size: 32, align: 32, offset: 896)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1153, file: !758, line: 341, baseType: !911, size: 32, align: 32, offset: 928)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1153, file: !758, line: 346, baseType: !911, size: 32, align: 32, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1153, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1153, file: !758, line: 356, baseType: !1007, size: 64, align: 32, offset: 1024)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1153, file: !758, line: 361, baseType: !1110, size: 64, align: 64, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1153, file: !758, line: 369, baseType: !1110, size: 64, align: 64, offset: 1152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1153, file: !758, line: 377, baseType: !1110, size: 64, align: 64, offset: 1216)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1153, file: !758, line: 382, baseType: !911, size: 32, align: 32, offset: 1280)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1153, file: !758, line: 386, baseType: !911, size: 32, align: 32, offset: 1312)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1153, file: !758, line: 391, baseType: !911, size: 32, align: 32, offset: 1344)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1153, file: !758, line: 396, baseType: !961, size: 64, align: 64, offset: 1408)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1153, file: !758, line: 403, baseType: !1174, size: 512, align: 64, offset: 1472)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 512, align: 64, elements: !932)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1153, file: !758, line: 410, baseType: !911, size: 32, align: 32, offset: 1984)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1153, file: !758, line: 415, baseType: !911, size: 32, align: 32, offset: 2016)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1153, file: !758, line: 420, baseType: !911, size: 32, align: 32, offset: 2048)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1153, file: !758, line: 425, baseType: !911, size: 32, align: 32, offset: 2080)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1153, file: !758, line: 435, baseType: !1110, size: 64, align: 64, offset: 2112)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1153, file: !758, line: 440, baseType: !911, size: 32, align: 32, offset: 2176)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1153, file: !758, line: 445, baseType: !923, size: 64, align: 64, offset: 2240)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !758, line: 459, baseType: !1183, size: 512, align: 64, offset: 2304)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !932)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1153, file: !758, line: 473, baseType: !1185, size: 64, align: 64, offset: 2816)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1153, file: !758, line: 477, baseType: !911, size: 32, align: 32, offset: 2880)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1153, file: !758, line: 479, baseType: !1188, size: 64, align: 64, offset: 2944)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1201}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1191, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !758, line: 203, baseType: !1068, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !758, line: 204, baseType: !911, size: 32, align: 32, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1191, file: !758, line: 205, baseType: !1197, size: 64, align: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1199, line: 86, baseType: !1200)
!1199 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1199, line: 86, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !758, line: 206, baseType: !1121, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1153, file: !758, line: 480, baseType: !911, size: 32, align: 32, offset: 3008)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1153, file: !758, line: 505, baseType: !911, size: 32, align: 32, offset: 3040)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1153, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1153, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1153, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1153, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1153, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1153, file: !758, line: 532, baseType: !1110, size: 64, align: 64, offset: 3264)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1153, file: !758, line: 539, baseType: !1110, size: 64, align: 64, offset: 3328)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1153, file: !758, line: 547, baseType: !1110, size: 64, align: 64, offset: 3392)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1153, file: !758, line: 554, baseType: !1197, size: 64, align: 64, offset: 3456)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1153, file: !758, line: 563, baseType: !911, size: 32, align: 32, offset: 3520)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1153, file: !758, line: 572, baseType: !911, size: 32, align: 32, offset: 3552)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1153, file: !758, line: 581, baseType: !911, size: 32, align: 32, offset: 3584)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1153, file: !758, line: 588, baseType: !1217, size: 64, align: 64, offset: 3648)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1153, file: !758, line: 593, baseType: !911, size: 32, align: 32, offset: 3712)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1153, file: !758, line: 596, baseType: !911, size: 32, align: 32, offset: 3744)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1153, file: !758, line: 599, baseType: !1121, size: 64, align: 64, offset: 3776)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1153, file: !758, line: 605, baseType: !1121, size: 64, align: 64, offset: 3840)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1153, file: !758, line: 616, baseType: !1121, size: 64, align: 64, offset: 3904)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1153, file: !758, line: 626, baseType: !1224, size: 64, align: 64, offset: 3968)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1225, line: 216, baseType: !924)
!1225 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1153, file: !758, line: 627, baseType: !1224, size: 64, align: 64, offset: 4032)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1153, file: !758, line: 628, baseType: !1224, size: 64, align: 64, offset: 4096)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1153, file: !758, line: 629, baseType: !1224, size: 64, align: 64, offset: 4160)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1153, file: !758, line: 645, baseType: !1121, size: 64, align: 64, offset: 4224)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !997, file: !35, line: 3566, baseType: !1232, size: 64, align: 64, offset: 1408)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!911, !943, !961, !1230, !1116}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !997, file: !35, line: 3567, baseType: !1039, size: 64, align: 64, offset: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !997, file: !35, line: 3576, baseType: !1237, size: 64, align: 64, offset: 1536)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!911, !943, !1150}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !997, file: !35, line: 3577, baseType: !1241, size: 64, align: 64, offset: 1600)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!911, !943, !1116}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !997, file: !35, line: 3584, baseType: !1245, size: 64, align: 64, offset: 1664)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!911, !943, !1248}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !997, file: !35, line: 3589, baseType: !1250, size: 64, align: 64, offset: 1728)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !943}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !997, file: !35, line: 3594, baseType: !911, size: 32, align: 32, offset: 1792)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !997, file: !35, line: 3600, baseType: !954, size: 64, align: 64, offset: 1856)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !997, file: !35, line: 3609, baseType: !1256, size: 64, align: 64, offset: 1920)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !945, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !945, file: !35, line: 1581, baseType: !912, size: 32, align: 32, offset: 224)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !945, file: !35, line: 1583, baseType: !961, size: 64, align: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !945, file: !35, line: 1591, baseType: !1264, size: 64, align: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1053, line: 129, size: 1664, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1289, !1290, !1296, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1265, file: !1053, line: 136, baseType: !911, size: 32, align: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1265, file: !1053, line: 151, baseType: !911, size: 32, align: 32, offset: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1265, file: !1053, line: 157, baseType: !911, size: 32, align: 32, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1265, file: !1053, line: 159, baseType: !1248, size: 64, align: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1265, file: !1053, line: 161, baseType: !1272, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1053, line: 117, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1053, line: 100, size: 832, align: 64, elements: !1275)
!1275 = !{!1276, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1274, file: !1053, line: 105, baseType: !1277, size: 256, align: 64)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1278, size: 256, align: 64, elements: !1100)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1123, line: 238, baseType: !1280)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1123, line: 238, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1274, file: !1053, line: 110, baseType: !911, size: 32, align: 32, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1274, file: !1053, line: 111, baseType: !911, size: 32, align: 32, offset: 288)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1274, file: !1053, line: 111, baseType: !911, size: 32, align: 32, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1274, file: !1053, line: 112, baseType: !1097, size: 256, align: 32, offset: 352)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1274, file: !1053, line: 113, baseType: !1103, size: 128, align: 32, offset: 608)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1274, file: !1053, line: 114, baseType: !911, size: 32, align: 32, offset: 736)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1274, file: !1053, line: 115, baseType: !911, size: 32, align: 32, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1274, file: !1053, line: 116, baseType: !911, size: 32, align: 32, offset: 800)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1265, file: !1053, line: 163, baseType: !961, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1265, file: !1053, line: 165, baseType: !1291, size: 128, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1053, line: 122, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1053, line: 119, size: 128, align: 64, elements: !1293)
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1292, file: !1053, line: 120, baseType: !1116, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1292, file: !1053, line: 121, baseType: !1248, size: 64, align: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1265, file: !1053, line: 166, baseType: !1297, size: 128, align: 64, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1053, line: 127, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1053, line: 124, size: 128, align: 64, elements: !1299)
!1299 = !{!1300, !1373}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1298, file: !1053, line: 125, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1305)
!1305 = !{!1306, !1307, !1331, !1335, !1336, !1370, !1371, !1372}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1304, file: !35, line: 5751, baseType: !948, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1304, file: !35, line: 5756, baseType: !1308, size: 64, align: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1316, !1317, !1318, !1322, !1326, !1330}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1310, file: !35, line: 5797, baseType: !954, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1310, file: !35, line: 5804, baseType: !1314, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1310, file: !35, line: 5815, baseType: !948, size: 64, align: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1310, file: !35, line: 5825, baseType: !911, size: 32, align: 32, offset: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1310, file: !35, line: 5826, baseType: !1319, size: 64, align: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!911, !1302}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1310, file: !35, line: 5827, baseType: !1323, size: 64, align: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!911, !1302, !1116}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1310, file: !35, line: 5828, baseType: !1327, size: 64, align: 64, offset: 384)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{null, !1302}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1310, file: !35, line: 5829, baseType: !1327, size: 64, align: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1304, file: !35, line: 5762, baseType: !1332, size: 64, align: 64, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1334)
!1334 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1304, file: !35, line: 5768, baseType: !961, size: 64, align: 64, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1304, file: !35, line: 5775, baseType: !1337, size: 64, align: 64, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1339, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1339, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1339, file: !35, line: 3948, baseType: !919, size: 32, align: 32, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1339, file: !35, line: 3958, baseType: !1068, size: 64, align: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1339, file: !35, line: 3962, baseType: !911, size: 32, align: 32, offset: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1339, file: !35, line: 3968, baseType: !911, size: 32, align: 32, offset: 224)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1339, file: !35, line: 3973, baseType: !1110, size: 64, align: 64, offset: 256)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1339, file: !35, line: 3986, baseType: !911, size: 32, align: 32, offset: 320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1339, file: !35, line: 3999, baseType: !911, size: 32, align: 32, offset: 352)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1339, file: !35, line: 4004, baseType: !911, size: 32, align: 32, offset: 384)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1339, file: !35, line: 4005, baseType: !911, size: 32, align: 32, offset: 416)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1339, file: !35, line: 4010, baseType: !911, size: 32, align: 32, offset: 448)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1339, file: !35, line: 4011, baseType: !911, size: 32, align: 32, offset: 480)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1339, file: !35, line: 4020, baseType: !1007, size: 64, align: 32, offset: 512)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1339, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1339, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1339, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1339, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1339, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1339, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1339, file: !35, line: 4039, baseType: !911, size: 32, align: 32, offset: 768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1339, file: !35, line: 4046, baseType: !923, size: 64, align: 64, offset: 832)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1339, file: !35, line: 4050, baseType: !911, size: 32, align: 32, offset: 896)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1339, file: !35, line: 4054, baseType: !911, size: 32, align: 32, offset: 928)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1339, file: !35, line: 4061, baseType: !911, size: 32, align: 32, offset: 960)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1339, file: !35, line: 4065, baseType: !911, size: 32, align: 32, offset: 992)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1339, file: !35, line: 4073, baseType: !911, size: 32, align: 32, offset: 1024)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1339, file: !35, line: 4080, baseType: !911, size: 32, align: 32, offset: 1056)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1339, file: !35, line: 4084, baseType: !911, size: 32, align: 32, offset: 1088)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1304, file: !35, line: 5781, baseType: !1337, size: 64, align: 64, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1304, file: !35, line: 5787, baseType: !1007, size: 64, align: 32, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1304, file: !35, line: 5793, baseType: !1007, size: 64, align: 32, offset: 448)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1298, file: !1053, line: 126, baseType: !911, size: 32, align: 32, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1265, file: !1053, line: 172, baseType: !1116, size: 64, align: 64, offset: 576)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1265, file: !1053, line: 177, baseType: !1068, size: 64, align: 64, offset: 640)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1265, file: !1053, line: 178, baseType: !912, size: 32, align: 32, offset: 704)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1265, file: !1053, line: 180, baseType: !961, size: 64, align: 64, offset: 768)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1265, file: !1053, line: 185, baseType: !911, size: 32, align: 32, offset: 832)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1265, file: !1053, line: 190, baseType: !961, size: 64, align: 64, offset: 896)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1265, file: !1053, line: 195, baseType: !911, size: 32, align: 32, offset: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1265, file: !1053, line: 200, baseType: !1116, size: 64, align: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1265, file: !1053, line: 201, baseType: !911, size: 32, align: 32, offset: 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1265, file: !1053, line: 202, baseType: !1248, size: 64, align: 64, offset: 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1265, file: !1053, line: 203, baseType: !911, size: 32, align: 32, offset: 1216)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1265, file: !1053, line: 205, baseType: !911, size: 32, align: 32, offset: 1248)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1265, file: !1053, line: 206, baseType: !911, size: 32, align: 32, offset: 1280)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1265, file: !1053, line: 209, baseType: !1224, size: 64, align: 64, offset: 1344)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1265, file: !1053, line: 212, baseType: !1224, size: 64, align: 64, offset: 1408)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1265, file: !1053, line: 213, baseType: !1248, size: 64, align: 64, offset: 1472)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1265, file: !1053, line: 215, baseType: !911, size: 32, align: 32, offset: 1536)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1265, file: !1053, line: 217, baseType: !911, size: 32, align: 32, offset: 1568)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1265, file: !1053, line: 220, baseType: !911, size: 32, align: 32, offset: 1600)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !945, file: !35, line: 1598, baseType: !961, size: 64, align: 64, offset: 384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !945, file: !35, line: 1606, baseType: !1110, size: 64, align: 64, offset: 448)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !945, file: !35, line: 1614, baseType: !911, size: 32, align: 32, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !945, file: !35, line: 1622, baseType: !911, size: 32, align: 32, offset: 544)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !945, file: !35, line: 1628, baseType: !911, size: 32, align: 32, offset: 576)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !35, line: 1636, baseType: !911, size: 32, align: 32, offset: 608)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !945, file: !35, line: 1643, baseType: !911, size: 32, align: 32, offset: 640)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !945, file: !35, line: 1657, baseType: !1068, size: 64, align: 64, offset: 704)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !945, file: !35, line: 1658, baseType: !911, size: 32, align: 32, offset: 768)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !945, file: !35, line: 1679, baseType: !1007, size: 64, align: 32, offset: 800)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !945, file: !35, line: 1688, baseType: !911, size: 32, align: 32, offset: 864)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !945, file: !35, line: 1712, baseType: !911, size: 32, align: 32, offset: 896)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !945, file: !35, line: 1729, baseType: !911, size: 32, align: 32, offset: 928)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !945, file: !35, line: 1729, baseType: !911, size: 32, align: 32, offset: 960)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !945, file: !35, line: 1744, baseType: !911, size: 32, align: 32, offset: 992)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !945, file: !35, line: 1744, baseType: !911, size: 32, align: 32, offset: 1024)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !945, file: !35, line: 1751, baseType: !911, size: 32, align: 32, offset: 1056)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !945, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !945, file: !35, line: 1791, baseType: !1412, size: 64, align: 64, offset: 1152)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{null, !1415, !1150, !1230, !911, !911, !911}
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !945, file: !35, line: 1808, baseType: !1417, size: 64, align: 64, offset: 1216)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!494, !1415, !1014}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !945, file: !35, line: 1816, baseType: !911, size: 32, align: 32, offset: 1280)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !945, file: !35, line: 1825, baseType: !1422, size: 32, align: 32, offset: 1312)
!1422 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !945, file: !35, line: 1830, baseType: !911, size: 32, align: 32, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !945, file: !35, line: 1838, baseType: !1422, size: 32, align: 32, offset: 1376)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !945, file: !35, line: 1846, baseType: !911, size: 32, align: 32, offset: 1408)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !945, file: !35, line: 1851, baseType: !911, size: 32, align: 32, offset: 1440)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !945, file: !35, line: 1861, baseType: !1422, size: 32, align: 32, offset: 1472)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !945, file: !35, line: 1868, baseType: !1422, size: 32, align: 32, offset: 1504)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !945, file: !35, line: 1875, baseType: !1422, size: 32, align: 32, offset: 1536)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !945, file: !35, line: 1882, baseType: !1422, size: 32, align: 32, offset: 1568)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !945, file: !35, line: 1889, baseType: !1422, size: 32, align: 32, offset: 1600)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !945, file: !35, line: 1896, baseType: !1422, size: 32, align: 32, offset: 1632)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !945, file: !35, line: 1903, baseType: !1422, size: 32, align: 32, offset: 1664)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !945, file: !35, line: 1910, baseType: !911, size: 32, align: 32, offset: 1696)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !945, file: !35, line: 1915, baseType: !911, size: 32, align: 32, offset: 1728)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !945, file: !35, line: 1926, baseType: !1230, size: 64, align: 64, offset: 1792)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !945, file: !35, line: 1935, baseType: !1007, size: 64, align: 32, offset: 1856)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !945, file: !35, line: 1942, baseType: !911, size: 32, align: 32, offset: 1920)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !945, file: !35, line: 1948, baseType: !911, size: 32, align: 32, offset: 1952)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !945, file: !35, line: 1954, baseType: !911, size: 32, align: 32, offset: 1984)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !945, file: !35, line: 1960, baseType: !911, size: 32, align: 32, offset: 2016)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !945, file: !35, line: 1984, baseType: !911, size: 32, align: 32, offset: 2048)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !945, file: !35, line: 1991, baseType: !911, size: 32, align: 32, offset: 2080)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !945, file: !35, line: 1996, baseType: !911, size: 32, align: 32, offset: 2112)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !945, file: !35, line: 2004, baseType: !911, size: 32, align: 32, offset: 2144)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !945, file: !35, line: 2011, baseType: !911, size: 32, align: 32, offset: 2176)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !945, file: !35, line: 2018, baseType: !911, size: 32, align: 32, offset: 2208)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !945, file: !35, line: 2027, baseType: !911, size: 32, align: 32, offset: 2240)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !945, file: !35, line: 2034, baseType: !911, size: 32, align: 32, offset: 2272)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !945, file: !35, line: 2044, baseType: !911, size: 32, align: 32, offset: 2304)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !945, file: !35, line: 2054, baseType: !1452, size: 64, align: 64, offset: 2368)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !945, file: !35, line: 2061, baseType: !1452, size: 64, align: 64, offset: 2432)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !945, file: !35, line: 2066, baseType: !911, size: 32, align: 32, offset: 2496)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !945, file: !35, line: 2070, baseType: !911, size: 32, align: 32, offset: 2528)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !945, file: !35, line: 2078, baseType: !911, size: 32, align: 32, offset: 2560)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !945, file: !35, line: 2085, baseType: !911, size: 32, align: 32, offset: 2592)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !945, file: !35, line: 2092, baseType: !911, size: 32, align: 32, offset: 2624)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !945, file: !35, line: 2099, baseType: !911, size: 32, align: 32, offset: 2656)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !945, file: !35, line: 2106, baseType: !911, size: 32, align: 32, offset: 2688)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !945, file: !35, line: 2113, baseType: !911, size: 32, align: 32, offset: 2720)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !945, file: !35, line: 2120, baseType: !911, size: 32, align: 32, offset: 2752)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !945, file: !35, line: 2125, baseType: !911, size: 32, align: 32, offset: 2784)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !945, file: !35, line: 2133, baseType: !911, size: 32, align: 32, offset: 2816)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !945, file: !35, line: 2140, baseType: !911, size: 32, align: 32, offset: 2848)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !945, file: !35, line: 2145, baseType: !911, size: 32, align: 32, offset: 2880)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !945, file: !35, line: 2153, baseType: !911, size: 32, align: 32, offset: 2912)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !945, file: !35, line: 2158, baseType: !911, size: 32, align: 32, offset: 2944)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !945, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !945, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !945, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !945, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !945, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !945, file: !35, line: 2203, baseType: !911, size: 32, align: 32, offset: 3136)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !945, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !945, file: !35, line: 2212, baseType: !911, size: 32, align: 32, offset: 3200)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !945, file: !35, line: 2213, baseType: !911, size: 32, align: 32, offset: 3232)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !945, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !945, file: !35, line: 2232, baseType: !911, size: 32, align: 32, offset: 3296)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !945, file: !35, line: 2243, baseType: !911, size: 32, align: 32, offset: 3328)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !945, file: !35, line: 2249, baseType: !911, size: 32, align: 32, offset: 3360)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !945, file: !35, line: 2256, baseType: !911, size: 32, align: 32, offset: 3392)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !945, file: !35, line: 2263, baseType: !923, size: 64, align: 64, offset: 3456)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !945, file: !35, line: 2270, baseType: !923, size: 64, align: 64, offset: 3520)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !945, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !945, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !945, file: !35, line: 2367, baseType: !1488, size: 64, align: 64, offset: 3648)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!911, !1415, !1248, !911}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !945, file: !35, line: 2383, baseType: !911, size: 32, align: 32, offset: 3712)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !945, file: !35, line: 2386, baseType: !1422, size: 32, align: 32, offset: 3744)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !945, file: !35, line: 2387, baseType: !1422, size: 32, align: 32, offset: 3776)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !945, file: !35, line: 2394, baseType: !911, size: 32, align: 32, offset: 3808)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !945, file: !35, line: 2401, baseType: !911, size: 32, align: 32, offset: 3840)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !945, file: !35, line: 2408, baseType: !911, size: 32, align: 32, offset: 3872)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !945, file: !35, line: 2415, baseType: !911, size: 32, align: 32, offset: 3904)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !945, file: !35, line: 2422, baseType: !911, size: 32, align: 32, offset: 3936)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !945, file: !35, line: 2423, baseType: !1500, size: 64, align: 64, offset: 3968)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1502, file: !35, line: 827, baseType: !911, size: 32, align: 32)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1502, file: !35, line: 828, baseType: !911, size: 32, align: 32, offset: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1502, file: !35, line: 829, baseType: !911, size: 32, align: 32, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1502, file: !35, line: 830, baseType: !1422, size: 32, align: 32, offset: 96)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !945, file: !35, line: 2430, baseType: !1110, size: 64, align: 64, offset: 4032)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !945, file: !35, line: 2437, baseType: !1110, size: 64, align: 64, offset: 4096)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !945, file: !35, line: 2444, baseType: !1422, size: 32, align: 32, offset: 4160)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !945, file: !35, line: 2451, baseType: !1422, size: 32, align: 32, offset: 4192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !945, file: !35, line: 2458, baseType: !911, size: 32, align: 32, offset: 4224)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !945, file: !35, line: 2469, baseType: !911, size: 32, align: 32, offset: 4256)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !945, file: !35, line: 2475, baseType: !911, size: 32, align: 32, offset: 4288)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !945, file: !35, line: 2481, baseType: !911, size: 32, align: 32, offset: 4320)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !945, file: !35, line: 2485, baseType: !911, size: 32, align: 32, offset: 4352)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !945, file: !35, line: 2489, baseType: !911, size: 32, align: 32, offset: 4384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !945, file: !35, line: 2493, baseType: !911, size: 32, align: 32, offset: 4416)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !945, file: !35, line: 2501, baseType: !911, size: 32, align: 32, offset: 4448)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !945, file: !35, line: 2506, baseType: !911, size: 32, align: 32, offset: 4480)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !945, file: !35, line: 2510, baseType: !911, size: 32, align: 32, offset: 4512)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !945, file: !35, line: 2514, baseType: !1110, size: 64, align: 64, offset: 4544)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !945, file: !35, line: 2528, baseType: !1524, size: 64, align: 64, offset: 4608)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !1415, !961, !911, !911}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !945, file: !35, line: 2534, baseType: !911, size: 32, align: 32, offset: 4672)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !945, file: !35, line: 2545, baseType: !911, size: 32, align: 32, offset: 4704)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !945, file: !35, line: 2547, baseType: !911, size: 32, align: 32, offset: 4736)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !945, file: !35, line: 2549, baseType: !911, size: 32, align: 32, offset: 4768)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !945, file: !35, line: 2551, baseType: !911, size: 32, align: 32, offset: 4800)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !945, file: !35, line: 2553, baseType: !911, size: 32, align: 32, offset: 4832)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !945, file: !35, line: 2555, baseType: !911, size: 32, align: 32, offset: 4864)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !945, file: !35, line: 2557, baseType: !911, size: 32, align: 32, offset: 4896)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !945, file: !35, line: 2559, baseType: !911, size: 32, align: 32, offset: 4928)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !945, file: !35, line: 2563, baseType: !911, size: 32, align: 32, offset: 4960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !945, file: !35, line: 2571, baseType: !1106, size: 64, align: 64, offset: 4992)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !945, file: !35, line: 2579, baseType: !1106, size: 64, align: 64, offset: 5056)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !945, file: !35, line: 2586, baseType: !911, size: 32, align: 32, offset: 5120)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !945, file: !35, line: 2615, baseType: !911, size: 32, align: 32, offset: 5152)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !945, file: !35, line: 2627, baseType: !911, size: 32, align: 32, offset: 5184)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !945, file: !35, line: 2637, baseType: !911, size: 32, align: 32, offset: 5216)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !945, file: !35, line: 2681, baseType: !911, size: 32, align: 32, offset: 5248)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !945, file: !35, line: 2709, baseType: !1110, size: 64, align: 64, offset: 5312)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !945, file: !35, line: 2716, baseType: !1546, size: 64, align: 64, offset: 5376)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553, !1554, !1555, !1556, !1560, !1564, !1565, !1566, !1567, !1573, !1574, !1575, !1576, !1577}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1548, file: !35, line: 3642, baseType: !954, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1548, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1548, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1548, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1548, file: !35, line: 3669, baseType: !911, size: 32, align: 32, offset: 160)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1548, file: !35, line: 3682, baseType: !1245, size: 64, align: 64, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1548, file: !35, line: 3698, baseType: !1557, size: 64, align: 64, offset: 256)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!911, !943, !1056, !919}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1548, file: !35, line: 3712, baseType: !1561, size: 64, align: 64, offset: 320)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!911, !943, !911, !1056, !919}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1548, file: !35, line: 3726, baseType: !1557, size: 64, align: 64, offset: 384)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1548, file: !35, line: 3737, baseType: !1039, size: 64, align: 64, offset: 448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1548, file: !35, line: 3746, baseType: !911, size: 32, align: 32, offset: 512)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1548, file: !35, line: 3757, baseType: !1568, size: 64, align: 64, offset: 576)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{null, !1571}
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1548, file: !35, line: 3766, baseType: !1039, size: 64, align: 64, offset: 640)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1548, file: !35, line: 3774, baseType: !1039, size: 64, align: 64, offset: 704)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1548, file: !35, line: 3780, baseType: !911, size: 32, align: 32, offset: 768)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1548, file: !35, line: 3785, baseType: !911, size: 32, align: 32, offset: 800)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1548, file: !35, line: 3795, baseType: !1578, size: 64, align: 64, offset: 832)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{!911, !943, !1121}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !945, file: !35, line: 2728, baseType: !961, size: 64, align: 64, offset: 5440)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !945, file: !35, line: 2735, baseType: !1174, size: 512, align: 64, offset: 5504)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !945, file: !35, line: 2742, baseType: !911, size: 32, align: 32, offset: 6016)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !945, file: !35, line: 2755, baseType: !911, size: 32, align: 32, offset: 6048)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !945, file: !35, line: 2776, baseType: !911, size: 32, align: 32, offset: 6080)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !945, file: !35, line: 2783, baseType: !911, size: 32, align: 32, offset: 6112)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !945, file: !35, line: 2791, baseType: !911, size: 32, align: 32, offset: 6144)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !945, file: !35, line: 2802, baseType: !1248, size: 64, align: 64, offset: 6208)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !945, file: !35, line: 2811, baseType: !911, size: 32, align: 32, offset: 6272)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !945, file: !35, line: 2821, baseType: !911, size: 32, align: 32, offset: 6304)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !945, file: !35, line: 2830, baseType: !911, size: 32, align: 32, offset: 6336)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !945, file: !35, line: 2840, baseType: !911, size: 32, align: 32, offset: 6368)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !945, file: !35, line: 2851, baseType: !1594, size: 64, align: 64, offset: 6400)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!911, !1415, !1597, !961, !1230, !911, !911}
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!911, !1415, !961}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !945, file: !35, line: 2871, baseType: !1601, size: 64, align: 64, offset: 6464)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!911, !1415, !1604, !961, !1230, !911}
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!911, !1415, !961, !911, !911}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !945, file: !35, line: 2878, baseType: !911, size: 32, align: 32, offset: 6528)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !945, file: !35, line: 2885, baseType: !911, size: 32, align: 32, offset: 6560)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !945, file: !35, line: 3005, baseType: !911, size: 32, align: 32, offset: 6592)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !945, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !945, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !945, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !945, file: !35, line: 3037, baseType: !1068, size: 64, align: 64, offset: 6720)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !945, file: !35, line: 3038, baseType: !911, size: 32, align: 32, offset: 6784)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !945, file: !35, line: 3050, baseType: !923, size: 64, align: 64, offset: 6848)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !945, file: !35, line: 3065, baseType: !911, size: 32, align: 32, offset: 6912)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !945, file: !35, line: 3083, baseType: !911, size: 32, align: 32, offset: 6944)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !945, file: !35, line: 3092, baseType: !1007, size: 64, align: 32, offset: 6976)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !945, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !945, file: !35, line: 3106, baseType: !1007, size: 64, align: 32, offset: 7072)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !945, file: !35, line: 3113, baseType: !1622, size: 64, align: 64, offset: 7168)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1624)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630, !1631, !1632, !1635}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1625, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1625, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1625, file: !35, line: 720, baseType: !954, size: 64, align: 64, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1625, file: !35, line: 724, baseType: !954, size: 64, align: 64, offset: 128)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1625, file: !35, line: 728, baseType: !911, size: 32, align: 32, offset: 192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1625, file: !35, line: 734, baseType: !1633, size: 64, align: 64, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1625, file: !35, line: 739, baseType: !1636, size: 64, align: 64, offset: 320)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !945, file: !35, line: 3129, baseType: !1110, size: 64, align: 64, offset: 7232)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !945, file: !35, line: 3130, baseType: !1110, size: 64, align: 64, offset: 7296)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !945, file: !35, line: 3131, baseType: !1110, size: 64, align: 64, offset: 7360)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !945, file: !35, line: 3132, baseType: !1110, size: 64, align: 64, offset: 7424)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !945, file: !35, line: 3139, baseType: !1106, size: 64, align: 64, offset: 7488)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !945, file: !35, line: 3147, baseType: !911, size: 32, align: 32, offset: 7552)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !945, file: !35, line: 3165, baseType: !911, size: 32, align: 32, offset: 7584)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !945, file: !35, line: 3172, baseType: !911, size: 32, align: 32, offset: 7616)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !945, file: !35, line: 3180, baseType: !911, size: 32, align: 32, offset: 7648)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !945, file: !35, line: 3191, baseType: !1452, size: 64, align: 64, offset: 7680)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !945, file: !35, line: 3199, baseType: !1068, size: 64, align: 64, offset: 7744)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !945, file: !35, line: 3207, baseType: !1106, size: 64, align: 64, offset: 7808)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !945, file: !35, line: 3214, baseType: !912, size: 32, align: 32, offset: 7872)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !945, file: !35, line: 3224, baseType: !1139, size: 64, align: 64, offset: 7936)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !945, file: !35, line: 3225, baseType: !911, size: 32, align: 32, offset: 8000)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !945, file: !35, line: 3249, baseType: !1121, size: 64, align: 64, offset: 8064)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !945, file: !35, line: 3256, baseType: !911, size: 32, align: 32, offset: 8128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !945, file: !35, line: 3271, baseType: !911, size: 32, align: 32, offset: 8160)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !945, file: !35, line: 3279, baseType: !1110, size: 64, align: 64, offset: 8192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !945, file: !35, line: 3301, baseType: !1121, size: 64, align: 64, offset: 8256)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !945, file: !35, line: 3310, baseType: !911, size: 32, align: 32, offset: 8320)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !945, file: !35, line: 3337, baseType: !911, size: 32, align: 32, offset: 8352)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !945, file: !35, line: 3351, baseType: !911, size: 32, align: 32, offset: 8384)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !945, file: !35, line: 3359, baseType: !911, size: 32, align: 32, offset: 8416)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1664, line: 70, baseType: !1665)
!1664 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1664, line: 61, size: 256, align: 64, elements: !1666)
!1666 = !{!1667, !1668, !1669, !1670, !1671}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1665, file: !1664, line: 62, baseType: !1056, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1665, file: !1664, line: 62, baseType: !1056, size: 64, align: 64, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1665, file: !1664, line: 67, baseType: !911, size: 32, align: 32, offset: 128)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1665, file: !1664, line: 68, baseType: !911, size: 32, align: 32, offset: 160)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1665, file: !1664, line: 69, baseType: !911, size: 32, align: 32, offset: 192)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLACFrameInfo", file: !888, line: 91, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FLACFrameInfo", file: !888, line: 82, size: 320, align: 64, elements: !1675)
!1675 = !{!1676, !1677, !1678, !1679, !1680, !1681, !1682}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !1674, file: !888, line: 83, baseType: !911, size: 32, align: 32)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1674, file: !888, line: 83, baseType: !911, size: 32, align: 32, offset: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !1674, file: !888, line: 83, baseType: !911, size: 32, align: 32, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !1674, file: !888, line: 84, baseType: !911, size: 32, align: 32, offset: 96)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "ch_mode", scope: !1674, file: !888, line: 85, baseType: !911, size: 32, align: 32, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_or_sample_num", scope: !1674, file: !888, line: 86, baseType: !1110, size: 64, align: 64, offset: 192)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "is_var_size", scope: !1674, file: !888, line: 87, baseType: !911, size: 32, align: 32, offset: 256)
!1683 = !{}
!1684 = !DILocalVariable(name: "avctx", arg: 1, scope: !940, file: !927, line: 50, type: !943)
!1685 = !DIExpression()
!1686 = !DILocation(line: 50, column: 49, scope: !940)
!1687 = !DILocalVariable(name: "gb", arg: 2, scope: !940, file: !927, line: 50, type: !1662)
!1688 = !DILocation(line: 50, column: 71, scope: !940)
!1689 = !DILocalVariable(name: "fi", arg: 3, scope: !940, file: !927, line: 51, type: !1672)
!1690 = !DILocation(line: 51, column: 48, scope: !940)
!1691 = !DILocalVariable(name: "log_level_offset", arg: 4, scope: !940, file: !927, line: 51, type: !911)
!1692 = !DILocation(line: 51, column: 56, scope: !940)
!1693 = !DILocalVariable(name: "bs_code", scope: !940, file: !927, line: 53, type: !911)
!1694 = !DILocation(line: 53, column: 9, scope: !940)
!1695 = !DILocalVariable(name: "sr_code", scope: !940, file: !927, line: 53, type: !911)
!1696 = !DILocation(line: 53, column: 18, scope: !940)
!1697 = !DILocalVariable(name: "bps_code", scope: !940, file: !927, line: 53, type: !911)
!1698 = !DILocation(line: 53, column: 27, scope: !940)
!1699 = !DILocation(line: 56, column: 19, scope: !1700)
!1700 = distinct !DILexicalBlock(scope: !940, file: !927, line: 56, column: 9)
!1701 = !DILocation(line: 56, column: 10, scope: !1700)
!1702 = !DILocation(line: 56, column: 27, scope: !1700)
!1703 = !DILocation(line: 56, column: 37, scope: !1700)
!1704 = !DILocation(line: 56, column: 9, scope: !940)
!1705 = !DILocation(line: 57, column: 16, scope: !1706)
!1706 = distinct !DILexicalBlock(scope: !1700, file: !927, line: 56, column: 48)
!1707 = !DILocation(line: 57, column: 28, scope: !1706)
!1708 = !DILocation(line: 57, column: 26, scope: !1706)
!1709 = !DILocation(line: 57, column: 9, scope: !1706)
!1710 = !DILocation(line: 58, column: 9, scope: !1706)
!1711 = !DILocation(line: 62, column: 33, scope: !940)
!1712 = !DILocation(line: 62, column: 23, scope: !940)
!1713 = !DILocation(line: 62, column: 5, scope: !940)
!1714 = !DILocation(line: 62, column: 9, scope: !940)
!1715 = !DILocation(line: 62, column: 21, scope: !940)
!1716 = !DILocation(line: 65, column: 24, scope: !940)
!1717 = !DILocation(line: 65, column: 15, scope: !940)
!1718 = !DILocation(line: 65, column: 13, scope: !940)
!1719 = !DILocation(line: 66, column: 24, scope: !940)
