; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacenc_ltp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacenc_ltp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AACEncContext = type { %struct.AVClass*, %struct.AACEncOptions, %struct.PutBitContext, %struct.FFTContext, %struct.FFTContext, %struct.AVFloatDSPContext*, %struct.AACPCEInfo, [16 x float*], i32, i32, [8 x i8], %struct.LPCContext, i32, i32, i8*, i8*, %struct.ChannelElement*, %struct.FFPsyContext, %struct.FFPsyPreprocessContext*, %struct.AACCoefficientsEncoder*, i32, i32, float, i32, float, i32, i32, %struct.AudioFrameQueue, [96 x i32], [1024 x float], i16, [256 x [128 x %struct.AACQuantizeBandCostCacheEntry]], void (float*, float*, i32)*, void (i32*, float*, float*, i32, i32, i32, float, float)*, %struct.anon.0 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AACEncOptions = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }

!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!918 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!919 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!920 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!921 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!922 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!923 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!924 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!925 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!926 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!927 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !85, line: 798, size: 32, align: 32, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!931 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!932 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!933 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!934 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!935 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!936 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OCStatus", file: !44, line: 115, size: 32, align: 32, elements: !938)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DIEnumerator(name: "OC_NONE", value: 0)
!940 = !DIEnumerator(name: "OC_TRIAL_PCE", value: 1)
!941 = !DIEnumerator(name: "OC_TRIAL_FRAME", value: 2)
!942 = !DIEnumerator(name: "OC_GLOBAL_HDR", value: 3)
!943 = !DIEnumerator(name: "OC_LOCKED", value: 4)
!944 = !{!945, !953}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !947, line: 221, size: 32, align: 8, elements: !948)
!947 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !946, file: !947, line: 221, baseType: !950, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!952 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !{!955, !964, !2734, !2739, !2740}
!955 = distinct !DIGlobalVariable(name: "ltp_coef", scope: !0, file: !956, line: 94, type: !957, isLocal: true, isDefinition: true, variable: [8 x float]* @ltp_coef)
!956 = !DIFile(filename: "libavcodec/aactab.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, align: 32, elements: !962)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !960, line: 86, baseType: !961)
!960 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!961 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!962 = !{!963}
!963 = !DISubrange(count: 8)
!964 = distinct !DIGlobalVariable(name: "quantize_and_encode_band_cost_rtz_arr", scope: !0, file: !965, line: 219, type: !966, isLocal: true, isDefinition: true, variable: [16 x float (%struct.AACEncContext*, %struct.PutBitContext*, float*, float*, float*, i32, i32, i32, float, float, i32*, float*)*]* @quantize_and_encode_band_cost_rtz_arr)
!965 = !DIFile(filename: "libavcodec/aacenc_quantization.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 1024, align: 64, elements: !1160)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!961, !971, !2642, !1105, !1104, !1105, !993, !993, !993, !1106, !1106, !1960, !1104}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncContext", file: !973, line: 376, size: 4539904, align: 256, elements: !974)
!973 = !DIFile(filename: "libavcodec/aacenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!974 = !{!975, !1019, !1031, !1045, !1093, !1094, !1140, !1163, !1165, !1166, !1167, !1216, !1217, !1218, !1221, !1222, !2541, !2621, !2624, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2702, !2706, !2708, !2709, !2722, !2726, !2730}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !972, file: !973, line: 377, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !979)
!979 = !{!980, !984, !988, !992, !994, !995, !996, !1000, !1006, !1008, !1012}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !978, file: !4, line: 72, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !978, file: !4, line: 78, baseType: !985, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!981, !953}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !978, file: !4, line: 85, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !978, file: !4, line: 93, baseType: !993, size: 32, align: 32, offset: 192)
!993 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !978, file: !4, line: 99, baseType: !993, size: 32, align: 32, offset: 224)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !978, file: !4, line: 108, baseType: !993, size: 32, align: 32, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !978, file: !4, line: 113, baseType: !997, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!953, !953, !953}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !978, file: !4, line: 123, baseType: !1001, size: 64, align: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !978, file: !4, line: 130, baseType: !1007, size: 32, align: 32, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !978, file: !4, line: 136, baseType: !1009, size: 64, align: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1007, !953}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !978, file: !4, line: 142, baseType: !1013, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!993, !1016, !953, !981, !993}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !972, file: !973, line: 378, baseType: !1020, size: 256, align: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACEncOptions", file: !973, line: 52, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACEncOptions", file: !973, line: 43, size: 256, align: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !1021, file: !973, line: 44, baseType: !993, size: 32, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pns", scope: !1021, file: !973, line: 45, baseType: !993, size: 32, align: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1021, file: !973, line: 46, baseType: !993, size: 32, align: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1021, file: !973, line: 47, baseType: !993, size: 32, align: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !1021, file: !973, line: 48, baseType: !993, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !1021, file: !973, line: 49, baseType: !993, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mid_side", scope: !1021, file: !973, line: 50, baseType: !993, size: 32, align: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "intensity_stereo", scope: !1021, file: !973, line: 51, baseType: !993, size: 32, align: 32, offset: 224)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !972, file: !973, line: 379, baseType: !1032, size: 320, align: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1033, line: 40, baseType: !1034)
!1033 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1033, line: 35, size: 320, align: 64, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1042, !1043, !1044}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1034, file: !1033, line: 36, baseType: !950, size: 32, align: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1034, file: !1033, line: 37, baseType: !993, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1034, file: !1033, line: 38, baseType: !1039, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !1041)
!1041 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1034, file: !1033, line: 38, baseType: !1039, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1034, file: !1033, line: 38, baseType: !1039, size: 64, align: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1034, file: !1033, line: 39, baseType: !993, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mdct1024", scope: !972, file: !973, line: 380, baseType: !1046, size: 896, align: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1047, line: 41, baseType: !1048)
!1047 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !25, line: 88, size: 896, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1056, !1064, !1065, !1066, !1068, !1069, !1074, !1075, !1081, !1082, !1083, !1089, !1090, !1091}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1048, file: !25, line: 89, baseType: !993, size: 32, align: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1048, file: !25, line: 90, baseType: !993, size: 32, align: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1048, file: !25, line: 91, baseType: !1053, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !1055)
!1055 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1048, file: !25, line: 92, baseType: !1057, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1047, line: 39, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1047, line: 37, size: 64, align: 32, elements: !1060)
!1060 = !{!1061, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1059, file: !1047, line: 38, baseType: !1062, size: 32, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1047, line: 35, baseType: !961)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1059, file: !1047, line: 38, baseType: !1062, size: 32, align: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1048, file: !25, line: 93, baseType: !993, size: 32, align: 32, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1048, file: !25, line: 94, baseType: !993, size: 32, align: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1048, file: !25, line: 96, baseType: !1067, size: 64, align: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1048, file: !25, line: 97, baseType: !1067, size: 64, align: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1048, file: !25, line: 101, baseType: !1070, size: 64, align: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !1073, !1057}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1048, file: !25, line: 106, baseType: !1070, size: 64, align: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1048, file: !25, line: 107, baseType: !1076, size: 64, align: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !1073, !1067, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1048, file: !25, line: 108, baseType: !1076, size: 64, align: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1048, file: !25, line: 109, baseType: !1076, size: 64, align: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1048, file: !25, line: 110, baseType: !1084, size: 64, align: 64, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !1073, !1087, !1079}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !25, line: 43, baseType: !961)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1048, file: !25, line: 111, baseType: !24, size: 32, align: 32, offset: 768)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1048, file: !25, line: 112, baseType: !30, size: 32, align: 32, offset: 800)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1048, file: !25, line: 113, baseType: !1092, size: 64, align: 64, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mdct128", scope: !972, file: !973, line: 381, baseType: !1046, size: 896, align: 64, offset: 1536)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "fdsp", scope: !972, file: !973, line: 382, baseType: !1095, size: 64, align: 64, offset: 2432)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1097, line: 192, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1097, line: 24, size: 704, align: 64, elements: !1099)
!1099 = !{!1100, !1107, !1111, !1119, !1120, !1121, !1125, !1126, !1127, !1132, !1136}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1098, file: !1097, line: 38, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{null, !1104, !1105, !1105, !993}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1098, file: !1097, line: 54, baseType: !1108, size: 64, align: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !1104, !1105, !961, !993}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1098, file: !1097, line: 70, baseType: !1112, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !1115, !1117, !1116, !993}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1098, file: !1097, line: 85, baseType: !1108, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1098, file: !1097, line: 100, baseType: !1112, size: 64, align: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1098, file: !1097, line: 119, baseType: !1122, size: 64, align: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1104, !1105, !1105, !1105, !993}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1098, file: !1097, line: 137, baseType: !1122, size: 64, align: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1098, file: !1097, line: 154, baseType: !1101, size: 64, align: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1098, file: !1097, line: 164, baseType: !1128, size: 64, align: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !1131, !1131, !993}
!1131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1104)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1098, file: !1097, line: 175, baseType: !1133, size: 64, align: 64, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!961, !1105, !1105, !993}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !1098, file: !1097, line: 190, baseType: !1137, size: 64, align: 64, offset: 640)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !1115, !1117, !1117, !993}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pce", scope: !972, file: !973, line: 383, baseType: !1141, size: 2240, align: 64, offset: 2496)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACPCEInfo", file: !973, line: 100, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACPCEInfo", file: !973, line: 93, size: 2240, align: 64, elements: !1143)
!1143 = !{!1144, !1147, !1151, !1155, !1158, !1162}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1142, file: !973, line: 94, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !1146)
!1146 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "num_ele", scope: !1142, file: !973, line: 95, baseType: !1148, size: 128, align: 32, offset: 64)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 128, align: 32, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 4)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !1142, file: !973, line: 96, baseType: !1152, size: 768, align: 32, offset: 192)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 768, align: 32, elements: !1153)
!1153 = !{!1154, !963}
!1154 = !DISubrange(count: 3)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1142, file: !973, line: 97, baseType: !1156, size: 1024, align: 32, offset: 960)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 1024, align: 32, elements: !1157)
!1157 = !{!1150, !963}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "config_map", scope: !1142, file: !973, line: 98, baseType: !1159, size: 128, align: 8, offset: 1984)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 128, align: 8, elements: !1160)
!1160 = !{!1161}
!1161 = !DISubrange(count: 16)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !1142, file: !973, line: 99, baseType: !1159, size: 128, align: 8, offset: 2112)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "planar_samples", scope: !972, file: !973, line: 384, baseType: !1164, size: 1024, align: 64, offset: 4736)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 1024, align: 64, elements: !1160)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !972, file: !973, line: 386, baseType: !993, size: 32, align: 32, offset: 5760)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "needs_pce", scope: !972, file: !973, line: 387, baseType: !993, size: 32, align: 32, offset: 5792)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "lpc", scope: !972, file: !973, line: 388, baseType: !1168, size: 302080, align: 256, offset: 5888)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPCContext", file: !35, line: 87, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LPCContext", file: !35, line: 52, size: 302080, align: 256, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175, !1176, !1183, !1187}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !1169, file: !35, line: 53, baseType: !993, size: 32, align: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !1169, file: !35, line: 54, baseType: !993, size: 32, align: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_type", scope: !1169, file: !35, line: 55, baseType: !34, size: 32, align: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_buffer", scope: !1169, file: !35, line: 56, baseType: !1115, size: 64, align: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_samples", scope: !1169, file: !35, line: 57, baseType: !1115, size: 64, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_apply_welch_window", scope: !1169, file: !35, line: 67, baseType: !1177, size: 64, align: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !1180, !993, !1115}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !951, line: 38, baseType: !993)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_compute_autocorr", scope: !1169, file: !35, line: 82, baseType: !1184, size: 64, align: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !1117, !993, !993, !1115}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "lls_models", scope: !1169, file: !35, line: 86, baseType: !1188, size: 301568, align: 256, offset: 512)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 301568, align: 256, elements: !1214)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLSModel", file: !1190, line: 58, baseType: !1191)
!1190 = !DIFile(filename: "./libavutil/lls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLSModel", file: !1190, line: 38, size: 150784, align: 256, elements: !1192)
!1192 = !{!1193, !1197, !1201, !1204, !1205, !1210}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "covariance", scope: !1191, file: !1190, line: 39, baseType: !1194, size: 82944, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 82944, align: 64, elements: !1195)
!1195 = !{!1196, !1196}
!1196 = !DISubrange(count: 36)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !1191, file: !1190, line: 40, baseType: !1198, size: 65536, align: 64, offset: 82944)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 65536, align: 64, elements: !1199)
!1199 = !{!1200, !1200}
!1200 = !DISubrange(count: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !1191, file: !1190, line: 41, baseType: !1202, size: 2048, align: 64, offset: 148480)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 2048, align: 64, elements: !1203)
!1203 = !{!1200}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "indep_count", scope: !1191, file: !1190, line: 42, baseType: !993, size: 32, align: 32, offset: 150528)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "update_lls", scope: !1191, file: !1190, line: 50, baseType: !1206, size: 64, align: 64, offset: 150592)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !1209, !1117}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_lls", scope: !1191, file: !1190, line: 57, baseType: !1211, size: 64, align: 64, offset: 150656)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!1116, !1209, !1117, !993}
!1214 = !{!1215}
!1215 = !DISubrange(count: 2)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate_index", scope: !972, file: !973, line: 389, baseType: !993, size: 32, align: 32, offset: 307968)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !972, file: !973, line: 390, baseType: !993, size: 32, align: 32, offset: 308000)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "reorder_map", scope: !972, file: !973, line: 391, baseType: !1219, size: 64, align: 64, offset: 308032)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "chan_map", scope: !972, file: !973, line: 392, baseType: !1219, size: 64, align: 64, offset: 308096)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "cpe", scope: !972, file: !973, line: 394, baseType: !1223, size: 64, align: 64, offset: 308160)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelElement", file: !44, line: 288, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelElement", file: !44, line: 275, size: 4381952, align: 256, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230, !1231, !1235, !1236, !1369, !1382}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1225, file: !44, line: 276, baseType: !993, size: 32, align: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "common_window", scope: !1225, file: !44, line: 278, baseType: !993, size: 32, align: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mode", scope: !1225, file: !44, line: 279, baseType: !993, size: 32, align: 32, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "is_mode", scope: !1225, file: !44, line: 280, baseType: !1040, size: 8, align: 8, offset: 96)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ms_mask", scope: !1225, file: !44, line: 281, baseType: !1232, size: 1024, align: 8, offset: 104)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 1024, align: 8, elements: !1233)
!1233 = !{!1234}
!1234 = !DISubrange(count: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "is_mask", scope: !1225, file: !44, line: 282, baseType: !1232, size: 1024, align: 8, offset: 1128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !1225, file: !44, line: 284, baseType: !1237, size: 1187328, align: 256, offset: 2304)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1238, size: 1187328, align: 256, elements: !1214)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "SingleChannelElement", file: !44, line: 270, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SingleChannelElement", file: !44, line: 248, size: 593664, align: 256, elements: !1240)
!1240 = !{!1241, !1289, !1307, !1315, !1317, !1318, !1322, !1324, !1326, !1327, !1328, !1330, !1331, !1335, !1336, !1340, !1344, !1348, !1351, !1352, !1367}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ics", scope: !1239, file: !44, line: 249, baseType: !1242, size: 2432, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndividualChannelStream", file: !44, line: 193, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IndividualChannelStream", file: !44, line: 174, size: 2432, align: 64, elements: !1244)
!1244 = !{!1245, !1246, !1248, !1250, !1251, !1253, !1269, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1287, !1288}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "max_sfb", scope: !1243, file: !44, line: 175, baseType: !1040, size: 8, align: 8)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "window_sequence", scope: !1243, file: !44, line: 176, baseType: !1247, size: 64, align: 32, offset: 32)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, align: 32, elements: !1214)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "use_kb_window", scope: !1243, file: !44, line: 177, baseType: !1249, size: 16, align: 8, offset: 96)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 16, align: 8, elements: !1214)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "num_window_groups", scope: !1243, file: !44, line: 178, baseType: !993, size: 32, align: 32, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "group_len", scope: !1243, file: !44, line: 179, baseType: !1252, size: 64, align: 8, offset: 160)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 64, align: 8, elements: !962)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ltp", scope: !1243, file: !44, line: 180, baseType: !1254, size: 416, align: 32, offset: 224)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "LongTermPrediction", file: !44, line: 169, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LongTermPrediction", file: !44, line: 163, size: 416, align: 32, elements: !1256)
!1256 = !{!1257, !1260, !1263, !1264, !1265}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1255, file: !44, line: 164, baseType: !1258, size: 8, align: 8)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !1259)
!1259 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !1255, file: !44, line: 165, baseType: !1261, size: 16, align: 16, offset: 16)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !951, line: 37, baseType: !1262)
!1262 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1255, file: !44, line: 166, baseType: !993, size: 32, align: 32, offset: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1255, file: !44, line: 167, baseType: !959, size: 32, align: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1255, file: !44, line: 168, baseType: !1266, size: 320, align: 8, offset: 96)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1258, size: 320, align: 8, elements: !1267)
!1267 = !{!1268}
!1268 = !DISubrange(count: 40)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "swb_offset", scope: !1243, file: !44, line: 181, baseType: !1270, size: 64, align: 64, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "swb_sizes", scope: !1243, file: !44, line: 182, baseType: !1219, size: 64, align: 64, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "num_swb", scope: !1243, file: !44, line: 183, baseType: !993, size: 32, align: 32, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "num_windows", scope: !1243, file: !44, line: 184, baseType: !993, size: 32, align: 32, offset: 800)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "tns_max_bands", scope: !1243, file: !44, line: 185, baseType: !993, size: 32, align: 32, offset: 832)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_present", scope: !1243, file: !44, line: 186, baseType: !993, size: 32, align: 32, offset: 864)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_initialized", scope: !1243, file: !44, line: 187, baseType: !993, size: 32, align: 32, offset: 896)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_group", scope: !1243, file: !44, line: 188, baseType: !993, size: 32, align: 32, offset: 928)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_reset_count", scope: !1243, file: !44, line: 189, baseType: !1280, size: 992, align: 32, offset: 960)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 992, align: 32, elements: !1281)
!1281 = !{!1282}
!1282 = !DISubrange(count: 31)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_used", scope: !1243, file: !44, line: 190, baseType: !1284, size: 328, align: 8, offset: 1952)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 328, align: 8, elements: !1285)
!1285 = !{!1286}
!1286 = !DISubrange(count: 41)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "window_clipping", scope: !1243, file: !44, line: 191, baseType: !1252, size: 64, align: 8, offset: 2280)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "clip_avoidance_factor", scope: !1243, file: !44, line: 192, baseType: !961, size: 32, align: 32, offset: 2368)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "tns", scope: !1239, file: !44, line: 250, baseType: !1290, size: 44320, align: 32, offset: 2432)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "TemporalNoiseShaping", file: !44, line: 206, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TemporalNoiseShaping", file: !44, line: 198, size: 44320, align: 32, elements: !1292)
!1292 = !{!1293, !1294, !1296, !1299, !1300, !1301, !1305}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1291, file: !44, line: 199, baseType: !993, size: 32, align: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "n_filt", scope: !1291, file: !44, line: 200, baseType: !1295, size: 256, align: 32, offset: 32)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 256, align: 32, elements: !962)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1291, file: !44, line: 201, baseType: !1297, size: 1024, align: 32, offset: 288)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 1024, align: 32, elements: !1298)
!1298 = !{!963, !1150}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1291, file: !44, line: 202, baseType: !1297, size: 1024, align: 32, offset: 1312)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !1291, file: !44, line: 203, baseType: !1297, size: 1024, align: 32, offset: 2336)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "coef_idx", scope: !1291, file: !44, line: 204, baseType: !1302, size: 20480, align: 32, offset: 3360)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 20480, align: 32, elements: !1303)
!1303 = !{!963, !1150, !1304}
!1304 = !DISubrange(count: 20)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !1291, file: !44, line: 205, baseType: !1306, size: 20480, align: 32, offset: 23840)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 20480, align: 32, elements: !1303)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pulse", scope: !1239, file: !44, line: 251, baseType: !1308, size: 320, align: 32, offset: 46752)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pulse", file: !44, line: 229, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pulse", file: !44, line: 224, size: 320, align: 32, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "num_pulse", scope: !1309, file: !44, line: 225, baseType: !993, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1309, file: !44, line: 226, baseType: !993, size: 32, align: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1309, file: !44, line: 227, baseType: !1148, size: 128, align: 32, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "amp", scope: !1309, file: !44, line: 228, baseType: !1148, size: 128, align: 32, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "band_type", scope: !1239, file: !44, line: 252, baseType: !1316, size: 4096, align: 32, offset: 47072)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 4096, align: 32, elements: !1233)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "band_alt", scope: !1239, file: !44, line: 253, baseType: !1316, size: 4096, align: 32, offset: 51168)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "band_type_run_end", scope: !1239, file: !44, line: 254, baseType: !1319, size: 3840, align: 32, offset: 55264)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 3840, align: 32, elements: !1320)
!1320 = !{!1321}
!1321 = !DISubrange(count: 120)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1239, file: !44, line: 255, baseType: !1323, size: 3840, align: 32, offset: 59104)
!1323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 3840, align: 32, elements: !1320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sf_idx", scope: !1239, file: !44, line: 256, baseType: !1325, size: 4096, align: 32, offset: 62944)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 4096, align: 32, elements: !1233)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "zeroes", scope: !1239, file: !44, line: 257, baseType: !1232, size: 1024, align: 8, offset: 67040)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "can_pns", scope: !1239, file: !44, line: 258, baseType: !1232, size: 1024, align: 8, offset: 68064)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "is_ener", scope: !1239, file: !44, line: 259, baseType: !1329, size: 4096, align: 32, offset: 69088)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 4096, align: 32, elements: !1233)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "pns_ener", scope: !1239, file: !44, line: 260, baseType: !1329, size: 4096, align: 32, offset: 73184)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pcoeffs", scope: !1239, file: !44, line: 261, baseType: !1332, size: 32768, align: 32, offset: 77312)
!1332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 32768, align: 32, elements: !1333)
!1333 = !{!1334}
!1334 = !DISubrange(count: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !1239, file: !44, line: 262, baseType: !1332, size: 32768, align: 32, offset: 110080)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1239, file: !44, line: 263, baseType: !1337, size: 49152, align: 32, offset: 142848)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 49152, align: 32, elements: !1338)
!1338 = !{!1339}
!1339 = !DISubrange(count: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ret_buf", scope: !1239, file: !44, line: 264, baseType: !1341, size: 65536, align: 32, offset: 192000)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 65536, align: 32, elements: !1342)
!1342 = !{!1343}
!1343 = !DISubrange(count: 2048)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ltp_state", scope: !1239, file: !44, line: 265, baseType: !1345, size: 98304, align: 32, offset: 257536)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 98304, align: 32, elements: !1346)
!1346 = !{!1347}
!1347 = !DISubrange(count: 3072)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "lcoeffs", scope: !1239, file: !44, line: 266, baseType: !1349, size: 32768, align: 32, offset: 355840)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 32768, align: 32, elements: !1333)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !960, line: 90, baseType: !961)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "prcoeffs", scope: !1239, file: !44, line: 267, baseType: !1349, size: 32768, align: 32, offset: 388608)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_state", scope: !1239, file: !44, line: 268, baseType: !1353, size: 172032, align: 32, offset: 421376)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1354, size: 172032, align: 32, elements: !1365)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PredictorState", file: !44, line: 144, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PredictorState", file: !44, line: 135, size: 256, align: 32, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "cor0", scope: !1355, file: !44, line: 136, baseType: !1350, size: 32, align: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "cor1", scope: !1355, file: !44, line: 137, baseType: !1350, size: 32, align: 32, offset: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "var0", scope: !1355, file: !44, line: 138, baseType: !1350, size: 32, align: 32, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "var1", scope: !1355, file: !44, line: 139, baseType: !1350, size: 32, align: 32, offset: 96)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !1355, file: !44, line: 140, baseType: !1350, size: 32, align: 32, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !1355, file: !44, line: 141, baseType: !1350, size: 32, align: 32, offset: 160)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1355, file: !44, line: 142, baseType: !1350, size: 32, align: 32, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x_est", scope: !1355, file: !44, line: 143, baseType: !1350, size: 32, align: 32, offset: 224)
!1365 = !{!1366}
!1366 = !DISubrange(count: 672)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !1239, file: !44, line: 269, baseType: !1368, size: 64, align: 64, offset: 593408)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "coup", scope: !1225, file: !44, line: 286, baseType: !1370, size: 62272, align: 32, offset: 1189632)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelCoupling", file: !44, line: 243, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelCoupling", file: !44, line: 234, size: 62272, align: 32, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1377, !1378, !1379}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coupling_point", scope: !1371, file: !44, line: 235, baseType: !59, size: 32, align: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "num_coupled", scope: !1371, file: !44, line: 236, baseType: !993, size: 32, align: 32, offset: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !44, line: 237, baseType: !1376, size: 256, align: 32, offset: 64)
!1376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, align: 32, elements: !962)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "id_select", scope: !1371, file: !44, line: 238, baseType: !1295, size: 256, align: 32, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ch_select", scope: !1371, file: !44, line: 239, baseType: !1295, size: 256, align: 32, offset: 576)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1371, file: !44, line: 242, baseType: !1380, size: 61440, align: 32, offset: 832)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 61440, align: 32, elements: !1381)
!1381 = !{!1161, !1321}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sbr", scope: !1225, file: !44, line: 287, baseType: !1383, size: 3129856, align: 256, offset: 1252096)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectralBandReplication", file: !1384, line: 115, baseType: !1385)
!1384 = !DIFile(filename: "libavcodec/sbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectralBandReplication", file: !1384, line: 139, size: 3129856, align: 256, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1413, !1415, !1416, !1417, !1418, !1490, !1607, !1608, !1609, !1610, !1614, !1618, !1619, !1621, !1625, !1626, !1628, !1629, !1632, !1635, !1638, !1641, !1642, !1645, !1646, !1648, !1649, !1650, !1651, !1652, !1655, !1656, !1657, !1710}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1385, file: !1384, line: 140, baseType: !993, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1385, file: !1384, line: 141, baseType: !993, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "ready_for_dequant", scope: !1385, file: !1384, line: 142, baseType: !993, size: 32, align: 32, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "id_aac", scope: !1385, file: !1384, line: 143, baseType: !993, size: 32, align: 32, offset: 96)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1385, file: !1384, line: 144, baseType: !993, size: 32, align: 32, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum_params", scope: !1385, file: !1384, line: 145, baseType: !1393, size: 48, align: 8, offset: 160)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectrumParameters", file: !1384, line: 55, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectrumParameters", file: !1384, line: 42, size: 48, align: 8, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1400, !1401}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bs_start_freq", scope: !1394, file: !1384, line: 43, baseType: !1040, size: 8, align: 8)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "bs_stop_freq", scope: !1394, file: !1384, line: 44, baseType: !1040, size: 8, align: 8, offset: 8)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "bs_xover_band", scope: !1394, file: !1384, line: 45, baseType: !1040, size: 8, align: 8, offset: 16)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_scale", scope: !1394, file: !1384, line: 51, baseType: !1040, size: 8, align: 8, offset: 24)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bs_alter_scale", scope: !1394, file: !1384, line: 52, baseType: !1040, size: 8, align: 8, offset: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "bs_noise_bands", scope: !1394, file: !1384, line: 53, baseType: !1040, size: 8, align: 8, offset: 40)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res_header", scope: !1385, file: !1384, line: 146, baseType: !993, size: 32, align: 32, offset: 224)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_bands", scope: !1385, file: !1384, line: 151, baseType: !952, size: 32, align: 32, offset: 256)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_gains", scope: !1385, file: !1384, line: 152, baseType: !952, size: 32, align: 32, offset: 288)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "bs_interpol_freq", scope: !1385, file: !1384, line: 153, baseType: !952, size: 32, align: 32, offset: 320)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bs_smoothing_mode", scope: !1385, file: !1384, line: 154, baseType: !952, size: 32, align: 32, offset: 352)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "bs_coupling", scope: !1385, file: !1384, line: 156, baseType: !952, size: 32, align: 32, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1385, file: !1384, line: 157, baseType: !1409, size: 160, align: 32, offset: 416)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 160, align: 32, elements: !1411)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !960, line: 91, baseType: !952)
!1411 = !{!1412}
!1412 = !DISubrange(count: 5)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !1385, file: !1384, line: 160, baseType: !1414, size: 64, align: 32, offset: 576)
!1414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 64, align: 32, elements: !1214)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1385, file: !1384, line: 162, baseType: !1414, size: 64, align: 32, offset: 640)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "kx_and_m_pushed", scope: !1385, file: !1384, line: 163, baseType: !952, size: 32, align: 32, offset: 704)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "n_master", scope: !1385, file: !1384, line: 165, baseType: !1410, size: 32, align: 32, offset: 736)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1385, file: !1384, line: 166, baseType: !1419, size: 1407488, align: 256, offset: 768)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 1407488, align: 256, elements: !1214)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRData", file: !1384, line: 113, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRData", file: !1384, line: 62, size: 703744, align: 256, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1430, !1431, !1433, !1434, !1437, !1441, !1442, !1446, !1450, !1451, !1453, !1455, !1458, !1459, !1464, !1468, !1469, !1472, !1476, !1478, !1481, !1483, !1484, !1485, !1488, !1489}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "bs_frame_class", scope: !1421, file: !1384, line: 67, baseType: !952, size: 32, align: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic_flag", scope: !1421, file: !1384, line: 68, baseType: !952, size: 32, align: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_env", scope: !1421, file: !1384, line: 69, baseType: !1410, size: 32, align: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_res", scope: !1421, file: !1384, line: 70, baseType: !1427, size: 56, align: 8, offset: 96)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 56, align: 8, elements: !1428)
!1428 = !{!1429}
!1429 = !DISubrange(count: 7)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_noise", scope: !1421, file: !1384, line: 71, baseType: !1410, size: 32, align: 32, offset: 160)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_env", scope: !1421, file: !1384, line: 72, baseType: !1432, size: 40, align: 8, offset: 192)
!1432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 40, align: 8, elements: !1411)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_noise", scope: !1421, file: !1384, line: 73, baseType: !1249, size: 16, align: 8, offset: 232)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "bs_invf_mode", scope: !1421, file: !1384, line: 74, baseType: !1435, size: 80, align: 8, offset: 248)
!1435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 80, align: 8, elements: !1436)
!1436 = !{!1215, !1412}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic", scope: !1421, file: !1384, line: 75, baseType: !1438, size: 384, align: 8, offset: 328)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 384, align: 8, elements: !1439)
!1439 = !{!1440}
!1440 = !DISubrange(count: 48)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res", scope: !1421, file: !1384, line: 76, baseType: !952, size: 32, align: 32, offset: 736)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples", scope: !1421, file: !1384, line: 83, baseType: !1443, size: 73728, align: 32, offset: 768)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 73728, align: 32, elements: !1444)
!1444 = !{!1445}
!1445 = !DISubrange(count: 2304)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "analysis_filterbank_samples", scope: !1421, file: !1384, line: 84, baseType: !1447, size: 41984, align: 32, offset: 74496)
!1447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 41984, align: 32, elements: !1448)
!1448 = !{!1449}
!1449 = !DISubrange(count: 1312)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples_offset", scope: !1421, file: !1384, line: 85, baseType: !993, size: 32, align: 32, offset: 116480)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "e_a", scope: !1421, file: !1384, line: 87, baseType: !1452, size: 64, align: 32, offset: 116512)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 64, align: 32, elements: !1214)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bw_array", scope: !1421, file: !1384, line: 89, baseType: !1454, size: 160, align: 32, offset: 116576)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 160, align: 32, elements: !1411)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !1421, file: !1384, line: 91, baseType: !1456, size: 131072, align: 32, offset: 116736)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 131072, align: 32, elements: !1457)
!1457 = !{!1215, !1200, !1200, !1215}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "Ypos", scope: !1421, file: !1384, line: 93, baseType: !993, size: 32, align: 32, offset: 247808)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !1421, file: !1384, line: 94, baseType: !1460, size: 311296, align: 32, offset: 247936)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 311296, align: 32, elements: !1461)
!1461 = !{!1215, !1462, !1463, !1215}
!1462 = !DISubrange(count: 38)
!1463 = !DISubrange(count: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "g_temp", scope: !1421, file: !1384, line: 95, baseType: !1465, size: 64512, align: 32, offset: 559232)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 64512, align: 32, elements: !1466)
!1466 = !{!1467, !1440}
!1467 = !DISubrange(count: 42)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "q_temp", scope: !1421, file: !1384, line: 96, baseType: !1465, size: 64512, align: 32, offset: 623744)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "s_indexmapped", scope: !1421, file: !1384, line: 97, baseType: !1470, size: 3072, align: 8, offset: 688256)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 3072, align: 8, elements: !1471)
!1471 = !{!963, !1440}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs_q", scope: !1421, file: !1384, line: 99, baseType: !1473, size: 2304, align: 8, offset: 691328)
!1473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 2304, align: 8, elements: !1474)
!1474 = !{!1475, !1440}
!1475 = !DISubrange(count: 6)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs", scope: !1421, file: !1384, line: 100, baseType: !1477, size: 9216, align: 32, offset: 693632)
!1477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 9216, align: 32, elements: !1474)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs_q", scope: !1421, file: !1384, line: 102, baseType: !1479, size: 120, align: 8, offset: 702848)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 120, align: 8, elements: !1480)
!1480 = !{!1154, !1412}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs", scope: !1421, file: !1384, line: 103, baseType: !1482, size: 480, align: 32, offset: 702976)
!1482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 480, align: 32, elements: !1480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "t_env", scope: !1421, file: !1384, line: 105, baseType: !1252, size: 64, align: 8, offset: 703456)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "t_env_num_env_old", scope: !1421, file: !1384, line: 107, baseType: !1040, size: 8, align: 8, offset: 703520)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "t_q", scope: !1421, file: !1384, line: 109, baseType: !1486, size: 24, align: 8, offset: 703528)
!1486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 24, align: 8, elements: !1487)
!1487 = !{!1154}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexnoise", scope: !1421, file: !1384, line: 110, baseType: !952, size: 32, align: 32, offset: 703552)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexsine", scope: !1421, file: !1384, line: 111, baseType: !952, size: 32, align: 32, offset: 703584)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1385, file: !1384, line: 167, baseType: !1491, size: 1072896, align: 128, offset: 1408256)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSContext", file: !1492, line: 79, baseType: !1493)
!1492 = !DIFile(filename: "libavcodec/aacps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSContext", file: !1492, line: 41, size: 1072896, align: 128, elements: !1494)
!1494 = !{!1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1511, !1515, !1516, !1517, !1518, !1519, !1520, !1524, !1529, !1534, !1537, !1538, !1539, !1542, !1543, !1544, !1545, !1548, !1549, !1551, !1552}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1493, file: !1492, line: 42, baseType: !993, size: 32, align: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "enable_iid", scope: !1493, file: !1492, line: 43, baseType: !993, size: 32, align: 32, offset: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "iid_quant", scope: !1493, file: !1492, line: 44, baseType: !993, size: 32, align: 32, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "nr_iid_par", scope: !1493, file: !1492, line: 45, baseType: !993, size: 32, align: 32, offset: 96)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ipdopd_par", scope: !1493, file: !1492, line: 46, baseType: !993, size: 32, align: 32, offset: 128)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "enable_icc", scope: !1493, file: !1492, line: 47, baseType: !993, size: 32, align: 32, offset: 160)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "icc_mode", scope: !1493, file: !1492, line: 48, baseType: !993, size: 32, align: 32, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "nr_icc_par", scope: !1493, file: !1492, line: 49, baseType: !993, size: 32, align: 32, offset: 224)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ext", scope: !1493, file: !1492, line: 50, baseType: !993, size: 32, align: 32, offset: 256)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_class", scope: !1493, file: !1492, line: 51, baseType: !993, size: 32, align: 32, offset: 288)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "num_env_old", scope: !1493, file: !1492, line: 52, baseType: !993, size: 32, align: 32, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "num_env", scope: !1493, file: !1492, line: 53, baseType: !993, size: 32, align: 32, offset: 352)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ipdopd", scope: !1493, file: !1492, line: 54, baseType: !993, size: 32, align: 32, offset: 384)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "border_position", scope: !1493, file: !1492, line: 55, baseType: !1509, size: 192, align: 32, offset: 416)
!1509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 192, align: 32, elements: !1510)
!1510 = !{!1475}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "iid_par", scope: !1493, file: !1492, line: 56, baseType: !1512, size: 1360, align: 8, offset: 608)
!1512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1258, size: 1360, align: 8, elements: !1513)
!1513 = !{!1412, !1514}
!1514 = !DISubrange(count: 34)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "icc_par", scope: !1493, file: !1492, line: 57, baseType: !1512, size: 1360, align: 8, offset: 1968)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_par", scope: !1493, file: !1492, line: 59, baseType: !1512, size: 1360, align: 8, offset: 3328)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "opd_par", scope: !1493, file: !1492, line: 60, baseType: !1512, size: 1360, align: 8, offset: 4688)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands", scope: !1493, file: !1492, line: 61, baseType: !993, size: 32, align: 32, offset: 6048)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands_old", scope: !1493, file: !1492, line: 62, baseType: !993, size: 32, align: 32, offset: 6080)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1493, file: !1492, line: 64, baseType: !1521, size: 14080, align: 32, offset: 6144)
!1521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 14080, align: 32, elements: !1522)
!1522 = !{!1412, !1523, !1215}
!1523 = !DISubrange(count: 44)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1493, file: !1492, line: 65, baseType: !1525, size: 267904, align: 32, offset: 20224)
!1525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 267904, align: 32, elements: !1526)
!1526 = !{!1527, !1528, !1215}
!1527 = !DISubrange(count: 91)
!1528 = !DISubrange(count: 46)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ap_delay", scope: !1493, file: !1492, line: 66, baseType: !1530, size: 355200, align: 32, offset: 288128)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 355200, align: 32, elements: !1531)
!1531 = !{!1532, !1154, !1533, !1215}
!1532 = !DISubrange(count: 50)
!1533 = !DISubrange(count: 37)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_nrg", scope: !1493, file: !1492, line: 67, baseType: !1535, size: 1088, align: 32, offset: 643328)
!1535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 1088, align: 32, elements: !1536)
!1536 = !{!1514}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "power_smooth", scope: !1493, file: !1492, line: 68, baseType: !1535, size: 1088, align: 32, offset: 644480)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_diff_smooth", scope: !1493, file: !1492, line: 69, baseType: !1535, size: 1088, align: 32, offset: 645632)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "H11", scope: !1493, file: !1492, line: 70, baseType: !1540, size: 13056, align: 32, offset: 646784)
!1540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 13056, align: 32, elements: !1541)
!1541 = !{!1215, !1475, !1514}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "H12", scope: !1493, file: !1492, line: 71, baseType: !1540, size: 13056, align: 32, offset: 659840)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "H21", scope: !1493, file: !1492, line: 72, baseType: !1540, size: 13056, align: 32, offset: 672896)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "H22", scope: !1493, file: !1492, line: 73, baseType: !1540, size: 13056, align: 32, offset: 685952)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "Lbuf", scope: !1493, file: !1492, line: 74, baseType: !1546, size: 186368, align: 32, offset: 699008)
!1546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 186368, align: 32, elements: !1547)
!1547 = !{!1527, !1200, !1215}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "Rbuf", scope: !1493, file: !1492, line: 75, baseType: !1546, size: 186368, align: 32, offset: 885376)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "opd_hist", scope: !1493, file: !1492, line: 76, baseType: !1550, size: 272, align: 8, offset: 1071744)
!1550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1258, size: 272, align: 8, elements: !1536)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_hist", scope: !1493, file: !1492, line: 77, baseType: !1550, size: 272, align: 8, offset: 1072016)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1493, file: !1492, line: 78, baseType: !1553, size: 512, align: 64, offset: 1072320)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSDSPContext", file: !1554, line: 52, baseType: !1555)
!1554 = !DIFile(filename: "libavcodec/aacpsdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSDSPContext", file: !1554, line: 32, size: 512, align: 64, elements: !1556)
!1556 = !{!1557, !1563, !1569, !1578, !1588, !1592, !1600}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "add_squares", scope: !1555, file: !1554, line: 33, baseType: !1558, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !1368, !1561, !993}
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 64, align: 32, elements: !1214)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mul_pair_single", scope: !1555, file: !1554, line: 34, baseType: !1564, size: 64, align: 64, offset: 64)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{null, !1567, !1567, !1368, !993}
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 64, align: 32, elements: !1214)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis", scope: !1555, file: !1554, line: 36, baseType: !1570, size: 64, align: 64, offset: 128)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1567, !1567, !1573, !1576, !993}
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 512, align: 32, elements: !1575)
!1575 = !{!963, !1215}
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1577, line: 149, baseType: !1146)
!1577 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis_ileave", scope: !1555, file: !1554, line: 39, baseType: !1579, size: 64, align: 64, offset: 192)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{null, !1582, !1585, !993, !993}
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 2048, align: 32, elements: !1584)
!1584 = !{!1200, !1215}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 77824, align: 32, elements: !1587)
!1587 = !{!1462, !1463}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_synthesis_deint", scope: !1555, file: !1554, line: 41, baseType: !1589, size: 64, align: 64, offset: 256)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1585, !1582, !993, !993}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "decorrelate", scope: !1555, file: !1554, line: 43, baseType: !1593, size: 64, align: 64, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1567, !1567, !1596, !1599, !1561, !1599, !959, !993}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 2368, align: 32, elements: !1598)
!1598 = !{!1533, !1215}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_interpolate", scope: !1555, file: !1554, line: 49, baseType: !1601, size: 128, align: 64, offset: 384)
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1602, size: 128, align: 64, elements: !1214)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{null, !1567, !1567, !1605, !1605, !993}
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 128, align: 32, elements: !1149)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1385, file: !1384, line: 169, baseType: !1414, size: 64, align: 32, offset: 2481152)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "n_q", scope: !1385, file: !1384, line: 171, baseType: !1410, size: 32, align: 32, offset: 2481216)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "n_lim", scope: !1385, file: !1384, line: 173, baseType: !1410, size: 32, align: 32, offset: 2481248)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "f_master", scope: !1385, file: !1384, line: 175, baseType: !1611, size: 784, align: 16, offset: 2481280)
!1611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 784, align: 16, elements: !1612)
!1612 = !{!1613}
!1613 = !DISubrange(count: 49)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelow", scope: !1385, file: !1384, line: 177, baseType: !1615, size: 400, align: 16, offset: 2482064)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 400, align: 16, elements: !1616)
!1616 = !{!1617}
!1617 = !DISubrange(count: 25)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablehigh", scope: !1385, file: !1384, line: 179, baseType: !1611, size: 784, align: 16, offset: 2482464)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablenoise", scope: !1385, file: !1384, line: 181, baseType: !1620, size: 96, align: 16, offset: 2483248)
!1620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 96, align: 16, elements: !1510)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelim", scope: !1385, file: !1384, line: 183, baseType: !1622, size: 480, align: 16, offset: 2483344)
!1622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 480, align: 16, elements: !1623)
!1623 = !{!1624}
!1624 = !DISubrange(count: 30)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "num_patches", scope: !1385, file: !1384, line: 184, baseType: !1410, size: 32, align: 32, offset: 2483840)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "patch_num_subbands", scope: !1385, file: !1384, line: 185, baseType: !1627, size: 48, align: 8, offset: 2483872)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 48, align: 8, elements: !1510)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "patch_start_subband", scope: !1385, file: !1384, line: 186, baseType: !1627, size: 48, align: 8, offset: 2483920)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "X_low", scope: !1385, file: !1384, line: 188, baseType: !1630, size: 81920, align: 32, offset: 2483968)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 81920, align: 32, elements: !1631)
!1631 = !{!1200, !1268, !1215}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "X_high", scope: !1385, file: !1384, line: 190, baseType: !1633, size: 163840, align: 32, offset: 2565888)
!1633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 163840, align: 32, elements: !1634)
!1634 = !{!1463, !1268, !1215}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !1385, file: !1384, line: 192, baseType: !1636, size: 311296, align: 32, offset: 2729728)
!1636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 311296, align: 32, elements: !1637)
!1637 = !{!1215, !1215, !1462, !1463}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "alpha0", scope: !1385, file: !1384, line: 194, baseType: !1639, size: 4096, align: 32, offset: 3041024)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 4096, align: 32, elements: !1640)
!1640 = !{!1463, !1215}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !1385, file: !1384, line: 196, baseType: !1639, size: 4096, align: 32, offset: 3045120)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "e_origmapped", scope: !1385, file: !1384, line: 198, baseType: !1643, size: 10752, align: 32, offset: 3049216)
!1643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 10752, align: 32, elements: !1644)
!1644 = !{!1429, !1440}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "q_mapped", scope: !1385, file: !1384, line: 200, baseType: !1643, size: 10752, align: 32, offset: 3059968)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "s_mapped", scope: !1385, file: !1384, line: 202, baseType: !1647, size: 2688, align: 8, offset: 3070720)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 2688, align: 8, elements: !1644)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "e_curr", scope: !1385, file: !1384, line: 204, baseType: !1643, size: 10752, align: 32, offset: 3073408)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "q_m", scope: !1385, file: !1384, line: 206, baseType: !1643, size: 10752, align: 32, offset: 3084160)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "s_m", scope: !1385, file: !1384, line: 208, baseType: !1643, size: 10752, align: 32, offset: 3094912)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1385, file: !1384, line: 209, baseType: !1643, size: 10752, align: 32, offset: 3105664)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_filter_scratch", scope: !1385, file: !1384, line: 210, baseType: !1653, size: 10240, align: 32, offset: 3116544)
!1653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 10240, align: 32, elements: !1654)
!1654 = !{!1412, !1463}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_ana", scope: !1385, file: !1384, line: 211, baseType: !1046, size: 896, align: 64, offset: 3126784)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1385, file: !1384, line: 212, baseType: !1046, size: 896, align: 64, offset: 3127680)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1385, file: !1384, line: 213, baseType: !1658, size: 896, align: 64, offset: 3128576)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !1659, line: 45, baseType: !1660)
!1659 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !1659, line: 28, size: 896, align: 64, elements: !1661)
!1661 = !{!1662, !1666, !1670, !1671, !1672, !1676, !1680, !1684, !1691, !1695, !1705}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !1660, file: !1659, line: 29, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{null, !1368}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !1660, file: !1659, line: 30, baseType: !1667, size: 64, align: 64, offset: 64)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!1350, !1567, !993}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !1660, file: !1659, line: 31, baseType: !1663, size: 64, align: 64, offset: 128)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !1660, file: !1659, line: 32, baseType: !1663, size: 64, align: 64, offset: 192)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !1660, file: !1659, line: 33, baseType: !1673, size: 64, align: 64, offset: 256)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{null, !1567, !1599}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !1660, file: !1659, line: 34, baseType: !1677, size: 64, align: 64, offset: 320)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{null, !1368, !1599}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !1660, file: !1659, line: 35, baseType: !1681, size: 64, align: 64, offset: 384)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1368, !1599, !1599}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !1660, file: !1659, line: 36, baseType: !1685, size: 64, align: 64, offset: 448)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{null, !1561, !1688}
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1350, size: 128, align: 32, elements: !1690)
!1690 = !{!1215, !1215}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !1660, file: !1659, line: 37, baseType: !1692, size: 64, align: 64, offset: 512)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{null, !1567, !1561, !1599, !1599, !959, !993, !993}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !1660, file: !1659, line: 40, baseType: !1696, size: 64, align: 64, offset: 576)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{null, !1567, !1699, !1702, !993, !1704}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 2560, align: 32, elements: !1701)
!1701 = !{!1268, !1215}
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1350)
!1704 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !951, line: 119, baseType: !1146)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !1660, file: !1659, line: 42, baseType: !1706, size: 256, align: 64, offset: 640)
!1706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1707, size: 256, align: 64, elements: !1149)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{null, !1567, !1702, !1702, !993, !993, !993}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1385, file: !1384, line: 214, baseType: !1711, size: 256, align: 64, offset: 3129472)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACSBRContext", file: !1384, line: 134, baseType: !1712)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACSBRContext", file: !1384, line: 120, size: 256, align: 64, elements: !1713)
!1713 = !{!1714, !2524, !2530, !2536}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_lf_gen", scope: !1712, file: !1384, line: 121, baseType: !1715, size: 64, align: 64)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!993, !1718, !2518, !2519, !2521, !993}
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACContext", file: !1384, line: 37, baseType: !1720)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACContext", file: !44, line: 293, size: 62208, align: 256, elements: !1721)
!1721 = !{!1722, !1723, !2390, !2391, !2392, !2409, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2451, !2452, !2453, !2454, !2455, !2458, !2459, !2460, !2462, !2491, !2492, !2493, !2494, !2498, !2499, !2505, !2509, !2510, !2514}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1720, file: !44, line: 294, baseType: !976, size: 64, align: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1720, file: !44, line: 295, baseType: !1724, size: 64, align: 64, offset: 64)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !85, line: 3360, baseType: !1726)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !85, line: 1556, size: 8448, align: 64, elements: !1727)
!1727 = !{!1728, !1731, !1732, !1733, !1990, !1991, !1992, !1993, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2146, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2328, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1726, file: !85, line: 1561, baseType: !1729, size: 64, align: 64)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64, align: 64)
!1730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1726, file: !85, line: 1562, baseType: !993, size: 32, align: 32, offset: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1726, file: !85, line: 1564, baseType: !74, size: 32, align: 32, offset: 96)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1726, file: !85, line: 1565, baseType: !1734, size: 64, align: 64, offset: 128)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1736)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !85, line: 3468, size: 1984, align: 64, elements: !1737)
!1737 = !{!1738, !1739, !1740, !1741, !1742, !1743, !1752, !1755, !1758, !1761, !1766, !1767, !1768, !1776, !1777, !1778, !1780, !1784, !1790, !1799, !1803, !1804, !1843, !1961, !1965, !1966, !1970, !1974, !1979, !1983, !1984, !1985}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1736, file: !85, line: 3475, baseType: !981, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1736, file: !85, line: 3480, baseType: !981, size: 64, align: 64, offset: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1736, file: !85, line: 3481, baseType: !74, size: 32, align: 32, offset: 128)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1736, file: !85, line: 3482, baseType: !84, size: 32, align: 32, offset: 160)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1736, file: !85, line: 3487, baseType: !993, size: 32, align: 32, offset: 192)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1736, file: !85, line: 3488, baseType: !1744, size: 64, align: 64, offset: 256)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1746)
!1746 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1747, line: 61, baseType: !1748)
!1747 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1747, line: 58, size: 64, align: 32, elements: !1749)
!1749 = !{!1750, !1751}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1748, file: !1747, line: 59, baseType: !993, size: 32, align: 32)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1748, file: !1747, line: 60, baseType: !993, size: 32, align: 32, offset: 32)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1736, file: !85, line: 3489, baseType: !1753, size: 64, align: 64, offset: 320)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64, align: 64)
!1754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1736, file: !85, line: 3490, baseType: !1756, size: 64, align: 64, offset: 384)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64, align: 64)
!1757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1736, file: !85, line: 3491, baseType: !1759, size: 64, align: 64, offset: 448)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64, align: 64)
!1760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1736, file: !85, line: 3492, baseType: !1762, size: 64, align: 64, offset: 512)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64, align: 64)
!1763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1764)
!1764 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1765)
!1765 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1736, file: !85, line: 3493, baseType: !1040, size: 8, align: 8, offset: 576)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1736, file: !85, line: 3494, baseType: !1729, size: 64, align: 64, offset: 640)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1736, file: !85, line: 3495, baseType: !1769, size: 64, align: 64, offset: 704)
!1769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1770, size: 64, align: 64)
!1770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1771)
!1771 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !85, line: 3404, baseType: !1772)
!1772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !85, line: 3401, size: 128, align: 64, elements: !1773)
!1773 = !{!1774, !1775}
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1772, file: !85, line: 3402, baseType: !993, size: 32, align: 32)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1772, file: !85, line: 3403, baseType: !981, size: 64, align: 64, offset: 64)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1736, file: !85, line: 3507, baseType: !981, size: 64, align: 64, offset: 768)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1736, file: !85, line: 3516, baseType: !993, size: 32, align: 32, offset: 832)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1736, file: !85, line: 3517, baseType: !1779, size: 64, align: 64, offset: 896)
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1736, file: !85, line: 3527, baseType: !1781, size: 64, align: 64, offset: 960)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1782, size: 64, align: 64)
!1782 = !DISubroutineType(types: !1783)
!1783 = !{!993, !1724}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1736, file: !85, line: 3535, baseType: !1785, size: 64, align: 64, offset: 1024)
!1785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1786, size: 64, align: 64)
!1786 = !DISubroutineType(types: !1787)
!1787 = !{!993, !1724, !1788}
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64, align: 64)
!1789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1725)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1736, file: !85, line: 3541, baseType: !1791, size: 64, align: 64, offset: 1088)
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1793)
!1793 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !85, line: 3461, baseType: !1794)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1795, line: 223, size: 128, align: 64, elements: !1796)
!1795 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1796 = !{!1797, !1798}
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1794, file: !1795, line: 224, baseType: !1219, size: 64, align: 64)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1794, file: !1795, line: 225, baseType: !1219, size: 64, align: 64, offset: 64)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1736, file: !85, line: 3549, baseType: !1800, size: 64, align: 64, offset: 1152)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64, align: 64)
!1801 = !DISubroutineType(types: !1802)
!1802 = !{null, !1779}
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1736, file: !85, line: 3551, baseType: !1781, size: 64, align: 64, offset: 1216)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1736, file: !85, line: 3552, baseType: !1805, size: 64, align: 64, offset: 1280)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64, align: 64)
!1806 = !DISubroutineType(types: !1807)
!1807 = !{!993, !1724, !1039, !993, !1808}
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64, align: 64)
!1809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1810)
!1810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !85, line: 3920, size: 256, align: 64, elements: !1811)
!1811 = !{!1812, !1813, !1814, !1815, !1816, !1842}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1810, file: !85, line: 3921, baseType: !1054, size: 16, align: 16)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1810, file: !85, line: 3922, baseType: !950, size: 32, align: 32, offset: 32)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1810, file: !85, line: 3923, baseType: !950, size: 32, align: 32, offset: 64)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1810, file: !85, line: 3924, baseType: !952, size: 32, align: 32, offset: 96)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1810, file: !85, line: 3925, baseType: !1817, size: 64, align: 64, offset: 128)
!1817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1818, size: 64, align: 64)
!1818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1819, size: 64, align: 64)
!1819 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !85, line: 3918, baseType: !1820)
!1820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !85, line: 3885, size: 1600, align: 64, elements: !1821)
!1821 = !{!1822, !1823, !1824, !1825, !1826, !1827, !1834, !1836, !1837, !1838, !1840, !1841}
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1820, file: !85, line: 3886, baseType: !993, size: 32, align: 32)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1820, file: !85, line: 3887, baseType: !993, size: 32, align: 32, offset: 32)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1820, file: !85, line: 3888, baseType: !993, size: 32, align: 32, offset: 64)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1820, file: !85, line: 3889, baseType: !993, size: 32, align: 32, offset: 96)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1820, file: !85, line: 3890, baseType: !993, size: 32, align: 32, offset: 128)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1820, file: !85, line: 3897, baseType: !1828, size: 768, align: 64, offset: 192)
!1828 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !85, line: 3858, baseType: !1829)
!1829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !85, line: 3853, size: 768, align: 64, elements: !1830)
!1830 = !{!1831, !1833}
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1829, file: !85, line: 3855, baseType: !1832, size: 512, align: 64)
!1832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !962)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1829, file: !85, line: 3857, baseType: !1295, size: 256, align: 32, offset: 512)
