; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlp_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlp_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !{!894, !903, !904, !905, !911}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !897, line: 222, size: 16, align: 8, elements: !898)
!897 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !896, file: !897, line: 222, baseType: !900, size: 16, align: 16)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !901, line: 49, baseType: !902)
!901 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!902 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!903 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!904 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !897, line: 221, size: 32, align: 8, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !907, file: !897, line: 221, baseType: !910, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !901, line: 51, baseType: !904)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !901, line: 48, baseType: !912)
!912 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!913 = !{!914, !922, !1581, !1585, !1589, !1591}
!914 = distinct !DIGlobalVariable(name: "ff_mlp_layout", scope: !0, file: !915, line: 47, type: !916, isLocal: false, isDefinition: true, variable: [32 x i64]* @ff_mlp_layout)
!915 = !DIFile(filename: "libavcodec/mlp_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 2048, align: 64, elements: !920)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !901, line: 55, baseType: !919)
!919 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!920 = !{!921}
!921 = !DISubrange(count: 32)
!922 = distinct !DIGlobalVariable(name: "ff_mlp_parser", scope: !0, file: !915, line: 394, type: !923, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_mlp_parser)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !925)
!925 = !{!926, !930, !931, !982, !1572, !1576, !1580}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !924, file: !4, line: 5260, baseType: !927, size: 160, align: 32)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 160, align: 32, elements: !928)
!928 = !{!929}
!929 = !DISubrange(count: 5)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !924, file: !4, line: 5261, baseType: !903, size: 32, align: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !924, file: !4, line: 5262, baseType: !932, size: 64, align: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!903, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !938)
!938 = !{!939, !941, !943, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !937, file: !4, line: 5093, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !937, file: !4, line: 5094, baseType: !942, size: 64, align: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !937, file: !4, line: 5095, baseType: !944, size: 64, align: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !901, line: 40, baseType: !945)
!945 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !937, file: !4, line: 5096, baseType: !944, size: 64, align: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !937, file: !4, line: 5098, baseType: !944, size: 64, align: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !937, file: !4, line: 5100, baseType: !903, size: 32, align: 32, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !937, file: !4, line: 5110, baseType: !903, size: 32, align: 32, offset: 352)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !937, file: !4, line: 5111, baseType: !944, size: 64, align: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !937, file: !4, line: 5112, baseType: !944, size: 64, align: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !937, file: !4, line: 5115, baseType: !944, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !937, file: !4, line: 5116, baseType: !944, size: 64, align: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !937, file: !4, line: 5117, baseType: !903, size: 32, align: 32, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !937, file: !4, line: 5120, baseType: !903, size: 32, align: 32, offset: 672)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !937, file: !4, line: 5121, baseType: !957, size: 256, align: 64, offset: 704)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 64, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 4)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !937, file: !4, line: 5122, baseType: !957, size: 256, align: 64, offset: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !937, file: !4, line: 5123, baseType: !957, size: 256, align: 64, offset: 1216)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !4, line: 5125, baseType: !903, size: 32, align: 32, offset: 1472)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !937, file: !4, line: 5132, baseType: !944, size: 64, align: 64, offset: 1536)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !937, file: !4, line: 5133, baseType: !957, size: 256, align: 64, offset: 1600)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !937, file: !4, line: 5141, baseType: !903, size: 32, align: 32, offset: 1856)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !937, file: !4, line: 5148, baseType: !944, size: 64, align: 64, offset: 1920)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !937, file: !4, line: 5161, baseType: !903, size: 32, align: 32, offset: 1984)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !937, file: !4, line: 5176, baseType: !903, size: 32, align: 32, offset: 2016)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !937, file: !4, line: 5190, baseType: !903, size: 32, align: 32, offset: 2048)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !937, file: !4, line: 5197, baseType: !957, size: 256, align: 64, offset: 2112)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !937, file: !4, line: 5202, baseType: !944, size: 64, align: 64, offset: 2368)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !937, file: !4, line: 5207, baseType: !944, size: 64, align: 64, offset: 2432)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !937, file: !4, line: 5214, baseType: !903, size: 32, align: 32, offset: 2496)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !937, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !937, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !937, file: !4, line: 5234, baseType: !903, size: 32, align: 32, offset: 2592)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !937, file: !4, line: 5239, baseType: !903, size: 32, align: 32, offset: 2624)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !937, file: !4, line: 5240, baseType: !903, size: 32, align: 32, offset: 2656)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !937, file: !4, line: 5245, baseType: !903, size: 32, align: 32, offset: 2688)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !937, file: !4, line: 5246, baseType: !903, size: 32, align: 32, offset: 2720)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !937, file: !4, line: 5256, baseType: !903, size: 32, align: 32, offset: 2752)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !924, file: !4, line: 5265, baseType: !983, size: 64, align: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!903, !935, !986, !1571, !1264, !1467, !903}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !989)
!989 = !{!990, !1034, !1035, !1036, !1294, !1295, !1296, !1297, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1323, !1327, !1328, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1509, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !988, file: !4, line: 1561, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !995)
!995 = !{!996, !1000, !1004, !1008, !1009, !1010, !1011, !1015, !1021, !1023, !1027}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !994, file: !19, line: 72, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !994, file: !19, line: 78, baseType: !1001, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!997, !940}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !994, file: !19, line: 85, baseType: !1005, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !994, file: !19, line: 93, baseType: !903, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !994, file: !19, line: 99, baseType: !903, size: 32, align: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !994, file: !19, line: 108, baseType: !903, size: 32, align: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !994, file: !19, line: 113, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!940, !940, !940}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !994, file: !19, line: 123, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !994, file: !19, line: 130, baseType: !1022, size: 32, align: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !994, file: !19, line: 136, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1022, !940}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !994, file: !19, line: 142, baseType: !1028, size: 64, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!903, !1031, !940, !997, !903}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !988, file: !4, line: 1562, baseType: !903, size: 32, align: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !988, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !988, file: !4, line: 1565, baseType: !1037, size: 64, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1055, !1058, !1061, !1064, !1066, !1067, !1068, !1076, !1077, !1078, !1080, !1084, !1090, !1095, !1099, !1100, !1144, !1265, !1269, !1270, !1274, !1278, !1283, !1287, !1288, !1289}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !4, line: 3475, baseType: !997, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1039, file: !4, line: 3480, baseType: !997, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1039, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1039, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1039, file: !4, line: 3487, baseType: !903, size: 32, align: 32, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1039, file: !4, line: 3488, baseType: !1047, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1050, line: 61, baseType: !1051)
!1050 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1050, line: 58, size: 64, align: 32, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1051, file: !1050, line: 59, baseType: !903, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1051, file: !1050, line: 60, baseType: !903, size: 32, align: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1039, file: !4, line: 3489, baseType: !1056, size: 64, align: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1039, file: !4, line: 3490, baseType: !1059, size: 64, align: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1039, file: !4, line: 3491, baseType: !1062, size: 64, align: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1039, file: !4, line: 3492, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1039, file: !4, line: 3493, baseType: !911, size: 8, align: 8, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1039, file: !4, line: 3494, baseType: !991, size: 64, align: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1039, file: !4, line: 3495, baseType: !1069, size: 64, align: 64, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1072, file: !4, line: 3402, baseType: !903, size: 32, align: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1072, file: !4, line: 3403, baseType: !997, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1039, file: !4, line: 3507, baseType: !997, size: 64, align: 64, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1039, file: !4, line: 3516, baseType: !903, size: 32, align: 32, offset: 832)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !4, line: 3517, baseType: !1079, size: 64, align: 64, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1039, file: !4, line: 3527, baseType: !1081, size: 64, align: 64, offset: 960)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!903, !986}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1039, file: !4, line: 3535, baseType: !1085, size: 64, align: 64, offset: 1024)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!903, !986, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1039, file: !4, line: 3541, baseType: !1091, size: 64, align: 64, offset: 1088)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1039, file: !4, line: 3549, baseType: !1096, size: 64, align: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1079}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1039, file: !4, line: 3551, baseType: !1081, size: 64, align: 64, offset: 1216)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1039, file: !4, line: 3552, baseType: !1101, size: 64, align: 64, offset: 1280)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!903, !986, !1104, !903, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1143}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1107, file: !4, line: 3921, baseType: !900, size: 16, align: 16)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1107, file: !4, line: 3922, baseType: !910, size: 32, align: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1107, file: !4, line: 3923, baseType: !910, size: 32, align: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1107, file: !4, line: 3924, baseType: !904, size: 32, align: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1107, file: !4, line: 3925, baseType: !1114, size: 64, align: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1134, !1136, !1138, !1139, !1141, !1142}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1117, file: !4, line: 3886, baseType: !903, size: 32, align: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1117, file: !4, line: 3887, baseType: !903, size: 32, align: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1117, file: !4, line: 3888, baseType: !903, size: 32, align: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1117, file: !4, line: 3889, baseType: !903, size: 32, align: 32, offset: 96)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1117, file: !4, line: 3890, baseType: !903, size: 32, align: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1117, file: !4, line: 3897, baseType: !1125, size: 768, align: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1127)
!1127 = !{!1128, !1132}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !4, line: 3855, baseType: !1129, size: 512, align: 64)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, align: 64, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 8)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1126, file: !4, line: 3857, baseType: !1133, size: 256, align: 32, offset: 512)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 256, align: 32, elements: !1130)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !4, line: 3903, baseType: !1135, size: 256, align: 64, offset: 960)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 256, align: 64, elements: !958)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1117, file: !4, line: 3904, baseType: !1137, size: 128, align: 32, offset: 1216)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 128, align: 32, elements: !958)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1117, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1117, file: !4, line: 3908, baseType: !1140, size: 64, align: 64, offset: 1408)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1117, file: !4, line: 3915, baseType: !1140, size: 64, align: 64, offset: 1472)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1117, file: !4, line: 3917, baseType: !903, size: 32, align: 32, offset: 1536)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1107, file: !4, line: 3926, baseType: !944, size: 64, align: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1039, file: !4, line: 3564, baseType: !1145, size: 64, align: 64, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!903, !986, !1148, !1182, !1264}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1151)
!1151 = !{!1152, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1178, !1179, !1180, !1181}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1150, file: !4, line: 1451, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1155, line: 94, baseType: !1156)
!1155 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1155, line: 81, size: 192, align: 64, elements: !1157)
!1157 = !{!1158, !1162, !1163}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1156, file: !1155, line: 82, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1155, line: 73, baseType: !1161)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1155, line: 73, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !1155, line: 89, baseType: !1104, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !1155, line: 93, baseType: !903, size: 32, align: 32, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1150, file: !4, line: 1461, baseType: !944, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1150, file: !4, line: 1467, baseType: !944, size: 64, align: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1150, file: !4, line: 1468, baseType: !1104, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1150, file: !4, line: 1469, baseType: !903, size: 32, align: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1150, file: !4, line: 1470, baseType: !903, size: 32, align: 32, offset: 288)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1150, file: !4, line: 1474, baseType: !903, size: 32, align: 32, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1150, file: !4, line: 1479, baseType: !1171, size: 64, align: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !4, line: 1412, baseType: !1104, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !4, line: 1413, baseType: !903, size: 32, align: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1150, file: !4, line: 1480, baseType: !903, size: 32, align: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1150, file: !4, line: 1486, baseType: !944, size: 64, align: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1150, file: !4, line: 1488, baseType: !944, size: 64, align: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1150, file: !4, line: 1497, baseType: !944, size: 64, align: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1216, !1218, !1219, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1252, !1253, !1254, !1255, !1256, !1257, !1260, !1261, !1262, !1263}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !772, line: 282, baseType: !1129, size: 512, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1185, file: !772, line: 299, baseType: !1133, size: 256, align: 32, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1185, file: !772, line: 315, baseType: !1190, size: 64, align: 64, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1185, file: !772, line: 326, baseType: !903, size: 32, align: 32, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1185, file: !772, line: 326, baseType: !903, size: 32, align: 32, offset: 864)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1185, file: !772, line: 334, baseType: !903, size: 32, align: 32, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1185, file: !772, line: 341, baseType: !903, size: 32, align: 32, offset: 928)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1185, file: !772, line: 346, baseType: !903, size: 32, align: 32, offset: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1185, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1185, file: !772, line: 356, baseType: !1049, size: 64, align: 32, offset: 1024)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1185, file: !772, line: 361, baseType: !944, size: 64, align: 64, offset: 1088)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1185, file: !772, line: 369, baseType: !944, size: 64, align: 64, offset: 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1185, file: !772, line: 377, baseType: !944, size: 64, align: 64, offset: 1216)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1185, file: !772, line: 382, baseType: !903, size: 32, align: 32, offset: 1280)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1185, file: !772, line: 386, baseType: !903, size: 32, align: 32, offset: 1312)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1185, file: !772, line: 391, baseType: !903, size: 32, align: 32, offset: 1344)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1185, file: !772, line: 396, baseType: !940, size: 64, align: 64, offset: 1408)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1185, file: !772, line: 403, baseType: !1206, size: 512, align: 64, offset: 1472)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 512, align: 64, elements: !1130)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1185, file: !772, line: 410, baseType: !903, size: 32, align: 32, offset: 1984)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1185, file: !772, line: 415, baseType: !903, size: 32, align: 32, offset: 2016)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1185, file: !772, line: 420, baseType: !903, size: 32, align: 32, offset: 2048)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1185, file: !772, line: 425, baseType: !903, size: 32, align: 32, offset: 2080)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1185, file: !772, line: 435, baseType: !944, size: 64, align: 64, offset: 2112)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1185, file: !772, line: 440, baseType: !903, size: 32, align: 32, offset: 2176)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1185, file: !772, line: 445, baseType: !918, size: 64, align: 64, offset: 2240)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !772, line: 459, baseType: !1215, size: 512, align: 64, offset: 2304)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 512, align: 64, elements: !1130)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1185, file: !772, line: 473, baseType: !1217, size: 64, align: 64, offset: 2816)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1185, file: !772, line: 477, baseType: !903, size: 32, align: 32, offset: 2880)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1185, file: !772, line: 479, baseType: !1220, size: 64, align: 64, offset: 2944)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1233}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1223, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !772, line: 203, baseType: !1104, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !772, line: 204, baseType: !903, size: 32, align: 32, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1223, file: !772, line: 205, baseType: !1229, size: 64, align: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1231, line: 86, baseType: !1232)
!1231 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1231, line: 86, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1223, file: !772, line: 206, baseType: !1153, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1185, file: !772, line: 480, baseType: !903, size: 32, align: 32, offset: 3008)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !772, line: 505, baseType: !903, size: 32, align: 32, offset: 3040)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1185, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1185, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1185, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1185, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1185, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1185, file: !772, line: 532, baseType: !944, size: 64, align: 64, offset: 3264)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1185, file: !772, line: 539, baseType: !944, size: 64, align: 64, offset: 3328)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1185, file: !772, line: 547, baseType: !944, size: 64, align: 64, offset: 3392)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1185, file: !772, line: 554, baseType: !1229, size: 64, align: 64, offset: 3456)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1185, file: !772, line: 563, baseType: !903, size: 32, align: 32, offset: 3520)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1185, file: !772, line: 572, baseType: !903, size: 32, align: 32, offset: 3552)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1185, file: !772, line: 581, baseType: !903, size: 32, align: 32, offset: 3584)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1185, file: !772, line: 588, baseType: !1249, size: 64, align: 64, offset: 3648)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !901, line: 36, baseType: !1251)
!1251 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1185, file: !772, line: 593, baseType: !903, size: 32, align: 32, offset: 3712)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1185, file: !772, line: 596, baseType: !903, size: 32, align: 32, offset: 3744)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1185, file: !772, line: 599, baseType: !1153, size: 64, align: 64, offset: 3776)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1185, file: !772, line: 605, baseType: !1153, size: 64, align: 64, offset: 3840)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1185, file: !772, line: 616, baseType: !1153, size: 64, align: 64, offset: 3904)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1185, file: !772, line: 626, baseType: !1258, size: 64, align: 64, offset: 3968)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1259, line: 216, baseType: !919)
!1259 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1185, file: !772, line: 627, baseType: !1258, size: 64, align: 64, offset: 4032)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1185, file: !772, line: 628, baseType: !1258, size: 64, align: 64, offset: 4096)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1185, file: !772, line: 629, baseType: !1258, size: 64, align: 64, offset: 4160)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1185, file: !772, line: 645, baseType: !1153, size: 64, align: 64, offset: 4224)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1039, file: !4, line: 3566, baseType: !1266, size: 64, align: 64, offset: 1408)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!903, !986, !940, !1264, !1148}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1039, file: !4, line: 3567, baseType: !1081, size: 64, align: 64, offset: 1472)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1039, file: !4, line: 3576, baseType: !1271, size: 64, align: 64, offset: 1536)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!903, !986, !1182}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1039, file: !4, line: 3577, baseType: !1275, size: 64, align: 64, offset: 1600)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!903, !986, !1148}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1039, file: !4, line: 3584, baseType: !1279, size: 64, align: 64, offset: 1664)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!903, !986, !1282}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1039, file: !4, line: 3589, baseType: !1284, size: 64, align: 64, offset: 1728)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !986}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1039, file: !4, line: 3594, baseType: !903, size: 32, align: 32, offset: 1792)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1039, file: !4, line: 3600, baseType: !997, size: 64, align: 64, offset: 1856)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1039, file: !4, line: 3609, baseType: !1290, size: 64, align: 64, offset: 1920)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1293)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !988, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !988, file: !4, line: 1581, baseType: !904, size: 32, align: 32, offset: 224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !988, file: !4, line: 1583, baseType: !940, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !988, file: !4, line: 1591, baseType: !1298, size: 64, align: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !988, file: !4, line: 1598, baseType: !940, size: 64, align: 64, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !988, file: !4, line: 1606, baseType: !944, size: 64, align: 64, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !988, file: !4, line: 1614, baseType: !903, size: 32, align: 32, offset: 512)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !988, file: !4, line: 1622, baseType: !903, size: 32, align: 32, offset: 544)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !988, file: !4, line: 1628, baseType: !903, size: 32, align: 32, offset: 576)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !4, line: 1636, baseType: !903, size: 32, align: 32, offset: 608)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !988, file: !4, line: 1643, baseType: !903, size: 32, align: 32, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !988, file: !4, line: 1657, baseType: !1104, size: 64, align: 64, offset: 704)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !988, file: !4, line: 1658, baseType: !903, size: 32, align: 32, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !988, file: !4, line: 1679, baseType: !1049, size: 64, align: 32, offset: 800)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !988, file: !4, line: 1688, baseType: !903, size: 32, align: 32, offset: 864)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !988, file: !4, line: 1712, baseType: !903, size: 32, align: 32, offset: 896)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !988, file: !4, line: 1729, baseType: !903, size: 32, align: 32, offset: 928)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !988, file: !4, line: 1729, baseType: !903, size: 32, align: 32, offset: 960)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !988, file: !4, line: 1744, baseType: !903, size: 32, align: 32, offset: 992)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !988, file: !4, line: 1744, baseType: !903, size: 32, align: 32, offset: 1024)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !988, file: !4, line: 1751, baseType: !903, size: 32, align: 32, offset: 1056)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !988, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !988, file: !4, line: 1791, baseType: !1319, size: 64, align: 64, offset: 1152)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{null, !1322, !1182, !1264, !903, !903, !903}
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !988, file: !4, line: 1808, baseType: !1324, size: 64, align: 64, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!508, !1322, !1056}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !988, file: !4, line: 1816, baseType: !903, size: 32, align: 32, offset: 1280)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !988, file: !4, line: 1825, baseType: !1329, size: 32, align: 32, offset: 1312)
!1329 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !988, file: !4, line: 1830, baseType: !903, size: 32, align: 32, offset: 1344)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !988, file: !4, line: 1838, baseType: !1329, size: 32, align: 32, offset: 1376)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !988, file: !4, line: 1846, baseType: !903, size: 32, align: 32, offset: 1408)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !988, file: !4, line: 1851, baseType: !903, size: 32, align: 32, offset: 1440)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !988, file: !4, line: 1861, baseType: !1329, size: 32, align: 32, offset: 1472)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !988, file: !4, line: 1868, baseType: !1329, size: 32, align: 32, offset: 1504)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !988, file: !4, line: 1875, baseType: !1329, size: 32, align: 32, offset: 1536)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !988, file: !4, line: 1882, baseType: !1329, size: 32, align: 32, offset: 1568)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !988, file: !4, line: 1889, baseType: !1329, size: 32, align: 32, offset: 1600)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !988, file: !4, line: 1896, baseType: !1329, size: 32, align: 32, offset: 1632)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !988, file: !4, line: 1903, baseType: !1329, size: 32, align: 32, offset: 1664)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !988, file: !4, line: 1910, baseType: !903, size: 32, align: 32, offset: 1696)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !988, file: !4, line: 1915, baseType: !903, size: 32, align: 32, offset: 1728)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !988, file: !4, line: 1926, baseType: !1264, size: 64, align: 64, offset: 1792)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !988, file: !4, line: 1935, baseType: !1049, size: 64, align: 32, offset: 1856)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !988, file: !4, line: 1942, baseType: !903, size: 32, align: 32, offset: 1920)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !988, file: !4, line: 1948, baseType: !903, size: 32, align: 32, offset: 1952)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !988, file: !4, line: 1954, baseType: !903, size: 32, align: 32, offset: 1984)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !988, file: !4, line: 1960, baseType: !903, size: 32, align: 32, offset: 2016)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !988, file: !4, line: 1984, baseType: !903, size: 32, align: 32, offset: 2048)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !988, file: !4, line: 1991, baseType: !903, size: 32, align: 32, offset: 2080)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !988, file: !4, line: 1996, baseType: !903, size: 32, align: 32, offset: 2112)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !988, file: !4, line: 2004, baseType: !903, size: 32, align: 32, offset: 2144)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !988, file: !4, line: 2011, baseType: !903, size: 32, align: 32, offset: 2176)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !988, file: !4, line: 2018, baseType: !903, size: 32, align: 32, offset: 2208)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !988, file: !4, line: 2027, baseType: !903, size: 32, align: 32, offset: 2240)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !988, file: !4, line: 2034, baseType: !903, size: 32, align: 32, offset: 2272)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !988, file: !4, line: 2044, baseType: !903, size: 32, align: 32, offset: 2304)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !988, file: !4, line: 2054, baseType: !1359, size: 64, align: 64, offset: 2368)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !988, file: !4, line: 2061, baseType: !1359, size: 64, align: 64, offset: 2432)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !988, file: !4, line: 2066, baseType: !903, size: 32, align: 32, offset: 2496)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !988, file: !4, line: 2070, baseType: !903, size: 32, align: 32, offset: 2528)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !988, file: !4, line: 2078, baseType: !903, size: 32, align: 32, offset: 2560)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !988, file: !4, line: 2085, baseType: !903, size: 32, align: 32, offset: 2592)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !988, file: !4, line: 2092, baseType: !903, size: 32, align: 32, offset: 2624)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !988, file: !4, line: 2099, baseType: !903, size: 32, align: 32, offset: 2656)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !988, file: !4, line: 2106, baseType: !903, size: 32, align: 32, offset: 2688)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !988, file: !4, line: 2113, baseType: !903, size: 32, align: 32, offset: 2720)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !988, file: !4, line: 2120, baseType: !903, size: 32, align: 32, offset: 2752)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !988, file: !4, line: 2125, baseType: !903, size: 32, align: 32, offset: 2784)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !988, file: !4, line: 2133, baseType: !903, size: 32, align: 32, offset: 2816)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !988, file: !4, line: 2140, baseType: !903, size: 32, align: 32, offset: 2848)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !988, file: !4, line: 2145, baseType: !903, size: 32, align: 32, offset: 2880)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !988, file: !4, line: 2153, baseType: !903, size: 32, align: 32, offset: 2912)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !988, file: !4, line: 2158, baseType: !903, size: 32, align: 32, offset: 2944)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !988, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !988, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !988, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !988, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !988, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !988, file: !4, line: 2203, baseType: !903, size: 32, align: 32, offset: 3136)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !988, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !988, file: !4, line: 2212, baseType: !903, size: 32, align: 32, offset: 3200)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !988, file: !4, line: 2213, baseType: !903, size: 32, align: 32, offset: 3232)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !988, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !988, file: !4, line: 2232, baseType: !903, size: 32, align: 32, offset: 3296)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !988, file: !4, line: 2243, baseType: !903, size: 32, align: 32, offset: 3328)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !988, file: !4, line: 2249, baseType: !903, size: 32, align: 32, offset: 3360)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !988, file: !4, line: 2256, baseType: !903, size: 32, align: 32, offset: 3392)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !988, file: !4, line: 2263, baseType: !918, size: 64, align: 64, offset: 3456)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !988, file: !4, line: 2270, baseType: !918, size: 64, align: 64, offset: 3520)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !988, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !988, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !988, file: !4, line: 2367, baseType: !1395, size: 64, align: 64, offset: 3648)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!903, !1322, !1282, !903}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !988, file: !4, line: 2383, baseType: !903, size: 32, align: 32, offset: 3712)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !988, file: !4, line: 2386, baseType: !1329, size: 32, align: 32, offset: 3744)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !988, file: !4, line: 2387, baseType: !1329, size: 32, align: 32, offset: 3776)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !988, file: !4, line: 2394, baseType: !903, size: 32, align: 32, offset: 3808)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !988, file: !4, line: 2401, baseType: !903, size: 32, align: 32, offset: 3840)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !988, file: !4, line: 2408, baseType: !903, size: 32, align: 32, offset: 3872)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !988, file: !4, line: 2415, baseType: !903, size: 32, align: 32, offset: 3904)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !988, file: !4, line: 2422, baseType: !903, size: 32, align: 32, offset: 3936)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !988, file: !4, line: 2423, baseType: !1407, size: 64, align: 64, offset: 3968)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1409, file: !4, line: 827, baseType: !903, size: 32, align: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1409, file: !4, line: 828, baseType: !903, size: 32, align: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1409, file: !4, line: 829, baseType: !903, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1409, file: !4, line: 830, baseType: !1329, size: 32, align: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !988, file: !4, line: 2430, baseType: !944, size: 64, align: 64, offset: 4032)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !988, file: !4, line: 2437, baseType: !944, size: 64, align: 64, offset: 4096)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !988, file: !4, line: 2444, baseType: !1329, size: 32, align: 32, offset: 4160)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !988, file: !4, line: 2451, baseType: !1329, size: 32, align: 32, offset: 4192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !988, file: !4, line: 2458, baseType: !903, size: 32, align: 32, offset: 4224)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !988, file: !4, line: 2469, baseType: !903, size: 32, align: 32, offset: 4256)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !988, file: !4, line: 2475, baseType: !903, size: 32, align: 32, offset: 4288)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !988, file: !4, line: 2481, baseType: !903, size: 32, align: 32, offset: 4320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !988, file: !4, line: 2485, baseType: !903, size: 32, align: 32, offset: 4352)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !988, file: !4, line: 2489, baseType: !903, size: 32, align: 32, offset: 4384)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !988, file: !4, line: 2493, baseType: !903, size: 32, align: 32, offset: 4416)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !988, file: !4, line: 2501, baseType: !903, size: 32, align: 32, offset: 4448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !988, file: !4, line: 2506, baseType: !903, size: 32, align: 32, offset: 4480)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !988, file: !4, line: 2510, baseType: !903, size: 32, align: 32, offset: 4512)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !988, file: !4, line: 2514, baseType: !944, size: 64, align: 64, offset: 4544)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !988, file: !4, line: 2528, baseType: !1431, size: 64, align: 64, offset: 4608)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{null, !1322, !940, !903, !903}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !988, file: !4, line: 2534, baseType: !903, size: 32, align: 32, offset: 4672)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !988, file: !4, line: 2545, baseType: !903, size: 32, align: 32, offset: 4704)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !988, file: !4, line: 2547, baseType: !903, size: 32, align: 32, offset: 4736)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !988, file: !4, line: 2549, baseType: !903, size: 32, align: 32, offset: 4768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !988, file: !4, line: 2551, baseType: !903, size: 32, align: 32, offset: 4800)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !988, file: !4, line: 2553, baseType: !903, size: 32, align: 32, offset: 4832)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !988, file: !4, line: 2555, baseType: !903, size: 32, align: 32, offset: 4864)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !988, file: !4, line: 2557, baseType: !903, size: 32, align: 32, offset: 4896)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !988, file: !4, line: 2559, baseType: !903, size: 32, align: 32, offset: 4928)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !988, file: !4, line: 2563, baseType: !903, size: 32, align: 32, offset: 4960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !988, file: !4, line: 2571, baseType: !1140, size: 64, align: 64, offset: 4992)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !988, file: !4, line: 2579, baseType: !1140, size: 64, align: 64, offset: 5056)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !988, file: !4, line: 2586, baseType: !903, size: 32, align: 32, offset: 5120)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !988, file: !4, line: 2615, baseType: !903, size: 32, align: 32, offset: 5152)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !988, file: !4, line: 2627, baseType: !903, size: 32, align: 32, offset: 5184)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !988, file: !4, line: 2637, baseType: !903, size: 32, align: 32, offset: 5216)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !988, file: !4, line: 2681, baseType: !903, size: 32, align: 32, offset: 5248)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !988, file: !4, line: 2709, baseType: !944, size: 64, align: 64, offset: 5312)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !988, file: !4, line: 2716, baseType: !1453, size: 64, align: 64, offset: 5376)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1456)
!1456 = !{!1457, !1458, !1459, !1460, !1461, !1462, !1463, !1469, !1473, !1474, !1475, !1476, !1482, !1483, !1484, !1485, !1486}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1455, file: !4, line: 3642, baseType: !997, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1455, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1455, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1455, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1455, file: !4, line: 3669, baseType: !903, size: 32, align: 32, offset: 160)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1455, file: !4, line: 3682, baseType: !1279, size: 64, align: 64, offset: 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1455, file: !4, line: 3698, baseType: !1464, size: 64, align: 64, offset: 256)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!903, !986, !1467, !910}
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1455, file: !4, line: 3712, baseType: !1470, size: 64, align: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!903, !986, !903, !1467, !910}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1455, file: !4, line: 3726, baseType: !1464, size: 64, align: 64, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1455, file: !4, line: 3737, baseType: !1081, size: 64, align: 64, offset: 448)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1455, file: !4, line: 3746, baseType: !903, size: 32, align: 32, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1455, file: !4, line: 3757, baseType: !1477, size: 64, align: 64, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{null, !1480}
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1455, file: !4, line: 3766, baseType: !1081, size: 64, align: 64, offset: 640)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1455, file: !4, line: 3774, baseType: !1081, size: 64, align: 64, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1455, file: !4, line: 3780, baseType: !903, size: 32, align: 32, offset: 768)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1455, file: !4, line: 3785, baseType: !903, size: 32, align: 32, offset: 800)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1455, file: !4, line: 3795, baseType: !1487, size: 64, align: 64, offset: 832)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!903, !986, !1153}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !988, file: !4, line: 2728, baseType: !940, size: 64, align: 64, offset: 5440)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !988, file: !4, line: 2735, baseType: !1206, size: 512, align: 64, offset: 5504)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !988, file: !4, line: 2742, baseType: !903, size: 32, align: 32, offset: 6016)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !988, file: !4, line: 2755, baseType: !903, size: 32, align: 32, offset: 6048)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !988, file: !4, line: 2776, baseType: !903, size: 32, align: 32, offset: 6080)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !988, file: !4, line: 2783, baseType: !903, size: 32, align: 32, offset: 6112)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !988, file: !4, line: 2791, baseType: !903, size: 32, align: 32, offset: 6144)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !988, file: !4, line: 2802, baseType: !1282, size: 64, align: 64, offset: 6208)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !988, file: !4, line: 2811, baseType: !903, size: 32, align: 32, offset: 6272)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !988, file: !4, line: 2821, baseType: !903, size: 32, align: 32, offset: 6304)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !988, file: !4, line: 2830, baseType: !903, size: 32, align: 32, offset: 6336)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !988, file: !4, line: 2840, baseType: !903, size: 32, align: 32, offset: 6368)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !988, file: !4, line: 2851, baseType: !1503, size: 64, align: 64, offset: 6400)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!903, !1322, !1506, !940, !1264, !903, !903}
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!903, !1322, !940}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !988, file: !4, line: 2871, baseType: !1510, size: 64, align: 64, offset: 6464)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!903, !1322, !1513, !940, !1264, !903}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!903, !1322, !940, !903, !903}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !988, file: !4, line: 2878, baseType: !903, size: 32, align: 32, offset: 6528)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !988, file: !4, line: 2885, baseType: !903, size: 32, align: 32, offset: 6560)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !988, file: !4, line: 3005, baseType: !903, size: 32, align: 32, offset: 6592)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !988, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !988, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !988, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !988, file: !4, line: 3037, baseType: !1104, size: 64, align: 64, offset: 6720)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !988, file: !4, line: 3038, baseType: !903, size: 32, align: 32, offset: 6784)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !988, file: !4, line: 3050, baseType: !918, size: 64, align: 64, offset: 6848)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !988, file: !4, line: 3065, baseType: !903, size: 32, align: 32, offset: 6912)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !988, file: !4, line: 3083, baseType: !903, size: 32, align: 32, offset: 6944)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !988, file: !4, line: 3092, baseType: !1049, size: 64, align: 32, offset: 6976)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !988, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !988, file: !4, line: 3106, baseType: !1049, size: 64, align: 32, offset: 7072)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !988, file: !4, line: 3113, baseType: !1531, size: 64, align: 64, offset: 7168)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1533)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539, !1540, !1541, !1544}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1534, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1534, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1534, file: !4, line: 720, baseType: !997, size: 64, align: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1534, file: !4, line: 724, baseType: !997, size: 64, align: 64, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1534, file: !4, line: 728, baseType: !903, size: 32, align: 32, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1534, file: !4, line: 734, baseType: !1542, size: 64, align: 64, offset: 256)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1534, file: !4, line: 739, baseType: !1545, size: 64, align: 64, offset: 320)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !988, file: !4, line: 3129, baseType: !944, size: 64, align: 64, offset: 7232)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !988, file: !4, line: 3130, baseType: !944, size: 64, align: 64, offset: 7296)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !988, file: !4, line: 3131, baseType: !944, size: 64, align: 64, offset: 7360)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !988, file: !4, line: 3132, baseType: !944, size: 64, align: 64, offset: 7424)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !988, file: !4, line: 3139, baseType: !1140, size: 64, align: 64, offset: 7488)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !988, file: !4, line: 3147, baseType: !903, size: 32, align: 32, offset: 7552)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !988, file: !4, line: 3165, baseType: !903, size: 32, align: 32, offset: 7584)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !988, file: !4, line: 3172, baseType: !903, size: 32, align: 32, offset: 7616)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !988, file: !4, line: 3180, baseType: !903, size: 32, align: 32, offset: 7648)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !988, file: !4, line: 3191, baseType: !1359, size: 64, align: 64, offset: 7680)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !988, file: !4, line: 3199, baseType: !1104, size: 64, align: 64, offset: 7744)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !988, file: !4, line: 3207, baseType: !1140, size: 64, align: 64, offset: 7808)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !988, file: !4, line: 3214, baseType: !904, size: 32, align: 32, offset: 7872)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !988, file: !4, line: 3224, baseType: !1171, size: 64, align: 64, offset: 7936)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !988, file: !4, line: 3225, baseType: !903, size: 32, align: 32, offset: 8000)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !988, file: !4, line: 3249, baseType: !1153, size: 64, align: 64, offset: 8064)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !988, file: !4, line: 3256, baseType: !903, size: 32, align: 32, offset: 8128)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !988, file: !4, line: 3271, baseType: !903, size: 32, align: 32, offset: 8160)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !988, file: !4, line: 3279, baseType: !944, size: 64, align: 64, offset: 8192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !988, file: !4, line: 3301, baseType: !1153, size: 64, align: 64, offset: 8256)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !988, file: !4, line: 3310, baseType: !903, size: 32, align: 32, offset: 8320)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !988, file: !4, line: 3337, baseType: !903, size: 32, align: 32, offset: 8352)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !988, file: !4, line: 3351, baseType: !903, size: 32, align: 32, offset: 8384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !988, file: !4, line: 3359, baseType: !903, size: 32, align: 32, offset: 8416)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !924, file: !4, line: 5269, baseType: !1573, size: 64, align: 64, offset: 320)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{null, !935}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !924, file: !4, line: 5270, baseType: !1577, size: 64, align: 64, offset: 384)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!903, !986, !1467, !903}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !4, line: 5271, baseType: !942, size: 64, align: 64, offset: 448)
!1581 = distinct !DIGlobalVariable(name: "thd_layout", scope: !0, file: !915, line: 77, type: !1582, isLocal: true, isDefinition: true, variable: [13 x i64]* @thd_layout)
!1582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 832, align: 64, elements: !1583)
!1583 = !{!1584}
!1584 = !DISubrange(count: 13)
!1585 = distinct !DIGlobalVariable(name: "mlp_quants", scope: !0, file: !915, line: 37, type: !1586, isLocal: true, isDefinition: true, variable: [16 x i8]* @mlp_quants)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1468, size: 128, align: 8, elements: !1587)
!1587 = !{!1588}
!1588 = !DISubrange(count: 16)
!1589 = distinct !DIGlobalVariable(name: "mlp_channels", scope: !0, file: !915, line: 42, type: !1590, isLocal: true, isDefinition: true, variable: [32 x i8]* @mlp_channels)
!1590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1468, size: 256, align: 8, elements: !920)
!1591 = distinct !DIGlobalVariable(name: "thd_chancount", scope: !0, file: !915, line: 72, type: !1592, isLocal: true, isDefinition: true, variable: [13 x i8]* @thd_chancount)
!1592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1468, size: 104, align: 8, elements: !1583)
!1593 = !{i32 2, !"Dwarf Version", i32 4}
!1594 = !{i32 2, !"Debug Info Version", i32 3}
!1595 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1596 = distinct !DISubprogram(name: "ff_truehd_layout", scope: !915, file: !915, line: 111, type: !1597, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1599)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!918, !903}
!1599 = !{}
!1600 = !DILocalVariable(name: "chanmap", arg: 1, scope: !1596, file: !915, line: 111, type: !903)
!1601 = !DIExpression()
!1602 = !DILocation(line: 111, column: 31, scope: !1596)
!1603 = !DILocalVariable(name: "i", scope: !1596, file: !915, line: 113, type: !903)
!1604 = !DILocation(line: 113, column: 9, scope: !1596)
!1605 = !DILocalVariable(name: "layout", scope: !1596, file: !915, line: 114, type: !918)
!1606 = !DILocation(line: 114, column: 14, scope: !1596)
!1607 = !DILocation(line: 116, column: 12, scope: !1608)
!1608 = distinct !DILexicalBlock(scope: !1596, file: !915, line: 116, column: 5)
!1609 = !DILocation(line: 116, column: 10, scope: !1608)
!1610 = !DILocation(line: 116, column: 17, scope: !1611)
!1611 = !DILexicalBlockFile(scope: !1612, file: !915, discriminator: 1)
!1612 = distinct !DILexicalBlock(scope: !1608, file: !915, line: 116, column: 5)
!1613 = !DILocation(line: 116, column: 19, scope: !1611)
!1614 = !DILocation(line: 116, column: 5, scope: !1611)
!1615 = !DILocation(line: 117, column: 30, scope: !1612)
!1616 = !DILocation(line: 117, column: 19, scope: !1612)
!1617 = !DILocation(line: 117, column: 37, scope: !1612)
!1618 = !DILocation(line: 117, column: 48, scope: !1612)
!1619 = !DILocation(line: 117, column: 45, scope: !1612)
!1620 = !DILocation(line: 117, column: 51, scope: !1612)
!1621 = !DILocation(line: 117, column: 35, scope: !1612)
!1622 = !DILocation(line: 117, column: 33, scope: !1612)
!1623 = !DILocation(line: 117, column: 16, scope: !1612)
!1624 = !DILocation(line: 117, column: 9, scope: !1612)
!1625 = !DILocation(line: 116, column: 26, scope: !1626)
!1626 = !DILexicalBlockFile(scope: !1612, file: !915, discriminator: 2)
!1627 = !DILocation(line: 116, column: 5, scope: !1626)
!1628 = distinct !{!1628, !1629}
!1629 = !DILocation(line: 116, column: 5, scope: !1596)
!1630 = !DILocation(line: 119, column: 12, scope: !1596)
!1631 = !DILocation(line: 119, column: 5, scope: !1596)
!1632 = distinct !DISubprogram(name: "ff_mlp_read_major_sync", scope: !915, file: !915, line: 145, type: !1633, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1599)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!903, !940, !1635, !1661}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLPHeaderInfo", file: !1637, line: 63, baseType: !1638)
!1637 = !DIFile(filename: "libavcodec/mlp_parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLPHeaderInfo", file: !1637, line: 32, size: 832, align: 64, elements: !1639)
!1639 = !{!1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "stream_type", scope: !1638, file: !1637, line: 34, baseType: !903, size: 32, align: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !1638, file: !1637, line: 35, baseType: !903, size: 32, align: 32, offset: 32)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "group1_bits", scope: !1638, file: !1637, line: 37, baseType: !903, size: 32, align: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "group2_bits", scope: !1638, file: !1637, line: 38, baseType: !903, size: 32, align: 32, offset: 96)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "group1_samplerate", scope: !1638, file: !1637, line: 40, baseType: !903, size: 32, align: 32, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "group2_samplerate", scope: !1638, file: !1637, line: 41, baseType: !903, size: 32, align: 32, offset: 160)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "channel_arrangement", scope: !1638, file: !1637, line: 43, baseType: !903, size: 32, align: 32, offset: 192)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "channel_modifier_thd_stream0", scope: !1638, file: !1637, line: 45, baseType: !903, size: 32, align: 32, offset: 224)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "channel_modifier_thd_stream1", scope: !1638, file: !1637, line: 46, baseType: !903, size: 32, align: 32, offset: 256)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "channel_modifier_thd_stream2", scope: !1638, file: !1637, line: 47, baseType: !903, size: 32, align: 32, offset: 288)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "channels_mlp", scope: !1638, file: !1637, line: 49, baseType: !903, size: 32, align: 32, offset: 320)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "channels_thd_stream1", scope: !1638, file: !1637, line: 50, baseType: !903, size: 32, align: 32, offset: 352)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "channels_thd_stream2", scope: !1638, file: !1637, line: 51, baseType: !903, size: 32, align: 32, offset: 384)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout_mlp", scope: !1638, file: !1637, line: 52, baseType: !918, size: 64, align: 64, offset: 448)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout_thd_stream1", scope: !1638, file: !1637, line: 53, baseType: !918, size: 64, align: 64, offset: 512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout_thd_stream2", scope: !1638, file: !1637, line: 54, baseType: !918, size: 64, align: 64, offset: 576)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit_size", scope: !1638, file: !1637, line: 56, baseType: !903, size: 32, align: 32, offset: 640)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit_size_pow2", scope: !1638, file: !1637, line: 57, baseType: !903, size: 32, align: 32, offset: 672)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "is_vbr", scope: !1638, file: !1637, line: 59, baseType: !903, size: 32, align: 32, offset: 704)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "peak_bitrate", scope: !1638, file: !1637, line: 60, baseType: !903, size: 32, align: 32, offset: 736)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "num_substreams", scope: !1638, file: !1637, line: 62, baseType: !903, size: 32, align: 32, offset: 768)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1663, line: 70, baseType: !1664)
!1663 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1663, line: 61, size: 256, align: 64, elements: !1665)
!1665 = !{!1666, !1667, !1668, !1669, !1670}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1664, file: !1663, line: 62, baseType: !1467, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1664, file: !1663, line: 62, baseType: !1467, size: 64, align: 64, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1664, file: !1663, line: 67, baseType: !903, size: 32, align: 32, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1664, file: !1663, line: 68, baseType: !903, size: 32, align: 32, offset: 160)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1664, file: !1663, line: 69, baseType: !903, size: 32, align: 32, offset: 192)
!1671 = !DILocalVariable(name: "log", arg: 1, scope: !1632, file: !915, line: 145, type: !940)
!1672 = !DILocation(line: 145, column: 34, scope: !1632)
!1673 = !DILocalVariable(name: "mh", arg: 2, scope: !1632, file: !915, line: 145, type: !1635)
!1674 = !DILocation(line: 145, column: 54, scope: !1632)
!1675 = !DILocalVariable(name: "gb", arg: 3, scope: !1632, file: !915, line: 145, type: !1661)
!1676 = !DILocation(line: 145, column: 73, scope: !1632)
!1677 = !DILocalVariable(name: "ratebits", scope: !1632, file: !915, line: 147, type: !903)
!1678 = !DILocation(line: 147, column: 9, scope: !1632)
!1679 = !DILocalVariable(name: "channel_arrangement", scope: !1632, file: !915, line: 147, type: !903)
!1680 = !DILocation(line: 147, column: 19, scope: !1632)
!1681 = !DILocalVariable(name: "header_size", scope: !1632, file: !915, line: 147, type: !903)
!1682 = !DILocation(line: 147, column: 40, scope: !1632)
!1683 = !DILocalVariable(name: "checksum", scope: !1632, file: !915, line: 148, type: !900)
!1684 = !DILocation(line: 148, column: 14, scope: !1632)
!1685 = !DILocation(line: 152, column: 43, scope: !1632)
!1686 = !DILocation(line: 152, column: 47, scope: !1632)
!1687 = !DILocation(line: 152, column: 55, scope: !1632)
!1688 = !DILocation(line: 152, column: 59, scope: !1632)
!1689 = !DILocation(line: 152, column: 72, scope: !1632)
!1690 = !DILocation(line: 152, column: 19, scope: !1632)
!1691 = !DILocation(line: 152, column: 17, scope: !1632)
!1692 = !DILocation(line: 153, column: 9, scope: !1693)
!1693 = distinct !DILexicalBlock(scope: !1632, file: !915, line: 153, column: 9)
!1694 = !DILocation(line: 153, column: 21, scope: !1693)
!1695 = !DILocation(line: 153, column: 25, scope: !1693)
!1696 = !DILocation(line: 153, column: 28, scope: !1697)
!1697 = !DILexicalBlockFile(scope: !1693, file: !915, discriminator: 1)
!1698 = !DILocation(line: 153, column: 32, scope: !1697)
!1699 = !DILocation(line: 153, column: 47, scope: !1697)
!1700 = !DILocation(line: 153, column: 59, scope: !1697)
!1701 = !DILocation(line: 153, column: 45, scope: !1697)
!1702 = !DILocation(line: 153, column: 9, scope: !1697)
!1703 = !DILocation(line: 154, column: 16, scope: !1704)
!1704 = distinct !DILexicalBlock(scope: !1693, file: !915, line: 153, column: 65)
!1705 = !DILocation(line: 154, column: 9, scope: !1704)
!1706 = !DILocation(line: 155, column: 9, scope: !1704)
!1707 = !DILocation(line: 158, column: 34, scope: !1632)
!1708 = !DILocation(line: 158, column: 38, scope: !1632)
!1709 = !DILocation(line: 158, column: 46, scope: !1632)
!1710 = !DILocation(line: 158, column: 58, scope: !1632)
!1711 = !DILocation(line: 158, column: 16, scope: !1632)
