; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--imx_dump_header_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--imx_dump_header_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }

!548 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!549 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!550 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !503, line: 493, size: 32, align: 32, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!553 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!554 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!555 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!556 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!557 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!558 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!559 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!560 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!561 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!562 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!563 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!564 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!565 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!566 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!567 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !613, line: 48, baseType: !614)
!613 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!614 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!615 = !{!616, !782, !786}
!616 = distinct !DIGlobalVariable(name: "ff_imx_dump_header_bsf", scope: !0, file: !617, line: 72, type: !618, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_imx_dump_header_bsf)
!617 = !DIFile(filename: "libavcodec/imx_dump_header_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !621)
!621 = !{!622, !626, !629, !672, !673, !739, !777, !781}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !620, file: !4, line: 5797, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !620, file: !4, line: 5804, baseType: !627, size: 64, align: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !620, file: !4, line: 5815, baseType: !630, size: 64, align: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !634)
!634 = !{!635, !636, !641, !645, !647, !648, !649, !653, !659, !661, !665}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !633, file: !464, line: 72, baseType: !623, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !633, file: !464, line: 78, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!623, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !633, file: !464, line: 85, baseType: !642, size: 64, align: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !633, file: !464, line: 93, baseType: !646, size: 32, align: 32, offset: 192)
!646 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !633, file: !464, line: 99, baseType: !646, size: 32, align: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !633, file: !464, line: 108, baseType: !646, size: 32, align: 32, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !633, file: !464, line: 113, baseType: !650, size: 64, align: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!640, !640, !640}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !633, file: !464, line: 123, baseType: !654, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !633, file: !464, line: 130, baseType: !660, size: 32, align: 32, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !633, file: !464, line: 136, baseType: !662, size: 64, align: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!660, !640}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !633, file: !464, line: 142, baseType: !666, size: 64, align: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!646, !669, !640, !623, !646}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !620, file: !4, line: 5825, baseType: !646, size: 32, align: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !620, file: !4, line: 5826, baseType: !674, size: 64, align: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, align: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!646, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !680)
!680 = !{!681, !682, !685, !689, !690, !736, !737, !738}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !679, file: !4, line: 5751, baseType: !630, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !679, file: !4, line: 5756, baseType: !683, size: 64, align: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !679, file: !4, line: 5762, baseType: !686, size: 64, align: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !679, file: !4, line: 5768, baseType: !640, size: 64, align: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !679, file: !4, line: 5775, baseType: !691, size: 64, align: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !694)
!694 = !{!695, !696, !697, !700, !701, !702, !703, !706, !707, !708, !709, !710, !711, !712, !719, !720, !721, !722, !723, !724, !725, !726, !729, !730, !731, !732, !733, !734, !735}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !693, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !693, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !693, file: !4, line: 3948, baseType: !698, size: 32, align: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !613, line: 51, baseType: !699)
!699 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !693, file: !4, line: 3958, baseType: !611, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !693, file: !4, line: 3962, baseType: !646, size: 32, align: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !693, file: !4, line: 3968, baseType: !646, size: 32, align: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !693, file: !4, line: 3973, baseType: !704, size: 64, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !613, line: 40, baseType: !705)
!705 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !693, file: !4, line: 3986, baseType: !646, size: 32, align: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !693, file: !4, line: 3999, baseType: !646, size: 32, align: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !693, file: !4, line: 4004, baseType: !646, size: 32, align: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !693, file: !4, line: 4005, baseType: !646, size: 32, align: 32, offset: 416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !693, file: !4, line: 4010, baseType: !646, size: 32, align: 32, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !693, file: !4, line: 4011, baseType: !646, size: 32, align: 32, offset: 480)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !693, file: !4, line: 4020, baseType: !713, size: 64, align: 32, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !714, line: 61, baseType: !715)
!714 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !714, line: 58, size: 64, align: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !715, file: !714, line: 59, baseType: !646, size: 32, align: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !715, file: !714, line: 60, baseType: !646, size: 32, align: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !693, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !693, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !693, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !693, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !693, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !693, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !693, file: !4, line: 4039, baseType: !646, size: 32, align: 32, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !693, file: !4, line: 4046, baseType: !727, size: 64, align: 64, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !613, line: 55, baseType: !728)
!728 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !693, file: !4, line: 4050, baseType: !646, size: 32, align: 32, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !693, file: !4, line: 4054, baseType: !646, size: 32, align: 32, offset: 928)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !693, file: !4, line: 4061, baseType: !646, size: 32, align: 32, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !693, file: !4, line: 4065, baseType: !646, size: 32, align: 32, offset: 992)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !693, file: !4, line: 4073, baseType: !646, size: 32, align: 32, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !693, file: !4, line: 4080, baseType: !646, size: 32, align: 32, offset: 1056)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !693, file: !4, line: 4084, baseType: !646, size: 32, align: 32, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !679, file: !4, line: 5781, baseType: !691, size: 64, align: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !679, file: !4, line: 5787, baseType: !713, size: 64, align: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !679, file: !4, line: 5793, baseType: !713, size: 64, align: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !620, file: !4, line: 5827, baseType: !740, size: 64, align: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!646, !677, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !746)
!746 = !{!747, !759, !760, !761, !762, !763, !764, !765, !773, !774, !775, !776}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !745, file: !4, line: 1451, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !750, line: 94, baseType: !751)
!750 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !750, line: 81, size: 192, align: 64, elements: !752)
!752 = !{!753, !757, !758}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !751, file: !750, line: 82, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !750, line: 73, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !750, line: 73, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !751, file: !750, line: 89, baseType: !611, size: 64, align: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !751, file: !750, line: 93, baseType: !646, size: 32, align: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !745, file: !4, line: 1461, baseType: !704, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !745, file: !4, line: 1467, baseType: !704, size: 64, align: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !745, file: !4, line: 1468, baseType: !611, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !4, line: 1469, baseType: !646, size: 32, align: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !745, file: !4, line: 1470, baseType: !646, size: 32, align: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !4, line: 1474, baseType: !646, size: 32, align: 32, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !745, file: !4, line: 1479, baseType: !766, size: 64, align: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !768, file: !4, line: 1412, baseType: !611, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !768, file: !4, line: 1413, baseType: !646, size: 32, align: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !745, file: !4, line: 1480, baseType: !646, size: 32, align: 32, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !745, file: !4, line: 1486, baseType: !704, size: 64, align: 64, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !745, file: !4, line: 1488, baseType: !704, size: 64, align: 64, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !745, file: !4, line: 1497, baseType: !704, size: 64, align: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !620, file: !4, line: 5828, baseType: !778, size: 64, align: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !677}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !620, file: !4, line: 5829, baseType: !778, size: 64, align: 64, offset: 448)
!782 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !617, line: 68, type: !783, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 64, align: 32, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 2)
!786 = distinct !DIGlobalVariable(name: "imx_header", scope: !787, file: !617, line: 36, type: !789, isLocal: true, isDefinition: true, variable: [16 x i8]* @imx_dump_header.imx_header)
!787 = distinct !DISubprogram(name: "imx_dump_header", scope: !617, file: !617, line: 33, type: !741, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !788)
!788 = !{}
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 128, align: 8, elements: !791)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!791 = !{!792}
!792 = !DISubrange(count: 16)
!793 = !{i32 2, !"Dwarf Version", i32 4}
!794 = !{i32 2, !"Debug Info Version", i32 3}
!795 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!796 = !DILocalVariable(name: "b", arg: 1, scope: !797, file: !798, line: 95, type: !801)
!797 = distinct !DISubprogram(name: "bytestream_put_byte", scope: !798, file: !798, line: 95, type: !799, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !788)
!798 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!799 = !DISubroutineType(types: !800)
!800 = !{null, !801, !802}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!803 = !DIExpression()
!804 = !DILocation(line: 95, column: 233, scope: !797, inlinedAt: !805)
!805 = distinct !DILocation(line: 53, column: 5, scope: !787)
!806 = !DILocalVariable(name: "value", arg: 2, scope: !797, file: !798, line: 95, type: !802)
!807 = !DILocation(line: 95, column: 255, scope: !797, inlinedAt: !805)
!808 = !DILocalVariable(name: "b", arg: 1, scope: !809, file: !798, line: 93, type: !801)
!809 = distinct !DISubprogram(name: "bytestream_put_be24", scope: !798, file: !798, line: 93, type: !799, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !788)
!810 = !DILocation(line: 93, column: 312, scope: !809, inlinedAt: !811)
!811 = distinct !DILocation(line: 54, column: 5, scope: !787)
!812 = !DILocalVariable(name: "value", arg: 2, scope: !809, file: !798, line: 93, type: !802)
!813 = !DILocation(line: 93, column: 334, scope: !809, inlinedAt: !811)
!814 = !DILocalVariable(name: "b", arg: 1, scope: !815, file: !798, line: 368, type: !801)
!815 = distinct !DISubprogram(name: "bytestream_put_buffer", scope: !798, file: !798, line: 368, type: !816, isLocal: true, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !788)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !801, !818, !699}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64, align: 64)
!819 = !DILocation(line: 368, column: 83, scope: !815, inlinedAt: !820)
!820 = distinct !DILocation(line: 55, column: 5, scope: !787)
!821 = !DILocalVariable(name: "src", arg: 2, scope: !815, file: !798, line: 369, type: !818)
!822 = !DILocation(line: 369, column: 67, scope: !815, inlinedAt: !820)
!823 = !DILocalVariable(name: "size", arg: 3, scope: !815, file: !798, line: 370, type: !699)
!824 = !DILocation(line: 370, column: 65, scope: !815, inlinedAt: !820)
!825 = !DILocation(line: 368, column: 83, scope: !815, inlinedAt: !826)
!826 = distinct !DILocation(line: 52, column: 5, scope: !787)
!827 = !DILocation(line: 369, column: 67, scope: !815, inlinedAt: !826)
