; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4data.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }
%struct.MVTable = type { i32, i16*, i8*, i8*, i8*, i16*, %struct.VLC }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msmpeg4data.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4, !14, !21, !25, !26, !27, !28, !72, !98, !102, !106, !108, !109, !110, !113, !114, !120, !124, !125, !129, !130, !132, !133, !137, !141, !142, !146, !150, !151, !155, !159, !160, !164, !168, !169, !173, !175, !179, !180, !181, !182, !183, !184, !185, !186}
!4 = distinct !DIGlobalVariable(name: "ff_msmp4_mb_i_table", scope: !0, file: !5, line: 43, type: !6, isLocal: false, isDefinition: true, variable: [64 x [2 x i16]]* @ff_msmp4_mb_i_table)
!5 = !DIFile(filename: "libavcodec/msmpeg4data.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, align: 16, elements: !11)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 49, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!10 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!11 = !{!12, !13}
!12 = !DISubrange(count: 64)
!13 = !DISubrange(count: 2)
!14 = distinct !DIGlobalVariable(name: "ff_table_mb_non_intra", scope: !0, file: !5, line: 63, type: !15, isLocal: false, isDefinition: true, variable: [128 x [2 x i32]]* @ff_table_mb_non_intra)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8192, align: 32, elements: !19)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 51, baseType: !18)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !13}
!20 = !DISubrange(count: 128)
!21 = distinct !DIGlobalVariable(name: "ff_table0_dc_lum", scope: !0, file: !5, line: 100, type: !22, isLocal: false, isDefinition: true, variable: [120 x [2 x i32]]* @ff_table0_dc_lum)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 7680, align: 32, elements: !23)
!23 = !{!24, !13}
!24 = !DISubrange(count: 120)
!25 = distinct !DIGlobalVariable(name: "ff_table0_dc_chroma", scope: !0, file: !5, line: 133, type: !22, isLocal: false, isDefinition: true, variable: [120 x [2 x i32]]* @ff_table0_dc_chroma)
!26 = distinct !DIGlobalVariable(name: "ff_table1_dc_lum", scope: !0, file: !5, line: 168, type: !22, isLocal: false, isDefinition: true, variable: [120 x [2 x i32]]* @ff_table1_dc_lum)
!27 = distinct !DIGlobalVariable(name: "ff_table1_dc_chroma", scope: !0, file: !5, line: 201, type: !22, isLocal: false, isDefinition: true, variable: [120 x [2 x i32]]* @ff_table1_dc_chroma)
!28 = distinct !DIGlobalVariable(name: "ff_rl_table", scope: !0, file: !5, line: 601, type: !29, isLocal: false, isDefinition: true, variable: [6 x %struct.RLTable]* @ff_rl_table)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 16128, align: 64, elements: !70)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "RLTable", file: !31, line: 49, baseType: !32)
!31 = !DIFile(filename: "libavcodec/rl.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RLTable", file: !31, line: 39, size: 2688, align: 64, elements: !33)
!33 = !{!34, !36, !37, !41, !46, !47, !52, !55, !56}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !32, file: !31, line: 40, baseType: !35, size: 32, align: 32)
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !32, file: !31, line: 41, baseType: !35, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "table_vlc", scope: !32, file: !31, line: 42, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, align: 16, elements: !40)
!40 = !{!13}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "table_run", scope: !32, file: !31, line: 43, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !9, line: 36, baseType: !45)
!45 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "table_level", scope: !32, file: !31, line: 44, baseType: !42, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "index_run", scope: !32, file: !31, line: 45, baseType: !48, size: 128, align: 64, offset: 256)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 128, align: 64, elements: !40)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 48, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "max_level", scope: !32, file: !31, line: 46, baseType: !53, size: 128, align: 64, offset: 384)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, align: 64, elements: !40)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max_run", scope: !32, file: !31, line: 47, baseType: !53, size: 128, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rl_vlc", scope: !32, file: !31, line: 48, baseType: !57, size: 2048, align: 64, offset: 640)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2048, align: 64, elements: !68)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "RL_VLC_ELEM", file: !60, line: 36, baseType: !61)
!60 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RL_VLC_ELEM", file: !60, line: 32, size: 32, align: 16, elements: !62)
!62 = !{!63, !66, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !61, file: !60, line: 33, baseType: !64, size: 16, align: 16)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !9, line: 37, baseType: !65)
!65 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !61, file: !60, line: 34, baseType: !44, size: 8, align: 8, offset: 16)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !61, file: !60, line: 35, baseType: !50, size: 8, align: 8, offset: 24)
!68 = !{!69}
!69 = !DISubrange(count: 32)
!70 = !{!71}
!71 = !DISubrange(count: 6)
!72 = distinct !DIGlobalVariable(name: "ff_mv_tables", scope: !0, file: !5, line: 1773, type: !73, isLocal: false, isDefinition: true, variable: [2 x %struct.MVTable]* @ff_mv_tables)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1152, align: 64, elements: !40)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVTable", file: !75, line: 47, baseType: !76)
!75 = !DIFile(filename: "libavcodec/msmpeg4data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVTable", file: !75, line: 39, size: 576, align: 64, elements: !77)
!77 = !{!78, !79, !81, !84, !85, !86, !88}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !76, file: !75, line: 40, baseType: !35, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "table_mv_code", scope: !76, file: !75, line: 41, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "table_mv_bits", scope: !76, file: !75, line: 42, baseType: !82, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "table_mvx", scope: !76, file: !75, line: 43, baseType: !82, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "table_mvy", scope: !76, file: !75, line: 44, baseType: !82, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "table_mv_index", scope: !76, file: !75, line: 45, baseType: !87, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "vlc", scope: !76, file: !75, line: 46, baseType: !89, size: 192, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !60, line: 30, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !60, line: 26, size: 192, align: 64, elements: !91)
!91 = !{!92, !93, !96, !97}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !90, file: !60, line: 27, baseType: !35, size: 32, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !90, file: !60, line: 28, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, align: 16, elements: !40)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !90, file: !60, line: 29, baseType: !35, size: 32, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !90, file: !60, line: 29, baseType: !35, size: 32, align: 32, offset: 160)
!98 = distinct !DIGlobalVariable(name: "ff_v2_mb_type", scope: !0, file: !5, line: 1786, type: !99, isLocal: false, isDefinition: true, variable: [8 x [2 x i8]]* @ff_v2_mb_type)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, align: 8, elements: !100)
!100 = !{!101, !13}
!101 = !DISubrange(count: 8)
!102 = distinct !DIGlobalVariable(name: "ff_v2_intra_cbpc", scope: !0, file: !5, line: 1791, type: !103, isLocal: false, isDefinition: true, variable: [4 x [2 x i8]]* @ff_v2_intra_cbpc)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, align: 8, elements: !104)
!104 = !{!105, !13}
!105 = !DISubrange(count: 4)
!106 = distinct !DIGlobalVariable(name: "ff_wmv1_y_dc_scale_table", scope: !0, file: !5, line: 1795, type: !107, isLocal: false, isDefinition: true, variable: [32 x i8]* @ff_wmv1_y_dc_scale_table)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, align: 8, elements: !68)
!108 = distinct !DIGlobalVariable(name: "ff_wmv1_c_dc_scale_table", scope: !0, file: !5, line: 1799, type: !107, isLocal: false, isDefinition: true, variable: [32 x i8]* @ff_wmv1_c_dc_scale_table)
!109 = distinct !DIGlobalVariable(name: "ff_old_ff_y_dc_scale_table", scope: !0, file: !5, line: 1804, type: !107, isLocal: false, isDefinition: true, variable: [32 x i8]* @ff_old_ff_y_dc_scale_table)
!110 = distinct !DIGlobalVariable(name: "ff_wmv1_scantable", scope: !0, file: !5, line: 1809, type: !111, isLocal: false, isDefinition: true, variable: [4 x [64 x i8]]* @ff_wmv1_scantable)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2048, align: 8, elements: !112)
!112 = !{!105, !12}
!113 = distinct !DIGlobalVariable(name: "ff_table_inter_intra", scope: !0, file: !5, line: 1844, type: !103, isLocal: false, isDefinition: true, variable: [4 x [2 x i8]]* @ff_table_inter_intra)
!114 = distinct !DIGlobalVariable(name: "ff_wmv2_inter_table", scope: !0, file: !5, line: 1956, type: !115, isLocal: false, isDefinition: true, variable: [4 x [2 x i32]*]* @ff_wmv2_inter_table)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, align: 64, elements: !119)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 32, elements: !40)
!119 = !{!105}
!120 = distinct !DIGlobalVariable(name: "ff_v2_dc_lum_table", scope: !0, file: !5, line: 34, type: !121, isLocal: false, isDefinition: true, variable: [512 x [2 x i32]]* @ff_v2_dc_lum_table)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32768, align: 32, elements: !122)
!122 = !{!123, !13}
!123 = !DISubrange(count: 512)
!124 = distinct !DIGlobalVariable(name: "ff_v2_dc_chroma_table", scope: !0, file: !5, line: 35, type: !121, isLocal: false, isDefinition: true, variable: [512 x [2 x i32]]* @ff_v2_dc_chroma_table)
!125 = distinct !DIGlobalVariable(name: "ff_static_rl_table_store", scope: !0, file: !5, line: 36, type: !126, isLocal: false, isDefinition: true, variable: [6 x [2 x [195 x i8]]]* @ff_static_rl_table_store)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 18720, align: 8, elements: !127)
!127 = !{!71, !13, !128}
!128 = !DISubrange(count: 195)
!129 = distinct !DIGlobalVariable(name: "ff_msmp4_mb_i_vlc", scope: !0, file: !5, line: 38, type: !89, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_msmp4_mb_i_vlc)
!130 = distinct !DIGlobalVariable(name: "ff_msmp4_dc_luma_vlc", scope: !0, file: !5, line: 39, type: !131, isLocal: false, isDefinition: true, variable: [2 x %struct.VLC]* @ff_msmp4_dc_luma_vlc)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 384, align: 64, elements: !40)
