; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vp9data.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vp9data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ProbContext = type { [4 x [9 x i8]], [10 x [9 x i8]], [4 x [2 x i8]], [7 x [3 x i8]], [4 x i8], [5 x i8], [5 x [2 x i8]], [5 x i8], [2 x [3 x i8]], [2 x [2 x i8]], [2 x i8], [3 x i8], [3 x i8], [2 x %struct.anon], [4 x [4 x [3 x i8]]] }
%struct.anon = type { i8, [10 x i8], i8, [10 x i8], [2 x [3 x i8]], [3 x i8], i8, i8 }

@ff_vp9_bwh_tab = constant [2 x [13 x [2 x i8]]] [[13 x [2 x i8]] [[2 x i8] c"\10\10", [2 x i8] c"\10\08", [2 x i8] c"\08\10", [2 x i8] c"\08\08", [2 x i8] c"\08\04", [2 x i8] c"\04\08", [2 x i8] c"\04\04", [2 x i8] c"\04\02", [2 x i8] c"\02\04", [2 x i8] c"\02\02", [2 x i8] c"\02\01", [2 x i8] c"\01\02", [2 x i8] c"\01\01"], [13 x [2 x i8]] [[2 x i8] c"\08\08", [2 x i8] c"\08\04", [2 x i8] c"\04\08", [2 x i8] c"\04\04", [2 x i8] c"\04\02", [2 x i8] c"\02\04", [2 x i8] c"\02\02", [2 x i8] c"\02\01", [2 x i8] c"\01\02", [2 x i8] c"\01\01", [2 x i8] c"\01\01", [2 x i8] c"\01\01", [2 x i8] c"\01\01"]], align 16
@ff_vp9_partition_tree = constant [3 x [2 x i8]] [[2 x i8] c"\00\01", [2 x i8] c"\FF\02", [2 x i8] c"\FE\FD"], align 1

!88 = distinct !DIGlobalVariable(name: "ff_vp9_row_scan_8x8", scope: !0, file: !21, line: 497, type: !84, isLocal: false, isDefinition: true, variable: [64 x i16]* @ff_vp9_row_scan_8x8)
!89 = distinct !DIGlobalVariable(name: "ff_vp9_default_scan_16x16", scope: !0, file: !21, line: 508, type: !90, isLocal: false, isDefinition: true, variable: [256 x i16]* @ff_vp9_default_scan_16x16)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 4096, align: 16, elements: !91)
!91 = !{!70}
!92 = distinct !DIGlobalVariable(name: "ff_vp9_col_scan_16x16", scope: !0, file: !21, line: 527, type: !90, isLocal: false, isDefinition: true, variable: [256 x i16]* @ff_vp9_col_scan_16x16)
!93 = distinct !DIGlobalVariable(name: "ff_vp9_row_scan_16x16", scope: !0, file: !21, line: 546, type: !90, isLocal: false, isDefinition: true, variable: [256 x i16]* @ff_vp9_row_scan_16x16)
!94 = distinct !DIGlobalVariable(name: "ff_vp9_default_scan_32x32", scope: !0, file: !21, line: 565, type: !95, isLocal: false, isDefinition: true, variable: [1024 x i16]* @ff_vp9_default_scan_32x32)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 16384, align: 16, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1024)
!98 = distinct !DIGlobalVariable(name: "ff_vp9_scans", scope: !0, file: !21, line: 600, type: !99, isLocal: false, isDefinition: true, variable: [5 x [4 x i16*]]* @ff_vp9_scans)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1280, align: 64, elements: !102)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!102 = !{!103, !40}
!103 = !DISubrange(count: 5)
!104 = distinct !DIGlobalVariable(name: "ff_vp9_default_scan_4x4_nb", scope: !0, file: !21, line: 619, type: !105, isLocal: false, isDefinition: true, variable: [16 x [2 x i16]]* @ff_vp9_default_scan_4x4_nb)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 512, align: 16, elements: !106)
!106 = !{!80, !28}
!107 = distinct !DIGlobalVariable(name: "ff_vp9_col_scan_4x4_nb", scope: !0, file: !21, line: 626, type: !105, isLocal: false, isDefinition: true, variable: [16 x [2 x i16]]* @ff_vp9_col_scan_4x4_nb)
!108 = distinct !DIGlobalVariable(name: "ff_vp9_row_scan_4x4_nb", scope: !0, file: !21, line: 633, type: !105, isLocal: false, isDefinition: true, variable: [16 x [2 x i16]]* @ff_vp9_row_scan_4x4_nb)
!109 = distinct !DIGlobalVariable(name: "ff_vp9_default_scan_8x8_nb", scope: !0, file: !21, line: 640, type: !110, isLocal: false, isDefinition: true, variable: [64 x [2 x i16]]* @ff_vp9_default_scan_8x8_nb)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, align: 16, elements: !111)
!111 = !{!86, !28}
!112 = distinct !DIGlobalVariable(name: "ff_vp9_col_scan_8x8_nb", scope: !0, file: !21, line: 659, type: !110, isLocal: false, isDefinition: true, variable: [64 x [2 x i16]]* @ff_vp9_col_scan_8x8_nb)
!113 = distinct !DIGlobalVariable(name: "ff_vp9_row_scan_8x8_nb", scope: !0, file: !21, line: 678, type: !110, isLocal: false, isDefinition: true, variable: [64 x [2 x i16]]* @ff_vp9_row_scan_8x8_nb)
!114 = distinct !DIGlobalVariable(name: "ff_vp9_default_scan_16x16_nb", scope: !0, file: !21, line: 697, type: !115, isLocal: false, isDefinition: true, variable: [256 x [2 x i16]]* @ff_vp9_default_scan_16x16_nb)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 8192, align: 16, elements: !116)
!116 = !{!70, !28}
!117 = distinct !DIGlobalVariable(name: "ff_vp9_col_scan_16x16_nb", scope: !0, file: !21, line: 764, type: !115, isLocal: false, isDefinition: true, variable: [256 x [2 x i16]]* @ff_vp9_col_scan_16x16_nb)
!118 = distinct !DIGlobalVariable(name: "ff_vp9_row_scan_16x16_nb", scope: !0, file: !21, line: 831, type: !115, isLocal: false, isDefinition: true, variable: [256 x [2 x i16]]* @ff_vp9_row_scan_16x16_nb)
!119 = distinct !DIGlobalVariable(name: "ff_vp9_default_scan_32x32_nb", scope: !0, file: !21, line: 898, type: !120, isLocal: false, isDefinition: true, variable: [1024 x [2 x i16]]* @ff_vp9_default_scan_32x32_nb)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 32768, align: 16, elements: !121)
!121 = !{!97, !28}
!122 = distinct !DIGlobalVariable(name: "ff_vp9_scans_nb", scope: !0, file: !21, line: 1157, type: !123, isLocal: false, isDefinition: true, variable: [5 x [4 x [2 x i16]*]]* @ff_vp9_scans_nb)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1280, align: 64, elements: !102)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 32, align: 16, elements: !127)
!127 = !{!28}
!128 = distinct !DIGlobalVariable(name: "ff_vp9_model_pareto8", scope: !0, file: !21, line: 1176, type: !129, isLocal: false, isDefinition: true, variable: [256 x [8 x i8]]* @ff_vp9_model_pareto8)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, align: 8, elements: !130)
!130 = !{!70, !131}
!131 = !DISubrange(count: 8)
!132 = distinct !DIGlobalVariable(name: "ff_vp9_default_probs", scope: !0, file: !21, line: 1435, type: !133, isLocal: false, isDefinition: true, variable: %struct.ProbContext* @ff_vp9_default_probs)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProbContext", file: !135, line: 71, baseType: !136)
!135 = !DIFile(filename: "libavcodec/vp9dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProbContext", file: !135, line: 46, size: 2488, align: 8, elements: !137)
!137 = !{!138, !141, !143, !146, !149, !152, !155, !158, !159, !162, !164, !166, !168, !169, !183}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "y_mode", scope: !136, file: !135, line: 47, baseType: !139, size: 288, align: 8)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 288, align: 8, elements: !140)
!140 = !{!40, !48}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "uv_mode", scope: !136, file: !135, line: 48, baseType: !142, size: 720, align: 8, offset: 288)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 720, align: 8, elements: !55)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !136, file: !135, line: 49, baseType: !144, size: 64, align: 8, offset: 1008)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, align: 8, elements: !145)
!145 = !{!40, !28}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mv_mode", scope: !136, file: !135, line: 50, baseType: !147, size: 168, align: 8, offset: 1072)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 168, align: 8, elements: !148)
!148 = !{!44, !36}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !136, file: !135, line: 51, baseType: !150, size: 32, align: 8, offset: 1240)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, align: 8, elements: !151)
!151 = !{!40}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !136, file: !135, line: 52, baseType: !153, size: 40, align: 8, offset: 1272)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, align: 8, elements: !154)
!154 = !{!103}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "single_ref", scope: !136, file: !135, line: 53, baseType: !156, size: 80, align: 8, offset: 1312)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 80, align: 8, elements: !157)
!157 = !{!103, !28}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "comp_ref", scope: !136, file: !135, line: 54, baseType: !153, size: 40, align: 8, offset: 1392)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tx32p", scope: !136, file: !135, line: 55, baseType: !160, size: 48, align: 8, offset: 1432)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, align: 8, elements: !161)
!161 = !{!28, !36}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tx16p", scope: !136, file: !135, line: 56, baseType: !163, size: 32, align: 8, offset: 1480)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, align: 8, elements: !59)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tx8p", scope: !136, file: !135, line: 57, baseType: !165, size: 16, align: 8, offset: 1512)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, align: 8, elements: !127)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !136, file: !135, line: 58, baseType: !167, size: 24, align: 8, offset: 1528)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !63)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mv_joint", scope: !136, file: !135, line: 59, baseType: !167, size: 24, align: 8, offset: 1552)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mv_comp", scope: !136, file: !135, line: 69, baseType: !170, size: 528, align: 8, offset: 1576)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 528, align: 8, elements: !127)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !135, line: 60, size: 264, align: 8, elements: !172)
!172 = !{!173, !174, !177, !178, !179, !180, !181, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !171, file: !135, line: 61, baseType: !24, size: 8, align: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "classes", scope: !171, file: !135, line: 62, baseType: !175, size: 80, align: 8, offset: 8)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 80, align: 8, elements: !176)
!176 = !{!52}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "class0", scope: !171, file: !135, line: 63, baseType: !24, size: 8, align: 8, offset: 88)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !171, file: !135, line: 64, baseType: !175, size: 80, align: 8, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "class0_fp", scope: !171, file: !135, line: 65, baseType: !160, size: 48, align: 8, offset: 176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !171, file: !135, line: 66, baseType: !167, size: 24, align: 8, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "class0_hp", scope: !171, file: !135, line: 67, baseType: !24, size: 8, align: 8, offset: 248)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "hp", scope: !171, file: !135, line: 68, baseType: !24, size: 8, align: 8, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !136, file: !135, line: 70, baseType: !184, size: 384, align: 8, offset: 2104)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 384, align: 8, elements: !39)
!185 = distinct !DIGlobalVariable(name: "ff_vp9_default_coef_probs", scope: !0, file: !21, line: 1540, type: !186, isLocal: false, isDefinition: true, variable: [4 x [2 x [2 x [6 x [6 x [3 x i8]]]]]]* @ff_vp9_default_coef_probs)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 13824, align: 8, elements: !187)
!187 = !{!40, !28, !28, !188, !188, !36}
!188 = !DISubrange(count: 6)
!189 = distinct !DIGlobalVariable(name: "ff_vp9_mv_joint_tree", scope: !0, file: !21, line: 2224, type: !31, isLocal: false, isDefinition: true, variable: [3 x [2 x i8]]* @ff_vp9_mv_joint_tree)
!190 = distinct !DIGlobalVariable(name: "ff_vp9_mv_class_tree", scope: !0, file: !21, line: 2230, type: !191, isLocal: false, isDefinition: true, variable: [10 x [2 x i8]]* @ff_vp9_mv_class_tree)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, align: 8, elements: !192)
!192 = !{!52, !28}
!193 = distinct !DIGlobalVariable(name: "ff_vp9_mv_fp_tree", scope: !0, file: !21, line: 2243, type: !31, isLocal: false, isDefinition: true, variable: [3 x [2 x i8]]* @ff_vp9_mv_fp_tree)
!194 = !{i32 2, !"Dwarf Version", i32 4}
!195 = !{i32 2, !"Debug Info Version", i32 3}
!196 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
