; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opusenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opusenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVCodecDefault = type { i8*, i8* }

!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !910, line: 77, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914}
!912 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!914 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !910, line: 83, size: 32, align: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!918 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpusMode", file: !920, line: 62, size: 32, align: 32, elements: !921)
!920 = !DIFile(filename: "libavcodec/opus.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!921 = !{!922, !923, !924, !925}
!922 = !DIEnumerator(name: "OPUS_MODE_SILK", value: 0)
!923 = !DIEnumerator(name: "OPUS_MODE_HYBRID", value: 1)
!924 = !DIEnumerator(name: "OPUS_MODE_CELT", value: 2)
!925 = !DIEnumerator(name: "OPUS_MODE_NB", value: 3)
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpusBandwidth", file: !920, line: 70, size: 32, align: 32, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933}
!928 = !DIEnumerator(name: "OPUS_BANDWIDTH_NARROWBAND", value: 0)
!929 = !DIEnumerator(name: "OPUS_BANDWIDTH_MEDIUMBAND", value: 1)
!930 = !DIEnumerator(name: "OPUS_BANDWIDTH_WIDEBAND", value: 2)
!931 = !DIEnumerator(name: "OPUS_BANDWIDTH_SUPERWIDEBAND", value: 3)
!932 = !DIEnumerator(name: "OPUS_BANDWIDTH_FULLBAND", value: 4)
!933 = !DIEnumerator(name: "OPUS_BANDWITH_NB", value: 5)
!934 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltBlockSize", file: !935, line: 56, size: 32, align: 32, elements: !936)
!935 = !DIFile(filename: "libavcodec/opus_celt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!936 = !{!937, !938, !939, !940, !941}
!937 = !DIEnumerator(name: "CELT_BLOCK_120", value: 0)
!938 = !DIEnumerator(name: "CELT_BLOCK_240", value: 1)
!939 = !DIEnumerator(name: "CELT_BLOCK_480", value: 2)
!940 = !DIEnumerator(name: "CELT_BLOCK_960", value: 3)
!941 = !DIEnumerator(name: "CELT_BLOCK_NB", value: 4)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltSpread", file: !935, line: 49, size: 32, align: 32, elements: !943)
!943 = !{!944, !945, !946, !947}
!944 = !DIEnumerator(name: "CELT_SPREAD_NONE", value: 0)
!945 = !DIEnumerator(name: "CELT_SPREAD_LIGHT", value: 1)
!946 = !DIEnumerator(name: "CELT_SPREAD_NORMAL", value: 2)
!947 = !DIEnumerator(name: "CELT_SPREAD_AGGRESSIVE", value: 3)
!948 = !{!949, !953, !960, !966, !967}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 48, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!952 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !955, line: 222, size: 16, align: 8, elements: !956)
!955 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !954, file: !955, line: 222, baseType: !958, size: 16, align: 16)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 49, baseType: !959)
!959 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !955, line: 221, size: 32, align: 8, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !961, file: !955, line: 221, baseType: !964, size: 32, align: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 51, baseType: !965)
!965 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!967 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!968 = !{!969, !1726, !1727, !1733, !1737}
!969 = distinct !DIGlobalVariable(name: "ff_opus_encoder", scope: !0, file: !970, line: 720, type: !971, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_opus_encoder)
!970 = !DIFile(filename: "libavcodec/opusenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !973)
!973 = !{!974, !978, !979, !980, !981, !982, !991, !994, !997, !1000, !1005, !1006, !1081, !1089, !1090, !1091, !1093, !1641, !1647, !1655, !1659, !1660, !1697, !1701, !1705, !1706, !1710, !1714, !1715, !1719, !1720, !1721}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !14, line: 3475, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !972, file: !14, line: 3480, baseType: !975, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !972, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !972, file: !14, line: 3487, baseType: !967, size: 32, align: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !972, file: !14, line: 3488, baseType: !983, size: 64, align: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !986, line: 61, baseType: !987)
!986 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !986, line: 58, size: 64, align: 32, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !987, file: !986, line: 59, baseType: !967, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !987, file: !986, line: 60, baseType: !967, size: 32, align: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !972, file: !14, line: 3489, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !972, file: !14, line: 3490, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !972, file: !14, line: 3491, baseType: !998, size: 64, align: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !972, file: !14, line: 3492, baseType: !1001, size: 64, align: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 55, baseType: !1004)
!1004 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !972, file: !14, line: 3493, baseType: !950, size: 8, align: 8, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !972, file: !14, line: 3494, baseType: !1007, size: 64, align: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1017, !1040, !1041, !1042, !1043, !1047, !1053, !1055, !1059}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1010, file: !713, line: 72, baseType: !975, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1010, file: !713, line: 78, baseType: !1014, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!975, !966}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1010, file: !713, line: 85, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1036, !1037, !1038, !1039}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !691, line: 247, baseType: !975, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1020, file: !691, line: 253, baseType: !975, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1020, file: !691, line: 259, baseType: !967, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1020, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1020, file: !691, line: 271, baseType: !1027, size: 64, align: 64, offset: 192)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !691, line: 265, size: 64, align: 64, elements: !1028)
!1028 = !{!1029, !1032, !1034, !1035}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1027, file: !691, line: 266, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !951, line: 40, baseType: !1031)
!1031 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1027, file: !691, line: 267, baseType: !1033, size: 64, align: 64)
!1033 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1027, file: !691, line: 268, baseType: !975, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1027, file: !691, line: 270, baseType: !985, size: 64, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1020, file: !691, line: 272, baseType: !1033, size: 64, align: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1020, file: !691, line: 273, baseType: !1033, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !691, line: 275, baseType: !967, size: 32, align: 32, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1020, file: !691, line: 300, baseType: !975, size: 64, align: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1010, file: !713, line: 93, baseType: !967, size: 32, align: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1010, file: !713, line: 99, baseType: !967, size: 32, align: 32, offset: 224)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1010, file: !713, line: 108, baseType: !967, size: 32, align: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1010, file: !713, line: 113, baseType: !1044, size: 64, align: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!966, !966, !966}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1010, file: !713, line: 123, baseType: !1048, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1051, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1010, file: !713, line: 130, baseType: !1054, size: 32, align: 32, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1010, file: !713, line: 136, baseType: !1056, size: 64, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!1054, !966}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1010, file: !713, line: 142, baseType: !1060, size: 64, align: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!967, !1063, !966, !975, !967}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1066)
!1066 = !{!1067, !1079, !1080}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1065, file: !691, line: 360, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1071, file: !691, line: 307, baseType: !975, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1071, file: !691, line: 313, baseType: !1033, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1071, file: !691, line: 313, baseType: !1033, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1071, file: !691, line: 318, baseType: !1033, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1071, file: !691, line: 318, baseType: !1033, size: 64, align: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1071, file: !691, line: 323, baseType: !967, size: 32, align: 32, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1065, file: !691, line: 364, baseType: !967, size: 32, align: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1065, file: !691, line: 368, baseType: !967, size: 32, align: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !972, file: !14, line: 3495, baseType: !1082, size: 64, align: 64, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1085, file: !14, line: 3402, baseType: !967, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !14, line: 3403, baseType: !975, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !972, file: !14, line: 3507, baseType: !975, size: 64, align: 64, offset: 768)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !972, file: !14, line: 3516, baseType: !967, size: 32, align: 32, offset: 832)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !972, file: !14, line: 3517, baseType: !1092, size: 64, align: 64, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !972, file: !14, line: 3527, baseType: !1094, size: 64, align: 64, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!967, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1107, !1108, !1109, !1110, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1389, !1393, !1394, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1579, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1099, file: !14, line: 1561, baseType: !1007, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1099, file: !14, line: 1562, baseType: !967, size: 32, align: 32, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1099, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1099, file: !14, line: 1565, baseType: !1105, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1099, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1099, file: !14, line: 1581, baseType: !965, size: 32, align: 32, offset: 224)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1099, file: !14, line: 1583, baseType: !966, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1099, file: !14, line: 1591, baseType: !1111, size: 64, align: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1113, line: 129, size: 1664, align: 64, elements: !1114)
!1113 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1114 = !{!1115, !1116, !1117, !1118, !1215, !1236, !1237, !1266, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1112, file: !1113, line: 136, baseType: !967, size: 32, align: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1112, file: !1113, line: 151, baseType: !967, size: 32, align: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1112, file: !1113, line: 157, baseType: !967, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1112, file: !1113, line: 159, baseType: !1119, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1122)
!1122 = !{!1123, !1127, !1129, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1167, !1169, !1170, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1203, !1204, !1205, !1206, !1207, !1208, !1211, !1212, !1213, !1214}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1121, file: !744, line: 282, baseType: !1124, size: 512, align: 64)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 512, align: 64, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 8)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1121, file: !744, line: 299, baseType: !1128, size: 256, align: 32, offset: 512)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 256, align: 32, elements: !1125)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1121, file: !744, line: 315, baseType: !1130, size: 64, align: 64, offset: 768)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1121, file: !744, line: 326, baseType: !967, size: 32, align: 32, offset: 832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1121, file: !744, line: 326, baseType: !967, size: 32, align: 32, offset: 864)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1121, file: !744, line: 334, baseType: !967, size: 32, align: 32, offset: 896)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1121, file: !744, line: 341, baseType: !967, size: 32, align: 32, offset: 928)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1121, file: !744, line: 346, baseType: !967, size: 32, align: 32, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1121, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1121, file: !744, line: 356, baseType: !985, size: 64, align: 32, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1121, file: !744, line: 361, baseType: !1030, size: 64, align: 64, offset: 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1121, file: !744, line: 369, baseType: !1030, size: 64, align: 64, offset: 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1121, file: !744, line: 377, baseType: !1030, size: 64, align: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1121, file: !744, line: 382, baseType: !967, size: 32, align: 32, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1121, file: !744, line: 386, baseType: !967, size: 32, align: 32, offset: 1312)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1121, file: !744, line: 391, baseType: !967, size: 32, align: 32, offset: 1344)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1121, file: !744, line: 396, baseType: !966, size: 64, align: 64, offset: 1408)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1121, file: !744, line: 403, baseType: !1146, size: 512, align: 64, offset: 1472)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 512, align: 64, elements: !1125)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1121, file: !744, line: 410, baseType: !967, size: 32, align: 32, offset: 1984)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1121, file: !744, line: 415, baseType: !967, size: 32, align: 32, offset: 2016)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1121, file: !744, line: 420, baseType: !967, size: 32, align: 32, offset: 2048)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1121, file: !744, line: 425, baseType: !967, size: 32, align: 32, offset: 2080)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1121, file: !744, line: 435, baseType: !1030, size: 64, align: 64, offset: 2112)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1121, file: !744, line: 440, baseType: !967, size: 32, align: 32, offset: 2176)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1121, file: !744, line: 445, baseType: !1003, size: 64, align: 64, offset: 2240)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1121, file: !744, line: 459, baseType: !1155, size: 512, align: 64, offset: 2304)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 512, align: 64, elements: !1125)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1158, line: 94, baseType: !1159)
!1158 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1158, line: 81, size: 192, align: 64, elements: !1160)
!1160 = !{!1161, !1165, !1166}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1159, file: !1158, line: 82, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1158, line: 73, baseType: !1164)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1158, line: 73, flags: DIFlagFwdDecl)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !1158, line: 89, baseType: !949, size: 64, align: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !1158, line: 93, baseType: !967, size: 32, align: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1121, file: !744, line: 473, baseType: !1168, size: 64, align: 64, offset: 2816)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1121, file: !744, line: 477, baseType: !967, size: 32, align: 32, offset: 2880)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1121, file: !744, line: 479, baseType: !1171, size: 64, align: 64, offset: 2944)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1184}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1174, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1174, file: !744, line: 203, baseType: !949, size: 64, align: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1174, file: !744, line: 204, baseType: !967, size: 32, align: 32, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1174, file: !744, line: 205, baseType: !1180, size: 64, align: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1182, line: 86, baseType: !1183)
!1182 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1182, line: 86, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1174, file: !744, line: 206, baseType: !1156, size: 64, align: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1121, file: !744, line: 480, baseType: !967, size: 32, align: 32, offset: 3008)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !744, line: 505, baseType: !967, size: 32, align: 32, offset: 3040)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1121, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1121, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1121, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1121, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1121, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1121, file: !744, line: 532, baseType: !1030, size: 64, align: 64, offset: 3264)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1121, file: !744, line: 539, baseType: !1030, size: 64, align: 64, offset: 3328)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1121, file: !744, line: 547, baseType: !1030, size: 64, align: 64, offset: 3392)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1121, file: !744, line: 554, baseType: !1180, size: 64, align: 64, offset: 3456)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1121, file: !744, line: 563, baseType: !967, size: 32, align: 32, offset: 3520)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1121, file: !744, line: 572, baseType: !967, size: 32, align: 32, offset: 3552)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1121, file: !744, line: 581, baseType: !967, size: 32, align: 32, offset: 3584)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1121, file: !744, line: 588, baseType: !1200, size: 64, align: 64, offset: 3648)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !951, line: 36, baseType: !1202)
!1202 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1121, file: !744, line: 593, baseType: !967, size: 32, align: 32, offset: 3712)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1121, file: !744, line: 596, baseType: !967, size: 32, align: 32, offset: 3744)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1121, file: !744, line: 599, baseType: !1156, size: 64, align: 64, offset: 3776)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1121, file: !744, line: 605, baseType: !1156, size: 64, align: 64, offset: 3840)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1121, file: !744, line: 616, baseType: !1156, size: 64, align: 64, offset: 3904)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1121, file: !744, line: 626, baseType: !1209, size: 64, align: 64, offset: 3968)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1210, line: 216, baseType: !1004)
!1210 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1121, file: !744, line: 627, baseType: !1209, size: 64, align: 64, offset: 4032)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1121, file: !744, line: 628, baseType: !1209, size: 64, align: 64, offset: 4096)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1121, file: !744, line: 629, baseType: !1209, size: 64, align: 64, offset: 4160)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1121, file: !744, line: 645, baseType: !1156, size: 64, align: 64, offset: 4224)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1112, file: !1113, line: 161, baseType: !1216, size: 64, align: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1113, line: 117, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1113, line: 100, size: 832, align: 64, elements: !1219)
!1219 = !{!1220, !1227, !1228, !1229, !1230, !1231, !1233, !1234, !1235}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1218, file: !1113, line: 105, baseType: !1221, size: 256, align: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 256, align: 64, elements: !1225)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1158, line: 238, baseType: !1224)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1158, line: 238, flags: DIFlagFwdDecl)
!1225 = !{!1226}
!1226 = !DISubrange(count: 4)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1218, file: !1113, line: 110, baseType: !967, size: 32, align: 32, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1218, file: !1113, line: 111, baseType: !967, size: 32, align: 32, offset: 288)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1218, file: !1113, line: 111, baseType: !967, size: 32, align: 32, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1218, file: !1113, line: 112, baseType: !1128, size: 256, align: 32, offset: 352)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1218, file: !1113, line: 113, baseType: !1232, size: 128, align: 32, offset: 608)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, align: 32, elements: !1225)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1218, file: !1113, line: 114, baseType: !967, size: 32, align: 32, offset: 736)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1218, file: !1113, line: 115, baseType: !967, size: 32, align: 32, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1218, file: !1113, line: 116, baseType: !967, size: 32, align: 32, offset: 800)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1112, file: !1113, line: 163, baseType: !966, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1112, file: !1113, line: 165, baseType: !1238, size: 128, align: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1113, line: 122, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1113, line: 119, size: 128, align: 64, elements: !1240)
!1240 = !{!1241, !1265}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1239, file: !1113, line: 120, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1261, !1262, !1263, !1264}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1244, file: !14, line: 1451, baseType: !1156, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1244, file: !14, line: 1461, baseType: !1030, size: 64, align: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1244, file: !14, line: 1467, baseType: !1030, size: 64, align: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1244, file: !14, line: 1468, baseType: !949, size: 64, align: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1244, file: !14, line: 1469, baseType: !967, size: 32, align: 32, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1244, file: !14, line: 1470, baseType: !967, size: 32, align: 32, offset: 288)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1244, file: !14, line: 1474, baseType: !967, size: 32, align: 32, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1244, file: !14, line: 1479, baseType: !1254, size: 64, align: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1257)
!1257 = !{!1258, !1259, !1260}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1256, file: !14, line: 1412, baseType: !949, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1256, file: !14, line: 1413, baseType: !967, size: 32, align: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1256, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1244, file: !14, line: 1480, baseType: !967, size: 32, align: 32, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1244, file: !14, line: 1486, baseType: !1030, size: 64, align: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1244, file: !14, line: 1488, baseType: !1030, size: 64, align: 64, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1244, file: !14, line: 1497, baseType: !1030, size: 64, align: 64, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1239, file: !1113, line: 121, baseType: !1119, size: 64, align: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1112, file: !1113, line: 166, baseType: !1267, size: 128, align: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1113, line: 127, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1113, line: 124, size: 128, align: 64, elements: !1269)
!1269 = !{!1270, !1343}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1268, file: !1113, line: 125, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1301, !1305, !1306, !1340, !1341, !1342}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1274, file: !14, line: 5751, baseType: !1007, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1274, file: !14, line: 5756, baseType: !1278, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1286, !1287, !1288, !1292, !1296, !1300}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1280, file: !14, line: 5797, baseType: !975, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1280, file: !14, line: 5804, baseType: !1284, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1280, file: !14, line: 5815, baseType: !1007, size: 64, align: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1280, file: !14, line: 5825, baseType: !967, size: 32, align: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1280, file: !14, line: 5826, baseType: !1289, size: 64, align: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!967, !1272}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1280, file: !14, line: 5827, baseType: !1293, size: 64, align: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!967, !1272, !1242}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1280, file: !14, line: 5828, baseType: !1297, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{null, !1272}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1280, file: !14, line: 5829, baseType: !1297, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1274, file: !14, line: 5762, baseType: !1302, size: 64, align: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1304)
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1274, file: !14, line: 5768, baseType: !966, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1274, file: !14, line: 5775, baseType: !1307, size: 64, align: 64, offset: 256)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1309, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1309, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1309, file: !14, line: 3948, baseType: !964, size: 32, align: 32, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1309, file: !14, line: 3958, baseType: !949, size: 64, align: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1309, file: !14, line: 3962, baseType: !967, size: 32, align: 32, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1309, file: !14, line: 3968, baseType: !967, size: 32, align: 32, offset: 224)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1309, file: !14, line: 3973, baseType: !1030, size: 64, align: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1309, file: !14, line: 3986, baseType: !967, size: 32, align: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1309, file: !14, line: 3999, baseType: !967, size: 32, align: 32, offset: 352)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1309, file: !14, line: 4004, baseType: !967, size: 32, align: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1309, file: !14, line: 4005, baseType: !967, size: 32, align: 32, offset: 416)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1309, file: !14, line: 4010, baseType: !967, size: 32, align: 32, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1309, file: !14, line: 4011, baseType: !967, size: 32, align: 32, offset: 480)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1309, file: !14, line: 4020, baseType: !985, size: 64, align: 32, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1309, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1309, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1309, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1309, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1309, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1309, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1309, file: !14, line: 4039, baseType: !967, size: 32, align: 32, offset: 768)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1309, file: !14, line: 4046, baseType: !1003, size: 64, align: 64, offset: 832)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1309, file: !14, line: 4050, baseType: !967, size: 32, align: 32, offset: 896)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1309, file: !14, line: 4054, baseType: !967, size: 32, align: 32, offset: 928)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1309, file: !14, line: 4061, baseType: !967, size: 32, align: 32, offset: 960)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1309, file: !14, line: 4065, baseType: !967, size: 32, align: 32, offset: 992)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1309, file: !14, line: 4073, baseType: !967, size: 32, align: 32, offset: 1024)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1309, file: !14, line: 4080, baseType: !967, size: 32, align: 32, offset: 1056)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1309, file: !14, line: 4084, baseType: !967, size: 32, align: 32, offset: 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1274, file: !14, line: 5781, baseType: !1307, size: 64, align: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1274, file: !14, line: 5787, baseType: !985, size: 64, align: 32, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1274, file: !14, line: 5793, baseType: !985, size: 64, align: 32, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1268, file: !1113, line: 126, baseType: !967, size: 32, align: 32, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1112, file: !1113, line: 172, baseType: !1242, size: 64, align: 64, offset: 576)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1112, file: !1113, line: 177, baseType: !949, size: 64, align: 64, offset: 640)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1112, file: !1113, line: 178, baseType: !965, size: 32, align: 32, offset: 704)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1112, file: !1113, line: 180, baseType: !966, size: 64, align: 64, offset: 768)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1112, file: !1113, line: 185, baseType: !967, size: 32, align: 32, offset: 832)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1112, file: !1113, line: 190, baseType: !966, size: 64, align: 64, offset: 896)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1112, file: !1113, line: 195, baseType: !967, size: 32, align: 32, offset: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1112, file: !1113, line: 200, baseType: !1242, size: 64, align: 64, offset: 1024)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1112, file: !1113, line: 201, baseType: !967, size: 32, align: 32, offset: 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1112, file: !1113, line: 202, baseType: !1119, size: 64, align: 64, offset: 1152)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1112, file: !1113, line: 203, baseType: !967, size: 32, align: 32, offset: 1216)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1112, file: !1113, line: 205, baseType: !967, size: 32, align: 32, offset: 1248)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1112, file: !1113, line: 206, baseType: !967, size: 32, align: 32, offset: 1280)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1112, file: !1113, line: 209, baseType: !1209, size: 64, align: 64, offset: 1344)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1112, file: !1113, line: 212, baseType: !1209, size: 64, align: 64, offset: 1408)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1112, file: !1113, line: 213, baseType: !1119, size: 64, align: 64, offset: 1472)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1112, file: !1113, line: 215, baseType: !967, size: 32, align: 32, offset: 1536)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1112, file: !1113, line: 217, baseType: !967, size: 32, align: 32, offset: 1568)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1112, file: !1113, line: 220, baseType: !967, size: 32, align: 32, offset: 1600)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1099, file: !14, line: 1598, baseType: !966, size: 64, align: 64, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1099, file: !14, line: 1606, baseType: !1030, size: 64, align: 64, offset: 448)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1099, file: !14, line: 1614, baseType: !967, size: 32, align: 32, offset: 512)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1099, file: !14, line: 1622, baseType: !967, size: 32, align: 32, offset: 544)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1099, file: !14, line: 1628, baseType: !967, size: 32, align: 32, offset: 576)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !14, line: 1636, baseType: !967, size: 32, align: 32, offset: 608)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1099, file: !14, line: 1643, baseType: !967, size: 32, align: 32, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1099, file: !14, line: 1657, baseType: !949, size: 64, align: 64, offset: 704)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1099, file: !14, line: 1658, baseType: !967, size: 32, align: 32, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1099, file: !14, line: 1679, baseType: !985, size: 64, align: 32, offset: 800)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1099, file: !14, line: 1688, baseType: !967, size: 32, align: 32, offset: 864)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1099, file: !14, line: 1712, baseType: !967, size: 32, align: 32, offset: 896)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1099, file: !14, line: 1729, baseType: !967, size: 32, align: 32, offset: 928)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1099, file: !14, line: 1729, baseType: !967, size: 32, align: 32, offset: 960)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1099, file: !14, line: 1744, baseType: !967, size: 32, align: 32, offset: 992)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1099, file: !14, line: 1744, baseType: !967, size: 32, align: 32, offset: 1024)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1099, file: !14, line: 1751, baseType: !967, size: 32, align: 32, offset: 1056)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1099, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1099, file: !14, line: 1791, baseType: !1382, size: 64, align: 64, offset: 1152)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{null, !1385, !1386, !1388, !967, !967, !967}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1099, file: !14, line: 1808, baseType: !1390, size: 64, align: 64, offset: 1216)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!473, !1385, !992}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1099, file: !14, line: 1816, baseType: !967, size: 32, align: 32, offset: 1280)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1099, file: !14, line: 1825, baseType: !1395, size: 32, align: 32, offset: 1312)
!1395 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1099, file: !14, line: 1830, baseType: !967, size: 32, align: 32, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1099, file: !14, line: 1838, baseType: !1395, size: 32, align: 32, offset: 1376)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1099, file: !14, line: 1846, baseType: !967, size: 32, align: 32, offset: 1408)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1099, file: !14, line: 1851, baseType: !967, size: 32, align: 32, offset: 1440)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1099, file: !14, line: 1861, baseType: !1395, size: 32, align: 32, offset: 1472)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1099, file: !14, line: 1868, baseType: !1395, size: 32, align: 32, offset: 1504)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1099, file: !14, line: 1875, baseType: !1395, size: 32, align: 32, offset: 1536)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1099, file: !14, line: 1882, baseType: !1395, size: 32, align: 32, offset: 1568)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1099, file: !14, line: 1889, baseType: !1395, size: 32, align: 32, offset: 1600)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1099, file: !14, line: 1896, baseType: !1395, size: 32, align: 32, offset: 1632)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1099, file: !14, line: 1903, baseType: !1395, size: 32, align: 32, offset: 1664)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1099, file: !14, line: 1910, baseType: !967, size: 32, align: 32, offset: 1696)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1099, file: !14, line: 1915, baseType: !967, size: 32, align: 32, offset: 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1099, file: !14, line: 1926, baseType: !1388, size: 64, align: 64, offset: 1792)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1099, file: !14, line: 1935, baseType: !985, size: 64, align: 32, offset: 1856)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1099, file: !14, line: 1942, baseType: !967, size: 32, align: 32, offset: 1920)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1099, file: !14, line: 1948, baseType: !967, size: 32, align: 32, offset: 1952)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1099, file: !14, line: 1954, baseType: !967, size: 32, align: 32, offset: 1984)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1099, file: !14, line: 1960, baseType: !967, size: 32, align: 32, offset: 2016)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1099, file: !14, line: 1984, baseType: !967, size: 32, align: 32, offset: 2048)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1099, file: !14, line: 1991, baseType: !967, size: 32, align: 32, offset: 2080)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1099, file: !14, line: 1996, baseType: !967, size: 32, align: 32, offset: 2112)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1099, file: !14, line: 2004, baseType: !967, size: 32, align: 32, offset: 2144)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1099, file: !14, line: 2011, baseType: !967, size: 32, align: 32, offset: 2176)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1099, file: !14, line: 2018, baseType: !967, size: 32, align: 32, offset: 2208)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1099, file: !14, line: 2027, baseType: !967, size: 32, align: 32, offset: 2240)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1099, file: !14, line: 2034, baseType: !967, size: 32, align: 32, offset: 2272)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1099, file: !14, line: 2044, baseType: !967, size: 32, align: 32, offset: 2304)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1099, file: !14, line: 2054, baseType: !1425, size: 64, align: 64, offset: 2368)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1099, file: !14, line: 2061, baseType: !1425, size: 64, align: 64, offset: 2432)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1099, file: !14, line: 2066, baseType: !967, size: 32, align: 32, offset: 2496)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1099, file: !14, line: 2070, baseType: !967, size: 32, align: 32, offset: 2528)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1099, file: !14, line: 2078, baseType: !967, size: 32, align: 32, offset: 2560)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1099, file: !14, line: 2085, baseType: !967, size: 32, align: 32, offset: 2592)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1099, file: !14, line: 2092, baseType: !967, size: 32, align: 32, offset: 2624)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1099, file: !14, line: 2099, baseType: !967, size: 32, align: 32, offset: 2656)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1099, file: !14, line: 2106, baseType: !967, size: 32, align: 32, offset: 2688)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1099, file: !14, line: 2113, baseType: !967, size: 32, align: 32, offset: 2720)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1099, file: !14, line: 2120, baseType: !967, size: 32, align: 32, offset: 2752)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1099, file: !14, line: 2125, baseType: !967, size: 32, align: 32, offset: 2784)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1099, file: !14, line: 2133, baseType: !967, size: 32, align: 32, offset: 2816)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1099, file: !14, line: 2140, baseType: !967, size: 32, align: 32, offset: 2848)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1099, file: !14, line: 2145, baseType: !967, size: 32, align: 32, offset: 2880)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1099, file: !14, line: 2153, baseType: !967, size: 32, align: 32, offset: 2912)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1099, file: !14, line: 2158, baseType: !967, size: 32, align: 32, offset: 2944)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1099, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1099, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1099, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1099, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1099, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1099, file: !14, line: 2203, baseType: !967, size: 32, align: 32, offset: 3136)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1099, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1099, file: !14, line: 2212, baseType: !967, size: 32, align: 32, offset: 3200)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1099, file: !14, line: 2213, baseType: !967, size: 32, align: 32, offset: 3232)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1099, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1099, file: !14, line: 2232, baseType: !967, size: 32, align: 32, offset: 3296)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1099, file: !14, line: 2243, baseType: !967, size: 32, align: 32, offset: 3328)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1099, file: !14, line: 2249, baseType: !967, size: 32, align: 32, offset: 3360)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1099, file: !14, line: 2256, baseType: !967, size: 32, align: 32, offset: 3392)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1099, file: !14, line: 2263, baseType: !1003, size: 64, align: 64, offset: 3456)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1099, file: !14, line: 2270, baseType: !1003, size: 64, align: 64, offset: 3520)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1099, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1099, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1099, file: !14, line: 2367, baseType: !1461, size: 64, align: 64, offset: 3648)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!967, !1385, !1119, !967}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1099, file: !14, line: 2383, baseType: !967, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1099, file: !14, line: 2386, baseType: !1395, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1099, file: !14, line: 2387, baseType: !1395, size: 32, align: 32, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1099, file: !14, line: 2394, baseType: !967, size: 32, align: 32, offset: 3808)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1099, file: !14, line: 2401, baseType: !967, size: 32, align: 32, offset: 3840)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1099, file: !14, line: 2408, baseType: !967, size: 32, align: 32, offset: 3872)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1099, file: !14, line: 2415, baseType: !967, size: 32, align: 32, offset: 3904)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1099, file: !14, line: 2422, baseType: !967, size: 32, align: 32, offset: 3936)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1099, file: !14, line: 2423, baseType: !1473, size: 64, align: 64, offset: 3968)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1475, file: !14, line: 827, baseType: !967, size: 32, align: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1475, file: !14, line: 828, baseType: !967, size: 32, align: 32, offset: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1475, file: !14, line: 829, baseType: !967, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1475, file: !14, line: 830, baseType: !1395, size: 32, align: 32, offset: 96)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1099, file: !14, line: 2430, baseType: !1030, size: 64, align: 64, offset: 4032)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1099, file: !14, line: 2437, baseType: !1030, size: 64, align: 64, offset: 4096)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1099, file: !14, line: 2444, baseType: !1395, size: 32, align: 32, offset: 4160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1099, file: !14, line: 2451, baseType: !1395, size: 32, align: 32, offset: 4192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1099, file: !14, line: 2458, baseType: !967, size: 32, align: 32, offset: 4224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1099, file: !14, line: 2469, baseType: !967, size: 32, align: 32, offset: 4256)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1099, file: !14, line: 2475, baseType: !967, size: 32, align: 32, offset: 4288)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1099, file: !14, line: 2481, baseType: !967, size: 32, align: 32, offset: 4320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1099, file: !14, line: 2485, baseType: !967, size: 32, align: 32, offset: 4352)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1099, file: !14, line: 2489, baseType: !967, size: 32, align: 32, offset: 4384)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1099, file: !14, line: 2493, baseType: !967, size: 32, align: 32, offset: 4416)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1099, file: !14, line: 2501, baseType: !967, size: 32, align: 32, offset: 4448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1099, file: !14, line: 2506, baseType: !967, size: 32, align: 32, offset: 4480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1099, file: !14, line: 2510, baseType: !967, size: 32, align: 32, offset: 4512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1099, file: !14, line: 2514, baseType: !1030, size: 64, align: 64, offset: 4544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1099, file: !14, line: 2528, baseType: !1497, size: 64, align: 64, offset: 4608)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1385, !966, !967, !967}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1099, file: !14, line: 2534, baseType: !967, size: 32, align: 32, offset: 4672)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1099, file: !14, line: 2545, baseType: !967, size: 32, align: 32, offset: 4704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1099, file: !14, line: 2547, baseType: !967, size: 32, align: 32, offset: 4736)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1099, file: !14, line: 2549, baseType: !967, size: 32, align: 32, offset: 4768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1099, file: !14, line: 2551, baseType: !967, size: 32, align: 32, offset: 4800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1099, file: !14, line: 2553, baseType: !967, size: 32, align: 32, offset: 4832)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1099, file: !14, line: 2555, baseType: !967, size: 32, align: 32, offset: 4864)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1099, file: !14, line: 2557, baseType: !967, size: 32, align: 32, offset: 4896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1099, file: !14, line: 2559, baseType: !967, size: 32, align: 32, offset: 4928)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1099, file: !14, line: 2563, baseType: !967, size: 32, align: 32, offset: 4960)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1099, file: !14, line: 2571, baseType: !1511, size: 64, align: 64, offset: 4992)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1099, file: !14, line: 2579, baseType: !1511, size: 64, align: 64, offset: 5056)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1099, file: !14, line: 2586, baseType: !967, size: 32, align: 32, offset: 5120)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1099, file: !14, line: 2615, baseType: !967, size: 32, align: 32, offset: 5152)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1099, file: !14, line: 2627, baseType: !967, size: 32, align: 32, offset: 5184)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1099, file: !14, line: 2637, baseType: !967, size: 32, align: 32, offset: 5216)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1099, file: !14, line: 2681, baseType: !967, size: 32, align: 32, offset: 5248)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1099, file: !14, line: 2709, baseType: !1030, size: 64, align: 64, offset: 5312)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1099, file: !14, line: 2716, baseType: !1520, size: 64, align: 64, offset: 5376)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1529, !1533, !1539, !1543, !1544, !1545, !1546, !1552, !1553, !1554, !1555, !1556}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1522, file: !14, line: 3642, baseType: !975, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1522, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1522, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1522, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1522, file: !14, line: 3669, baseType: !967, size: 32, align: 32, offset: 160)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1522, file: !14, line: 3682, baseType: !1530, size: 64, align: 64, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!967, !1097, !1119}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1522, file: !14, line: 3698, baseType: !1534, size: 64, align: 64, offset: 256)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!967, !1097, !1537, !964}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1522, file: !14, line: 3712, baseType: !1540, size: 64, align: 64, offset: 320)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!967, !1097, !967, !1537, !964}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1522, file: !14, line: 3726, baseType: !1534, size: 64, align: 64, offset: 384)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1522, file: !14, line: 3737, baseType: !1094, size: 64, align: 64, offset: 448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1522, file: !14, line: 3746, baseType: !967, size: 32, align: 32, offset: 512)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1522, file: !14, line: 3757, baseType: !1547, size: 64, align: 64, offset: 576)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{null, !1550}
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1522, file: !14, line: 3766, baseType: !1094, size: 64, align: 64, offset: 640)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1522, file: !14, line: 3774, baseType: !1094, size: 64, align: 64, offset: 704)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1522, file: !14, line: 3780, baseType: !967, size: 32, align: 32, offset: 768)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1522, file: !14, line: 3785, baseType: !967, size: 32, align: 32, offset: 800)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1522, file: !14, line: 3795, baseType: !1557, size: 64, align: 64, offset: 832)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!967, !1097, !1156}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1099, file: !14, line: 2728, baseType: !966, size: 64, align: 64, offset: 5440)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1099, file: !14, line: 2735, baseType: !1146, size: 512, align: 64, offset: 5504)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1099, file: !14, line: 2742, baseType: !967, size: 32, align: 32, offset: 6016)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1099, file: !14, line: 2755, baseType: !967, size: 32, align: 32, offset: 6048)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1099, file: !14, line: 2776, baseType: !967, size: 32, align: 32, offset: 6080)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1099, file: !14, line: 2783, baseType: !967, size: 32, align: 32, offset: 6112)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1099, file: !14, line: 2791, baseType: !967, size: 32, align: 32, offset: 6144)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1099, file: !14, line: 2802, baseType: !1119, size: 64, align: 64, offset: 6208)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1099, file: !14, line: 2811, baseType: !967, size: 32, align: 32, offset: 6272)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1099, file: !14, line: 2821, baseType: !967, size: 32, align: 32, offset: 6304)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1099, file: !14, line: 2830, baseType: !967, size: 32, align: 32, offset: 6336)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1099, file: !14, line: 2840, baseType: !967, size: 32, align: 32, offset: 6368)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1099, file: !14, line: 2851, baseType: !1573, size: 64, align: 64, offset: 6400)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!967, !1385, !1576, !966, !1388, !967, !967}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!967, !1385, !966}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1099, file: !14, line: 2871, baseType: !1580, size: 64, align: 64, offset: 6464)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!967, !1385, !1583, !966, !1388, !967}
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!967, !1385, !966, !967, !967}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1099, file: !14, line: 2878, baseType: !967, size: 32, align: 32, offset: 6528)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1099, file: !14, line: 2885, baseType: !967, size: 32, align: 32, offset: 6560)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1099, file: !14, line: 3005, baseType: !967, size: 32, align: 32, offset: 6592)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1099, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1099, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1099, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1099, file: !14, line: 3037, baseType: !949, size: 64, align: 64, offset: 6720)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1099, file: !14, line: 3038, baseType: !967, size: 32, align: 32, offset: 6784)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1099, file: !14, line: 3050, baseType: !1003, size: 64, align: 64, offset: 6848)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1099, file: !14, line: 3065, baseType: !967, size: 32, align: 32, offset: 6912)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1099, file: !14, line: 3083, baseType: !967, size: 32, align: 32, offset: 6944)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1099, file: !14, line: 3092, baseType: !985, size: 64, align: 32, offset: 6976)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1099, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1099, file: !14, line: 3106, baseType: !985, size: 64, align: 32, offset: 7072)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1099, file: !14, line: 3113, baseType: !1601, size: 64, align: 64, offset: 7168)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1603)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609, !1610, !1611, !1614}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1604, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1604, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1604, file: !14, line: 720, baseType: !975, size: 64, align: 64, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1604, file: !14, line: 724, baseType: !975, size: 64, align: 64, offset: 128)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1604, file: !14, line: 728, baseType: !967, size: 32, align: 32, offset: 192)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1604, file: !14, line: 734, baseType: !1612, size: 64, align: 64, offset: 256)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1604, file: !14, line: 739, baseType: !1615, size: 64, align: 64, offset: 320)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1099, file: !14, line: 3129, baseType: !1030, size: 64, align: 64, offset: 7232)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1099, file: !14, line: 3130, baseType: !1030, size: 64, align: 64, offset: 7296)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1099, file: !14, line: 3131, baseType: !1030, size: 64, align: 64, offset: 7360)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1099, file: !14, line: 3132, baseType: !1030, size: 64, align: 64, offset: 7424)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1099, file: !14, line: 3139, baseType: !1511, size: 64, align: 64, offset: 7488)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1099, file: !14, line: 3147, baseType: !967, size: 32, align: 32, offset: 7552)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1099, file: !14, line: 3165, baseType: !967, size: 32, align: 32, offset: 7584)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1099, file: !14, line: 3172, baseType: !967, size: 32, align: 32, offset: 7616)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1099, file: !14, line: 3180, baseType: !967, size: 32, align: 32, offset: 7648)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1099, file: !14, line: 3191, baseType: !1425, size: 64, align: 64, offset: 7680)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1099, file: !14, line: 3199, baseType: !949, size: 64, align: 64, offset: 7744)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1099, file: !14, line: 3207, baseType: !1511, size: 64, align: 64, offset: 7808)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1099, file: !14, line: 3214, baseType: !965, size: 32, align: 32, offset: 7872)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1099, file: !14, line: 3224, baseType: !1254, size: 64, align: 64, offset: 7936)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1099, file: !14, line: 3225, baseType: !967, size: 32, align: 32, offset: 8000)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1099, file: !14, line: 3249, baseType: !1156, size: 64, align: 64, offset: 8064)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1099, file: !14, line: 3256, baseType: !967, size: 32, align: 32, offset: 8128)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1099, file: !14, line: 3271, baseType: !967, size: 32, align: 32, offset: 8160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1099, file: !14, line: 3279, baseType: !1030, size: 64, align: 64, offset: 8192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1099, file: !14, line: 3301, baseType: !1156, size: 64, align: 64, offset: 8256)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1099, file: !14, line: 3310, baseType: !967, size: 32, align: 32, offset: 8320)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1099, file: !14, line: 3337, baseType: !967, size: 32, align: 32, offset: 8352)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1099, file: !14, line: 3351, baseType: !967, size: 32, align: 32, offset: 8384)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1099, file: !14, line: 3359, baseType: !967, size: 32, align: 32, offset: 8416)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !972, file: !14, line: 3535, baseType: !1642, size: 64, align: 64, offset: 1024)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!967, !1097, !1645}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !972, file: !14, line: 3541, baseType: !1648, size: 64, align: 64, offset: 1088)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1651)
!1651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1113, line: 223, size: 128, align: 64, elements: !1652)
!1652 = !{!1653, !1654}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1651, file: !1113, line: 224, baseType: !1537, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1651, file: !1113, line: 225, baseType: !1537, size: 64, align: 64, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !972, file: !14, line: 3549, baseType: !1656, size: 64, align: 64, offset: 1152)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1092}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !972, file: !14, line: 3551, baseType: !1094, size: 64, align: 64, offset: 1216)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !972, file: !14, line: 3552, baseType: !1661, size: 64, align: 64, offset: 1280)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!967, !1097, !949, !967, !1664}
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1696}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1666, file: !14, line: 3921, baseType: !958, size: 16, align: 16)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1666, file: !14, line: 3922, baseType: !964, size: 32, align: 32, offset: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1666, file: !14, line: 3923, baseType: !964, size: 32, align: 32, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1666, file: !14, line: 3924, baseType: !965, size: 32, align: 32, offset: 96)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1666, file: !14, line: 3925, baseType: !1673, size: 64, align: 64, offset: 128)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1677)
!1677 = !{!1678, !1679, !1680, !1681, !1682, !1683, !1689, !1691, !1692, !1693, !1694, !1695}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1676, file: !14, line: 3886, baseType: !967, size: 32, align: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1676, file: !14, line: 3887, baseType: !967, size: 32, align: 32, offset: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1676, file: !14, line: 3888, baseType: !967, size: 32, align: 32, offset: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1676, file: !14, line: 3889, baseType: !967, size: 32, align: 32, offset: 96)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1676, file: !14, line: 3890, baseType: !967, size: 32, align: 32, offset: 128)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1676, file: !14, line: 3897, baseType: !1684, size: 768, align: 64, offset: 192)
!1684 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1685)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1686)
!1686 = !{!1687, !1688}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1685, file: !14, line: 3855, baseType: !1124, size: 512, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1685, file: !14, line: 3857, baseType: !1128, size: 256, align: 32, offset: 512)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1676, file: !14, line: 3903, baseType: !1690, size: 256, align: 64, offset: 960)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 64, elements: !1225)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1676, file: !14, line: 3904, baseType: !1232, size: 128, align: 32, offset: 1216)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1676, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1676, file: !14, line: 3908, baseType: !1511, size: 64, align: 64, offset: 1408)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1676, file: !14, line: 3915, baseType: !1511, size: 64, align: 64, offset: 1472)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1676, file: !14, line: 3917, baseType: !967, size: 32, align: 32, offset: 1536)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1666, file: !14, line: 3926, baseType: !1030, size: 64, align: 64, offset: 192)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !972, file: !14, line: 3564, baseType: !1698, size: 64, align: 64, offset: 1344)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!967, !1097, !1242, !1386, !1388}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !972, file: !14, line: 3566, baseType: !1702, size: 64, align: 64, offset: 1408)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!967, !1097, !966, !1388, !1242}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !972, file: !14, line: 3567, baseType: !1094, size: 64, align: 64, offset: 1472)
