; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlpenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlpenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFLPCType", file: !888, line: 43, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "FF_LPC_TYPE_DEFAULT", value: -1)
!891 = !DIEnumerator(name: "FF_LPC_TYPE_NONE", value: 0)
!892 = !DIEnumerator(name: "FF_LPC_TYPE_FIXED", value: 1)
!893 = !DIEnumerator(name: "FF_LPC_TYPE_LEVINSON", value: 2)
!894 = !DIEnumerator(name: "FF_LPC_TYPE_CHOLESKY", value: 3)
!895 = !DIEnumerator(name: "FF_LPC_TYPE_NB", value: 4)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InputBitDepth", file: !897, line: 475, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavcodec/mlpenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!898 = !{!899, !900, !901}
!899 = !DIEnumerator(name: "BITS_16", value: 0)
!900 = !DIEnumerator(name: "BITS_20", value: 1)
!901 = !DIEnumerator(name: "BITS_24", value: 2)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ParamFlags", file: !897, line: 66, size: 32, align: 32, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!904 = !DIEnumerator(name: "PARAMS_DEFAULT", value: 255)
!905 = !DIEnumerator(name: "PARAM_PRESENCE_FLAGS", value: 256)
!906 = !DIEnumerator(name: "PARAM_BLOCKSIZE", value: 128)
!907 = !DIEnumerator(name: "PARAM_MATRIX", value: 64)
!908 = !DIEnumerator(name: "PARAM_OUTSHIFT", value: 32)
!909 = !DIEnumerator(name: "PARAM_QUANTSTEP", value: 16)
!910 = !DIEnumerator(name: "PARAM_FIR", value: 8)
!911 = !DIEnumerator(name: "PARAM_IIR", value: 4)
!912 = !DIEnumerator(name: "PARAM_HUFFOFFSET", value: 2)
!913 = !DIEnumerator(name: "PARAM_PRESENT", value: 1)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MLPChMode", file: !897, line: 1440, size: 32, align: 32, elements: !915)
!915 = !{!916, !917, !918, !919}
!916 = !DIEnumerator(name: "MLP_CHMODE_LEFT_RIGHT", value: 0)
!917 = !DIEnumerator(name: "MLP_CHMODE_LEFT_SIDE", value: 1)
!918 = !DIEnumerator(name: "MLP_CHMODE_RIGHT_SIDE", value: 2)
!919 = !DIEnumerator(name: "MLP_CHMODE_MID_SIDE", value: 3)
!920 = !{!921, !955, !978, !981, !983, !988, !994, !995, !997}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelParams", file: !923, line: 93, baseType: !924)
!923 = !DIFile(filename: "libavcodec/mlp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelParams", file: !923, line: 85, size: 1312, align: 32, elements: !925)
!925 = !{!926, !946, !949, !952, !953, !954}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "filter_params", scope: !924, file: !923, line: 86, baseType: !927, size: 704, align: 32)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 704, align: 32, elements: !944)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterParams", file: !923, line: 82, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilterParams", file: !923, line: 74, size: 352, align: 32, elements: !930)
!930 = !{!931, !935, !936, !942, !943}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !929, file: !923, line: 75, baseType: !932, size: 8, align: 8)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !933, line: 48, baseType: !934)
!933 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!934 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !929, file: !923, line: 76, baseType: !932, size: 8, align: 8, offset: 8)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !929, file: !923, line: 78, baseType: !937, size: 256, align: 32, offset: 32)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 256, align: 32, elements: !940)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !933, line: 38, baseType: !939)
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !{!941}
!941 = !DISubrange(count: 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "coeff_bits", scope: !929, file: !923, line: 80, baseType: !939, size: 32, align: 32, offset: 288)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "coeff_shift", scope: !929, file: !923, line: 81, baseType: !939, size: 32, align: 32, offset: 320)
!944 = !{!945}
!945 = !DISubrange(count: 2)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !924, file: !923, line: 87, baseType: !947, size: 512, align: 32, offset: 704)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 512, align: 32, elements: !948)
!948 = !{!945, !941}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "huff_offset", scope: !924, file: !923, line: 89, baseType: !950, size: 16, align: 16, offset: 1216)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !933, line: 37, baseType: !951)
!951 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "sign_huff_offset", scope: !924, file: !923, line: 90, baseType: !938, size: 32, align: 32, offset: 1248)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "codebook", scope: !924, file: !923, line: 91, baseType: !932, size: 8, align: 8, offset: 1280)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "huff_lsbs", scope: !924, file: !923, line: 92, baseType: !932, size: 8, align: 8, offset: 1288)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingParams", file: !897, line: 86, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !897, line: 79, size: 5472, align: 32, elements: !958)
!958 = !{!959, !962, !964, !980}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !957, file: !897, line: 80, baseType: !960, size: 16, align: 16)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !933, line: 49, baseType: !961)
!961 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "quant_step_size", scope: !957, file: !897, line: 81, baseType: !963, size: 64, align: 8, offset: 16)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 64, align: 8, elements: !940)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_params", scope: !957, file: !897, line: 83, baseType: !965, size: 5344, align: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatrixParams", file: !897, line: 64, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !897, line: 55, size: 5344, align: 32, elements: !967)
!967 = !{!968, !969, !970, !974, !975, !976}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !966, file: !897, line: 56, baseType: !932, size: 8, align: 8)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "outch", scope: !966, file: !897, line: 58, baseType: !963, size: 64, align: 8, offset: 8)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "forco", scope: !966, file: !897, line: 59, baseType: !971, size: 2560, align: 32, offset: 96)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 2560, align: 32, elements: !972)
!972 = !{!941, !973}
!973 = !DISubrange(count: 10)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !966, file: !897, line: 60, baseType: !971, size: 2560, align: 32, offset: 2656)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fbits", scope: !966, file: !897, line: 61, baseType: !963, size: 64, align: 8, offset: 5216)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !966, file: !897, line: 63, baseType: !977, size: 64, align: 8, offset: 5280)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 64, align: 8, elements: !940)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !933, line: 36, baseType: !979)
!979 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "param_presence_flags", scope: !957, file: !897, line: 85, baseType: !932, size: 8, align: 8, offset: 5440)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !933, line: 40, baseType: !982)
!982 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !985, line: 222, size: 16, align: 8, elements: !986)
!985 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !984, file: !985, line: 222, baseType: !960, size: 16, align: 16)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !985, line: 221, size: 32, align: 8, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !989, file: !985, line: 221, baseType: !992, size: 32, align: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !933, line: 51, baseType: !993)
!993 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!999 = !{!1000, !1719, !1720, !1722, !1724, !1728, !1738}
!1000 = distinct !DIGlobalVariable(name: "ff_mlp_encoder", scope: !0, file: !897, line: 2386, type: !1001, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mlp_encoder)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1003)
!1003 = !{!1004, !1008, !1009, !1010, !1011, !1012, !1021, !1024, !1027, !1030, !1035, !1036, !1077, !1085, !1086, !1087, !1089, !1634, !1640, !1648, !1652, !1653, !1690, !1694, !1698, !1699, !1703, !1707, !1708, !1712, !1713, !1714}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !14, line: 3475, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1002, file: !14, line: 3480, baseType: !1005, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1002, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1002, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1002, file: !14, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1002, file: !14, line: 3488, baseType: !1013, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1016, line: 61, baseType: !1017)
!1016 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1016, line: 58, size: 64, align: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !1016, line: 59, baseType: !939, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1017, file: !1016, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1002, file: !14, line: 3489, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1002, file: !14, line: 3490, baseType: !1025, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1002, file: !14, line: 3491, baseType: !1028, size: 64, align: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1002, file: !14, line: 3492, baseType: !1031, size: 64, align: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !933, line: 55, baseType: !1034)
!1034 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1002, file: !14, line: 3493, baseType: !932, size: 8, align: 8, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1002, file: !14, line: 3494, baseType: !1037, size: 64, align: 64, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1047, !1051, !1052, !1053, !1054, !1058, !1064, !1066, !1070}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1040, file: !691, line: 72, baseType: !1005, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1040, file: !691, line: 78, baseType: !1044, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1005, !994}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1040, file: !691, line: 85, baseType: !1048, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1040, file: !691, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1040, file: !691, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1040, file: !691, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1040, file: !691, line: 113, baseType: !1055, size: 64, align: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!994, !994, !994}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1040, file: !691, line: 123, baseType: !1059, size: 64, align: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!1062, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1040, file: !691, line: 130, baseType: !1065, size: 32, align: 32, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1040, file: !691, line: 136, baseType: !1067, size: 64, align: 64, offset: 512)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!1065, !994}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1040, file: !691, line: 142, baseType: !1071, size: 64, align: 64, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!939, !1074, !994, !1005, !939}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1002, file: !14, line: 3495, baseType: !1078, size: 64, align: 64, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1081, file: !14, line: 3402, baseType: !939, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !14, line: 3403, baseType: !1005, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1002, file: !14, line: 3507, baseType: !1005, size: 64, align: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1002, file: !14, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !14, line: 3517, baseType: !1088, size: 64, align: 64, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1002, file: !14, line: 3527, baseType: !1090, size: 64, align: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!939, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1103, !1104, !1105, !1106, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1382, !1386, !1387, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1572, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1095, file: !14, line: 1561, baseType: !1037, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1095, file: !14, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1095, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1095, file: !14, line: 1565, baseType: !1101, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1095, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1095, file: !14, line: 1581, baseType: !993, size: 32, align: 32, offset: 224)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1095, file: !14, line: 1583, baseType: !994, size: 64, align: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1095, file: !14, line: 1591, baseType: !1107, size: 64, align: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1109, line: 129, size: 1664, align: 64, elements: !1110)
!1109 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1110 = !{!1111, !1112, !1113, !1114, !1208, !1229, !1230, !1259, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1108, file: !1109, line: 136, baseType: !939, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1108, file: !1109, line: 151, baseType: !939, size: 32, align: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1108, file: !1109, line: 157, baseType: !939, size: 32, align: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1108, file: !1109, line: 159, baseType: !1115, size: 64, align: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1118)
!1118 = !{!1119, !1122, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1162, !1164, !1165, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1196, !1197, !1198, !1199, !1200, !1201, !1204, !1205, !1206, !1207}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !722, line: 282, baseType: !1120, size: 512, align: 64)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !940)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1117, file: !722, line: 299, baseType: !1123, size: 256, align: 32, offset: 512)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !940)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1117, file: !722, line: 315, baseType: !1125, size: 64, align: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1117, file: !722, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1117, file: !722, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1117, file: !722, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1117, file: !722, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1117, file: !722, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1117, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1117, file: !722, line: 356, baseType: !1015, size: 64, align: 32, offset: 1024)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1117, file: !722, line: 361, baseType: !981, size: 64, align: 64, offset: 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1117, file: !722, line: 369, baseType: !981, size: 64, align: 64, offset: 1152)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1117, file: !722, line: 377, baseType: !981, size: 64, align: 64, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1117, file: !722, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1117, file: !722, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1117, file: !722, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1117, file: !722, line: 396, baseType: !994, size: 64, align: 64, offset: 1408)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1117, file: !722, line: 403, baseType: !1141, size: 512, align: 64, offset: 1472)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 64, elements: !940)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1117, file: !722, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1117, file: !722, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1117, file: !722, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1117, file: !722, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1117, file: !722, line: 435, baseType: !981, size: 64, align: 64, offset: 2112)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1117, file: !722, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1117, file: !722, line: 445, baseType: !1033, size: 64, align: 64, offset: 2240)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1117, file: !722, line: 459, baseType: !1150, size: 512, align: 64, offset: 2304)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 512, align: 64, elements: !940)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1153, line: 94, baseType: !1154)
!1153 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1153, line: 81, size: 192, align: 64, elements: !1155)
!1155 = !{!1156, !1160, !1161}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1154, file: !1153, line: 82, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1153, line: 73, baseType: !1159)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1153, line: 73, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !1153, line: 89, baseType: !1121, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !1153, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1117, file: !722, line: 473, baseType: !1163, size: 64, align: 64, offset: 2816)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1117, file: !722, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1117, file: !722, line: 479, baseType: !1166, size: 64, align: 64, offset: 2944)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1179}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1169, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1169, file: !722, line: 203, baseType: !1121, size: 64, align: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1169, file: !722, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1169, file: !722, line: 205, baseType: !1175, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1177, line: 86, baseType: !1178)
!1177 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1177, line: 86, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1169, file: !722, line: 206, baseType: !1151, size: 64, align: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1117, file: !722, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1117, file: !722, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1117, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1117, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1117, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1117, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1117, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1117, file: !722, line: 532, baseType: !981, size: 64, align: 64, offset: 3264)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1117, file: !722, line: 539, baseType: !981, size: 64, align: 64, offset: 3328)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1117, file: !722, line: 547, baseType: !981, size: 64, align: 64, offset: 3392)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1117, file: !722, line: 554, baseType: !1175, size: 64, align: 64, offset: 3456)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1117, file: !722, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1117, file: !722, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1117, file: !722, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1117, file: !722, line: 588, baseType: !1195, size: 64, align: 64, offset: 3648)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1117, file: !722, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1117, file: !722, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1117, file: !722, line: 599, baseType: !1151, size: 64, align: 64, offset: 3776)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1117, file: !722, line: 605, baseType: !1151, size: 64, align: 64, offset: 3840)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1117, file: !722, line: 616, baseType: !1151, size: 64, align: 64, offset: 3904)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1117, file: !722, line: 626, baseType: !1202, size: 64, align: 64, offset: 3968)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1203, line: 216, baseType: !1034)
!1203 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1117, file: !722, line: 627, baseType: !1202, size: 64, align: 64, offset: 4032)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1117, file: !722, line: 628, baseType: !1202, size: 64, align: 64, offset: 4096)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1117, file: !722, line: 629, baseType: !1202, size: 64, align: 64, offset: 4160)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1117, file: !722, line: 645, baseType: !1151, size: 64, align: 64, offset: 4224)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1108, file: !1109, line: 161, baseType: !1209, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1109, line: 117, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1109, line: 100, size: 832, align: 64, elements: !1212)
!1212 = !{!1213, !1220, !1221, !1222, !1223, !1224, !1226, !1227, !1228}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1211, file: !1109, line: 105, baseType: !1214, size: 256, align: 64)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 256, align: 64, elements: !1218)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1153, line: 238, baseType: !1217)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1153, line: 238, flags: DIFlagFwdDecl)
!1218 = !{!1219}
!1219 = !DISubrange(count: 4)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1211, file: !1109, line: 110, baseType: !939, size: 32, align: 32, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1211, file: !1109, line: 111, baseType: !939, size: 32, align: 32, offset: 288)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1211, file: !1109, line: 111, baseType: !939, size: 32, align: 32, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1211, file: !1109, line: 112, baseType: !1123, size: 256, align: 32, offset: 352)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1211, file: !1109, line: 113, baseType: !1225, size: 128, align: 32, offset: 608)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1218)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1211, file: !1109, line: 114, baseType: !939, size: 32, align: 32, offset: 736)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1211, file: !1109, line: 115, baseType: !939, size: 32, align: 32, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1211, file: !1109, line: 116, baseType: !939, size: 32, align: 32, offset: 800)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1108, file: !1109, line: 163, baseType: !994, size: 64, align: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1108, file: !1109, line: 165, baseType: !1231, size: 128, align: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1109, line: 122, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1109, line: 119, size: 128, align: 64, elements: !1233)
!1233 = !{!1234, !1258}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1232, file: !1109, line: 120, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1254, !1255, !1256, !1257}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1237, file: !14, line: 1451, baseType: !1151, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1237, file: !14, line: 1461, baseType: !981, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1237, file: !14, line: 1467, baseType: !981, size: 64, align: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !14, line: 1468, baseType: !1121, size: 64, align: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1237, file: !14, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1237, file: !14, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1237, file: !14, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1237, file: !14, line: 1479, baseType: !1247, size: 64, align: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1249, file: !14, line: 1412, baseType: !1121, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1249, file: !14, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1249, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1237, file: !14, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1237, file: !14, line: 1486, baseType: !981, size: 64, align: 64, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1237, file: !14, line: 1488, baseType: !981, size: 64, align: 64, offset: 576)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1237, file: !14, line: 1497, baseType: !981, size: 64, align: 64, offset: 640)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1232, file: !1109, line: 121, baseType: !1115, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1108, file: !1109, line: 166, baseType: !1260, size: 128, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1109, line: 127, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1109, line: 124, size: 128, align: 64, elements: !1262)
!1262 = !{!1263, !1336}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1261, file: !1109, line: 125, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1268)
!1268 = !{!1269, !1270, !1294, !1298, !1299, !1333, !1334, !1335}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1267, file: !14, line: 5751, baseType: !1037, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1267, file: !14, line: 5756, baseType: !1271, size: 64, align: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1274)
!1274 = !{!1275, !1276, !1279, !1280, !1281, !1285, !1289, !1293}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1273, file: !14, line: 5797, baseType: !1005, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1273, file: !14, line: 5804, baseType: !1277, size: 64, align: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1273, file: !14, line: 5815, baseType: !1037, size: 64, align: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1273, file: !14, line: 5825, baseType: !939, size: 32, align: 32, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1273, file: !14, line: 5826, baseType: !1282, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!939, !1265}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1273, file: !14, line: 5827, baseType: !1286, size: 64, align: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!939, !1265, !1235}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1273, file: !14, line: 5828, baseType: !1290, size: 64, align: 64, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1265}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1273, file: !14, line: 5829, baseType: !1290, size: 64, align: 64, offset: 448)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1267, file: !14, line: 5762, baseType: !1295, size: 64, align: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1297)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1267, file: !14, line: 5768, baseType: !994, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1267, file: !14, line: 5775, baseType: !1300, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1302, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1302, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1302, file: !14, line: 3948, baseType: !992, size: 32, align: 32, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1302, file: !14, line: 3958, baseType: !1121, size: 64, align: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1302, file: !14, line: 3962, baseType: !939, size: 32, align: 32, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1302, file: !14, line: 3968, baseType: !939, size: 32, align: 32, offset: 224)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1302, file: !14, line: 3973, baseType: !981, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1302, file: !14, line: 3986, baseType: !939, size: 32, align: 32, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1302, file: !14, line: 3999, baseType: !939, size: 32, align: 32, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1302, file: !14, line: 4004, baseType: !939, size: 32, align: 32, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1302, file: !14, line: 4005, baseType: !939, size: 32, align: 32, offset: 416)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1302, file: !14, line: 4010, baseType: !939, size: 32, align: 32, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1302, file: !14, line: 4011, baseType: !939, size: 32, align: 32, offset: 480)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1302, file: !14, line: 4020, baseType: !1015, size: 64, align: 32, offset: 512)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1302, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1302, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1302, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1302, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1302, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1302, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1302, file: !14, line: 4039, baseType: !939, size: 32, align: 32, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1302, file: !14, line: 4046, baseType: !1033, size: 64, align: 64, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1302, file: !14, line: 4050, baseType: !939, size: 32, align: 32, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1302, file: !14, line: 4054, baseType: !939, size: 32, align: 32, offset: 928)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1302, file: !14, line: 4061, baseType: !939, size: 32, align: 32, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1302, file: !14, line: 4065, baseType: !939, size: 32, align: 32, offset: 992)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1302, file: !14, line: 4073, baseType: !939, size: 32, align: 32, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1302, file: !14, line: 4080, baseType: !939, size: 32, align: 32, offset: 1056)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1302, file: !14, line: 4084, baseType: !939, size: 32, align: 32, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1267, file: !14, line: 5781, baseType: !1300, size: 64, align: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1267, file: !14, line: 5787, baseType: !1015, size: 64, align: 32, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1267, file: !14, line: 5793, baseType: !1015, size: 64, align: 32, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1261, file: !1109, line: 126, baseType: !939, size: 32, align: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1108, file: !1109, line: 172, baseType: !1235, size: 64, align: 64, offset: 576)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1108, file: !1109, line: 177, baseType: !1121, size: 64, align: 64, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1108, file: !1109, line: 178, baseType: !993, size: 32, align: 32, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1108, file: !1109, line: 180, baseType: !994, size: 64, align: 64, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1108, file: !1109, line: 185, baseType: !939, size: 32, align: 32, offset: 832)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1108, file: !1109, line: 190, baseType: !994, size: 64, align: 64, offset: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1108, file: !1109, line: 195, baseType: !939, size: 32, align: 32, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1108, file: !1109, line: 200, baseType: !1235, size: 64, align: 64, offset: 1024)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1108, file: !1109, line: 201, baseType: !939, size: 32, align: 32, offset: 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1108, file: !1109, line: 202, baseType: !1115, size: 64, align: 64, offset: 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1108, file: !1109, line: 203, baseType: !939, size: 32, align: 32, offset: 1216)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1108, file: !1109, line: 205, baseType: !939, size: 32, align: 32, offset: 1248)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1108, file: !1109, line: 206, baseType: !939, size: 32, align: 32, offset: 1280)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1108, file: !1109, line: 209, baseType: !1202, size: 64, align: 64, offset: 1344)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1108, file: !1109, line: 212, baseType: !1202, size: 64, align: 64, offset: 1408)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1108, file: !1109, line: 213, baseType: !1115, size: 64, align: 64, offset: 1472)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1108, file: !1109, line: 215, baseType: !939, size: 32, align: 32, offset: 1536)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1108, file: !1109, line: 217, baseType: !939, size: 32, align: 32, offset: 1568)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1108, file: !1109, line: 220, baseType: !939, size: 32, align: 32, offset: 1600)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1095, file: !14, line: 1598, baseType: !994, size: 64, align: 64, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1095, file: !14, line: 1606, baseType: !981, size: 64, align: 64, offset: 448)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1095, file: !14, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1095, file: !14, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1095, file: !14, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1095, file: !14, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1095, file: !14, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1095, file: !14, line: 1657, baseType: !1121, size: 64, align: 64, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1095, file: !14, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1095, file: !14, line: 1679, baseType: !1015, size: 64, align: 32, offset: 800)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1095, file: !14, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1095, file: !14, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1095, file: !14, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1095, file: !14, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1095, file: !14, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1095, file: !14, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1095, file: !14, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1095, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1095, file: !14, line: 1791, baseType: !1375, size: 64, align: 64, offset: 1152)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !1378, !1379, !1381, !939, !939, !939}
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1095, file: !14, line: 1808, baseType: !1383, size: 64, align: 64, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!473, !1378, !1022}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1095, file: !14, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1095, file: !14, line: 1825, baseType: !1388, size: 32, align: 32, offset: 1312)
!1388 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1095, file: !14, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1095, file: !14, line: 1838, baseType: !1388, size: 32, align: 32, offset: 1376)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1095, file: !14, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1095, file: !14, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1095, file: !14, line: 1861, baseType: !1388, size: 32, align: 32, offset: 1472)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1095, file: !14, line: 1868, baseType: !1388, size: 32, align: 32, offset: 1504)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1095, file: !14, line: 1875, baseType: !1388, size: 32, align: 32, offset: 1536)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1095, file: !14, line: 1882, baseType: !1388, size: 32, align: 32, offset: 1568)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1095, file: !14, line: 1889, baseType: !1388, size: 32, align: 32, offset: 1600)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1095, file: !14, line: 1896, baseType: !1388, size: 32, align: 32, offset: 1632)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1095, file: !14, line: 1903, baseType: !1388, size: 32, align: 32, offset: 1664)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1095, file: !14, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1095, file: !14, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1095, file: !14, line: 1926, baseType: !1381, size: 64, align: 64, offset: 1792)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1095, file: !14, line: 1935, baseType: !1015, size: 64, align: 32, offset: 1856)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1095, file: !14, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1095, file: !14, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1095, file: !14, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1095, file: !14, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1095, file: !14, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1095, file: !14, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1095, file: !14, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1095, file: !14, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1095, file: !14, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1095, file: !14, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1095, file: !14, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1095, file: !14, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1095, file: !14, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1095, file: !14, line: 2054, baseType: !1418, size: 64, align: 64, offset: 2368)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1095, file: !14, line: 2061, baseType: !1418, size: 64, align: 64, offset: 2432)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1095, file: !14, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1095, file: !14, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1095, file: !14, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1095, file: !14, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1095, file: !14, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1095, file: !14, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1095, file: !14, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1095, file: !14, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1095, file: !14, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1095, file: !14, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1095, file: !14, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1095, file: !14, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1095, file: !14, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1095, file: !14, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1095, file: !14, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1095, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1095, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1095, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1095, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1095, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1095, file: !14, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1095, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1095, file: !14, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1095, file: !14, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1095, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1095, file: !14, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1095, file: !14, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1095, file: !14, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1095, file: !14, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1095, file: !14, line: 2263, baseType: !1033, size: 64, align: 64, offset: 3456)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1095, file: !14, line: 2270, baseType: !1033, size: 64, align: 64, offset: 3520)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1095, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1095, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1095, file: !14, line: 2367, baseType: !1454, size: 64, align: 64, offset: 3648)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!939, !1378, !1115, !939}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1095, file: !14, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1095, file: !14, line: 2386, baseType: !1388, size: 32, align: 32, offset: 3744)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1095, file: !14, line: 2387, baseType: !1388, size: 32, align: 32, offset: 3776)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1095, file: !14, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1095, file: !14, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1095, file: !14, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1095, file: !14, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1095, file: !14, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1095, file: !14, line: 2423, baseType: !1466, size: 64, align: 64, offset: 3968)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1468, file: !14, line: 827, baseType: !939, size: 32, align: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1468, file: !14, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1468, file: !14, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1468, file: !14, line: 830, baseType: !1388, size: 32, align: 32, offset: 96)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1095, file: !14, line: 2430, baseType: !981, size: 64, align: 64, offset: 4032)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1095, file: !14, line: 2437, baseType: !981, size: 64, align: 64, offset: 4096)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1095, file: !14, line: 2444, baseType: !1388, size: 32, align: 32, offset: 4160)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1095, file: !14, line: 2451, baseType: !1388, size: 32, align: 32, offset: 4192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1095, file: !14, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1095, file: !14, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1095, file: !14, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1095, file: !14, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1095, file: !14, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1095, file: !14, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1095, file: !14, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1095, file: !14, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1095, file: !14, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1095, file: !14, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1095, file: !14, line: 2514, baseType: !981, size: 64, align: 64, offset: 4544)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1095, file: !14, line: 2528, baseType: !1490, size: 64, align: 64, offset: 4608)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !1378, !994, !939, !939}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1095, file: !14, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1095, file: !14, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1095, file: !14, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1095, file: !14, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1095, file: !14, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1095, file: !14, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1095, file: !14, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1095, file: !14, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1095, file: !14, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1095, file: !14, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1095, file: !14, line: 2571, baseType: !1504, size: 64, align: 64, offset: 4992)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1095, file: !14, line: 2579, baseType: !1504, size: 64, align: 64, offset: 5056)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1095, file: !14, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1095, file: !14, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1095, file: !14, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1095, file: !14, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1095, file: !14, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1095, file: !14, line: 2709, baseType: !981, size: 64, align: 64, offset: 5312)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1095, file: !14, line: 2716, baseType: !1513, size: 64, align: 64, offset: 5376)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520, !1521, !1522, !1526, !1532, !1536, !1537, !1538, !1539, !1545, !1546, !1547, !1548, !1549}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1515, file: !14, line: 3642, baseType: !1005, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1515, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1515, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1515, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1515, file: !14, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1515, file: !14, line: 3682, baseType: !1523, size: 64, align: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!939, !1093, !1115}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1515, file: !14, line: 3698, baseType: !1527, size: 64, align: 64, offset: 256)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!939, !1093, !1530, !992}
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1515, file: !14, line: 3712, baseType: !1533, size: 64, align: 64, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!939, !1093, !939, !1530, !992}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1515, file: !14, line: 3726, baseType: !1527, size: 64, align: 64, offset: 384)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1515, file: !14, line: 3737, baseType: !1090, size: 64, align: 64, offset: 448)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1515, file: !14, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1515, file: !14, line: 3757, baseType: !1540, size: 64, align: 64, offset: 576)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{null, !1543}
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1515, file: !14, line: 3766, baseType: !1090, size: 64, align: 64, offset: 640)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1515, file: !14, line: 3774, baseType: !1090, size: 64, align: 64, offset: 704)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1515, file: !14, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1515, file: !14, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1515, file: !14, line: 3795, baseType: !1550, size: 64, align: 64, offset: 832)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!939, !1093, !1151}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1095, file: !14, line: 2728, baseType: !994, size: 64, align: 64, offset: 5440)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1095, file: !14, line: 2735, baseType: !1141, size: 512, align: 64, offset: 5504)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1095, file: !14, line: 2742, baseType: !939, size: 32, align: 32, offset: 6016)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1095, file: !14, line: 2755, baseType: !939, size: 32, align: 32, offset: 6048)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1095, file: !14, line: 2776, baseType: !939, size: 32, align: 32, offset: 6080)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1095, file: !14, line: 2783, baseType: !939, size: 32, align: 32, offset: 6112)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1095, file: !14, line: 2791, baseType: !939, size: 32, align: 32, offset: 6144)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1095, file: !14, line: 2802, baseType: !1115, size: 64, align: 64, offset: 6208)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1095, file: !14, line: 2811, baseType: !939, size: 32, align: 32, offset: 6272)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1095, file: !14, line: 2821, baseType: !939, size: 32, align: 32, offset: 6304)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1095, file: !14, line: 2830, baseType: !939, size: 32, align: 32, offset: 6336)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1095, file: !14, line: 2840, baseType: !939, size: 32, align: 32, offset: 6368)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1095, file: !14, line: 2851, baseType: !1566, size: 64, align: 64, offset: 6400)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!939, !1378, !1569, !994, !1381, !939, !939}
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!939, !1378, !994}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1095, file: !14, line: 2871, baseType: !1573, size: 64, align: 64, offset: 6464)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!939, !1378, !1576, !994, !1381, !939}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!939, !1378, !994, !939, !939}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1095, file: !14, line: 2878, baseType: !939, size: 32, align: 32, offset: 6528)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1095, file: !14, line: 2885, baseType: !939, size: 32, align: 32, offset: 6560)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1095, file: !14, line: 3005, baseType: !939, size: 32, align: 32, offset: 6592)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1095, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1095, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1095, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1095, file: !14, line: 3037, baseType: !1121, size: 64, align: 64, offset: 6720)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1095, file: !14, line: 3038, baseType: !939, size: 32, align: 32, offset: 6784)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1095, file: !14, line: 3050, baseType: !1033, size: 64, align: 64, offset: 6848)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1095, file: !14, line: 3065, baseType: !939, size: 32, align: 32, offset: 6912)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1095, file: !14, line: 3083, baseType: !939, size: 32, align: 32, offset: 6944)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1095, file: !14, line: 3092, baseType: !1015, size: 64, align: 32, offset: 6976)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1095, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1095, file: !14, line: 3106, baseType: !1015, size: 64, align: 32, offset: 7072)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1095, file: !14, line: 3113, baseType: !1594, size: 64, align: 64, offset: 7168)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1596)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602, !1603, !1604, !1607}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1597, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1597, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1597, file: !14, line: 720, baseType: !1005, size: 64, align: 64, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1597, file: !14, line: 724, baseType: !1005, size: 64, align: 64, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1597, file: !14, line: 728, baseType: !939, size: 32, align: 32, offset: 192)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1597, file: !14, line: 734, baseType: !1605, size: 64, align: 64, offset: 256)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1597, file: !14, line: 739, baseType: !1608, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1095, file: !14, line: 3129, baseType: !981, size: 64, align: 64, offset: 7232)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1095, file: !14, line: 3130, baseType: !981, size: 64, align: 64, offset: 7296)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1095, file: !14, line: 3131, baseType: !981, size: 64, align: 64, offset: 7360)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1095, file: !14, line: 3132, baseType: !981, size: 64, align: 64, offset: 7424)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1095, file: !14, line: 3139, baseType: !1504, size: 64, align: 64, offset: 7488)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1095, file: !14, line: 3147, baseType: !939, size: 32, align: 32, offset: 7552)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1095, file: !14, line: 3165, baseType: !939, size: 32, align: 32, offset: 7584)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1095, file: !14, line: 3172, baseType: !939, size: 32, align: 32, offset: 7616)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1095, file: !14, line: 3180, baseType: !939, size: 32, align: 32, offset: 7648)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1095, file: !14, line: 3191, baseType: !1418, size: 64, align: 64, offset: 7680)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1095, file: !14, line: 3199, baseType: !1121, size: 64, align: 64, offset: 7744)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1095, file: !14, line: 3207, baseType: !1504, size: 64, align: 64, offset: 7808)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1095, file: !14, line: 3214, baseType: !993, size: 32, align: 32, offset: 7872)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1095, file: !14, line: 3224, baseType: !1247, size: 64, align: 64, offset: 7936)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1095, file: !14, line: 3225, baseType: !939, size: 32, align: 32, offset: 8000)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1095, file: !14, line: 3249, baseType: !1151, size: 64, align: 64, offset: 8064)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1095, file: !14, line: 3256, baseType: !939, size: 32, align: 32, offset: 8128)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1095, file: !14, line: 3271, baseType: !939, size: 32, align: 32, offset: 8160)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1095, file: !14, line: 3279, baseType: !981, size: 64, align: 64, offset: 8192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1095, file: !14, line: 3301, baseType: !1151, size: 64, align: 64, offset: 8256)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1095, file: !14, line: 3310, baseType: !939, size: 32, align: 32, offset: 8320)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1095, file: !14, line: 3337, baseType: !939, size: 32, align: 32, offset: 8352)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1095, file: !14, line: 3351, baseType: !939, size: 32, align: 32, offset: 8384)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1095, file: !14, line: 3359, baseType: !939, size: 32, align: 32, offset: 8416)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1002, file: !14, line: 3535, baseType: !1635, size: 64, align: 64, offset: 1024)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!939, !1093, !1638}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1002, file: !14, line: 3541, baseType: !1641, size: 64, align: 64, offset: 1088)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1644)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1109, line: 223, size: 128, align: 64, elements: !1645)
!1645 = !{!1646, !1647}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1644, file: !1109, line: 224, baseType: !1530, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1644, file: !1109, line: 225, baseType: !1530, size: 64, align: 64, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1002, file: !14, line: 3549, baseType: !1649, size: 64, align: 64, offset: 1152)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !1088}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1002, file: !14, line: 3551, baseType: !1090, size: 64, align: 64, offset: 1216)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1002, file: !14, line: 3552, baseType: !1654, size: 64, align: 64, offset: 1280)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!939, !1093, !1121, !939, !1657}
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664, !1665, !1689}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1659, file: !14, line: 3921, baseType: !960, size: 16, align: 16)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1659, file: !14, line: 3922, baseType: !992, size: 32, align: 32, offset: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1659, file: !14, line: 3923, baseType: !992, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1659, file: !14, line: 3924, baseType: !993, size: 32, align: 32, offset: 96)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1659, file: !14, line: 3925, baseType: !1666, size: 64, align: 64, offset: 128)
