; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--opus.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.OpusPacket = type { i32, i32, i32, i32, i32, i32, i32, [48 x i32], [48 x i32], i32, i32, i32 }

!911 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltBlockSize", file: !913, line: 56, size: 32, align: 32, elements: !914)
!913 = !DIFile(filename: "libavcodec/opus_celt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = !{!915, !916, !917, !918, !919}
!915 = !DIEnumerator(name: "CELT_BLOCK_120", value: 0)
!916 = !DIEnumerator(name: "CELT_BLOCK_240", value: 1)
!917 = !DIEnumerator(name: "CELT_BLOCK_480", value: 2)
!918 = !DIEnumerator(name: "CELT_BLOCK_960", value: 3)
!919 = !DIEnumerator(name: "CELT_BLOCK_NB", value: 4)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltSpread", file: !913, line: 49, size: 32, align: 32, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIEnumerator(name: "CELT_SPREAD_NONE", value: 0)
!923 = !DIEnumerator(name: "CELT_SPREAD_LIGHT", value: 1)
!924 = !DIEnumerator(name: "CELT_SPREAD_NORMAL", value: 2)
!925 = !DIEnumerator(name: "CELT_SPREAD_AGGRESSIVE", value: 3)
!926 = !{!927, !928, !929, !938, !940, !941}
!927 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!928 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !932, line: 222, size: 16, align: 8, elements: !933)
!932 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !931, file: !932, line: 222, baseType: !935, size: 16, align: 16)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !936, line: 49, baseType: !937)
!936 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!937 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !936, line: 48, baseType: !939)
!939 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !936, line: 51, baseType: !928)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !936, line: 55, baseType: !942)
!942 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!943 = !{!944, !2025, !2030}
!944 = distinct !DIGlobalVariable(name: "default_channel_map", scope: !945, file: !946, line: 295, type: !2024, isLocal: true, isDefinition: true, variable: [2 x i8]* @ff_opus_parse_extradata.default_channel_map)
!945 = distinct !DISubprogram(name: "ff_opus_parse_extradata", scope: !946, file: !946, line: 292, type: !947, isLocal: false, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2023)
!946 = !DIFile(filename: "libavcodec/opus.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!947 = !DISubroutineType(types: !948)
!948 = !{!927, !949, !1671}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !50, line: 3360, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !50, line: 1556, size: 8448, align: 64, elements: !952)
!952 = !{!953, !998, !999, !1000, !1269, !1270, !1271, !1272, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1425, !1429, !1430, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1609, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !951, file: !50, line: 1561, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !958)
!958 = !{!959, !963, !968, !972, !973, !974, !975, !979, !985, !987, !991}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !957, file: !19, line: 72, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !957, file: !19, line: 78, baseType: !964, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!960, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !957, file: !19, line: 85, baseType: !969, size: 64, align: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !957, file: !19, line: 93, baseType: !927, size: 32, align: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !957, file: !19, line: 99, baseType: !927, size: 32, align: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !957, file: !19, line: 108, baseType: !927, size: 32, align: 32, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !957, file: !19, line: 113, baseType: !976, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!967, !967, !967}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !957, file: !19, line: 123, baseType: !980, size: 64, align: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !957, file: !19, line: 130, baseType: !986, size: 32, align: 32, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !957, file: !19, line: 136, baseType: !988, size: 64, align: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!986, !967}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !957, file: !19, line: 142, baseType: !992, size: 64, align: 64, offset: 576)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!927, !995, !967, !960, !927}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !951, file: !50, line: 1562, baseType: !927, size: 32, align: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !951, file: !50, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !951, file: !50, line: 1565, baseType: !1001, size: 64, align: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !50, line: 3468, size: 1984, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1019, !1022, !1025, !1028, !1031, !1032, !1033, !1041, !1042, !1043, !1045, !1049, !1055, !1066, !1070, !1071, !1119, !1240, !1244, !1245, !1249, !1253, !1258, !1262, !1263, !1264}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !50, line: 3475, baseType: !960, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1003, file: !50, line: 3480, baseType: !960, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1003, file: !50, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1003, file: !50, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1003, file: !50, line: 3487, baseType: !927, size: 32, align: 32, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1003, file: !50, line: 3488, baseType: !1011, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1014, line: 61, baseType: !1015)
!1014 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1014, line: 58, size: 64, align: 32, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1015, file: !1014, line: 59, baseType: !927, size: 32, align: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1015, file: !1014, line: 60, baseType: !927, size: 32, align: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1003, file: !50, line: 3489, baseType: !1020, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1003, file: !50, line: 3490, baseType: !1023, size: 64, align: 64, offset: 384)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1003, file: !50, line: 3491, baseType: !1026, size: 64, align: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1003, file: !50, line: 3492, baseType: !1029, size: 64, align: 64, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1003, file: !50, line: 3493, baseType: !938, size: 8, align: 8, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1003, file: !50, line: 3494, baseType: !954, size: 64, align: 64, offset: 640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1003, file: !50, line: 3495, baseType: !1034, size: 64, align: 64, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !50, line: 3404, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !50, line: 3401, size: 128, align: 64, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1037, file: !50, line: 3402, baseType: !927, size: 32, align: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1037, file: !50, line: 3403, baseType: !960, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1003, file: !50, line: 3507, baseType: !960, size: 64, align: 64, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1003, file: !50, line: 3516, baseType: !927, size: 32, align: 32, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !50, line: 3517, baseType: !1044, size: 64, align: 64, offset: 896)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1003, file: !50, line: 3527, baseType: !1046, size: 64, align: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!927, !949}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1003, file: !50, line: 3535, baseType: !1050, size: 64, align: 64, offset: 1024)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!927, !949, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1003, file: !50, line: 3541, baseType: !1056, size: 64, align: 64, offset: 1088)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !50, line: 3461, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1060, line: 223, size: 128, align: 64, elements: !1061)
!1060 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1061 = !{!1062, !1065}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1059, file: !1060, line: 224, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1059, file: !1060, line: 225, baseType: !1063, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1003, file: !50, line: 3549, baseType: !1067, size: 64, align: 64, offset: 1152)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1044}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1003, file: !50, line: 3551, baseType: !1046, size: 64, align: 64, offset: 1216)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1003, file: !50, line: 3552, baseType: !1072, size: 64, align: 64, offset: 1280)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!927, !949, !1075, !927, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !50, line: 3920, size: 256, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1116}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1078, file: !50, line: 3921, baseType: !935, size: 16, align: 16)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1078, file: !50, line: 3922, baseType: !940, size: 32, align: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1078, file: !50, line: 3923, baseType: !940, size: 32, align: 32, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1078, file: !50, line: 3924, baseType: !928, size: 32, align: 32, offset: 96)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1078, file: !50, line: 3925, baseType: !1085, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !50, line: 3918, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !50, line: 3885, size: 1600, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1105, !1109, !1111, !1112, !1114, !1115}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1088, file: !50, line: 3886, baseType: !927, size: 32, align: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1088, file: !50, line: 3887, baseType: !927, size: 32, align: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1088, file: !50, line: 3888, baseType: !927, size: 32, align: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1088, file: !50, line: 3889, baseType: !927, size: 32, align: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1088, file: !50, line: 3890, baseType: !927, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1088, file: !50, line: 3897, baseType: !1096, size: 768, align: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !50, line: 3858, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !50, line: 3853, size: 768, align: 64, elements: !1098)
!1098 = !{!1099, !1103}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !50, line: 3855, baseType: !1100, size: 512, align: 64)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 512, align: 64, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 8)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1097, file: !50, line: 3857, baseType: !1104, size: 256, align: 32, offset: 512)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 256, align: 32, elements: !1101)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1088, file: !50, line: 3903, baseType: !1106, size: 256, align: 64, offset: 960)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 256, align: 64, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 4)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1088, file: !50, line: 3904, baseType: !1110, size: 128, align: 32, offset: 1216)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 128, align: 32, elements: !1107)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1088, file: !50, line: 3906, baseType: !726, size: 32, align: 32, offset: 1344)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1088, file: !50, line: 3908, baseType: !1113, size: 64, align: 64, offset: 1408)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1088, file: !50, line: 3915, baseType: !1113, size: 64, align: 64, offset: 1472)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !50, line: 3917, baseType: !927, size: 32, align: 32, offset: 1536)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1078, file: !50, line: 3926, baseType: !1117, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !936, line: 40, baseType: !1118)
!1118 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1003, file: !50, line: 3564, baseType: !1120, size: 64, align: 64, offset: 1344)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!927, !949, !1123, !1157, !1239}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !50, line: 1499, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !50, line: 1445, size: 704, align: 64, elements: !1126)
!1126 = !{!1127, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1153, !1154, !1155, !1156}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1125, file: !50, line: 1451, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1130, line: 94, baseType: !1131)
!1130 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1130, line: 81, size: 192, align: 64, elements: !1132)
!1132 = !{!1133, !1137, !1138}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1131, file: !1130, line: 82, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1130, line: 73, baseType: !1136)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1130, line: 73, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !1130, line: 89, baseType: !1075, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !1130, line: 93, baseType: !927, size: 32, align: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1125, file: !50, line: 1461, baseType: !1117, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1125, file: !50, line: 1467, baseType: !1117, size: 64, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !50, line: 1468, baseType: !1075, size: 64, align: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1125, file: !50, line: 1469, baseType: !927, size: 32, align: 32, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1125, file: !50, line: 1470, baseType: !927, size: 32, align: 32, offset: 288)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1125, file: !50, line: 1474, baseType: !927, size: 32, align: 32, offset: 320)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1125, file: !50, line: 1479, baseType: !1146, size: 64, align: 64, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !50, line: 1415, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !50, line: 1411, size: 128, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !50, line: 1412, baseType: !1075, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !50, line: 1413, baseType: !927, size: 32, align: 32, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1148, file: !50, line: 1414, baseType: !732, size: 32, align: 32, offset: 96)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1125, file: !50, line: 1480, baseType: !927, size: 32, align: 32, offset: 448)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1125, file: !50, line: 1486, baseType: !1117, size: 64, align: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1125, file: !50, line: 1488, baseType: !1117, size: 64, align: 64, offset: 576)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1125, file: !50, line: 1497, baseType: !1117, size: 64, align: 64, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !773, line: 646, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !773, line: 268, size: 4288, align: 64, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1191, !1193, !1194, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1227, !1228, !1229, !1230, !1231, !1232, !1235, !1236, !1237, !1238}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !773, line: 282, baseType: !1100, size: 512, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1160, file: !773, line: 299, baseType: !1104, size: 256, align: 32, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1160, file: !773, line: 315, baseType: !1165, size: 64, align: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1160, file: !773, line: 326, baseType: !927, size: 32, align: 32, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1160, file: !773, line: 326, baseType: !927, size: 32, align: 32, offset: 864)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1160, file: !773, line: 334, baseType: !927, size: 32, align: 32, offset: 896)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1160, file: !773, line: 341, baseType: !927, size: 32, align: 32, offset: 928)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1160, file: !773, line: 346, baseType: !927, size: 32, align: 32, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1160, file: !773, line: 351, baseType: !762, size: 32, align: 32, offset: 992)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1160, file: !773, line: 356, baseType: !1013, size: 64, align: 32, offset: 1024)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1160, file: !773, line: 361, baseType: !1117, size: 64, align: 64, offset: 1088)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1160, file: !773, line: 369, baseType: !1117, size: 64, align: 64, offset: 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1160, file: !773, line: 377, baseType: !1117, size: 64, align: 64, offset: 1216)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1160, file: !773, line: 382, baseType: !927, size: 32, align: 32, offset: 1280)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1160, file: !773, line: 386, baseType: !927, size: 32, align: 32, offset: 1312)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1160, file: !773, line: 391, baseType: !927, size: 32, align: 32, offset: 1344)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1160, file: !773, line: 396, baseType: !967, size: 64, align: 64, offset: 1408)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1160, file: !773, line: 403, baseType: !1181, size: 512, align: 64, offset: 1472)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 512, align: 64, elements: !1101)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1160, file: !773, line: 410, baseType: !927, size: 32, align: 32, offset: 1984)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1160, file: !773, line: 415, baseType: !927, size: 32, align: 32, offset: 2016)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1160, file: !773, line: 420, baseType: !927, size: 32, align: 32, offset: 2048)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1160, file: !773, line: 425, baseType: !927, size: 32, align: 32, offset: 2080)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1160, file: !773, line: 435, baseType: !1117, size: 64, align: 64, offset: 2112)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1160, file: !773, line: 440, baseType: !927, size: 32, align: 32, offset: 2176)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1160, file: !773, line: 445, baseType: !941, size: 64, align: 64, offset: 2240)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1160, file: !773, line: 459, baseType: !1190, size: 512, align: 64, offset: 2304)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 512, align: 64, elements: !1101)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1160, file: !773, line: 473, baseType: !1192, size: 64, align: 64, offset: 2816)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1160, file: !773, line: 477, baseType: !927, size: 32, align: 32, offset: 2880)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1160, file: !773, line: 479, baseType: !1195, size: 64, align: 64, offset: 2944)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !773, line: 207, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !773, line: 201, size: 320, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1208}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1198, file: !773, line: 202, baseType: !772, size: 32, align: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !773, line: 203, baseType: !1075, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1198, file: !773, line: 204, baseType: !927, size: 32, align: 32, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1198, file: !773, line: 205, baseType: !1204, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1206, line: 86, baseType: !1207)
!1206 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1206, line: 86, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1198, file: !773, line: 206, baseType: !1128, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1160, file: !773, line: 480, baseType: !927, size: 32, align: 32, offset: 3008)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !773, line: 505, baseType: !927, size: 32, align: 32, offset: 3040)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1160, file: !773, line: 512, baseType: !796, size: 32, align: 32, offset: 3072)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1160, file: !773, line: 514, baseType: !802, size: 32, align: 32, offset: 3104)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1160, file: !773, line: 516, baseType: !820, size: 32, align: 32, offset: 3136)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1160, file: !773, line: 523, baseType: !844, size: 32, align: 32, offset: 3168)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1160, file: !773, line: 525, baseType: !863, size: 32, align: 32, offset: 3200)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1160, file: !773, line: 532, baseType: !1117, size: 64, align: 64, offset: 3264)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1160, file: !773, line: 539, baseType: !1117, size: 64, align: 64, offset: 3328)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1160, file: !773, line: 547, baseType: !1117, size: 64, align: 64, offset: 3392)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1160, file: !773, line: 554, baseType: !1204, size: 64, align: 64, offset: 3456)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1160, file: !773, line: 563, baseType: !927, size: 32, align: 32, offset: 3520)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1160, file: !773, line: 572, baseType: !927, size: 32, align: 32, offset: 3552)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1160, file: !773, line: 581, baseType: !927, size: 32, align: 32, offset: 3584)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1160, file: !773, line: 588, baseType: !1224, size: 64, align: 64, offset: 3648)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !936, line: 36, baseType: !1226)
!1226 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1160, file: !773, line: 593, baseType: !927, size: 32, align: 32, offset: 3712)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1160, file: !773, line: 596, baseType: !927, size: 32, align: 32, offset: 3744)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1160, file: !773, line: 599, baseType: !1128, size: 64, align: 64, offset: 3776)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1160, file: !773, line: 605, baseType: !1128, size: 64, align: 64, offset: 3840)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1160, file: !773, line: 616, baseType: !1128, size: 64, align: 64, offset: 3904)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1160, file: !773, line: 626, baseType: !1233, size: 64, align: 64, offset: 3968)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1234, line: 216, baseType: !942)
!1234 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1160, file: !773, line: 627, baseType: !1233, size: 64, align: 64, offset: 4032)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1160, file: !773, line: 628, baseType: !1233, size: 64, align: 64, offset: 4096)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1160, file: !773, line: 629, baseType: !1233, size: 64, align: 64, offset: 4160)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1160, file: !773, line: 645, baseType: !1128, size: 64, align: 64, offset: 4224)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1003, file: !50, line: 3566, baseType: !1241, size: 64, align: 64, offset: 1408)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!927, !949, !967, !1239, !1123}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1003, file: !50, line: 3567, baseType: !1046, size: 64, align: 64, offset: 1472)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1003, file: !50, line: 3576, baseType: !1246, size: 64, align: 64, offset: 1536)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!927, !949, !1157}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1003, file: !50, line: 3577, baseType: !1250, size: 64, align: 64, offset: 1600)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!927, !949, !1123}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1003, file: !50, line: 3584, baseType: !1254, size: 64, align: 64, offset: 1664)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!927, !949, !1257}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1003, file: !50, line: 3589, baseType: !1259, size: 64, align: 64, offset: 1728)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !949}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1003, file: !50, line: 3594, baseType: !927, size: 32, align: 32, offset: 1792)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1003, file: !50, line: 3600, baseType: !960, size: 64, align: 64, offset: 1856)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1003, file: !50, line: 3609, baseType: !1265, size: 64, align: 64, offset: 1920)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1268)
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !50, line: 3609, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !951, file: !50, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !951, file: !50, line: 1581, baseType: !928, size: 32, align: 32, offset: 224)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !951, file: !50, line: 1583, baseType: !967, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !951, file: !50, line: 1591, baseType: !1273, size: 64, align: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1060, line: 129, size: 1664, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1298, !1299, !1305, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1274, file: !1060, line: 136, baseType: !927, size: 32, align: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1274, file: !1060, line: 151, baseType: !927, size: 32, align: 32, offset: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1274, file: !1060, line: 157, baseType: !927, size: 32, align: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1274, file: !1060, line: 159, baseType: !1257, size: 64, align: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1274, file: !1060, line: 161, baseType: !1281, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1060, line: 117, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1060, line: 100, size: 832, align: 64, elements: !1284)
!1284 = !{!1285, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1283, file: !1060, line: 105, baseType: !1286, size: 256, align: 64)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1287, size: 256, align: 64, elements: !1107)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1130, line: 238, baseType: !1289)
!1289 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1130, line: 238, flags: DIFlagFwdDecl)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1283, file: !1060, line: 110, baseType: !927, size: 32, align: 32, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1283, file: !1060, line: 111, baseType: !927, size: 32, align: 32, offset: 288)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1283, file: !1060, line: 111, baseType: !927, size: 32, align: 32, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1283, file: !1060, line: 112, baseType: !1104, size: 256, align: 32, offset: 352)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1283, file: !1060, line: 113, baseType: !1110, size: 128, align: 32, offset: 608)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1283, file: !1060, line: 114, baseType: !927, size: 32, align: 32, offset: 736)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1283, file: !1060, line: 115, baseType: !927, size: 32, align: 32, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1283, file: !1060, line: 116, baseType: !927, size: 32, align: 32, offset: 800)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1274, file: !1060, line: 163, baseType: !967, size: 64, align: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1274, file: !1060, line: 165, baseType: !1300, size: 128, align: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1060, line: 122, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1060, line: 119, size: 128, align: 64, elements: !1302)
!1302 = !{!1303, !1304}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1301, file: !1060, line: 120, baseType: !1123, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1301, file: !1060, line: 121, baseType: !1257, size: 64, align: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1274, file: !1060, line: 166, baseType: !1306, size: 128, align: 64, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1060, line: 127, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1060, line: 124, size: 128, align: 64, elements: !1308)
!1308 = !{!1309, !1382}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1307, file: !1060, line: 125, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !50, line: 5794, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !50, line: 5747, size: 512, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1340, !1344, !1345, !1379, !1380, !1381}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1313, file: !50, line: 5751, baseType: !954, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1313, file: !50, line: 5756, baseType: !1317, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !50, line: 5796, size: 512, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1325, !1326, !1327, !1331, !1335, !1339}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1319, file: !50, line: 5797, baseType: !960, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1319, file: !50, line: 5804, baseType: !1323, size: 64, align: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1319, file: !50, line: 5815, baseType: !954, size: 64, align: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1319, file: !50, line: 5825, baseType: !927, size: 32, align: 32, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1319, file: !50, line: 5826, baseType: !1328, size: 64, align: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!927, !1311}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1319, file: !50, line: 5827, baseType: !1332, size: 64, align: 64, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!927, !1311, !1123}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1319, file: !50, line: 5828, baseType: !1336, size: 64, align: 64, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !1311}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1319, file: !50, line: 5829, baseType: !1336, size: 64, align: 64, offset: 448)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1313, file: !50, line: 5762, baseType: !1341, size: 64, align: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !50, line: 5735, baseType: !1343)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !50, line: 5735, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1313, file: !50, line: 5768, baseType: !967, size: 64, align: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1313, file: !50, line: 5775, baseType: !1346, size: 64, align: 64, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !50, line: 4085, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !50, line: 3936, size: 1152, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1348, file: !50, line: 3940, baseType: !39, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1348, file: !50, line: 3944, baseType: !49, size: 32, align: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1348, file: !50, line: 3948, baseType: !940, size: 32, align: 32, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1348, file: !50, line: 3958, baseType: !1075, size: 64, align: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1348, file: !50, line: 3962, baseType: !927, size: 32, align: 32, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1348, file: !50, line: 3968, baseType: !927, size: 32, align: 32, offset: 224)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1348, file: !50, line: 3973, baseType: !1117, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1348, file: !50, line: 3986, baseType: !927, size: 32, align: 32, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1348, file: !50, line: 3999, baseType: !927, size: 32, align: 32, offset: 352)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1348, file: !50, line: 4004, baseType: !927, size: 32, align: 32, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1348, file: !50, line: 4005, baseType: !927, size: 32, align: 32, offset: 416)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1348, file: !50, line: 4010, baseType: !927, size: 32, align: 32, offset: 448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1348, file: !50, line: 4011, baseType: !927, size: 32, align: 32, offset: 480)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1348, file: !50, line: 4020, baseType: !1013, size: 64, align: 32, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1348, file: !50, line: 4025, baseType: !873, size: 32, align: 32, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1348, file: !50, line: 4030, baseType: !796, size: 32, align: 32, offset: 608)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1348, file: !50, line: 4031, baseType: !802, size: 32, align: 32, offset: 640)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1348, file: !50, line: 4032, baseType: !820, size: 32, align: 32, offset: 672)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1348, file: !50, line: 4033, baseType: !844, size: 32, align: 32, offset: 704)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1348, file: !50, line: 4034, baseType: !863, size: 32, align: 32, offset: 736)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1348, file: !50, line: 4039, baseType: !927, size: 32, align: 32, offset: 768)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1348, file: !50, line: 4046, baseType: !941, size: 64, align: 64, offset: 832)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1348, file: !50, line: 4050, baseType: !927, size: 32, align: 32, offset: 896)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1348, file: !50, line: 4054, baseType: !927, size: 32, align: 32, offset: 928)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1348, file: !50, line: 4061, baseType: !927, size: 32, align: 32, offset: 960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1348, file: !50, line: 4065, baseType: !927, size: 32, align: 32, offset: 992)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1348, file: !50, line: 4073, baseType: !927, size: 32, align: 32, offset: 1024)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1348, file: !50, line: 4080, baseType: !927, size: 32, align: 32, offset: 1056)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1348, file: !50, line: 4084, baseType: !927, size: 32, align: 32, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1313, file: !50, line: 5781, baseType: !1346, size: 64, align: 64, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1313, file: !50, line: 5787, baseType: !1013, size: 64, align: 32, offset: 384)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1313, file: !50, line: 5793, baseType: !1013, size: 64, align: 32, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1307, file: !1060, line: 126, baseType: !927, size: 32, align: 32, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1274, file: !1060, line: 172, baseType: !1123, size: 64, align: 64, offset: 576)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1274, file: !1060, line: 177, baseType: !1075, size: 64, align: 64, offset: 640)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1274, file: !1060, line: 178, baseType: !928, size: 32, align: 32, offset: 704)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1274, file: !1060, line: 180, baseType: !967, size: 64, align: 64, offset: 768)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1274, file: !1060, line: 185, baseType: !927, size: 32, align: 32, offset: 832)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1274, file: !1060, line: 190, baseType: !967, size: 64, align: 64, offset: 896)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1274, file: !1060, line: 195, baseType: !927, size: 32, align: 32, offset: 960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1274, file: !1060, line: 200, baseType: !1123, size: 64, align: 64, offset: 1024)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1274, file: !1060, line: 201, baseType: !927, size: 32, align: 32, offset: 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1274, file: !1060, line: 202, baseType: !1257, size: 64, align: 64, offset: 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1274, file: !1060, line: 203, baseType: !927, size: 32, align: 32, offset: 1216)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1274, file: !1060, line: 205, baseType: !927, size: 32, align: 32, offset: 1248)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1274, file: !1060, line: 206, baseType: !927, size: 32, align: 32, offset: 1280)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1274, file: !1060, line: 209, baseType: !1233, size: 64, align: 64, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1274, file: !1060, line: 212, baseType: !1233, size: 64, align: 64, offset: 1408)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1274, file: !1060, line: 213, baseType: !1257, size: 64, align: 64, offset: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1274, file: !1060, line: 215, baseType: !927, size: 32, align: 32, offset: 1536)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1274, file: !1060, line: 217, baseType: !927, size: 32, align: 32, offset: 1568)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1274, file: !1060, line: 220, baseType: !927, size: 32, align: 32, offset: 1600)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !951, file: !50, line: 1598, baseType: !967, size: 64, align: 64, offset: 384)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !951, file: !50, line: 1606, baseType: !1117, size: 64, align: 64, offset: 448)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !951, file: !50, line: 1614, baseType: !927, size: 32, align: 32, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !951, file: !50, line: 1622, baseType: !927, size: 32, align: 32, offset: 544)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !951, file: !50, line: 1628, baseType: !927, size: 32, align: 32, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !951, file: !50, line: 1636, baseType: !927, size: 32, align: 32, offset: 608)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !951, file: !50, line: 1643, baseType: !927, size: 32, align: 32, offset: 640)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !951, file: !50, line: 1657, baseType: !1075, size: 64, align: 64, offset: 704)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !951, file: !50, line: 1658, baseType: !927, size: 32, align: 32, offset: 768)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !951, file: !50, line: 1679, baseType: !1013, size: 64, align: 32, offset: 800)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !951, file: !50, line: 1688, baseType: !927, size: 32, align: 32, offset: 864)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !951, file: !50, line: 1712, baseType: !927, size: 32, align: 32, offset: 896)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !951, file: !50, line: 1729, baseType: !927, size: 32, align: 32, offset: 928)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !951, file: !50, line: 1729, baseType: !927, size: 32, align: 32, offset: 960)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !951, file: !50, line: 1744, baseType: !927, size: 32, align: 32, offset: 992)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !951, file: !50, line: 1744, baseType: !927, size: 32, align: 32, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !951, file: !50, line: 1751, baseType: !927, size: 32, align: 32, offset: 1056)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !951, file: !50, line: 1766, baseType: !509, size: 32, align: 32, offset: 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !951, file: !50, line: 1791, baseType: !1421, size: 64, align: 64, offset: 1152)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !1424, !1157, !1239, !927, !927, !927}
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !951, file: !50, line: 1808, baseType: !1426, size: 64, align: 64, offset: 1216)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!509, !1424, !1020}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !951, file: !50, line: 1816, baseType: !927, size: 32, align: 32, offset: 1280)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !951, file: !50, line: 1825, baseType: !1431, size: 32, align: 32, offset: 1312)
!1431 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !951, file: !50, line: 1830, baseType: !927, size: 32, align: 32, offset: 1344)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !951, file: !50, line: 1838, baseType: !1431, size: 32, align: 32, offset: 1376)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !951, file: !50, line: 1846, baseType: !927, size: 32, align: 32, offset: 1408)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !951, file: !50, line: 1851, baseType: !927, size: 32, align: 32, offset: 1440)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !951, file: !50, line: 1861, baseType: !1431, size: 32, align: 32, offset: 1472)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !951, file: !50, line: 1868, baseType: !1431, size: 32, align: 32, offset: 1504)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !951, file: !50, line: 1875, baseType: !1431, size: 32, align: 32, offset: 1536)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !951, file: !50, line: 1882, baseType: !1431, size: 32, align: 32, offset: 1568)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !951, file: !50, line: 1889, baseType: !1431, size: 32, align: 32, offset: 1600)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !951, file: !50, line: 1896, baseType: !1431, size: 32, align: 32, offset: 1632)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !951, file: !50, line: 1903, baseType: !1431, size: 32, align: 32, offset: 1664)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !951, file: !50, line: 1910, baseType: !927, size: 32, align: 32, offset: 1696)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !951, file: !50, line: 1915, baseType: !927, size: 32, align: 32, offset: 1728)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !951, file: !50, line: 1926, baseType: !1239, size: 64, align: 64, offset: 1792)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !951, file: !50, line: 1935, baseType: !1013, size: 64, align: 32, offset: 1856)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !951, file: !50, line: 1942, baseType: !927, size: 32, align: 32, offset: 1920)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !951, file: !50, line: 1948, baseType: !927, size: 32, align: 32, offset: 1952)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !951, file: !50, line: 1954, baseType: !927, size: 32, align: 32, offset: 1984)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !951, file: !50, line: 1960, baseType: !927, size: 32, align: 32, offset: 2016)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !951, file: !50, line: 1984, baseType: !927, size: 32, align: 32, offset: 2048)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !951, file: !50, line: 1991, baseType: !927, size: 32, align: 32, offset: 2080)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !951, file: !50, line: 1996, baseType: !927, size: 32, align: 32, offset: 2112)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !951, file: !50, line: 2004, baseType: !927, size: 32, align: 32, offset: 2144)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !951, file: !50, line: 2011, baseType: !927, size: 32, align: 32, offset: 2176)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !951, file: !50, line: 2018, baseType: !927, size: 32, align: 32, offset: 2208)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !951, file: !50, line: 2027, baseType: !927, size: 32, align: 32, offset: 2240)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !951, file: !50, line: 2034, baseType: !927, size: 32, align: 32, offset: 2272)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !951, file: !50, line: 2044, baseType: !927, size: 32, align: 32, offset: 2304)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !951, file: !50, line: 2054, baseType: !1461, size: 64, align: 64, offset: 2368)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !951, file: !50, line: 2061, baseType: !1461, size: 64, align: 64, offset: 2432)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !951, file: !50, line: 2066, baseType: !927, size: 32, align: 32, offset: 2496)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !951, file: !50, line: 2070, baseType: !927, size: 32, align: 32, offset: 2528)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !951, file: !50, line: 2078, baseType: !927, size: 32, align: 32, offset: 2560)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !951, file: !50, line: 2085, baseType: !927, size: 32, align: 32, offset: 2592)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !951, file: !50, line: 2092, baseType: !927, size: 32, align: 32, offset: 2624)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !951, file: !50, line: 2099, baseType: !927, size: 32, align: 32, offset: 2656)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !951, file: !50, line: 2106, baseType: !927, size: 32, align: 32, offset: 2688)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !951, file: !50, line: 2113, baseType: !927, size: 32, align: 32, offset: 2720)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !951, file: !50, line: 2120, baseType: !927, size: 32, align: 32, offset: 2752)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !951, file: !50, line: 2125, baseType: !927, size: 32, align: 32, offset: 2784)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !951, file: !50, line: 2133, baseType: !927, size: 32, align: 32, offset: 2816)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !951, file: !50, line: 2140, baseType: !927, size: 32, align: 32, offset: 2848)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !951, file: !50, line: 2145, baseType: !927, size: 32, align: 32, offset: 2880)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !951, file: !50, line: 2153, baseType: !927, size: 32, align: 32, offset: 2912)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !951, file: !50, line: 2158, baseType: !927, size: 32, align: 32, offset: 2944)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !951, file: !50, line: 2166, baseType: !802, size: 32, align: 32, offset: 2976)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !951, file: !50, line: 2173, baseType: !820, size: 32, align: 32, offset: 3008)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !951, file: !50, line: 2180, baseType: !844, size: 32, align: 32, offset: 3040)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !951, file: !50, line: 2187, baseType: !796, size: 32, align: 32, offset: 3072)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !951, file: !50, line: 2194, baseType: !863, size: 32, align: 32, offset: 3104)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !951, file: !50, line: 2203, baseType: !927, size: 32, align: 32, offset: 3136)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !951, file: !50, line: 2209, baseType: !873, size: 32, align: 32, offset: 3168)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !951, file: !50, line: 2212, baseType: !927, size: 32, align: 32, offset: 3200)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !951, file: !50, line: 2213, baseType: !927, size: 32, align: 32, offset: 3232)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !951, file: !50, line: 2220, baseType: !709, size: 32, align: 32, offset: 3264)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !951, file: !50, line: 2232, baseType: !927, size: 32, align: 32, offset: 3296)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !951, file: !50, line: 2243, baseType: !927, size: 32, align: 32, offset: 3328)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !951, file: !50, line: 2249, baseType: !927, size: 32, align: 32, offset: 3360)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !951, file: !50, line: 2256, baseType: !927, size: 32, align: 32, offset: 3392)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !951, file: !50, line: 2263, baseType: !941, size: 64, align: 64, offset: 3456)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !951, file: !50, line: 2270, baseType: !941, size: 64, align: 64, offset: 3520)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !951, file: !50, line: 2277, baseType: !881, size: 32, align: 32, offset: 3584)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !951, file: !50, line: 2285, baseType: !709, size: 32, align: 32, offset: 3616)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !951, file: !50, line: 2367, baseType: !1497, size: 64, align: 64, offset: 3648)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!927, !1424, !1257, !927}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !951, file: !50, line: 2383, baseType: !927, size: 32, align: 32, offset: 3712)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !951, file: !50, line: 2386, baseType: !1431, size: 32, align: 32, offset: 3744)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !951, file: !50, line: 2387, baseType: !1431, size: 32, align: 32, offset: 3776)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !951, file: !50, line: 2394, baseType: !927, size: 32, align: 32, offset: 3808)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !951, file: !50, line: 2401, baseType: !927, size: 32, align: 32, offset: 3840)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !951, file: !50, line: 2408, baseType: !927, size: 32, align: 32, offset: 3872)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !951, file: !50, line: 2415, baseType: !927, size: 32, align: 32, offset: 3904)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !951, file: !50, line: 2422, baseType: !927, size: 32, align: 32, offset: 3936)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !951, file: !50, line: 2423, baseType: !1509, size: 64, align: 64, offset: 3968)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !50, line: 831, baseType: !1511)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !50, line: 826, size: 128, align: 32, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1516}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1511, file: !50, line: 827, baseType: !927, size: 32, align: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1511, file: !50, line: 828, baseType: !927, size: 32, align: 32, offset: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1511, file: !50, line: 829, baseType: !927, size: 32, align: 32, offset: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1511, file: !50, line: 830, baseType: !1431, size: 32, align: 32, offset: 96)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !951, file: !50, line: 2430, baseType: !1117, size: 64, align: 64, offset: 4032)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !951, file: !50, line: 2437, baseType: !1117, size: 64, align: 64, offset: 4096)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !951, file: !50, line: 2444, baseType: !1431, size: 32, align: 32, offset: 4160)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !951, file: !50, line: 2451, baseType: !1431, size: 32, align: 32, offset: 4192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !951, file: !50, line: 2458, baseType: !927, size: 32, align: 32, offset: 4224)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !951, file: !50, line: 2469, baseType: !927, size: 32, align: 32, offset: 4256)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !951, file: !50, line: 2475, baseType: !927, size: 32, align: 32, offset: 4288)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !951, file: !50, line: 2481, baseType: !927, size: 32, align: 32, offset: 4320)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !951, file: !50, line: 2485, baseType: !927, size: 32, align: 32, offset: 4352)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !951, file: !50, line: 2489, baseType: !927, size: 32, align: 32, offset: 4384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !951, file: !50, line: 2493, baseType: !927, size: 32, align: 32, offset: 4416)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !951, file: !50, line: 2501, baseType: !927, size: 32, align: 32, offset: 4448)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !951, file: !50, line: 2506, baseType: !927, size: 32, align: 32, offset: 4480)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !951, file: !50, line: 2510, baseType: !927, size: 32, align: 32, offset: 4512)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !951, file: !50, line: 2514, baseType: !1117, size: 64, align: 64, offset: 4544)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !951, file: !50, line: 2528, baseType: !1533, size: 64, align: 64, offset: 4608)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{null, !1424, !967, !927, !927}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !951, file: !50, line: 2534, baseType: !927, size: 32, align: 32, offset: 4672)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !951, file: !50, line: 2545, baseType: !927, size: 32, align: 32, offset: 4704)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !951, file: !50, line: 2547, baseType: !927, size: 32, align: 32, offset: 4736)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !951, file: !50, line: 2549, baseType: !927, size: 32, align: 32, offset: 4768)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !951, file: !50, line: 2551, baseType: !927, size: 32, align: 32, offset: 4800)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !951, file: !50, line: 2553, baseType: !927, size: 32, align: 32, offset: 4832)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !951, file: !50, line: 2555, baseType: !927, size: 32, align: 32, offset: 4864)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !951, file: !50, line: 2557, baseType: !927, size: 32, align: 32, offset: 4896)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !951, file: !50, line: 2559, baseType: !927, size: 32, align: 32, offset: 4928)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !951, file: !50, line: 2563, baseType: !927, size: 32, align: 32, offset: 4960)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !951, file: !50, line: 2571, baseType: !1113, size: 64, align: 64, offset: 4992)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !951, file: !50, line: 2579, baseType: !1113, size: 64, align: 64, offset: 5056)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !951, file: !50, line: 2586, baseType: !927, size: 32, align: 32, offset: 5120)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !951, file: !50, line: 2615, baseType: !927, size: 32, align: 32, offset: 5152)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !951, file: !50, line: 2627, baseType: !927, size: 32, align: 32, offset: 5184)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !951, file: !50, line: 2637, baseType: !927, size: 32, align: 32, offset: 5216)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !951, file: !50, line: 2681, baseType: !927, size: 32, align: 32, offset: 5248)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !951, file: !50, line: 2709, baseType: !1117, size: 64, align: 64, offset: 5312)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !951, file: !50, line: 2716, baseType: !1555, size: 64, align: 64, offset: 5376)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1557)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !50, line: 3636, size: 896, align: 64, elements: !1558)
!1558 = !{!1559, !1560, !1561, !1562, !1563, !1564, !1565, !1569, !1573, !1574, !1575, !1576, !1582, !1583, !1584, !1585, !1586}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1557, file: !50, line: 3642, baseType: !960, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1557, file: !50, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1557, file: !50, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1557, file: !50, line: 3663, baseType: !509, size: 32, align: 32, offset: 128)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1557, file: !50, line: 3669, baseType: !927, size: 32, align: 32, offset: 160)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1557, file: !50, line: 3682, baseType: !1254, size: 64, align: 64, offset: 192)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1557, file: !50, line: 3698, baseType: !1566, size: 64, align: 64, offset: 256)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!927, !949, !1063, !940}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1557, file: !50, line: 3712, baseType: !1570, size: 64, align: 64, offset: 320)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!927, !949, !927, !1063, !940}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1557, file: !50, line: 3726, baseType: !1566, size: 64, align: 64, offset: 384)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1557, file: !50, line: 3737, baseType: !1046, size: 64, align: 64, offset: 448)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1557, file: !50, line: 3746, baseType: !927, size: 32, align: 32, offset: 512)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1557, file: !50, line: 3757, baseType: !1577, size: 64, align: 64, offset: 576)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{null, !1580}
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !50, line: 3617, flags: DIFlagFwdDecl)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1557, file: !50, line: 3766, baseType: !1046, size: 64, align: 64, offset: 640)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1557, file: !50, line: 3774, baseType: !1046, size: 64, align: 64, offset: 704)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1557, file: !50, line: 3780, baseType: !927, size: 32, align: 32, offset: 768)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1557, file: !50, line: 3785, baseType: !927, size: 32, align: 32, offset: 800)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1557, file: !50, line: 3795, baseType: !1587, size: 64, align: 64, offset: 832)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!927, !949, !1128}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !951, file: !50, line: 2728, baseType: !967, size: 64, align: 64, offset: 5440)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !951, file: !50, line: 2735, baseType: !1181, size: 512, align: 64, offset: 5504)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !951, file: !50, line: 2742, baseType: !927, size: 32, align: 32, offset: 6016)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !951, file: !50, line: 2755, baseType: !927, size: 32, align: 32, offset: 6048)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !951, file: !50, line: 2776, baseType: !927, size: 32, align: 32, offset: 6080)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !951, file: !50, line: 2783, baseType: !927, size: 32, align: 32, offset: 6112)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !951, file: !50, line: 2791, baseType: !927, size: 32, align: 32, offset: 6144)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !951, file: !50, line: 2802, baseType: !1257, size: 64, align: 64, offset: 6208)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !951, file: !50, line: 2811, baseType: !927, size: 32, align: 32, offset: 6272)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !951, file: !50, line: 2821, baseType: !927, size: 32, align: 32, offset: 6304)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !951, file: !50, line: 2830, baseType: !927, size: 32, align: 32, offset: 6336)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !951, file: !50, line: 2840, baseType: !927, size: 32, align: 32, offset: 6368)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !951, file: !50, line: 2851, baseType: !1603, size: 64, align: 64, offset: 6400)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!927, !1424, !1606, !967, !1239, !927, !927}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!927, !1424, !967}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !951, file: !50, line: 2871, baseType: !1610, size: 64, align: 64, offset: 6464)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!927, !1424, !1613, !967, !1239, !927}
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!927, !1424, !967, !927, !927}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !951, file: !50, line: 2878, baseType: !927, size: 32, align: 32, offset: 6528)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !951, file: !50, line: 2885, baseType: !927, size: 32, align: 32, offset: 6560)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !951, file: !50, line: 3005, baseType: !927, size: 32, align: 32, offset: 6592)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !951, file: !50, line: 3013, baseType: !893, size: 32, align: 32, offset: 6624)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !951, file: !50, line: 3020, baseType: !893, size: 32, align: 32, offset: 6656)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !951, file: !50, line: 3027, baseType: !893, size: 32, align: 32, offset: 6688)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !951, file: !50, line: 3037, baseType: !1075, size: 64, align: 64, offset: 6720)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !951, file: !50, line: 3038, baseType: !927, size: 32, align: 32, offset: 6784)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !951, file: !50, line: 3050, baseType: !941, size: 64, align: 64, offset: 6848)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !951, file: !50, line: 3065, baseType: !927, size: 32, align: 32, offset: 6912)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !951, file: !50, line: 3083, baseType: !927, size: 32, align: 32, offset: 6944)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !951, file: !50, line: 3092, baseType: !1013, size: 64, align: 32, offset: 6976)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !951, file: !50, line: 3099, baseType: !509, size: 32, align: 32, offset: 7040)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !951, file: !50, line: 3106, baseType: !1013, size: 64, align: 32, offset: 7072)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !951, file: !50, line: 3113, baseType: !1631, size: 64, align: 64, offset: 7168)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1633)
!1633 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !50, line: 740, baseType: !1634)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !50, line: 712, size: 384, align: 64, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1639, !1640, !1641, !1644}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1634, file: !50, line: 713, baseType: !49, size: 32, align: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1634, file: !50, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1634, file: !50, line: 720, baseType: !960, size: 64, align: 64, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1634, file: !50, line: 724, baseType: !960, size: 64, align: 64, offset: 128)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1634, file: !50, line: 728, baseType: !927, size: 32, align: 32, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1634, file: !50, line: 734, baseType: !1642, size: 64, align: 64, offset: 256)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1634, file: !50, line: 739, baseType: !1645, size: 64, align: 64, offset: 320)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !951, file: !50, line: 3129, baseType: !1117, size: 64, align: 64, offset: 7232)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !951, file: !50, line: 3130, baseType: !1117, size: 64, align: 64, offset: 7296)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !951, file: !50, line: 3131, baseType: !1117, size: 64, align: 64, offset: 7360)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !951, file: !50, line: 3132, baseType: !1117, size: 64, align: 64, offset: 7424)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !951, file: !50, line: 3139, baseType: !1113, size: 64, align: 64, offset: 7488)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !951, file: !50, line: 3147, baseType: !927, size: 32, align: 32, offset: 7552)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !951, file: !50, line: 3165, baseType: !927, size: 32, align: 32, offset: 7584)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !951, file: !50, line: 3172, baseType: !927, size: 32, align: 32, offset: 7616)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !951, file: !50, line: 3180, baseType: !927, size: 32, align: 32, offset: 7648)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !951, file: !50, line: 3191, baseType: !1461, size: 64, align: 64, offset: 7680)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !951, file: !50, line: 3199, baseType: !1075, size: 64, align: 64, offset: 7744)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !951, file: !50, line: 3207, baseType: !1113, size: 64, align: 64, offset: 7808)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !951, file: !50, line: 3214, baseType: !928, size: 32, align: 32, offset: 7872)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !951, file: !50, line: 3224, baseType: !1146, size: 64, align: 64, offset: 7936)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !951, file: !50, line: 3225, baseType: !927, size: 32, align: 32, offset: 8000)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !951, file: !50, line: 3249, baseType: !1128, size: 64, align: 64, offset: 8064)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !951, file: !50, line: 3256, baseType: !927, size: 32, align: 32, offset: 8128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !951, file: !50, line: 3271, baseType: !927, size: 32, align: 32, offset: 8160)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !951, file: !50, line: 3279, baseType: !1117, size: 64, align: 64, offset: 8192)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !951, file: !50, line: 3301, baseType: !1128, size: 64, align: 64, offset: 8256)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !951, file: !50, line: 3310, baseType: !927, size: 32, align: 32, offset: 8320)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !951, file: !50, line: 3337, baseType: !927, size: 32, align: 32, offset: 8352)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !951, file: !50, line: 3351, baseType: !927, size: 32, align: 32, offset: 8384)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !951, file: !50, line: 3359, baseType: !927, size: 32, align: 32, offset: 8416)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusContext", file: !4, line: 174, baseType: !1673)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusContext", file: !4, line: 152, size: 704, align: 64, elements: !1674)
!1674 = !{!1675, !1677, !1999, !2000, !2002, !2003, !2005, !2006, !2007, !2008, !2009, !2012, !2013}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1673, file: !4, line: 153, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1673, file: !4, line: 154, baseType: !1678, size: 64, align: 64, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusStreamContext", file: !4, line: 134, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusStreamContext", file: !4, line: 100, size: 211456, align: 256, elements: !1681)
!1681 = !{!1682, !1683, !1684, !1718, !1719, !1723, !1953, !1954, !1957, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1972, !1977, !1978, !1979, !1998}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1680, file: !4, line: 101, baseType: !949, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "output_channels", scope: !1680, file: !4, line: 102, baseType: !927, size: 32, align: 32, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !1680, file: !4, line: 104, baseType: !1685, size: 11072, align: 64, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusRangeCoder", file: !1686, line: 55, baseType: !1687)
!1686 = !DIFile(filename: "libavcodec/opus_rc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusRangeCoder", file: !1686, line: 40, size: 11072, align: 64, elements: !1688)
!1688 = !{!1689, !1699, !1707, !1708, !1709, !1710, !1714, !1715, !1716, !1717}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1687, file: !1686, line: 41, baseType: !1690, size: 256, align: 64)
!1690 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1691, line: 70, baseType: !1692)
!1691 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1691, line: 61, size: 256, align: 64, elements: !1693)
!1693 = !{!1694, !1695, !1696, !1697, !1698}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1692, file: !1691, line: 62, baseType: !1063, size: 64, align: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1692, file: !1691, line: 62, baseType: !1063, size: 64, align: 64, offset: 64)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1692, file: !1691, line: 67, baseType: !927, size: 32, align: 32, offset: 128)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1692, file: !1691, line: 68, baseType: !927, size: 32, align: 32, offset: 160)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1692, file: !1691, line: 69, baseType: !927, size: 32, align: 32, offset: 192)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !1687, file: !1686, line: 42, baseType: !1700, size: 192, align: 64, offset: 256)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "RawBitsContext", file: !1686, line: 38, baseType: !1701)
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawBitsContext", file: !1686, line: 33, size: 192, align: 64, elements: !1702)
!1702 = !{!1703, !1704, !1705, !1706}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1701, file: !1686, line: 34, baseType: !1063, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !1701, file: !1686, line: 35, baseType: !940, size: 32, align: 32, offset: 64)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "cachelen", scope: !1701, file: !1686, line: 36, baseType: !940, size: 32, align: 32, offset: 96)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "cacheval", scope: !1701, file: !1686, line: 37, baseType: !940, size: 32, align: 32, offset: 128)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1687, file: !1686, line: 43, baseType: !940, size: 32, align: 32, offset: 448)
