; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpeg2_metadata_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mpeg2_metadata_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !525, line: 538, size: 32, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!595 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!596 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!597 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!598 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!599 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!600 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!601 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!604 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!605 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!606 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!607 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!608 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!609 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!610 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!611 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!612 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!613 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!614 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!615 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!616 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!617 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!618 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!619 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!620 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!621 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!622 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!623 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!624 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!625 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!626 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!627 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!628 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!629 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!630 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!631 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 28, size: 32, align: 32, elements: !634)
!633 = !DIFile(filename: "libavcodec/cbs_mpeg2.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643}
!635 = !DIEnumerator(name: "MPEG2_START_PICTURE", value: 0)
!636 = !DIEnumerator(name: "MPEG2_START_SLICE_MIN", value: 1)
!637 = !DIEnumerator(name: "MPEG2_START_SLICE_MAX", value: 175)
!638 = !DIEnumerator(name: "MPEG2_START_USER_DATA", value: 178)
!639 = !DIEnumerator(name: "MPEG2_START_SEQUENCE_HEADER", value: 179)
!640 = !DIEnumerator(name: "MPEG2_START_SEQUENCE_ERROR", value: 180)
!641 = !DIEnumerator(name: "MPEG2_START_EXTENSION", value: 181)
!642 = !DIEnumerator(name: "MPEG2_START_SEQUENCE_END", value: 183)
!643 = !DIEnumerator(name: "MPEG2_START_GROUP", value: 184)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 44, size: 32, align: 32, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!646 = !DIEnumerator(name: "MPEG2_EXTENSION_SEQUENCE", value: 1)
!647 = !DIEnumerator(name: "MPEG2_EXTENSION_SEQUENCE_DISPLAY", value: 2)
!648 = !DIEnumerator(name: "MPEG2_EXTENSION_QUANT_MATRIX", value: 3)
!649 = !DIEnumerator(name: "MPEG2_EXTENSION_COPYRIGHT", value: 4)
!650 = !DIEnumerator(name: "MPEG2_EXTENSION_SEQUENCE_SCALABLE", value: 5)
!651 = !DIEnumerator(name: "MPEG2_EXTENSION_PICTURE_DISPLAY", value: 7)
!652 = !DIEnumerator(name: "MPEG2_EXTENSION_PICTURE_CODING", value: 8)
!653 = !DIEnumerator(name: "MPEG2_EXTENSION_PICTURE_SPATIAL_SCALABLE", value: 9)
!654 = !DIEnumerator(name: "MPEG2_EXTENSION_PICTURE_TEMPORAL_SCALABLE", value: 10)
!655 = !DIEnumerator(name: "MPEG2_EXTENSION_CAMAERA_PARAMETERS", value: 11)
!656 = !DIEnumerator(name: "MPEG2_EXTENSION_ITU_T", value: 12)
!657 = !{!658, !860, !864, !865}
!658 = distinct !DIGlobalVariable(name: "ff_mpeg2_metadata_bsf", scope: !0, file: !659, line: 306, type: !660, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_mpeg2_metadata_bsf)
!659 = !DIFile(filename: "libavcodec/mpeg2_metadata_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !663)
!663 = !{!664, !668, !671, !755, !756, !817, !855, !859}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !4, line: 5797, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !662, file: !4, line: 5804, baseType: !669, size: 64, align: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !662, file: !4, line: 5815, baseType: !672, size: 64, align: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !676)
!676 = !{!677, !678, !683, !714, !715, !716, !717, !721, !727, !729, !733}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !675, file: !486, line: 72, baseType: !665, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !675, file: !486, line: 78, baseType: !679, size: 64, align: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!665, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !675, file: !486, line: 85, baseType: !684, size: 64, align: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !687)
!687 = !{!688, !689, !690, !692, !693, !710, !711, !712, !713}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !464, line: 247, baseType: !665, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !686, file: !464, line: 253, baseType: !665, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !686, file: !464, line: 259, baseType: !691, size: 32, align: 32, offset: 128)
!691 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !686, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !686, file: !464, line: 271, baseType: !694, size: 64, align: 64, offset: 192)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !686, file: !464, line: 265, size: 64, align: 64, elements: !695)
!695 = !{!696, !700, !702, !703}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !694, file: !464, line: 266, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !698, line: 40, baseType: !699)
!698 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!699 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !694, file: !464, line: 267, baseType: !701, size: 64, align: 64)
!701 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !694, file: !464, line: 268, baseType: !665, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !694, file: !464, line: 270, baseType: !704, size: 64, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !705, line: 61, baseType: !706)
!705 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !705, line: 58, size: 64, align: 32, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !706, file: !705, line: 59, baseType: !691, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !706, file: !705, line: 60, baseType: !691, size: 32, align: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !686, file: !464, line: 272, baseType: !701, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !686, file: !464, line: 273, baseType: !701, size: 64, align: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !686, file: !464, line: 275, baseType: !691, size: 32, align: 32, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !686, file: !464, line: 300, baseType: !665, size: 64, align: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !675, file: !486, line: 93, baseType: !691, size: 32, align: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !675, file: !486, line: 99, baseType: !691, size: 32, align: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !675, file: !486, line: 108, baseType: !691, size: 32, align: 32, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !675, file: !486, line: 113, baseType: !718, size: 64, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!682, !682, !682}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !675, file: !486, line: 123, baseType: !722, size: 64, align: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !675, file: !486, line: 130, baseType: !728, size: 32, align: 32, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !675, file: !486, line: 136, baseType: !730, size: 64, align: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!728, !682}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !675, file: !486, line: 142, baseType: !734, size: 64, align: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!691, !737, !682, !665, !691}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !740)
!740 = !{!741, !753, !754}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !739, file: !464, line: 360, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !745, file: !464, line: 307, baseType: !665, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !745, file: !464, line: 313, baseType: !701, size: 64, align: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !745, file: !464, line: 313, baseType: !701, size: 64, align: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !745, file: !464, line: 318, baseType: !701, size: 64, align: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !745, file: !464, line: 318, baseType: !701, size: 64, align: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !745, file: !464, line: 323, baseType: !691, size: 32, align: 32, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !739, file: !464, line: 364, baseType: !691, size: 32, align: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !739, file: !464, line: 368, baseType: !691, size: 32, align: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !662, file: !4, line: 5825, baseType: !691, size: 32, align: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !662, file: !4, line: 5826, baseType: !757, size: 64, align: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!691, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !763)
!763 = !{!764, !765, !768, !772, !773, !814, !815, !816}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !762, file: !4, line: 5751, baseType: !672, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !762, file: !4, line: 5756, baseType: !766, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !762, file: !4, line: 5762, baseType: !769, size: 64, align: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !762, file: !4, line: 5768, baseType: !682, size: 64, align: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !762, file: !4, line: 5775, baseType: !774, size: 64, align: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !777)
!777 = !{!778, !779, !780, !783, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !807, !808, !809, !810, !811, !812, !813}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !776, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !776, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !776, file: !4, line: 3948, baseType: !781, size: 32, align: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !698, line: 51, baseType: !782)
!782 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !776, file: !4, line: 3958, baseType: !784, size: 64, align: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !698, line: 48, baseType: !786)
!786 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !776, file: !4, line: 3962, baseType: !691, size: 32, align: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !776, file: !4, line: 3968, baseType: !691, size: 32, align: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !776, file: !4, line: 3973, baseType: !697, size: 64, align: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !776, file: !4, line: 3986, baseType: !691, size: 32, align: 32, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !776, file: !4, line: 3999, baseType: !691, size: 32, align: 32, offset: 352)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !776, file: !4, line: 4004, baseType: !691, size: 32, align: 32, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !776, file: !4, line: 4005, baseType: !691, size: 32, align: 32, offset: 416)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !776, file: !4, line: 4010, baseType: !691, size: 32, align: 32, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !776, file: !4, line: 4011, baseType: !691, size: 32, align: 32, offset: 480)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !776, file: !4, line: 4020, baseType: !704, size: 64, align: 32, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !776, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !776, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !776, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !776, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !776, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !776, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !776, file: !4, line: 4039, baseType: !691, size: 32, align: 32, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !776, file: !4, line: 4046, baseType: !805, size: 64, align: 64, offset: 832)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !698, line: 55, baseType: !806)
!806 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !776, file: !4, line: 4050, baseType: !691, size: 32, align: 32, offset: 896)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !776, file: !4, line: 4054, baseType: !691, size: 32, align: 32, offset: 928)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !776, file: !4, line: 4061, baseType: !691, size: 32, align: 32, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !776, file: !4, line: 4065, baseType: !691, size: 32, align: 32, offset: 992)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !776, file: !4, line: 4073, baseType: !691, size: 32, align: 32, offset: 1024)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !776, file: !4, line: 4080, baseType: !691, size: 32, align: 32, offset: 1056)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !776, file: !4, line: 4084, baseType: !691, size: 32, align: 32, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !762, file: !4, line: 5781, baseType: !774, size: 64, align: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !762, file: !4, line: 5787, baseType: !704, size: 64, align: 32, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !762, file: !4, line: 5793, baseType: !704, size: 64, align: 32, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !662, file: !4, line: 5827, baseType: !818, size: 64, align: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!691, !760, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !824)
!824 = !{!825, !837, !838, !839, !840, !841, !842, !843, !851, !852, !853, !854}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !823, file: !4, line: 1451, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !828, line: 94, baseType: !829)
!828 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !828, line: 81, size: 192, align: 64, elements: !830)
!830 = !{!831, !835, !836}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !829, file: !828, line: 82, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !828, line: 73, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !828, line: 73, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !829, file: !828, line: 89, baseType: !784, size: 64, align: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !829, file: !828, line: 93, baseType: !691, size: 32, align: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !823, file: !4, line: 1461, baseType: !697, size: 64, align: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !823, file: !4, line: 1467, baseType: !697, size: 64, align: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !823, file: !4, line: 1468, baseType: !784, size: 64, align: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !823, file: !4, line: 1469, baseType: !691, size: 32, align: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !823, file: !4, line: 1470, baseType: !691, size: 32, align: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !823, file: !4, line: 1474, baseType: !691, size: 32, align: 32, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !823, file: !4, line: 1479, baseType: !844, size: 64, align: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !846, file: !4, line: 1412, baseType: !784, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !846, file: !4, line: 1413, baseType: !691, size: 32, align: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !846, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !823, file: !4, line: 1480, baseType: !691, size: 32, align: 32, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !823, file: !4, line: 1486, baseType: !697, size: 64, align: 64, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !823, file: !4, line: 1488, baseType: !697, size: 64, align: 64, offset: 576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !823, file: !4, line: 1497, baseType: !697, size: 64, align: 64, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !662, file: !4, line: 5828, baseType: !856, size: 64, align: 64, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64, align: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !760}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !662, file: !4, line: 5829, baseType: !856, size: 64, align: 64, offset: 448)
!860 = distinct !DIGlobalVariable(name: "mpeg2_metadata_codec_ids", scope: !0, file: !659, line: 302, type: !861, isLocal: true, isDefinition: true, variable: [2 x i32]* @mpeg2_metadata_codec_ids)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, align: 32, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 2)
!864 = distinct !DIGlobalVariable(name: "mpeg2_metadata_class", scope: !0, file: !659, line: 295, type: !673, isLocal: true, isDefinition: true, variable: %struct.AVClass* @mpeg2_metadata_class)
!865 = distinct !DIGlobalVariable(name: "mpeg2_metadata_options", scope: !0, file: !659, line: 270, type: !866, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @mpeg2_metadata_options)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 3584, align: 64, elements: !869)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !686)
!869 = !{!870}
!870 = !DISubrange(count: 7)
!871 = !{i32 2, !"Dwarf Version", i32 4}
!872 = !{i32 2, !"Debug Info Version", i32 3}
!873 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!874 = distinct !DISubprogram(name: "mpeg2_metadata_init", scope: !659, file: !659, line: 226, type: !758, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !875)
!875 = !{}
!876 = !DILocalVariable(name: "bsf", arg: 1, scope: !874, file: !659, line: 226, type: !760)
!877 = !DIExpression()
!878 = !DILocation(line: 226, column: 46, scope: !874)
!879 = !DILocalVariable(name: "ctx", scope: !874, file: !659, line: 228, type: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2MetadataContext", file: !659, line: 46, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2MetadataContext", file: !659, line: 28, size: 2944, align: 64, elements: !883)
!883 = !{!884, !885, !903, !926, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !882, file: !659, line: 29, baseType: !672, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "cbc", scope: !882, file: !659, line: 31, baseType: !886, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !888, line: 204, baseType: !889)
!888 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !888, line: 159, size: 384, align: 64, elements: !890)
!890 = !{!891, !892, !896, !897, !900, !901, !902}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !889, file: !888, line: 164, baseType: !682, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !889, file: !888, line: 169, baseType: !893, size: 64, align: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !888, line: 43, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !889, file: !888, line: 180, baseType: !682, size: 64, align: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !889, file: !888, line: 188, baseType: !898, size: 64, align: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !888, line: 53, baseType: !781)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !889, file: !888, line: 192, baseType: !691, size: 32, align: 32, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !889, file: !888, line: 197, baseType: !691, size: 32, align: 32, offset: 288)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !889, file: !888, line: 203, baseType: !691, size: 32, align: 32, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !882, file: !659, line: 32, baseType: !904, size: 384, align: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !888, line: 154, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !888, line: 116, size: 384, align: 64, elements: !906)
!906 = !{!907, !908, !911, !912, !913, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !905, file: !888, line: 122, baseType: !784, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !905, file: !888, line: 129, baseType: !909, size: 64, align: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !910, line: 216, baseType: !806)
!910 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !905, file: !888, line: 133, baseType: !909, size: 64, align: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !905, file: !888, line: 139, baseType: !826, size: 64, align: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !905, file: !888, line: 147, baseType: !691, size: 32, align: 32, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !905, file: !888, line: 153, baseType: !915, size: 64, align: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !888, line: 107, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !888, line: 64, size: 448, align: 64, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !917, file: !888, line: 68, baseType: !899, size: 32, align: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !917, file: !888, line: 75, baseType: !784, size: 64, align: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !917, file: !888, line: 80, baseType: !909, size: 64, align: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !917, file: !888, line: 86, baseType: !909, size: 64, align: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !917, file: !888, line: 92, baseType: !826, size: 64, align: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !917, file: !888, line: 101, baseType: !682, size: 64, align: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !917, file: !888, line: 106, baseType: !826, size: 64, align: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_display_extension", scope: !882, file: !659, line: 34, baseType: !927, size: 2096, align: 16, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawExtensionData", file: !633, line: 182, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawExtensionData", file: !633, line: 171, size: 2096, align: 16, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "extension_start_code", scope: !928, file: !633, line: 172, baseType: !785, size: 8, align: 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "extension_start_code_identifier", scope: !928, file: !633, line: 173, baseType: !785, size: 8, align: 8, offset: 8)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !928, file: !633, line: 181, baseType: !933, size: 2080, align: 16, offset: 16)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !928, file: !633, line: 175, size: 2080, align: 16, elements: !934)
!934 = !{!935, !951, !962, !977, !1001}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !933, file: !633, line: 176, baseType: !936, size: 96, align: 16)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawSequenceExtension", file: !633, line: 95, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawSequenceExtension", file: !633, line: 84, size: 96, align: 16, elements: !938)
!938 = !{!939, !940, !941, !942, !943, !944, !947, !948, !949, !950}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "profile_and_level_indication", scope: !937, file: !633, line: 85, baseType: !785, size: 8, align: 8)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_sequence", scope: !937, file: !633, line: 86, baseType: !785, size: 8, align: 8, offset: 8)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format", scope: !937, file: !633, line: 87, baseType: !785, size: 8, align: 8, offset: 16)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "horizontal_size_extension", scope: !937, file: !633, line: 88, baseType: !785, size: 8, align: 8, offset: 24)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_size_extension", scope: !937, file: !633, line: 89, baseType: !785, size: 8, align: 8, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_extension", scope: !937, file: !633, line: 90, baseType: !945, size: 16, align: 16, offset: 48)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !698, line: 49, baseType: !946)
!946 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_buffer_size_extension", scope: !937, file: !633, line: 91, baseType: !785, size: 8, align: 8, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay", scope: !937, file: !633, line: 92, baseType: !785, size: 8, align: 8, offset: 72)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate_extension_n", scope: !937, file: !633, line: 93, baseType: !785, size: 8, align: 8, offset: 80)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate_extension_d", scope: !937, file: !633, line: 94, baseType: !785, size: 8, align: 8, offset: 88)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_display", scope: !933, file: !633, line: 177, baseType: !952, size: 80, align: 16)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawSequenceDisplayExtension", file: !633, line: 107, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawSequenceDisplayExtension", file: !633, line: 97, size: 80, align: 16, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !953, file: !633, line: 98, baseType: !785, size: 8, align: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description", scope: !953, file: !633, line: 100, baseType: !785, size: 8, align: 8, offset: 8)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !953, file: !633, line: 101, baseType: !785, size: 8, align: 8, offset: 16)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !953, file: !633, line: 102, baseType: !785, size: 8, align: 8, offset: 24)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !953, file: !633, line: 103, baseType: !785, size: 8, align: 8, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "display_horizontal_size", scope: !953, file: !633, line: 105, baseType: !945, size: 16, align: 16, offset: 48)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "display_vertical_size", scope: !953, file: !633, line: 106, baseType: !945, size: 16, align: 16, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "quant_matrix", scope: !933, file: !633, line: 178, baseType: !963, size: 2080, align: 8)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawQuantMatrixExtension", file: !633, line: 164, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawQuantMatrixExtension", file: !633, line: 155, size: 2080, align: 8, elements: !965)
!965 = !{!966, !967, !971, !972, !973, !974, !975, !976}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "load_intra_quantiser_matrix", scope: !964, file: !633, line: 156, baseType: !785, size: 8, align: 8)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "intra_quantiser_matrix", scope: !964, file: !633, line: 157, baseType: !968, size: 512, align: 8, offset: 8)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 512, align: 8, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "load_non_intra_quantiser_matrix", scope: !964, file: !633, line: 158, baseType: !785, size: 8, align: 8, offset: 520)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "non_intra_quantiser_matrix", scope: !964, file: !633, line: 159, baseType: !968, size: 512, align: 8, offset: 528)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "load_chroma_intra_quantiser_matrix", scope: !964, file: !633, line: 160, baseType: !785, size: 8, align: 8, offset: 1040)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_quantiser_matrix", scope: !964, file: !633, line: 161, baseType: !968, size: 512, align: 8, offset: 1048)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "load_chroma_non_intra_quantiser_matrix", scope: !964, file: !633, line: 162, baseType: !785, size: 8, align: 8, offset: 1560)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_non_intra_quantiser_matrix", scope: !964, file: !633, line: 163, baseType: !968, size: 512, align: 8, offset: 1568)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "picture_coding", scope: !933, file: !633, line: 179, baseType: !978, size: 168, align: 8)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawPictureCodingExtension", file: !633, line: 153, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawPictureCodingExtension", file: !633, line: 132, size: 168, align: 8, elements: !980)
!980 = !{!981, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !979, file: !633, line: 133, baseType: !982, size: 32, align: 8)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 32, align: 8, elements: !983)
!983 = !{!863, !863}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !979, file: !633, line: 135, baseType: !785, size: 8, align: 8, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !979, file: !633, line: 136, baseType: !785, size: 8, align: 8, offset: 40)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !979, file: !633, line: 137, baseType: !785, size: 8, align: 8, offset: 48)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pred_frame_dct", scope: !979, file: !633, line: 138, baseType: !785, size: 8, align: 8, offset: 56)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_motion_vectors", scope: !979, file: !633, line: 139, baseType: !785, size: 8, align: 8, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "q_scale_type", scope: !979, file: !633, line: 140, baseType: !785, size: 8, align: 8, offset: 72)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "intra_vlc_format", scope: !979, file: !633, line: 141, baseType: !785, size: 8, align: 8, offset: 80)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_scan", scope: !979, file: !633, line: 142, baseType: !785, size: 8, align: 8, offset: 88)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_first_field", scope: !979, file: !633, line: 143, baseType: !785, size: 8, align: 8, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_420_type", scope: !979, file: !633, line: 144, baseType: !785, size: 8, align: 8, offset: 104)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_frame", scope: !979, file: !633, line: 145, baseType: !785, size: 8, align: 8, offset: 112)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "composite_display_flag", scope: !979, file: !633, line: 147, baseType: !785, size: 8, align: 8, offset: 120)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "v_axis", scope: !979, file: !633, line: 148, baseType: !785, size: 8, align: 8, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "field_sequence", scope: !979, file: !633, line: 149, baseType: !785, size: 8, align: 8, offset: 136)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "sub_carrier", scope: !979, file: !633, line: 150, baseType: !785, size: 8, align: 8, offset: 144)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "burst_amplitude", scope: !979, file: !633, line: 151, baseType: !785, size: 8, align: 8, offset: 152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "sub_carrier_phase", scope: !979, file: !633, line: 152, baseType: !785, size: 8, align: 8, offset: 160)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "picture_display", scope: !933, file: !633, line: 180, baseType: !1002, size: 96, align: 16)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawPictureDisplayExtension", file: !633, line: 169, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawPictureDisplayExtension", file: !633, line: 166, size: 96, align: 16, elements: !1004)
!1004 = !{!1005, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "frame_centre_horizontal_offset", scope: !1003, file: !633, line: 167, baseType: !1006, size: 48, align: 16)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 48, align: 16, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 3)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "frame_centre_vertical_offset", scope: !1003, file: !633, line: 168, baseType: !1006, size: 48, align: 16, offset: 48)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "display_aspect_ratio", scope: !882, file: !659, line: 36, baseType: !704, size: 64, align: 32, offset: 2624)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !882, file: !659, line: 38, baseType: !704, size: 64, align: 32, offset: 2688)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !882, file: !659, line: 40, baseType: !691, size: 32, align: 32, offset: 2752)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !882, file: !659, line: 41, baseType: !691, size: 32, align: 32, offset: 2784)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !882, file: !659, line: 42, baseType: !691, size: 32, align: 32, offset: 2816)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !882, file: !659, line: 43, baseType: !691, size: 32, align: 32, offset: 2848)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg1_warned", scope: !882, file: !659, line: 45, baseType: !691, size: 32, align: 32, offset: 2880)
!1017 = !DILocation(line: 228, column: 27, scope: !874)
!1018 = !DILocation(line: 228, column: 33, scope: !874)
!1019 = !DILocation(line: 228, column: 38, scope: !874)
!1020 = !DILocalVariable(name: "frag", scope: !874, file: !659, line: 229, type: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1022 = !DILocation(line: 229, column: 29, scope: !874)
!1023 = !DILocation(line: 229, column: 37, scope: !874)
!1024 = !DILocation(line: 229, column: 42, scope: !874)
!1025 = !DILocalVariable(name: "err", scope: !874, file: !659, line: 230, type: !691)
!1026 = !DILocation(line: 230, column: 9, scope: !874)
!1027 = !DILocation(line: 232, column: 24, scope: !874)
!1028 = !DILocation(line: 232, column: 29, scope: !874)
!1029 = !DILocation(line: 232, column: 58, scope: !874)
!1030 = !DILocation(line: 232, column: 11, scope: !874)
!1031 = !DILocation(line: 232, column: 9, scope: !874)
!1032 = !DILocation(line: 233, column: 9, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !874, file: !659, line: 233, column: 9)
!1034 = !DILocation(line: 233, column: 13, scope: !1033)
!1035 = !DILocation(line: 233, column: 9, scope: !874)
!1036 = !DILocation(line: 234, column: 16, scope: !1033)
!1037 = !DILocation(line: 234, column: 9, scope: !1033)
!1038 = !DILocation(line: 236, column: 9, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !874, file: !659, line: 236, column: 9)
!1040 = !DILocation(line: 236, column: 14, scope: !1039)
!1041 = !DILocation(line: 236, column: 22, scope: !1039)
!1042 = !DILocation(line: 236, column: 9, scope: !874)
!1043 = !DILocation(line: 237, column: 37, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1039, file: !659, line: 236, column: 33)
!1045 = !DILocation(line: 237, column: 42, scope: !1044)
!1046 = !DILocation(line: 237, column: 47, scope: !1044)
!1047 = !DILocation(line: 237, column: 53, scope: !1044)
!1048 = !DILocation(line: 237, column: 58, scope: !1044)
!1049 = !DILocation(line: 237, column: 15, scope: !1044)
!1050 = !DILocation(line: 237, column: 13, scope: !1044)
!1051 = !DILocation(line: 238, column: 13, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1044, file: !659, line: 238, column: 13)
!1053 = !DILocation(line: 238, column: 17, scope: !1052)
!1054 = !DILocation(line: 238, column: 13, scope: !1044)
!1055 = !DILocation(line: 239, column: 20, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !659, line: 238, column: 22)
!1057 = !DILocation(line: 239, column: 13, scope: !1056)
!1058 = !DILocation(line: 240, column: 13, scope: !1056)
!1059 = !DILocation(line: 243, column: 46, scope: !1044)
!1060 = !DILocation(line: 243, column: 51, scope: !1044)
!1061 = !DILocation(line: 243, column: 15, scope: !1044)
!1062 = !DILocation(line: 243, column: 13, scope: !1044)
!1063 = !DILocation(line: 244, column: 13, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1044, file: !659, line: 244, column: 13)
!1065 = !DILocation(line: 244, column: 17, scope: !1064)
!1066 = !DILocation(line: 244, column: 13, scope: !1044)
!1067 = !DILocation(line: 245, column: 20, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !659, line: 244, column: 22)
!1069 = !DILocation(line: 245, column: 13, scope: !1068)
!1070 = !DILocation(line: 246, column: 13, scope: !1068)
!1071 = !DILocation(line: 249, column: 38, scope: !1044)
!1072 = !DILocation(line: 249, column: 43, scope: !1044)
!1073 = !DILocation(line: 249, column: 48, scope: !1044)
!1074 = !DILocation(line: 249, column: 53, scope: !1044)
!1075 = !DILocation(line: 249, column: 62, scope: !1044)
!1076 = !DILocation(line: 249, column: 15, scope: !1044)
!1077 = !DILocation(line: 249, column: 13, scope: !1044)
!1078 = !DILocation(line: 250, column: 13, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1044, file: !659, line: 250, column: 13)
!1080 = !DILocation(line: 250, column: 17, scope: !1079)
!1081 = !DILocation(line: 250, column: 13, scope: !1044)
!1082 = !DILocation(line: 251, column: 20, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !659, line: 250, column: 22)
!1084 = !DILocation(line: 251, column: 13, scope: !1083)
!1085 = !DILocation(line: 252, column: 13, scope: !1083)
!1086 = !DILocation(line: 254, column: 5, scope: !1044)
!1087 = !DILocation(line: 256, column: 9, scope: !874)
!1088 = !DILocation(line: 256, column: 5, scope: !874)
!1089 = !DILocation(line: 258, column: 28, scope: !874)
!1090 = !DILocation(line: 258, column: 33, scope: !874)
!1091 = !DILocation(line: 258, column: 38, scope: !874)
!1092 = !DILocation(line: 258, column: 5, scope: !874)
!1093 = !DILocation(line: 259, column: 12, scope: !874)
!1094 = !DILocation(line: 259, column: 5, scope: !874)
!1095 = !DILocation(line: 260, column: 1, scope: !874)
!1096 = distinct !DISubprogram(name: "mpeg2_metadata_filter", scope: !659, file: !659, line: 182, type: !819, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !875)
!1097 = !DILocalVariable(name: "bsf", arg: 1, scope: !1096, file: !659, line: 182, type: !760)
!1098 = !DILocation(line: 182, column: 48, scope: !1096)
!1099 = !DILocalVariable(name: "out", arg: 2, scope: !1096, file: !659, line: 182, type: !821)
!1100 = !DILocation(line: 182, column: 63, scope: !1096)
!1101 = !DILocalVariable(name: "ctx", scope: !1096, file: !659, line: 184, type: !880)
!1102 = !DILocation(line: 184, column: 27, scope: !1096)
!1103 = !DILocation(line: 184, column: 33, scope: !1096)
!1104 = !DILocation(line: 184, column: 38, scope: !1096)
!1105 = !DILocalVariable(name: "in", scope: !1096, file: !659, line: 185, type: !821)
!1106 = !DILocation(line: 185, column: 15, scope: !1096)
!1107 = !DILocalVariable(name: "frag", scope: !1096, file: !659, line: 186, type: !1021)
!1108 = !DILocation(line: 186, column: 29, scope: !1096)
!1109 = !DILocation(line: 186, column: 37, scope: !1096)
!1110 = !DILocation(line: 186, column: 42, scope: !1096)
!1111 = !DILocalVariable(name: "err", scope: !1096, file: !659, line: 187, type: !691)
!1112 = !DILocation(line: 187, column: 9, scope: !1096)
!1113 = !DILocation(line: 189, column: 29, scope: !1096)
!1114 = !DILocation(line: 189, column: 11, scope: !1096)
!1115 = !DILocation(line: 189, column: 9, scope: !1096)
!1116 = !DILocation(line: 190, column: 9, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1096, file: !659, line: 190, column: 9)
!1118 = !DILocation(line: 190, column: 13, scope: !1117)
!1119 = !DILocation(line: 190, column: 9, scope: !1096)
!1120 = !DILocation(line: 191, column: 16, scope: !1117)
!1121 = !DILocation(line: 191, column: 9, scope: !1117)
!1122 = !DILocation(line: 193, column: 30, scope: !1096)
!1123 = !DILocation(line: 193, column: 35, scope: !1096)
!1124 = !DILocation(line: 193, column: 40, scope: !1096)
!1125 = !DILocation(line: 193, column: 46, scope: !1096)
!1126 = !DILocation(line: 193, column: 11, scope: !1096)
!1127 = !DILocation(line: 193, column: 9, scope: !1096)
!1128 = !DILocation(line: 194, column: 9, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1096, file: !659, line: 194, column: 9)
!1130 = !DILocation(line: 194, column: 13, scope: !1129)
!1131 = !DILocation(line: 194, column: 9, scope: !1096)
!1132 = !DILocation(line: 195, column: 16, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1129, file: !659, line: 194, column: 18)
!1134 = !DILocation(line: 195, column: 9, scope: !1133)
!1135 = !DILocation(line: 196, column: 9, scope: !1133)
!1136 = !DILocation(line: 199, column: 42, scope: !1096)
!1137 = !DILocation(line: 199, column: 47, scope: !1096)
!1138 = !DILocation(line: 199, column: 11, scope: !1096)
!1139 = !DILocation(line: 199, column: 9, scope: !1096)
!1140 = !DILocation(line: 200, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1096, file: !659, line: 200, column: 9)
!1142 = !DILocation(line: 200, column: 13, scope: !1141)
!1143 = !DILocation(line: 200, column: 9, scope: !1096)
!1144 = !DILocation(line: 201, column: 16, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1141, file: !659, line: 200, column: 18)
!1146 = !DILocation(line: 201, column: 9, scope: !1145)
!1147 = !DILocation(line: 202, column: 9, scope: !1145)
!1148 = !DILocation(line: 205, column: 31, scope: !1096)
!1149 = !DILocation(line: 205, column: 36, scope: !1096)
!1150 = !DILocation(line: 205, column: 41, scope: !1096)
!1151 = !DILocation(line: 205, column: 46, scope: !1096)
!1152 = !DILocation(line: 205, column: 11, scope: !1096)
!1153 = !DILocation(line: 205, column: 9, scope: !1096)
!1154 = !DILocation(line: 206, column: 9, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1096, file: !659, line: 206, column: 9)
!1156 = !DILocation(line: 206, column: 13, scope: !1155)
!1157 = !DILocation(line: 206, column: 9, scope: !1096)
!1158 = !DILocation(line: 207, column: 16, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !659, line: 206, column: 18)
!1160 = !DILocation(line: 207, column: 9, scope: !1159)
!1161 = !DILocation(line: 208, column: 9, scope: !1159)
!1162 = !DILocation(line: 211, column: 32, scope: !1096)
!1163 = !DILocation(line: 211, column: 37, scope: !1096)
!1164 = !DILocation(line: 211, column: 11, scope: !1096)
!1165 = !DILocation(line: 211, column: 9, scope: !1096)
!1166 = !DILocation(line: 212, column: 9, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1096, file: !659, line: 212, column: 9)
!1168 = !DILocation(line: 212, column: 13, scope: !1167)
!1169 = !DILocation(line: 212, column: 9, scope: !1096)
!1170 = !DILocation(line: 213, column: 9, scope: !1167)
!1171 = !DILocation(line: 215, column: 9, scope: !1096)
!1172 = !DILocation(line: 215, column: 5, scope: !1096)
!1173 = !DILocation(line: 217, column: 28, scope: !1096)
!1174 = !DILocation(line: 217, column: 33, scope: !1096)
!1175 = !DILocation(line: 217, column: 38, scope: !1096)
!1176 = !DILocation(line: 217, column: 5, scope: !1096)
!1177 = !DILocation(line: 219, column: 9, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1096, file: !659, line: 219, column: 9)
!1179 = !DILocation(line: 219, column: 13, scope: !1178)
!1180 = !DILocation(line: 219, column: 9, scope: !1096)
!1181 = !DILocation(line: 220, column: 25, scope: !1178)
!1182 = !DILocation(line: 220, column: 9, scope: !1178)
!1183 = !DILocation(line: 221, column: 5, scope: !1096)
!1184 = !DILocation(line: 223, column: 12, scope: !1096)
!1185 = !DILocation(line: 223, column: 5, scope: !1096)
!1186 = !DILocation(line: 224, column: 1, scope: !1096)
!1187 = distinct !DISubprogram(name: "mpeg2_metadata_close", scope: !659, file: !659, line: 262, type: !857, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !875)
!1188 = !DILocalVariable(name: "bsf", arg: 1, scope: !1187, file: !659, line: 262, type: !760)
!1189 = !DILocation(line: 262, column: 48, scope: !1187)
!1190 = !DILocalVariable(name: "ctx", scope: !1187, file: !659, line: 264, type: !880)
!1191 = !DILocation(line: 264, column: 27, scope: !1187)
!1192 = !DILocation(line: 264, column: 33, scope: !1187)
!1193 = !DILocation(line: 264, column: 38, scope: !1187)
!1194 = !DILocation(line: 265, column: 19, scope: !1187)
!1195 = !DILocation(line: 265, column: 24, scope: !1187)
!1196 = !DILocation(line: 265, column: 5, scope: !1187)
!1197 = !DILocation(line: 266, column: 1, scope: !1187)
!1198 = distinct !DISubprogram(name: "mpeg2_metadata_update_fragment", scope: !659, file: !659, line: 49, type: !1199, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !875)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!691, !760, !1021}
!1201 = !DILocalVariable(name: "bsf", arg: 1, scope: !1198, file: !659, line: 49, type: !760)
!1202 = !DILocation(line: 49, column: 57, scope: !1198)
!1203 = !DILocalVariable(name: "frag", arg: 2, scope: !1198, file: !659, line: 50, type: !1021)
!1204 = !DILocation(line: 50, column: 67, scope: !1198)
!1205 = !DILocalVariable(name: "ctx", scope: !1198, file: !659, line: 52, type: !880)
!1206 = !DILocation(line: 52, column: 27, scope: !1198)
!1207 = !DILocation(line: 52, column: 33, scope: !1198)
!1208 = !DILocation(line: 52, column: 38, scope: !1198)
!1209 = !DILocalVariable(name: "sh", scope: !1198, file: !659, line: 53, type: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG2RawSequenceHeader", file: !633, line: 74, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG2RawSequenceHeader", file: !633, line: 59, size: 1184, align: 32, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_header_code", scope: !1212, file: !633, line: 60, baseType: !785, size: 8, align: 8)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "horizontal_size_value", scope: !1212, file: !633, line: 62, baseType: !945, size: 16, align: 16, offset: 16)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_size_value", scope: !1212, file: !633, line: 63, baseType: !945, size: 16, align: 16, offset: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_information", scope: !1212, file: !633, line: 64, baseType: !785, size: 8, align: 8, offset: 48)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate_code", scope: !1212, file: !633, line: 65, baseType: !785, size: 8, align: 8, offset: 56)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !1212, file: !633, line: 66, baseType: !781, size: 32, align: 32, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_buffer_size_value", scope: !1212, file: !633, line: 67, baseType: !945, size: 16, align: 16, offset: 96)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_parameters_flag", scope: !1212, file: !633, line: 68, baseType: !785, size: 8, align: 8, offset: 112)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "load_intra_quantiser_matrix", scope: !1212, file: !633, line: 70, baseType: !785, size: 8, align: 8, offset: 120)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "intra_quantiser_matrix", scope: !1212, file: !633, line: 71, baseType: !968, size: 512, align: 8, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "load_non_intra_quantiser_matrix", scope: !1212, file: !633, line: 72, baseType: !785, size: 8, align: 8, offset: 640)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "non_intra_quantiser_matrix", scope: !1212, file: !633, line: 73, baseType: !968, size: 512, align: 8, offset: 648)
!1226 = !DILocation(line: 53, column: 29, scope: !1198)
!1227 = !DILocalVariable(name: "se", scope: !1198, file: !659, line: 54, type: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1229 = !DILocation(line: 54, column: 32, scope: !1198)
!1230 = !DILocalVariable(name: "sde", scope: !1198, file: !659, line: 55, type: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1232 = !DILocation(line: 55, column: 39, scope: !1198)
!1233 = !DILocalVariable(name: "i", scope: !1198, file: !659, line: 56, type: !691)
!1234 = !DILocation(line: 56, column: 9, scope: !1198)
!1235 = !DILocalVariable(name: "se_pos", scope: !1198, file: !659, line: 56, type: !691)
!1236 = !DILocation(line: 56, column: 12, scope: !1198)
!1237 = !DILocalVariable(name: "add_sde", scope: !1198, file: !659, line: 56, type: !691)
!1238 = !DILocation(line: 56, column: 20, scope: !1198)
!1239 = !DILocation(line: 58, column: 12, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1198, file: !659, line: 58, column: 5)
!1241 = !DILocation(line: 58, column: 10, scope: !1240)
!1242 = !DILocation(line: 58, column: 17, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1244, file: !659, discriminator: 1)
!1244 = distinct !DILexicalBlock(scope: !1240, file: !659, line: 58, column: 5)
!1245 = !DILocation(line: 58, column: 21, scope: !1243)
!1246 = !DILocation(line: 58, column: 27, scope: !1243)
!1247 = !DILocation(line: 58, column: 19, scope: !1243)
!1248 = !DILocation(line: 58, column: 5, scope: !1243)
!1249 = !DILocation(line: 59, column: 25, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1251, file: !659, line: 59, column: 13)
!1251 = distinct !DILexicalBlock(scope: !1244, file: !659, line: 58, column: 42)
!1252 = !DILocation(line: 59, column: 13, scope: !1250)
!1253 = !DILocation(line: 59, column: 19, scope: !1250)
!1254 = !DILocation(line: 59, column: 28, scope: !1250)
!1255 = !DILocation(line: 59, column: 33, scope: !1250)
!1256 = !DILocation(line: 59, column: 13, scope: !1251)
!1257 = !DILocation(line: 60, column: 30, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1250, file: !659, line: 59, column: 65)
!1259 = !DILocation(line: 60, column: 18, scope: !1258)
!1260 = !DILocation(line: 60, column: 24, scope: !1258)
!1261 = !DILocation(line: 60, column: 33, scope: !1258)
!1262 = !DILocation(line: 60, column: 16, scope: !1258)
!1263 = !DILocation(line: 61, column: 9, scope: !1258)
!1264 = !DILocation(line: 61, column: 32, scope: !1265)
!1265 = !DILexicalBlockFile(scope: !1266, file: !659, discriminator: 1)
!1266 = distinct !DILexicalBlock(scope: !1250, file: !659, line: 61, column: 20)
!1267 = !DILocation(line: 61, column: 20, scope: !1265)
!1268 = !DILocation(line: 61, column: 26, scope: !1265)
!1269 = !DILocation(line: 61, column: 35, scope: !1265)
!1270 = !DILocation(line: 61, column: 40, scope: !1265)
!1271 = !DILocalVariable(name: "ext", scope: !1272, file: !659, line: 62, type: !1273)
!1272 = distinct !DILexicalBlock(scope: !1266, file: !659, line: 61, column: 66)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1274 = !DILocation(line: 62, column: 36, scope: !1272)
!1275 = !DILocation(line: 62, column: 54, scope: !1272)
!1276 = !DILocation(line: 62, column: 42, scope: !1272)
!1277 = !DILocation(line: 62, column: 48, scope: !1272)
!1278 = !DILocation(line: 62, column: 57, scope: !1272)
!1279 = !DILocation(line: 63, column: 17, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1272, file: !659, line: 63, column: 17)
!1281 = !DILocation(line: 63, column: 22, scope: !1280)
!1282 = !DILocation(line: 63, column: 54, scope: !1280)
!1283 = !DILocation(line: 63, column: 17, scope: !1272)
!1284 = !DILocation(line: 65, column: 23, scope: !1285)
