; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacdec_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacdec_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVProfile = type { i32, i8* }
%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!971 = !DIEnumerator(name: "AOT_MAINSYNTH", value: 13)
!972 = !DIEnumerator(name: "AOT_WAVESYNTH", value: 14)
!973 = !DIEnumerator(name: "AOT_MIDI", value: 15)
!974 = !DIEnumerator(name: "AOT_SAFX", value: 16)
!975 = !DIEnumerator(name: "AOT_ER_AAC_LC", value: 17)
!976 = !DIEnumerator(name: "AOT_ER_AAC_LTP", value: 19)
!977 = !DIEnumerator(name: "AOT_ER_AAC_SCALABLE", value: 20)
!978 = !DIEnumerator(name: "AOT_ER_TWINVQ", value: 21)
!979 = !DIEnumerator(name: "AOT_ER_BSAC", value: 22)
!980 = !DIEnumerator(name: "AOT_ER_AAC_LD", value: 23)
!981 = !DIEnumerator(name: "AOT_ER_CELP", value: 24)
!982 = !DIEnumerator(name: "AOT_ER_HVXC", value: 25)
!983 = !DIEnumerator(name: "AOT_ER_HILN", value: 26)
!984 = !DIEnumerator(name: "AOT_ER_PARAM", value: 27)
!985 = !DIEnumerator(name: "AOT_SSC", value: 28)
!986 = !DIEnumerator(name: "AOT_PS", value: 29)
!987 = !DIEnumerator(name: "AOT_SURROUND", value: 30)
!988 = !DIEnumerator(name: "AOT_ESCAPE", value: 31)
!989 = !DIEnumerator(name: "AOT_L1", value: 32)
!990 = !DIEnumerator(name: "AOT_L2", value: 33)
!991 = !DIEnumerator(name: "AOT_L3", value: 34)
!992 = !DIEnumerator(name: "AOT_DST", value: 35)
!993 = !DIEnumerator(name: "AOT_ALS", value: 36)
!994 = !DIEnumerator(name: "AOT_SLS", value: 37)
!995 = !DIEnumerator(name: "AOT_SLS_NON_CORE", value: 38)
!996 = !DIEnumerator(name: "AOT_ER_AAC_ELD", value: 39)
!997 = !DIEnumerator(name: "AOT_SMR_SIMPLE", value: 40)
!998 = !DIEnumerator(name: "AOT_SMR_MAIN", value: 41)
!999 = !DIEnumerator(name: "AOT_USAC_NOSBR", value: 42)
!1000 = !DIEnumerator(name: "AOT_SAOC", value: 43)
!1001 = !DIEnumerator(name: "AOT_LD_SURROUND", value: 44)
!1002 = !DIEnumerator(name: "AOT_USAC", value: 45)
!1003 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ChannelPosition", file: !910, line: 94, size: 32, align: 32, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010}
!1005 = !DIEnumerator(name: "AAC_CHANNEL_OFF", value: 0)
!1006 = !DIEnumerator(name: "AAC_CHANNEL_FRONT", value: 1)
!1007 = !DIEnumerator(name: "AAC_CHANNEL_SIDE", value: 2)
!1008 = !DIEnumerator(name: "AAC_CHANNEL_BACK", value: 3)
!1009 = !DIEnumerator(name: "AAC_CHANNEL_LFE", value: 4)
!1010 = !DIEnumerator(name: "AAC_CHANNEL_CC", value: 5)
!1011 = !{!1012, !1013, !1014, !1017, !1019, !1020, !1022, !1023, !1030, !1032, !1033, !1029, !1034, !1036, !1037}
!1012 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1013 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1015, line: 40, baseType: !1016)
!1015 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1016 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTFLOAT", file: !1018, line: 38, baseType: !1013)
!1018 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !1018, line: 37, baseType: !1012)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPC_TYPE_U", file: !1021, line: 120, baseType: !1013)
!1021 = !DIFile(filename: "libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1026, line: 221, size: 32, align: 8, elements: !1027)
!1026 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1025, file: !1026, line: 221, baseType: !1029, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1015, line: 51, baseType: !1013)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1015, line: 48, baseType: !1031)
!1031 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !1018, line: 42, baseType: !1012)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1015, line: 55, baseType: !1035)
!1035 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1015, line: 38, baseType: !1012)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1040)
!1040 = !{!1041, !1046, !1048, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1092, !1094, !1095, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137, !1138, !1139}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1039, file: !744, line: 282, baseType: !1042, size: 512, align: 64)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 512, align: 64, elements: !1044)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1044 = !{!1045}
!1045 = !DISubrange(count: 8)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1039, file: !744, line: 299, baseType: !1047, size: 256, align: 32, offset: 512)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 256, align: 32, elements: !1044)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1039, file: !744, line: 315, baseType: !1049, size: 64, align: 64, offset: 768)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1039, file: !744, line: 326, baseType: !1012, size: 32, align: 32, offset: 832)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1039, file: !744, line: 326, baseType: !1012, size: 32, align: 32, offset: 864)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1039, file: !744, line: 334, baseType: !1012, size: 32, align: 32, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1039, file: !744, line: 341, baseType: !1012, size: 32, align: 32, offset: 928)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1039, file: !744, line: 346, baseType: !1012, size: 32, align: 32, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1039, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1039, file: !744, line: 356, baseType: !1057, size: 64, align: 32, offset: 1024)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1058, line: 61, baseType: !1059)
!1058 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1058, line: 58, size: 64, align: 32, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1059, file: !1058, line: 59, baseType: !1012, size: 32, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1059, file: !1058, line: 60, baseType: !1012, size: 32, align: 32, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1039, file: !744, line: 361, baseType: !1014, size: 64, align: 64, offset: 1088)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1039, file: !744, line: 369, baseType: !1014, size: 64, align: 64, offset: 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1039, file: !744, line: 377, baseType: !1014, size: 64, align: 64, offset: 1216)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1039, file: !744, line: 382, baseType: !1012, size: 32, align: 32, offset: 1280)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1039, file: !744, line: 386, baseType: !1012, size: 32, align: 32, offset: 1312)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1039, file: !744, line: 391, baseType: !1012, size: 32, align: 32, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1039, file: !744, line: 396, baseType: !1022, size: 64, align: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1039, file: !744, line: 403, baseType: !1071, size: 512, align: 64, offset: 1472)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 512, align: 64, elements: !1044)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1039, file: !744, line: 410, baseType: !1012, size: 32, align: 32, offset: 1984)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1039, file: !744, line: 415, baseType: !1012, size: 32, align: 32, offset: 2016)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1039, file: !744, line: 420, baseType: !1012, size: 32, align: 32, offset: 2048)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1039, file: !744, line: 425, baseType: !1012, size: 32, align: 32, offset: 2080)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1039, file: !744, line: 435, baseType: !1014, size: 64, align: 64, offset: 2112)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1039, file: !744, line: 440, baseType: !1012, size: 32, align: 32, offset: 2176)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1039, file: !744, line: 445, baseType: !1034, size: 64, align: 64, offset: 2240)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1039, file: !744, line: 459, baseType: !1080, size: 512, align: 64, offset: 2304)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 512, align: 64, elements: !1044)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1083, line: 94, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1083, line: 81, size: 192, align: 64, elements: !1085)
!1085 = !{!1086, !1090, !1091}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1084, file: !1083, line: 82, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1083, line: 73, baseType: !1089)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1083, line: 73, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !1083, line: 89, baseType: !1043, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !1083, line: 93, baseType: !1012, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1039, file: !744, line: 473, baseType: !1093, size: 64, align: 64, offset: 2816)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1039, file: !744, line: 477, baseType: !1012, size: 32, align: 32, offset: 2880)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1039, file: !744, line: 479, baseType: !1096, size: 64, align: 64, offset: 2944)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1109}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1099, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !744, line: 203, baseType: !1043, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1099, file: !744, line: 204, baseType: !1012, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1099, file: !744, line: 205, baseType: !1105, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1107, line: 86, baseType: !1108)
!1107 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1107, line: 86, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !744, line: 206, baseType: !1081, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1039, file: !744, line: 480, baseType: !1012, size: 32, align: 32, offset: 3008)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1039, file: !744, line: 505, baseType: !1012, size: 32, align: 32, offset: 3040)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1039, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1039, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1039, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1039, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1039, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1039, file: !744, line: 532, baseType: !1014, size: 64, align: 64, offset: 3264)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1039, file: !744, line: 539, baseType: !1014, size: 64, align: 64, offset: 3328)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1039, file: !744, line: 547, baseType: !1014, size: 64, align: 64, offset: 3392)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1039, file: !744, line: 554, baseType: !1105, size: 64, align: 64, offset: 3456)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1039, file: !744, line: 563, baseType: !1012, size: 32, align: 32, offset: 3520)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1039, file: !744, line: 572, baseType: !1012, size: 32, align: 32, offset: 3552)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1039, file: !744, line: 581, baseType: !1012, size: 32, align: 32, offset: 3584)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1039, file: !744, line: 588, baseType: !1125, size: 64, align: 64, offset: 3648)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1015, line: 36, baseType: !1127)
!1127 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1039, file: !744, line: 593, baseType: !1012, size: 32, align: 32, offset: 3712)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1039, file: !744, line: 596, baseType: !1012, size: 32, align: 32, offset: 3744)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1039, file: !744, line: 599, baseType: !1081, size: 64, align: 64, offset: 3776)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1039, file: !744, line: 605, baseType: !1081, size: 64, align: 64, offset: 3840)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1039, file: !744, line: 616, baseType: !1081, size: 64, align: 64, offset: 3904)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1039, file: !744, line: 626, baseType: !1134, size: 64, align: 64, offset: 3968)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1135, line: 216, baseType: !1035)
!1135 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1039, file: !744, line: 627, baseType: !1134, size: 64, align: 64, offset: 4032)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1039, file: !744, line: 628, baseType: !1134, size: 64, align: 64, offset: 4096)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1039, file: !744, line: 629, baseType: !1134, size: 64, align: 64, offset: 4160)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1039, file: !744, line: 645, baseType: !1081, size: 64, align: 64, offset: 4224)
!1140 = !{!1141, !1794, !1799, !1803, !1814, !1818, !1822, !1826, !1830, !1834, !1838, !1842, !1846, !1850, !1854, !1858, !1873, !1878, !1879, !1881, !1884, !1889, !1892, !1896, !1897, !1899, !1901, !1902, !2053, !2059, !2060, !2061}
!1141 = distinct !DIGlobalVariable(name: "ff_aac_fixed_decoder", scope: !0, file: !1142, line: 446, type: !1143, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aac_fixed_decoder)
!1142 = !DIFile(filename: "libavcodec/aacdec_fixed.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1145)
!1145 = !{!1146, !1150, !1151, !1152, !1153, !1154, !1157, !1160, !1163, !1166, !1169, !1170, !1243, !1251, !1252, !1253, !1255, !1709, !1715, !1723, !1727, !1728, !1765, !1769, !1773, !1774, !1778, !1782, !1783, !1787, !1788, !1789}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1144, file: !14, line: 3475, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1149)
!1149 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1144, file: !14, line: 3480, baseType: !1147, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1144, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1144, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1144, file: !14, line: 3487, baseType: !1012, size: 32, align: 32, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1144, file: !14, line: 3488, baseType: !1155, size: 64, align: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1144, file: !14, line: 3489, baseType: !1158, size: 64, align: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1144, file: !14, line: 3490, baseType: !1161, size: 64, align: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1144, file: !14, line: 3491, baseType: !1164, size: 64, align: 64, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1144, file: !14, line: 3492, baseType: !1167, size: 64, align: 64, offset: 512)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1144, file: !14, line: 3493, baseType: !1030, size: 8, align: 8, offset: 576)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1144, file: !14, line: 3494, baseType: !1171, size: 64, align: 64, offset: 640)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1181, !1202, !1203, !1204, !1205, !1209, !1215, !1217, !1221}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1174, file: !713, line: 72, baseType: !1147, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1174, file: !713, line: 78, baseType: !1178, size: 64, align: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!1147, !1022}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1174, file: !713, line: 85, baseType: !1182, size: 64, align: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1198, !1199, !1200, !1201}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1184, file: !691, line: 247, baseType: !1147, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1184, file: !691, line: 253, baseType: !1147, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1184, file: !691, line: 259, baseType: !1012, size: 32, align: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1184, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1184, file: !691, line: 271, baseType: !1191, size: 64, align: 64, offset: 192)
!1191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1184, file: !691, line: 265, size: 64, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1196, !1197}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1191, file: !691, line: 266, baseType: !1014, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1191, file: !691, line: 267, baseType: !1195, size: 64, align: 64)
!1195 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1191, file: !691, line: 268, baseType: !1147, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1191, file: !691, line: 270, baseType: !1057, size: 64, align: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1184, file: !691, line: 272, baseType: !1195, size: 64, align: 64, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1184, file: !691, line: 273, baseType: !1195, size: 64, align: 64, offset: 320)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1184, file: !691, line: 275, baseType: !1012, size: 32, align: 32, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1184, file: !691, line: 300, baseType: !1147, size: 64, align: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1174, file: !713, line: 93, baseType: !1012, size: 32, align: 32, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1174, file: !713, line: 99, baseType: !1012, size: 32, align: 32, offset: 224)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1174, file: !713, line: 108, baseType: !1012, size: 32, align: 32, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1174, file: !713, line: 113, baseType: !1206, size: 64, align: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!1022, !1022, !1022}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1174, file: !713, line: 123, baseType: !1210, size: 64, align: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!1213, !1213}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1174, file: !713, line: 130, baseType: !1216, size: 32, align: 32, offset: 448)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1174, file: !713, line: 136, baseType: !1218, size: 64, align: 64, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!1216, !1022}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1174, file: !713, line: 142, baseType: !1222, size: 64, align: 64, offset: 576)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!1012, !1225, !1022, !1147, !1012}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1228)
!1228 = !{!1229, !1241, !1242}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1227, file: !691, line: 360, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1233, file: !691, line: 307, baseType: !1147, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1233, file: !691, line: 313, baseType: !1195, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1233, file: !691, line: 313, baseType: !1195, size: 64, align: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1233, file: !691, line: 318, baseType: !1195, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1233, file: !691, line: 318, baseType: !1195, size: 64, align: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1233, file: !691, line: 323, baseType: !1012, size: 32, align: 32, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1227, file: !691, line: 364, baseType: !1012, size: 32, align: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1227, file: !691, line: 368, baseType: !1012, size: 32, align: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1144, file: !14, line: 3495, baseType: !1244, size: 64, align: 64, offset: 704)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1247, file: !14, line: 3402, baseType: !1012, size: 32, align: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1247, file: !14, line: 3403, baseType: !1147, size: 64, align: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1144, file: !14, line: 3507, baseType: !1147, size: 64, align: 64, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1144, file: !14, line: 3516, baseType: !1012, size: 32, align: 32, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !14, line: 3517, baseType: !1254, size: 64, align: 64, offset: 896)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1144, file: !14, line: 3527, baseType: !1256, size: 64, align: 64, offset: 960)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!1012, !1259}
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1269, !1270, !1271, !1272, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1455, !1459, !1460, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1647, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1261, file: !14, line: 1561, baseType: !1171, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1261, file: !14, line: 1562, baseType: !1012, size: 32, align: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1261, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1261, file: !14, line: 1565, baseType: !1267, size: 64, align: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1261, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1261, file: !14, line: 1581, baseType: !1013, size: 32, align: 32, offset: 224)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1261, file: !14, line: 1583, baseType: !1022, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1261, file: !14, line: 1591, baseType: !1273, size: 64, align: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1275, line: 129, size: 1664, align: 64, elements: !1276)
!1275 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1302, !1303, !1332, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1274, file: !1275, line: 136, baseType: !1012, size: 32, align: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1274, file: !1275, line: 151, baseType: !1012, size: 32, align: 32, offset: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1274, file: !1275, line: 157, baseType: !1012, size: 32, align: 32, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1274, file: !1275, line: 159, baseType: !1037, size: 64, align: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1274, file: !1275, line: 161, baseType: !1282, size: 64, align: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1275, line: 117, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1275, line: 100, size: 832, align: 64, elements: !1285)
!1285 = !{!1286, !1293, !1294, !1295, !1296, !1297, !1299, !1300, !1301}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1284, file: !1275, line: 105, baseType: !1287, size: 256, align: 64)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1288, size: 256, align: 64, elements: !1291)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1083, line: 238, baseType: !1290)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1083, line: 238, flags: DIFlagFwdDecl)
!1291 = !{!1292}
!1292 = !DISubrange(count: 4)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1284, file: !1275, line: 110, baseType: !1012, size: 32, align: 32, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1284, file: !1275, line: 111, baseType: !1012, size: 32, align: 32, offset: 288)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1284, file: !1275, line: 111, baseType: !1012, size: 32, align: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1284, file: !1275, line: 112, baseType: !1047, size: 256, align: 32, offset: 352)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1284, file: !1275, line: 113, baseType: !1298, size: 128, align: 32, offset: 608)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, align: 32, elements: !1291)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1284, file: !1275, line: 114, baseType: !1012, size: 32, align: 32, offset: 736)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1284, file: !1275, line: 115, baseType: !1012, size: 32, align: 32, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1284, file: !1275, line: 116, baseType: !1012, size: 32, align: 32, offset: 800)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1274, file: !1275, line: 163, baseType: !1022, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1274, file: !1275, line: 165, baseType: !1304, size: 128, align: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1275, line: 122, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1275, line: 119, size: 128, align: 64, elements: !1306)
!1306 = !{!1307, !1331}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1305, file: !1275, line: 120, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1327, !1328, !1329, !1330}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1310, file: !14, line: 1451, baseType: !1081, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1310, file: !14, line: 1461, baseType: !1014, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1310, file: !14, line: 1467, baseType: !1014, size: 64, align: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1310, file: !14, line: 1468, baseType: !1043, size: 64, align: 64, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1310, file: !14, line: 1469, baseType: !1012, size: 32, align: 32, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1310, file: !14, line: 1470, baseType: !1012, size: 32, align: 32, offset: 288)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1310, file: !14, line: 1474, baseType: !1012, size: 32, align: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1310, file: !14, line: 1479, baseType: !1320, size: 64, align: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1322, file: !14, line: 1412, baseType: !1043, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1322, file: !14, line: 1413, baseType: !1012, size: 32, align: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1322, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1310, file: !14, line: 1480, baseType: !1012, size: 32, align: 32, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1310, file: !14, line: 1486, baseType: !1014, size: 64, align: 64, offset: 512)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1310, file: !14, line: 1488, baseType: !1014, size: 64, align: 64, offset: 576)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1310, file: !14, line: 1497, baseType: !1014, size: 64, align: 64, offset: 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1305, file: !1275, line: 121, baseType: !1037, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1274, file: !1275, line: 166, baseType: !1333, size: 128, align: 64, offset: 448)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1275, line: 127, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1275, line: 124, size: 128, align: 64, elements: !1335)
!1335 = !{!1336, !1409}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1334, file: !1275, line: 125, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1341)
!1341 = !{!1342, !1343, !1367, !1371, !1372, !1406, !1407, !1408}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1340, file: !14, line: 5751, baseType: !1171, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1340, file: !14, line: 5756, baseType: !1344, size: 64, align: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1352, !1353, !1354, !1358, !1362, !1366}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1346, file: !14, line: 5797, baseType: !1147, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1346, file: !14, line: 5804, baseType: !1350, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1346, file: !14, line: 5815, baseType: !1171, size: 64, align: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1346, file: !14, line: 5825, baseType: !1012, size: 32, align: 32, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1346, file: !14, line: 5826, baseType: !1355, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!1012, !1338}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1346, file: !14, line: 5827, baseType: !1359, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1012, !1338, !1308}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1346, file: !14, line: 5828, baseType: !1363, size: 64, align: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{null, !1338}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1346, file: !14, line: 5829, baseType: !1363, size: 64, align: 64, offset: 448)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1340, file: !14, line: 5762, baseType: !1368, size: 64, align: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1340, file: !14, line: 5768, baseType: !1022, size: 64, align: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1340, file: !14, line: 5775, baseType: !1373, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1375, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1375, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1375, file: !14, line: 3948, baseType: !1029, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1375, file: !14, line: 3958, baseType: !1043, size: 64, align: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1375, file: !14, line: 3962, baseType: !1012, size: 32, align: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1375, file: !14, line: 3968, baseType: !1012, size: 32, align: 32, offset: 224)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1375, file: !14, line: 3973, baseType: !1014, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1375, file: !14, line: 3986, baseType: !1012, size: 32, align: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1375, file: !14, line: 3999, baseType: !1012, size: 32, align: 32, offset: 352)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1375, file: !14, line: 4004, baseType: !1012, size: 32, align: 32, offset: 384)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1375, file: !14, line: 4005, baseType: !1012, size: 32, align: 32, offset: 416)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1375, file: !14, line: 4010, baseType: !1012, size: 32, align: 32, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1375, file: !14, line: 4011, baseType: !1012, size: 32, align: 32, offset: 480)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1375, file: !14, line: 4020, baseType: !1057, size: 64, align: 32, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1375, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1375, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1375, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1375, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1375, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1375, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1375, file: !14, line: 4039, baseType: !1012, size: 32, align: 32, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1375, file: !14, line: 4046, baseType: !1034, size: 64, align: 64, offset: 832)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1375, file: !14, line: 4050, baseType: !1012, size: 32, align: 32, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1375, file: !14, line: 4054, baseType: !1012, size: 32, align: 32, offset: 928)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1375, file: !14, line: 4061, baseType: !1012, size: 32, align: 32, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1375, file: !14, line: 4065, baseType: !1012, size: 32, align: 32, offset: 992)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1375, file: !14, line: 4073, baseType: !1012, size: 32, align: 32, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1375, file: !14, line: 4080, baseType: !1012, size: 32, align: 32, offset: 1056)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1375, file: !14, line: 4084, baseType: !1012, size: 32, align: 32, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1340, file: !14, line: 5781, baseType: !1373, size: 64, align: 64, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1340, file: !14, line: 5787, baseType: !1057, size: 64, align: 32, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1340, file: !14, line: 5793, baseType: !1057, size: 64, align: 32, offset: 448)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1334, file: !1275, line: 126, baseType: !1012, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1274, file: !1275, line: 172, baseType: !1308, size: 64, align: 64, offset: 576)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1274, file: !1275, line: 177, baseType: !1043, size: 64, align: 64, offset: 640)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1274, file: !1275, line: 178, baseType: !1013, size: 32, align: 32, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1274, file: !1275, line: 180, baseType: !1022, size: 64, align: 64, offset: 768)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1274, file: !1275, line: 185, baseType: !1012, size: 32, align: 32, offset: 832)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1274, file: !1275, line: 190, baseType: !1022, size: 64, align: 64, offset: 896)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1274, file: !1275, line: 195, baseType: !1012, size: 32, align: 32, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1274, file: !1275, line: 200, baseType: !1308, size: 64, align: 64, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1274, file: !1275, line: 201, baseType: !1012, size: 32, align: 32, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1274, file: !1275, line: 202, baseType: !1037, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1274, file: !1275, line: 203, baseType: !1012, size: 32, align: 32, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1274, file: !1275, line: 205, baseType: !1012, size: 32, align: 32, offset: 1248)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1274, file: !1275, line: 206, baseType: !1012, size: 32, align: 32, offset: 1280)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1274, file: !1275, line: 209, baseType: !1134, size: 64, align: 64, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1274, file: !1275, line: 212, baseType: !1134, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1274, file: !1275, line: 213, baseType: !1037, size: 64, align: 64, offset: 1472)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1274, file: !1275, line: 215, baseType: !1012, size: 32, align: 32, offset: 1536)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1274, file: !1275, line: 217, baseType: !1012, size: 32, align: 32, offset: 1568)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1274, file: !1275, line: 220, baseType: !1012, size: 32, align: 32, offset: 1600)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1261, file: !14, line: 1598, baseType: !1022, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1261, file: !14, line: 1606, baseType: !1014, size: 64, align: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1261, file: !14, line: 1614, baseType: !1012, size: 32, align: 32, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1261, file: !14, line: 1622, baseType: !1012, size: 32, align: 32, offset: 544)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1261, file: !14, line: 1628, baseType: !1012, size: 32, align: 32, offset: 576)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1261, file: !14, line: 1636, baseType: !1012, size: 32, align: 32, offset: 608)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1261, file: !14, line: 1643, baseType: !1012, size: 32, align: 32, offset: 640)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1261, file: !14, line: 1657, baseType: !1043, size: 64, align: 64, offset: 704)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1261, file: !14, line: 1658, baseType: !1012, size: 32, align: 32, offset: 768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1261, file: !14, line: 1679, baseType: !1057, size: 64, align: 32, offset: 800)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1261, file: !14, line: 1688, baseType: !1012, size: 32, align: 32, offset: 864)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1261, file: !14, line: 1712, baseType: !1012, size: 32, align: 32, offset: 896)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1261, file: !14, line: 1729, baseType: !1012, size: 32, align: 32, offset: 928)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1261, file: !14, line: 1729, baseType: !1012, size: 32, align: 32, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1261, file: !14, line: 1744, baseType: !1012, size: 32, align: 32, offset: 992)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1261, file: !14, line: 1744, baseType: !1012, size: 32, align: 32, offset: 1024)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1261, file: !14, line: 1751, baseType: !1012, size: 32, align: 32, offset: 1056)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1261, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1261, file: !14, line: 1791, baseType: !1448, size: 64, align: 64, offset: 1152)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{null, !1451, !1452, !1454, !1012, !1012, !1012}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1261, file: !14, line: 1808, baseType: !1456, size: 64, align: 64, offset: 1216)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!473, !1451, !1158}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1261, file: !14, line: 1816, baseType: !1012, size: 32, align: 32, offset: 1280)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1261, file: !14, line: 1825, baseType: !1461, size: 32, align: 32, offset: 1312)
!1461 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1261, file: !14, line: 1830, baseType: !1012, size: 32, align: 32, offset: 1344)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1261, file: !14, line: 1838, baseType: !1461, size: 32, align: 32, offset: 1376)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1261, file: !14, line: 1846, baseType: !1012, size: 32, align: 32, offset: 1408)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1261, file: !14, line: 1851, baseType: !1012, size: 32, align: 32, offset: 1440)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1261, file: !14, line: 1861, baseType: !1461, size: 32, align: 32, offset: 1472)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1261, file: !14, line: 1868, baseType: !1461, size: 32, align: 32, offset: 1504)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1261, file: !14, line: 1875, baseType: !1461, size: 32, align: 32, offset: 1536)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1261, file: !14, line: 1882, baseType: !1461, size: 32, align: 32, offset: 1568)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1261, file: !14, line: 1889, baseType: !1461, size: 32, align: 32, offset: 1600)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1261, file: !14, line: 1896, baseType: !1461, size: 32, align: 32, offset: 1632)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1261, file: !14, line: 1903, baseType: !1461, size: 32, align: 32, offset: 1664)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1261, file: !14, line: 1910, baseType: !1012, size: 32, align: 32, offset: 1696)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1261, file: !14, line: 1915, baseType: !1012, size: 32, align: 32, offset: 1728)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1261, file: !14, line: 1926, baseType: !1454, size: 64, align: 64, offset: 1792)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1261, file: !14, line: 1935, baseType: !1057, size: 64, align: 32, offset: 1856)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1261, file: !14, line: 1942, baseType: !1012, size: 32, align: 32, offset: 1920)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1261, file: !14, line: 1948, baseType: !1012, size: 32, align: 32, offset: 1952)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1261, file: !14, line: 1954, baseType: !1012, size: 32, align: 32, offset: 1984)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1261, file: !14, line: 1960, baseType: !1012, size: 32, align: 32, offset: 2016)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1261, file: !14, line: 1984, baseType: !1012, size: 32, align: 32, offset: 2048)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1261, file: !14, line: 1991, baseType: !1012, size: 32, align: 32, offset: 2080)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1261, file: !14, line: 1996, baseType: !1012, size: 32, align: 32, offset: 2112)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1261, file: !14, line: 2004, baseType: !1012, size: 32, align: 32, offset: 2144)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1261, file: !14, line: 2011, baseType: !1012, size: 32, align: 32, offset: 2176)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1261, file: !14, line: 2018, baseType: !1012, size: 32, align: 32, offset: 2208)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1261, file: !14, line: 2027, baseType: !1012, size: 32, align: 32, offset: 2240)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1261, file: !14, line: 2034, baseType: !1012, size: 32, align: 32, offset: 2272)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1261, file: !14, line: 2044, baseType: !1012, size: 32, align: 32, offset: 2304)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1261, file: !14, line: 2054, baseType: !1491, size: 64, align: 64, offset: 2368)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1015, line: 49, baseType: !1493)
!1493 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1261, file: !14, line: 2061, baseType: !1491, size: 64, align: 64, offset: 2432)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1261, file: !14, line: 2066, baseType: !1012, size: 32, align: 32, offset: 2496)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1261, file: !14, line: 2070, baseType: !1012, size: 32, align: 32, offset: 2528)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1261, file: !14, line: 2078, baseType: !1012, size: 32, align: 32, offset: 2560)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1261, file: !14, line: 2085, baseType: !1012, size: 32, align: 32, offset: 2592)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1261, file: !14, line: 2092, baseType: !1012, size: 32, align: 32, offset: 2624)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1261, file: !14, line: 2099, baseType: !1012, size: 32, align: 32, offset: 2656)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1261, file: !14, line: 2106, baseType: !1012, size: 32, align: 32, offset: 2688)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1261, file: !14, line: 2113, baseType: !1012, size: 32, align: 32, offset: 2720)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1261, file: !14, line: 2120, baseType: !1012, size: 32, align: 32, offset: 2752)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1261, file: !14, line: 2125, baseType: !1012, size: 32, align: 32, offset: 2784)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1261, file: !14, line: 2133, baseType: !1012, size: 32, align: 32, offset: 2816)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1261, file: !14, line: 2140, baseType: !1012, size: 32, align: 32, offset: 2848)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1261, file: !14, line: 2145, baseType: !1012, size: 32, align: 32, offset: 2880)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1261, file: !14, line: 2153, baseType: !1012, size: 32, align: 32, offset: 2912)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1261, file: !14, line: 2158, baseType: !1012, size: 32, align: 32, offset: 2944)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1261, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1261, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1261, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1261, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1261, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1261, file: !14, line: 2203, baseType: !1012, size: 32, align: 32, offset: 3136)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1261, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1261, file: !14, line: 2212, baseType: !1012, size: 32, align: 32, offset: 3200)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1261, file: !14, line: 2213, baseType: !1012, size: 32, align: 32, offset: 3232)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1261, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1261, file: !14, line: 2232, baseType: !1012, size: 32, align: 32, offset: 3296)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1261, file: !14, line: 2243, baseType: !1012, size: 32, align: 32, offset: 3328)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1261, file: !14, line: 2249, baseType: !1012, size: 32, align: 32, offset: 3360)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1261, file: !14, line: 2256, baseType: !1012, size: 32, align: 32, offset: 3392)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1261, file: !14, line: 2263, baseType: !1034, size: 64, align: 64, offset: 3456)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1261, file: !14, line: 2270, baseType: !1034, size: 64, align: 64, offset: 3520)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1261, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1261, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1261, file: !14, line: 2367, baseType: !1529, size: 64, align: 64, offset: 3648)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!1012, !1451, !1037, !1012}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1261, file: !14, line: 2383, baseType: !1012, size: 32, align: 32, offset: 3712)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1261, file: !14, line: 2386, baseType: !1461, size: 32, align: 32, offset: 3744)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1261, file: !14, line: 2387, baseType: !1461, size: 32, align: 32, offset: 3776)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1261, file: !14, line: 2394, baseType: !1012, size: 32, align: 32, offset: 3808)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1261, file: !14, line: 2401, baseType: !1012, size: 32, align: 32, offset: 3840)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1261, file: !14, line: 2408, baseType: !1012, size: 32, align: 32, offset: 3872)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1261, file: !14, line: 2415, baseType: !1012, size: 32, align: 32, offset: 3904)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1261, file: !14, line: 2422, baseType: !1012, size: 32, align: 32, offset: 3936)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1261, file: !14, line: 2423, baseType: !1541, size: 64, align: 64, offset: 3968)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1543)
!1543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1544)
!1544 = !{!1545, !1546, !1547, !1548}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1543, file: !14, line: 827, baseType: !1012, size: 32, align: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1543, file: !14, line: 828, baseType: !1012, size: 32, align: 32, offset: 32)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1543, file: !14, line: 829, baseType: !1012, size: 32, align: 32, offset: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1543, file: !14, line: 830, baseType: !1461, size: 32, align: 32, offset: 96)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1261, file: !14, line: 2430, baseType: !1014, size: 64, align: 64, offset: 4032)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1261, file: !14, line: 2437, baseType: !1014, size: 64, align: 64, offset: 4096)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1261, file: !14, line: 2444, baseType: !1461, size: 32, align: 32, offset: 4160)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1261, file: !14, line: 2451, baseType: !1461, size: 32, align: 32, offset: 4192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1261, file: !14, line: 2458, baseType: !1012, size: 32, align: 32, offset: 4224)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1261, file: !14, line: 2469, baseType: !1012, size: 32, align: 32, offset: 4256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1261, file: !14, line: 2475, baseType: !1012, size: 32, align: 32, offset: 4288)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1261, file: !14, line: 2481, baseType: !1012, size: 32, align: 32, offset: 4320)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1261, file: !14, line: 2485, baseType: !1012, size: 32, align: 32, offset: 4352)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1261, file: !14, line: 2489, baseType: !1012, size: 32, align: 32, offset: 4384)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1261, file: !14, line: 2493, baseType: !1012, size: 32, align: 32, offset: 4416)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1261, file: !14, line: 2501, baseType: !1012, size: 32, align: 32, offset: 4448)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1261, file: !14, line: 2506, baseType: !1012, size: 32, align: 32, offset: 4480)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1261, file: !14, line: 2510, baseType: !1012, size: 32, align: 32, offset: 4512)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1261, file: !14, line: 2514, baseType: !1014, size: 64, align: 64, offset: 4544)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1261, file: !14, line: 2528, baseType: !1565, size: 64, align: 64, offset: 4608)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{null, !1451, !1022, !1012, !1012}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1261, file: !14, line: 2534, baseType: !1012, size: 32, align: 32, offset: 4672)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1261, file: !14, line: 2545, baseType: !1012, size: 32, align: 32, offset: 4704)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1261, file: !14, line: 2547, baseType: !1012, size: 32, align: 32, offset: 4736)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1261, file: !14, line: 2549, baseType: !1012, size: 32, align: 32, offset: 4768)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1261, file: !14, line: 2551, baseType: !1012, size: 32, align: 32, offset: 4800)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1261, file: !14, line: 2553, baseType: !1012, size: 32, align: 32, offset: 4832)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1261, file: !14, line: 2555, baseType: !1012, size: 32, align: 32, offset: 4864)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1261, file: !14, line: 2557, baseType: !1012, size: 32, align: 32, offset: 4896)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1261, file: !14, line: 2559, baseType: !1012, size: 32, align: 32, offset: 4928)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1261, file: !14, line: 2563, baseType: !1012, size: 32, align: 32, offset: 4960)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1261, file: !14, line: 2571, baseType: !1579, size: 64, align: 64, offset: 4992)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1261, file: !14, line: 2579, baseType: !1579, size: 64, align: 64, offset: 5056)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1261, file: !14, line: 2586, baseType: !1012, size: 32, align: 32, offset: 5120)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1261, file: !14, line: 2615, baseType: !1012, size: 32, align: 32, offset: 5152)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1261, file: !14, line: 2627, baseType: !1012, size: 32, align: 32, offset: 5184)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1261, file: !14, line: 2637, baseType: !1012, size: 32, align: 32, offset: 5216)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1261, file: !14, line: 2681, baseType: !1012, size: 32, align: 32, offset: 5248)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1261, file: !14, line: 2709, baseType: !1014, size: 64, align: 64, offset: 5312)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1261, file: !14, line: 2716, baseType: !1588, size: 64, align: 64, offset: 5376)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595, !1596, !1597, !1601, !1607, !1611, !1612, !1613, !1614, !1620, !1621, !1622, !1623, !1624}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1590, file: !14, line: 3642, baseType: !1147, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1590, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1590, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1590, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1590, file: !14, line: 3669, baseType: !1012, size: 32, align: 32, offset: 160)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1590, file: !14, line: 3682, baseType: !1598, size: 64, align: 64, offset: 192)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!1012, !1259, !1037}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1590, file: !14, line: 3698, baseType: !1602, size: 64, align: 64, offset: 256)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{!1012, !1259, !1605, !1029}
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1590, file: !14, line: 3712, baseType: !1608, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!1012, !1259, !1012, !1605, !1029}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1590, file: !14, line: 3726, baseType: !1602, size: 64, align: 64, offset: 384)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1590, file: !14, line: 3737, baseType: !1256, size: 64, align: 64, offset: 448)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1590, file: !14, line: 3746, baseType: !1012, size: 32, align: 32, offset: 512)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1590, file: !14, line: 3757, baseType: !1615, size: 64, align: 64, offset: 576)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !1618}
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1590, file: !14, line: 3766, baseType: !1256, size: 64, align: 64, offset: 640)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1590, file: !14, line: 3774, baseType: !1256, size: 64, align: 64, offset: 704)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1590, file: !14, line: 3780, baseType: !1012, size: 32, align: 32, offset: 768)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1590, file: !14, line: 3785, baseType: !1012, size: 32, align: 32, offset: 800)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1590, file: !14, line: 3795, baseType: !1625, size: 64, align: 64, offset: 832)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!1012, !1259, !1081}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1261, file: !14, line: 2728, baseType: !1022, size: 64, align: 64, offset: 5440)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1261, file: !14, line: 2735, baseType: !1071, size: 512, align: 64, offset: 5504)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1261, file: !14, line: 2742, baseType: !1012, size: 32, align: 32, offset: 6016)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1261, file: !14, line: 2755, baseType: !1012, size: 32, align: 32, offset: 6048)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1261, file: !14, line: 2776, baseType: !1012, size: 32, align: 32, offset: 6080)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1261, file: !14, line: 2783, baseType: !1012, size: 32, align: 32, offset: 6112)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1261, file: !14, line: 2791, baseType: !1012, size: 32, align: 32, offset: 6144)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1261, file: !14, line: 2802, baseType: !1037, size: 64, align: 64, offset: 6208)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1261, file: !14, line: 2811, baseType: !1012, size: 32, align: 32, offset: 6272)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1261, file: !14, line: 2821, baseType: !1012, size: 32, align: 32, offset: 6304)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1261, file: !14, line: 2830, baseType: !1012, size: 32, align: 32, offset: 6336)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1261, file: !14, line: 2840, baseType: !1012, size: 32, align: 32, offset: 6368)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1261, file: !14, line: 2851, baseType: !1641, size: 64, align: 64, offset: 6400)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!1012, !1451, !1644, !1022, !1454, !1012, !1012}
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!1012, !1451, !1022}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1261, file: !14, line: 2871, baseType: !1648, size: 64, align: 64, offset: 6464)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!1012, !1451, !1651, !1022, !1454, !1012}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!1012, !1451, !1022, !1012, !1012}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1261, file: !14, line: 2878, baseType: !1012, size: 32, align: 32, offset: 6528)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1261, file: !14, line: 2885, baseType: !1012, size: 32, align: 32, offset: 6560)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1261, file: !14, line: 3005, baseType: !1012, size: 32, align: 32, offset: 6592)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1261, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1261, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1261, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1261, file: !14, line: 3037, baseType: !1043, size: 64, align: 64, offset: 6720)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1261, file: !14, line: 3038, baseType: !1012, size: 32, align: 32, offset: 6784)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1261, file: !14, line: 3050, baseType: !1034, size: 64, align: 64, offset: 6848)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1261, file: !14, line: 3065, baseType: !1012, size: 32, align: 32, offset: 6912)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1261, file: !14, line: 3083, baseType: !1012, size: 32, align: 32, offset: 6944)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1261, file: !14, line: 3092, baseType: !1057, size: 64, align: 32, offset: 6976)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1261, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1261, file: !14, line: 3106, baseType: !1057, size: 64, align: 32, offset: 7072)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1261, file: !14, line: 3113, baseType: !1669, size: 64, align: 64, offset: 7168)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1671)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1682}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1672, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !14, line: 720, baseType: !1147, size: 64, align: 64, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1672, file: !14, line: 724, baseType: !1147, size: 64, align: 64, offset: 128)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1672, file: !14, line: 728, baseType: !1012, size: 32, align: 32, offset: 192)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1672, file: !14, line: 734, baseType: !1680, size: 64, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1672, file: !14, line: 739, baseType: !1683, size: 64, align: 64, offset: 320)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1247)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1261, file: !14, line: 3129, baseType: !1014, size: 64, align: 64, offset: 7232)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1261, file: !14, line: 3130, baseType: !1014, size: 64, align: 64, offset: 7296)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1261, file: !14, line: 3131, baseType: !1014, size: 64, align: 64, offset: 7360)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1261, file: !14, line: 3132, baseType: !1014, size: 64, align: 64, offset: 7424)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1261, file: !14, line: 3139, baseType: !1579, size: 64, align: 64, offset: 7488)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1261, file: !14, line: 3147, baseType: !1012, size: 32, align: 32, offset: 7552)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1261, file: !14, line: 3165, baseType: !1012, size: 32, align: 32, offset: 7584)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1261, file: !14, line: 3172, baseType: !1012, size: 32, align: 32, offset: 7616)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1261, file: !14, line: 3180, baseType: !1012, size: 32, align: 32, offset: 7648)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1261, file: !14, line: 3191, baseType: !1491, size: 64, align: 64, offset: 7680)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1261, file: !14, line: 3199, baseType: !1043, size: 64, align: 64, offset: 7744)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1261, file: !14, line: 3207, baseType: !1579, size: 64, align: 64, offset: 7808)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1261, file: !14, line: 3214, baseType: !1013, size: 32, align: 32, offset: 7872)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1261, file: !14, line: 3224, baseType: !1320, size: 64, align: 64, offset: 7936)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1261, file: !14, line: 3225, baseType: !1012, size: 32, align: 32, offset: 8000)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1261, file: !14, line: 3249, baseType: !1081, size: 64, align: 64, offset: 8064)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1261, file: !14, line: 3256, baseType: !1012, size: 32, align: 32, offset: 8128)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1261, file: !14, line: 3271, baseType: !1012, size: 32, align: 32, offset: 8160)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1261, file: !14, line: 3279, baseType: !1014, size: 64, align: 64, offset: 8192)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1261, file: !14, line: 3301, baseType: !1081, size: 64, align: 64, offset: 8256)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1261, file: !14, line: 3310, baseType: !1012, size: 32, align: 32, offset: 8320)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1261, file: !14, line: 3337, baseType: !1012, size: 32, align: 32, offset: 8352)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1261, file: !14, line: 3351, baseType: !1012, size: 32, align: 32, offset: 8384)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1261, file: !14, line: 3359, baseType: !1012, size: 32, align: 32, offset: 8416)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1144, file: !14, line: 3535, baseType: !1710, size: 64, align: 64, offset: 1024)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{!1012, !1259, !1713}
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1144, file: !14, line: 3541, baseType: !1716, size: 64, align: 64, offset: 1088)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1718)
!1718 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1719)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1275, line: 223, size: 128, align: 64, elements: !1720)
!1720 = !{!1721, !1722}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1719, file: !1275, line: 224, baseType: !1605, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1719, file: !1275, line: 225, baseType: !1605, size: 64, align: 64, offset: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1144, file: !14, line: 3549, baseType: !1724, size: 64, align: 64, offset: 1152)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{null, !1254}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1144, file: !14, line: 3551, baseType: !1256, size: 64, align: 64, offset: 1216)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1144, file: !14, line: 3552, baseType: !1729, size: 64, align: 64, offset: 1280)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64, align: 64)
!1730 = !DISubroutineType(types: !1731)
!1731 = !{!1012, !1259, !1043, !1012, !1732}
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1734)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1735)
!1735 = !{!1736, !1737, !1738, !1739, !1740, !1764}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1734, file: !14, line: 3921, baseType: !1492, size: 16, align: 16)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1734, file: !14, line: 3922, baseType: !1029, size: 32, align: 32, offset: 32)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1734, file: !14, line: 3923, baseType: !1029, size: 32, align: 32, offset: 64)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1734, file: !14, line: 3924, baseType: !1013, size: 32, align: 32, offset: 96)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1734, file: !14, line: 3925, baseType: !1741, size: 64, align: 64, offset: 128)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64, align: 64)
!1743 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1744)
!1744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1745)
!1745 = !{!1746, !1747, !1748, !1749, !1750, !1751, !1757, !1759, !1760, !1761, !1762, !1763}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1744, file: !14, line: 3886, baseType: !1012, size: 32, align: 32)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1744, file: !14, line: 3887, baseType: !1012, size: 32, align: 32, offset: 32)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1744, file: !14, line: 3888, baseType: !1012, size: 32, align: 32, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1744, file: !14, line: 3889, baseType: !1012, size: 32, align: 32, offset: 96)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1744, file: !14, line: 3890, baseType: !1012, size: 32, align: 32, offset: 128)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1744, file: !14, line: 3897, baseType: !1752, size: 768, align: 64, offset: 192)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1753)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1754)
!1754 = !{!1755, !1756}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1753, file: !14, line: 3855, baseType: !1042, size: 512, align: 64)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1753, file: !14, line: 3857, baseType: !1047, size: 256, align: 32, offset: 512)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1744, file: !14, line: 3903, baseType: !1758, size: 256, align: 64, offset: 960)
!1758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 256, align: 64, elements: !1291)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1744, file: !14, line: 3904, baseType: !1298, size: 128, align: 32, offset: 1216)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1744, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1744, file: !14, line: 3908, baseType: !1579, size: 64, align: 64, offset: 1408)
