; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--v210enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--v210enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }

!856 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!857 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!858 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!860 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!861 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!862 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!863 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!864 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!865 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!866 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!868 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!869 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!870 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !{!910, !918}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !912, line: 221, size: 32, align: 8, elements: !913)
!912 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !911, file: !912, line: 221, baseType: !915, size: 32, align: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !916, line: 51, baseType: !917)
!916 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!917 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !916, line: 49, baseType: !921)
!921 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!922 = !{!923}
!923 = distinct !DIGlobalVariable(name: "ff_v210_encoder", scope: !0, file: !924, line: 258, type: !925, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_v210_encoder)
!924 = !DIFile(filename: "libavcodec/v210enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !927)
!927 = !{!928, !932, !933, !934, !935, !937, !946, !949, !952, !955, !960, !963, !1039, !1047, !1048, !1049, !1051, !1600, !1606, !1614, !1618, !1619, !1656, !1660, !1664, !1665, !1669, !1673, !1674, !1678, !1679, !1680}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !926, file: !14, line: 3475, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !926, file: !14, line: 3480, baseType: !929, size: 64, align: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !926, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !926, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !926, file: !14, line: 3487, baseType: !936, size: 32, align: 32, offset: 192)
!936 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !926, file: !14, line: 3488, baseType: !938, size: 64, align: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !941, line: 61, baseType: !942)
!941 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !941, line: 58, size: 64, align: 32, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !942, file: !941, line: 59, baseType: !936, size: 32, align: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !942, file: !941, line: 60, baseType: !936, size: 32, align: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !926, file: !14, line: 3489, baseType: !947, size: 64, align: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !926, file: !14, line: 3490, baseType: !950, size: 64, align: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !926, file: !14, line: 3491, baseType: !953, size: 64, align: 64, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !926, file: !14, line: 3492, baseType: !956, size: 64, align: 64, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !916, line: 55, baseType: !959)
!959 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !926, file: !14, line: 3493, baseType: !961, size: 8, align: 8, offset: 576)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !916, line: 48, baseType: !962)
!962 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !926, file: !14, line: 3494, baseType: !964, size: 64, align: 64, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !968)
!968 = !{!969, !970, !975, !998, !999, !1000, !1001, !1005, !1011, !1013, !1017}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !967, file: !713, line: 72, baseType: !929, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !967, file: !713, line: 78, baseType: !971, size: 64, align: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!929, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !967, file: !713, line: 85, baseType: !976, size: 64, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !994, !995, !996, !997}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !978, file: !691, line: 247, baseType: !929, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !978, file: !691, line: 253, baseType: !929, size: 64, align: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !978, file: !691, line: 259, baseType: !936, size: 32, align: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !978, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !978, file: !691, line: 271, baseType: !985, size: 64, align: 64, offset: 192)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !978, file: !691, line: 265, size: 64, align: 64, elements: !986)
!986 = !{!987, !990, !992, !993}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !985, file: !691, line: 266, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !916, line: 40, baseType: !989)
!989 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !985, file: !691, line: 267, baseType: !991, size: 64, align: 64)
!991 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !985, file: !691, line: 268, baseType: !929, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !985, file: !691, line: 270, baseType: !940, size: 64, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !978, file: !691, line: 272, baseType: !991, size: 64, align: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !978, file: !691, line: 273, baseType: !991, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !978, file: !691, line: 275, baseType: !936, size: 32, align: 32, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !978, file: !691, line: 300, baseType: !929, size: 64, align: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !967, file: !713, line: 93, baseType: !936, size: 32, align: 32, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !967, file: !713, line: 99, baseType: !936, size: 32, align: 32, offset: 224)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !967, file: !713, line: 108, baseType: !936, size: 32, align: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !967, file: !713, line: 113, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!974, !974, !974}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !967, file: !713, line: 123, baseType: !1006, size: 64, align: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1009, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !967, file: !713, line: 130, baseType: !1012, size: 32, align: 32, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !967, file: !713, line: 136, baseType: !1014, size: 64, align: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1012, !974}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !967, file: !713, line: 142, baseType: !1018, size: 64, align: 64, offset: 576)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!936, !1021, !974, !929, !936}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1024)
!1024 = !{!1025, !1037, !1038}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1023, file: !691, line: 360, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1029, file: !691, line: 307, baseType: !929, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1029, file: !691, line: 313, baseType: !991, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1029, file: !691, line: 313, baseType: !991, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1029, file: !691, line: 318, baseType: !991, size: 64, align: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1029, file: !691, line: 318, baseType: !991, size: 64, align: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1029, file: !691, line: 323, baseType: !936, size: 32, align: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1023, file: !691, line: 364, baseType: !936, size: 32, align: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1023, file: !691, line: 368, baseType: !936, size: 32, align: 32, offset: 96)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !926, file: !14, line: 3495, baseType: !1040, size: 64, align: 64, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1043, file: !14, line: 3402, baseType: !936, size: 32, align: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1043, file: !14, line: 3403, baseType: !929, size: 64, align: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !926, file: !14, line: 3507, baseType: !929, size: 64, align: 64, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !926, file: !14, line: 3516, baseType: !936, size: 32, align: 32, offset: 832)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !926, file: !14, line: 3517, baseType: !1050, size: 64, align: 64, offset: 896)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !926, file: !14, line: 3527, baseType: !1052, size: 64, align: 64, offset: 960)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!936, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1065, !1066, !1067, !1068, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1348, !1352, !1353, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1538, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1057, file: !14, line: 1561, baseType: !964, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1057, file: !14, line: 1562, baseType: !936, size: 32, align: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1057, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1057, file: !14, line: 1565, baseType: !1063, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1057, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1057, file: !14, line: 1581, baseType: !917, size: 32, align: 32, offset: 224)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1057, file: !14, line: 1583, baseType: !974, size: 64, align: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1057, file: !14, line: 1591, baseType: !1069, size: 64, align: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1071, line: 129, size: 1664, align: 64, elements: !1072)
!1071 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1072 = !{!1073, !1074, !1075, !1076, !1174, !1195, !1196, !1225, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1070, file: !1071, line: 136, baseType: !936, size: 32, align: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1070, file: !1071, line: 151, baseType: !936, size: 32, align: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1070, file: !1071, line: 157, baseType: !936, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1070, file: !1071, line: 159, baseType: !1077, size: 64, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1080)
!1080 = !{!1081, !1086, !1088, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1126, !1128, !1129, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1162, !1163, !1164, !1165, !1166, !1167, !1170, !1171, !1172, !1173}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !744, line: 282, baseType: !1082, size: 512, align: 64)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 512, align: 64, elements: !1084)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1084 = !{!1085}
!1085 = !DISubrange(count: 8)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1079, file: !744, line: 299, baseType: !1087, size: 256, align: 32, offset: 512)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 32, elements: !1084)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1079, file: !744, line: 315, baseType: !1089, size: 64, align: 64, offset: 768)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1079, file: !744, line: 326, baseType: !936, size: 32, align: 32, offset: 832)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1079, file: !744, line: 326, baseType: !936, size: 32, align: 32, offset: 864)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1079, file: !744, line: 334, baseType: !936, size: 32, align: 32, offset: 896)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1079, file: !744, line: 341, baseType: !936, size: 32, align: 32, offset: 928)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1079, file: !744, line: 346, baseType: !936, size: 32, align: 32, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1079, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1079, file: !744, line: 356, baseType: !940, size: 64, align: 32, offset: 1024)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1079, file: !744, line: 361, baseType: !988, size: 64, align: 64, offset: 1088)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1079, file: !744, line: 369, baseType: !988, size: 64, align: 64, offset: 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1079, file: !744, line: 377, baseType: !988, size: 64, align: 64, offset: 1216)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1079, file: !744, line: 382, baseType: !936, size: 32, align: 32, offset: 1280)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1079, file: !744, line: 386, baseType: !936, size: 32, align: 32, offset: 1312)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1079, file: !744, line: 391, baseType: !936, size: 32, align: 32, offset: 1344)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1079, file: !744, line: 396, baseType: !974, size: 64, align: 64, offset: 1408)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1079, file: !744, line: 403, baseType: !1105, size: 512, align: 64, offset: 1472)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 512, align: 64, elements: !1084)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1079, file: !744, line: 410, baseType: !936, size: 32, align: 32, offset: 1984)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1079, file: !744, line: 415, baseType: !936, size: 32, align: 32, offset: 2016)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1079, file: !744, line: 420, baseType: !936, size: 32, align: 32, offset: 2048)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1079, file: !744, line: 425, baseType: !936, size: 32, align: 32, offset: 2080)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1079, file: !744, line: 435, baseType: !988, size: 64, align: 64, offset: 2112)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1079, file: !744, line: 440, baseType: !936, size: 32, align: 32, offset: 2176)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1079, file: !744, line: 445, baseType: !958, size: 64, align: 64, offset: 2240)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1079, file: !744, line: 459, baseType: !1114, size: 512, align: 64, offset: 2304)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 512, align: 64, elements: !1084)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1117, line: 94, baseType: !1118)
!1117 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1117, line: 81, size: 192, align: 64, elements: !1119)
!1119 = !{!1120, !1124, !1125}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1118, file: !1117, line: 82, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1117, line: 73, baseType: !1123)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1117, line: 73, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !1117, line: 89, baseType: !1083, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !1117, line: 93, baseType: !936, size: 32, align: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1079, file: !744, line: 473, baseType: !1127, size: 64, align: 64, offset: 2816)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1079, file: !744, line: 477, baseType: !936, size: 32, align: 32, offset: 2880)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1079, file: !744, line: 479, baseType: !1130, size: 64, align: 64, offset: 2944)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1143}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1133, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !744, line: 203, baseType: !1083, size: 64, align: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !744, line: 204, baseType: !936, size: 32, align: 32, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1133, file: !744, line: 205, baseType: !1139, size: 64, align: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1141, line: 86, baseType: !1142)
!1141 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1142 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1141, line: 86, flags: DIFlagFwdDecl)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1133, file: !744, line: 206, baseType: !1115, size: 64, align: 64, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1079, file: !744, line: 480, baseType: !936, size: 32, align: 32, offset: 3008)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !744, line: 505, baseType: !936, size: 32, align: 32, offset: 3040)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1079, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1079, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1079, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1079, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1079, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1079, file: !744, line: 532, baseType: !988, size: 64, align: 64, offset: 3264)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1079, file: !744, line: 539, baseType: !988, size: 64, align: 64, offset: 3328)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1079, file: !744, line: 547, baseType: !988, size: 64, align: 64, offset: 3392)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1079, file: !744, line: 554, baseType: !1139, size: 64, align: 64, offset: 3456)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1079, file: !744, line: 563, baseType: !936, size: 32, align: 32, offset: 3520)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1079, file: !744, line: 572, baseType: !936, size: 32, align: 32, offset: 3552)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1079, file: !744, line: 581, baseType: !936, size: 32, align: 32, offset: 3584)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1079, file: !744, line: 588, baseType: !1159, size: 64, align: 64, offset: 3648)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !916, line: 36, baseType: !1161)
!1161 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1079, file: !744, line: 593, baseType: !936, size: 32, align: 32, offset: 3712)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1079, file: !744, line: 596, baseType: !936, size: 32, align: 32, offset: 3744)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1079, file: !744, line: 599, baseType: !1115, size: 64, align: 64, offset: 3776)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1079, file: !744, line: 605, baseType: !1115, size: 64, align: 64, offset: 3840)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1079, file: !744, line: 616, baseType: !1115, size: 64, align: 64, offset: 3904)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1079, file: !744, line: 626, baseType: !1168, size: 64, align: 64, offset: 3968)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1169, line: 216, baseType: !959)
!1169 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1079, file: !744, line: 627, baseType: !1168, size: 64, align: 64, offset: 4032)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1079, file: !744, line: 628, baseType: !1168, size: 64, align: 64, offset: 4096)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1079, file: !744, line: 629, baseType: !1168, size: 64, align: 64, offset: 4160)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1079, file: !744, line: 645, baseType: !1115, size: 64, align: 64, offset: 4224)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1070, file: !1071, line: 161, baseType: !1175, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1071, line: 117, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1071, line: 100, size: 832, align: 64, elements: !1178)
!1178 = !{!1179, !1186, !1187, !1188, !1189, !1190, !1192, !1193, !1194}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1177, file: !1071, line: 105, baseType: !1180, size: 256, align: 64)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1181, size: 256, align: 64, elements: !1184)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1117, line: 238, baseType: !1183)
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1117, line: 238, flags: DIFlagFwdDecl)
!1184 = !{!1185}
!1185 = !DISubrange(count: 4)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1177, file: !1071, line: 110, baseType: !936, size: 32, align: 32, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1177, file: !1071, line: 111, baseType: !936, size: 32, align: 32, offset: 288)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1177, file: !1071, line: 111, baseType: !936, size: 32, align: 32, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1177, file: !1071, line: 112, baseType: !1087, size: 256, align: 32, offset: 352)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1177, file: !1071, line: 113, baseType: !1191, size: 128, align: 32, offset: 608)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 128, align: 32, elements: !1184)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1177, file: !1071, line: 114, baseType: !936, size: 32, align: 32, offset: 736)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1177, file: !1071, line: 115, baseType: !936, size: 32, align: 32, offset: 768)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1177, file: !1071, line: 116, baseType: !936, size: 32, align: 32, offset: 800)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1070, file: !1071, line: 163, baseType: !974, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1070, file: !1071, line: 165, baseType: !1197, size: 128, align: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1071, line: 122, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1071, line: 119, size: 128, align: 64, elements: !1199)
!1199 = !{!1200, !1224}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1198, file: !1071, line: 120, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1220, !1221, !1222, !1223}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1203, file: !14, line: 1451, baseType: !1115, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1203, file: !14, line: 1461, baseType: !988, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1203, file: !14, line: 1467, baseType: !988, size: 64, align: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1203, file: !14, line: 1468, baseType: !1083, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !14, line: 1469, baseType: !936, size: 32, align: 32, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1203, file: !14, line: 1470, baseType: !936, size: 32, align: 32, offset: 288)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1203, file: !14, line: 1474, baseType: !936, size: 32, align: 32, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1203, file: !14, line: 1479, baseType: !1213, size: 64, align: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !14, line: 1412, baseType: !1083, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1215, file: !14, line: 1413, baseType: !936, size: 32, align: 32, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1215, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1203, file: !14, line: 1480, baseType: !936, size: 32, align: 32, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1203, file: !14, line: 1486, baseType: !988, size: 64, align: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1203, file: !14, line: 1488, baseType: !988, size: 64, align: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1203, file: !14, line: 1497, baseType: !988, size: 64, align: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1198, file: !1071, line: 121, baseType: !1077, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1070, file: !1071, line: 166, baseType: !1226, size: 128, align: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1071, line: 127, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1071, line: 124, size: 128, align: 64, elements: !1228)
!1228 = !{!1229, !1302}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1227, file: !1071, line: 125, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1260, !1264, !1265, !1299, !1300, !1301}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1233, file: !14, line: 5751, baseType: !964, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1233, file: !14, line: 5756, baseType: !1237, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1245, !1246, !1247, !1251, !1255, !1259}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1239, file: !14, line: 5797, baseType: !929, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1239, file: !14, line: 5804, baseType: !1243, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1239, file: !14, line: 5815, baseType: !964, size: 64, align: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1239, file: !14, line: 5825, baseType: !936, size: 32, align: 32, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1239, file: !14, line: 5826, baseType: !1248, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!936, !1231}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1239, file: !14, line: 5827, baseType: !1252, size: 64, align: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!936, !1231, !1201}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1239, file: !14, line: 5828, baseType: !1256, size: 64, align: 64, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !1231}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1239, file: !14, line: 5829, baseType: !1256, size: 64, align: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1233, file: !14, line: 5762, baseType: !1261, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1263)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1233, file: !14, line: 5768, baseType: !974, size: 64, align: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1233, file: !14, line: 5775, baseType: !1266, size: 64, align: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1268, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1268, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1268, file: !14, line: 3948, baseType: !915, size: 32, align: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1268, file: !14, line: 3958, baseType: !1083, size: 64, align: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1268, file: !14, line: 3962, baseType: !936, size: 32, align: 32, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1268, file: !14, line: 3968, baseType: !936, size: 32, align: 32, offset: 224)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1268, file: !14, line: 3973, baseType: !988, size: 64, align: 64, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1268, file: !14, line: 3986, baseType: !936, size: 32, align: 32, offset: 320)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1268, file: !14, line: 3999, baseType: !936, size: 32, align: 32, offset: 352)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1268, file: !14, line: 4004, baseType: !936, size: 32, align: 32, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1268, file: !14, line: 4005, baseType: !936, size: 32, align: 32, offset: 416)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1268, file: !14, line: 4010, baseType: !936, size: 32, align: 32, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1268, file: !14, line: 4011, baseType: !936, size: 32, align: 32, offset: 480)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1268, file: !14, line: 4020, baseType: !940, size: 64, align: 32, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1268, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1268, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1268, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1268, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1268, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1268, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1268, file: !14, line: 4039, baseType: !936, size: 32, align: 32, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1268, file: !14, line: 4046, baseType: !958, size: 64, align: 64, offset: 832)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1268, file: !14, line: 4050, baseType: !936, size: 32, align: 32, offset: 896)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1268, file: !14, line: 4054, baseType: !936, size: 32, align: 32, offset: 928)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1268, file: !14, line: 4061, baseType: !936, size: 32, align: 32, offset: 960)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1268, file: !14, line: 4065, baseType: !936, size: 32, align: 32, offset: 992)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1268, file: !14, line: 4073, baseType: !936, size: 32, align: 32, offset: 1024)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1268, file: !14, line: 4080, baseType: !936, size: 32, align: 32, offset: 1056)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1268, file: !14, line: 4084, baseType: !936, size: 32, align: 32, offset: 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1233, file: !14, line: 5781, baseType: !1266, size: 64, align: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1233, file: !14, line: 5787, baseType: !940, size: 64, align: 32, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1233, file: !14, line: 5793, baseType: !940, size: 64, align: 32, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1227, file: !1071, line: 126, baseType: !936, size: 32, align: 32, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1070, file: !1071, line: 172, baseType: !1201, size: 64, align: 64, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1070, file: !1071, line: 177, baseType: !1083, size: 64, align: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1070, file: !1071, line: 178, baseType: !917, size: 32, align: 32, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1070, file: !1071, line: 180, baseType: !974, size: 64, align: 64, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1070, file: !1071, line: 185, baseType: !936, size: 32, align: 32, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1070, file: !1071, line: 190, baseType: !974, size: 64, align: 64, offset: 896)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1070, file: !1071, line: 195, baseType: !936, size: 32, align: 32, offset: 960)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1070, file: !1071, line: 200, baseType: !1201, size: 64, align: 64, offset: 1024)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1070, file: !1071, line: 201, baseType: !936, size: 32, align: 32, offset: 1088)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1070, file: !1071, line: 202, baseType: !1077, size: 64, align: 64, offset: 1152)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1070, file: !1071, line: 203, baseType: !936, size: 32, align: 32, offset: 1216)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1070, file: !1071, line: 205, baseType: !936, size: 32, align: 32, offset: 1248)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1070, file: !1071, line: 206, baseType: !936, size: 32, align: 32, offset: 1280)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1070, file: !1071, line: 209, baseType: !1168, size: 64, align: 64, offset: 1344)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1070, file: !1071, line: 212, baseType: !1168, size: 64, align: 64, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1070, file: !1071, line: 213, baseType: !1077, size: 64, align: 64, offset: 1472)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1070, file: !1071, line: 215, baseType: !936, size: 32, align: 32, offset: 1536)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1070, file: !1071, line: 217, baseType: !936, size: 32, align: 32, offset: 1568)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1070, file: !1071, line: 220, baseType: !936, size: 32, align: 32, offset: 1600)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1057, file: !14, line: 1598, baseType: !974, size: 64, align: 64, offset: 384)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1057, file: !14, line: 1606, baseType: !988, size: 64, align: 64, offset: 448)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1057, file: !14, line: 1614, baseType: !936, size: 32, align: 32, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1057, file: !14, line: 1622, baseType: !936, size: 32, align: 32, offset: 544)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1057, file: !14, line: 1628, baseType: !936, size: 32, align: 32, offset: 576)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !14, line: 1636, baseType: !936, size: 32, align: 32, offset: 608)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1057, file: !14, line: 1643, baseType: !936, size: 32, align: 32, offset: 640)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1057, file: !14, line: 1657, baseType: !1083, size: 64, align: 64, offset: 704)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1057, file: !14, line: 1658, baseType: !936, size: 32, align: 32, offset: 768)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1057, file: !14, line: 1679, baseType: !940, size: 64, align: 32, offset: 800)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1057, file: !14, line: 1688, baseType: !936, size: 32, align: 32, offset: 864)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1057, file: !14, line: 1712, baseType: !936, size: 32, align: 32, offset: 896)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1057, file: !14, line: 1729, baseType: !936, size: 32, align: 32, offset: 928)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1057, file: !14, line: 1729, baseType: !936, size: 32, align: 32, offset: 960)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1057, file: !14, line: 1744, baseType: !936, size: 32, align: 32, offset: 992)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1057, file: !14, line: 1744, baseType: !936, size: 32, align: 32, offset: 1024)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1057, file: !14, line: 1751, baseType: !936, size: 32, align: 32, offset: 1056)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1057, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1057, file: !14, line: 1791, baseType: !1341, size: 64, align: 64, offset: 1152)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{null, !1344, !1345, !1347, !936, !936, !936}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1057, file: !14, line: 1808, baseType: !1349, size: 64, align: 64, offset: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!473, !1344, !947}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1057, file: !14, line: 1816, baseType: !936, size: 32, align: 32, offset: 1280)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1057, file: !14, line: 1825, baseType: !1354, size: 32, align: 32, offset: 1312)
!1354 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1057, file: !14, line: 1830, baseType: !936, size: 32, align: 32, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1057, file: !14, line: 1838, baseType: !1354, size: 32, align: 32, offset: 1376)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1057, file: !14, line: 1846, baseType: !936, size: 32, align: 32, offset: 1408)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1057, file: !14, line: 1851, baseType: !936, size: 32, align: 32, offset: 1440)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1057, file: !14, line: 1861, baseType: !1354, size: 32, align: 32, offset: 1472)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1057, file: !14, line: 1868, baseType: !1354, size: 32, align: 32, offset: 1504)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1057, file: !14, line: 1875, baseType: !1354, size: 32, align: 32, offset: 1536)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1057, file: !14, line: 1882, baseType: !1354, size: 32, align: 32, offset: 1568)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1057, file: !14, line: 1889, baseType: !1354, size: 32, align: 32, offset: 1600)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1057, file: !14, line: 1896, baseType: !1354, size: 32, align: 32, offset: 1632)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1057, file: !14, line: 1903, baseType: !1354, size: 32, align: 32, offset: 1664)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1057, file: !14, line: 1910, baseType: !936, size: 32, align: 32, offset: 1696)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1057, file: !14, line: 1915, baseType: !936, size: 32, align: 32, offset: 1728)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1057, file: !14, line: 1926, baseType: !1347, size: 64, align: 64, offset: 1792)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1057, file: !14, line: 1935, baseType: !940, size: 64, align: 32, offset: 1856)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1057, file: !14, line: 1942, baseType: !936, size: 32, align: 32, offset: 1920)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1057, file: !14, line: 1948, baseType: !936, size: 32, align: 32, offset: 1952)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1057, file: !14, line: 1954, baseType: !936, size: 32, align: 32, offset: 1984)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1057, file: !14, line: 1960, baseType: !936, size: 32, align: 32, offset: 2016)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1057, file: !14, line: 1984, baseType: !936, size: 32, align: 32, offset: 2048)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1057, file: !14, line: 1991, baseType: !936, size: 32, align: 32, offset: 2080)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1057, file: !14, line: 1996, baseType: !936, size: 32, align: 32, offset: 2112)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1057, file: !14, line: 2004, baseType: !936, size: 32, align: 32, offset: 2144)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1057, file: !14, line: 2011, baseType: !936, size: 32, align: 32, offset: 2176)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1057, file: !14, line: 2018, baseType: !936, size: 32, align: 32, offset: 2208)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1057, file: !14, line: 2027, baseType: !936, size: 32, align: 32, offset: 2240)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1057, file: !14, line: 2034, baseType: !936, size: 32, align: 32, offset: 2272)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1057, file: !14, line: 2044, baseType: !936, size: 32, align: 32, offset: 2304)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1057, file: !14, line: 2054, baseType: !1384, size: 64, align: 64, offset: 2368)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1057, file: !14, line: 2061, baseType: !1384, size: 64, align: 64, offset: 2432)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1057, file: !14, line: 2066, baseType: !936, size: 32, align: 32, offset: 2496)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1057, file: !14, line: 2070, baseType: !936, size: 32, align: 32, offset: 2528)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1057, file: !14, line: 2078, baseType: !936, size: 32, align: 32, offset: 2560)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1057, file: !14, line: 2085, baseType: !936, size: 32, align: 32, offset: 2592)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1057, file: !14, line: 2092, baseType: !936, size: 32, align: 32, offset: 2624)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1057, file: !14, line: 2099, baseType: !936, size: 32, align: 32, offset: 2656)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1057, file: !14, line: 2106, baseType: !936, size: 32, align: 32, offset: 2688)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1057, file: !14, line: 2113, baseType: !936, size: 32, align: 32, offset: 2720)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1057, file: !14, line: 2120, baseType: !936, size: 32, align: 32, offset: 2752)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1057, file: !14, line: 2125, baseType: !936, size: 32, align: 32, offset: 2784)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1057, file: !14, line: 2133, baseType: !936, size: 32, align: 32, offset: 2816)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1057, file: !14, line: 2140, baseType: !936, size: 32, align: 32, offset: 2848)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1057, file: !14, line: 2145, baseType: !936, size: 32, align: 32, offset: 2880)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1057, file: !14, line: 2153, baseType: !936, size: 32, align: 32, offset: 2912)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1057, file: !14, line: 2158, baseType: !936, size: 32, align: 32, offset: 2944)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1057, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1057, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1057, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1057, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1057, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1057, file: !14, line: 2203, baseType: !936, size: 32, align: 32, offset: 3136)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1057, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1057, file: !14, line: 2212, baseType: !936, size: 32, align: 32, offset: 3200)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1057, file: !14, line: 2213, baseType: !936, size: 32, align: 32, offset: 3232)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1057, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1057, file: !14, line: 2232, baseType: !936, size: 32, align: 32, offset: 3296)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1057, file: !14, line: 2243, baseType: !936, size: 32, align: 32, offset: 3328)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1057, file: !14, line: 2249, baseType: !936, size: 32, align: 32, offset: 3360)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1057, file: !14, line: 2256, baseType: !936, size: 32, align: 32, offset: 3392)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1057, file: !14, line: 2263, baseType: !958, size: 64, align: 64, offset: 3456)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1057, file: !14, line: 2270, baseType: !958, size: 64, align: 64, offset: 3520)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1057, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1057, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1057, file: !14, line: 2367, baseType: !1420, size: 64, align: 64, offset: 3648)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!936, !1344, !1077, !936}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1057, file: !14, line: 2383, baseType: !936, size: 32, align: 32, offset: 3712)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1057, file: !14, line: 2386, baseType: !1354, size: 32, align: 32, offset: 3744)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1057, file: !14, line: 2387, baseType: !1354, size: 32, align: 32, offset: 3776)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1057, file: !14, line: 2394, baseType: !936, size: 32, align: 32, offset: 3808)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1057, file: !14, line: 2401, baseType: !936, size: 32, align: 32, offset: 3840)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1057, file: !14, line: 2408, baseType: !936, size: 32, align: 32, offset: 3872)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1057, file: !14, line: 2415, baseType: !936, size: 32, align: 32, offset: 3904)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1057, file: !14, line: 2422, baseType: !936, size: 32, align: 32, offset: 3936)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1057, file: !14, line: 2423, baseType: !1432, size: 64, align: 64, offset: 3968)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1434, file: !14, line: 827, baseType: !936, size: 32, align: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1434, file: !14, line: 828, baseType: !936, size: 32, align: 32, offset: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1434, file: !14, line: 829, baseType: !936, size: 32, align: 32, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1434, file: !14, line: 830, baseType: !1354, size: 32, align: 32, offset: 96)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1057, file: !14, line: 2430, baseType: !988, size: 64, align: 64, offset: 4032)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1057, file: !14, line: 2437, baseType: !988, size: 64, align: 64, offset: 4096)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1057, file: !14, line: 2444, baseType: !1354, size: 32, align: 32, offset: 4160)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1057, file: !14, line: 2451, baseType: !1354, size: 32, align: 32, offset: 4192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1057, file: !14, line: 2458, baseType: !936, size: 32, align: 32, offset: 4224)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1057, file: !14, line: 2469, baseType: !936, size: 32, align: 32, offset: 4256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1057, file: !14, line: 2475, baseType: !936, size: 32, align: 32, offset: 4288)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1057, file: !14, line: 2481, baseType: !936, size: 32, align: 32, offset: 4320)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1057, file: !14, line: 2485, baseType: !936, size: 32, align: 32, offset: 4352)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1057, file: !14, line: 2489, baseType: !936, size: 32, align: 32, offset: 4384)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1057, file: !14, line: 2493, baseType: !936, size: 32, align: 32, offset: 4416)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1057, file: !14, line: 2501, baseType: !936, size: 32, align: 32, offset: 4448)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1057, file: !14, line: 2506, baseType: !936, size: 32, align: 32, offset: 4480)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1057, file: !14, line: 2510, baseType: !936, size: 32, align: 32, offset: 4512)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1057, file: !14, line: 2514, baseType: !988, size: 64, align: 64, offset: 4544)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1057, file: !14, line: 2528, baseType: !1456, size: 64, align: 64, offset: 4608)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{null, !1344, !974, !936, !936}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1057, file: !14, line: 2534, baseType: !936, size: 32, align: 32, offset: 4672)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1057, file: !14, line: 2545, baseType: !936, size: 32, align: 32, offset: 4704)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1057, file: !14, line: 2547, baseType: !936, size: 32, align: 32, offset: 4736)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1057, file: !14, line: 2549, baseType: !936, size: 32, align: 32, offset: 4768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1057, file: !14, line: 2551, baseType: !936, size: 32, align: 32, offset: 4800)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1057, file: !14, line: 2553, baseType: !936, size: 32, align: 32, offset: 4832)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1057, file: !14, line: 2555, baseType: !936, size: 32, align: 32, offset: 4864)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1057, file: !14, line: 2557, baseType: !936, size: 32, align: 32, offset: 4896)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1057, file: !14, line: 2559, baseType: !936, size: 32, align: 32, offset: 4928)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1057, file: !14, line: 2563, baseType: !936, size: 32, align: 32, offset: 4960)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1057, file: !14, line: 2571, baseType: !1470, size: 64, align: 64, offset: 4992)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1057, file: !14, line: 2579, baseType: !1470, size: 64, align: 64, offset: 5056)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1057, file: !14, line: 2586, baseType: !936, size: 32, align: 32, offset: 5120)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1057, file: !14, line: 2615, baseType: !936, size: 32, align: 32, offset: 5152)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1057, file: !14, line: 2627, baseType: !936, size: 32, align: 32, offset: 5184)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1057, file: !14, line: 2637, baseType: !936, size: 32, align: 32, offset: 5216)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1057, file: !14, line: 2681, baseType: !936, size: 32, align: 32, offset: 5248)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1057, file: !14, line: 2709, baseType: !988, size: 64, align: 64, offset: 5312)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1057, file: !14, line: 2716, baseType: !1479, size: 64, align: 64, offset: 5376)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1481)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1482)
!1482 = !{!1483, !1484, !1485, !1486, !1487, !1488, !1492, !1498, !1502, !1503, !1504, !1505, !1511, !1512, !1513, !1514, !1515}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1481, file: !14, line: 3642, baseType: !929, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1481, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1481, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1481, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1481, file: !14, line: 3669, baseType: !936, size: 32, align: 32, offset: 160)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1481, file: !14, line: 3682, baseType: !1489, size: 64, align: 64, offset: 192)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!936, !1055, !1077}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1481, file: !14, line: 3698, baseType: !1493, size: 64, align: 64, offset: 256)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!936, !1055, !1496, !915}
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1481, file: !14, line: 3712, baseType: !1499, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!936, !1055, !936, !1496, !915}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1481, file: !14, line: 3726, baseType: !1493, size: 64, align: 64, offset: 384)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1481, file: !14, line: 3737, baseType: !1052, size: 64, align: 64, offset: 448)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1481, file: !14, line: 3746, baseType: !936, size: 32, align: 32, offset: 512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1481, file: !14, line: 3757, baseType: !1506, size: 64, align: 64, offset: 576)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !1509}
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1481, file: !14, line: 3766, baseType: !1052, size: 64, align: 64, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1481, file: !14, line: 3774, baseType: !1052, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1481, file: !14, line: 3780, baseType: !936, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1481, file: !14, line: 3785, baseType: !936, size: 32, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1481, file: !14, line: 3795, baseType: !1516, size: 64, align: 64, offset: 832)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!936, !1055, !1115}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1057, file: !14, line: 2728, baseType: !974, size: 64, align: 64, offset: 5440)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1057, file: !14, line: 2735, baseType: !1105, size: 512, align: 64, offset: 5504)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1057, file: !14, line: 2742, baseType: !936, size: 32, align: 32, offset: 6016)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1057, file: !14, line: 2755, baseType: !936, size: 32, align: 32, offset: 6048)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1057, file: !14, line: 2776, baseType: !936, size: 32, align: 32, offset: 6080)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1057, file: !14, line: 2783, baseType: !936, size: 32, align: 32, offset: 6112)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1057, file: !14, line: 2791, baseType: !936, size: 32, align: 32, offset: 6144)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1057, file: !14, line: 2802, baseType: !1077, size: 64, align: 64, offset: 6208)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1057, file: !14, line: 2811, baseType: !936, size: 32, align: 32, offset: 6272)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1057, file: !14, line: 2821, baseType: !936, size: 32, align: 32, offset: 6304)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1057, file: !14, line: 2830, baseType: !936, size: 32, align: 32, offset: 6336)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1057, file: !14, line: 2840, baseType: !936, size: 32, align: 32, offset: 6368)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1057, file: !14, line: 2851, baseType: !1532, size: 64, align: 64, offset: 6400)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!936, !1344, !1535, !974, !1347, !936, !936}
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!936, !1344, !974}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1057, file: !14, line: 2871, baseType: !1539, size: 64, align: 64, offset: 6464)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!936, !1344, !1542, !974, !1347, !936}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!936, !1344, !974, !936, !936}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1057, file: !14, line: 2878, baseType: !936, size: 32, align: 32, offset: 6528)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1057, file: !14, line: 2885, baseType: !936, size: 32, align: 32, offset: 6560)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1057, file: !14, line: 3005, baseType: !936, size: 32, align: 32, offset: 6592)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1057, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1057, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1057, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1057, file: !14, line: 3037, baseType: !1083, size: 64, align: 64, offset: 6720)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1057, file: !14, line: 3038, baseType: !936, size: 32, align: 32, offset: 6784)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1057, file: !14, line: 3050, baseType: !958, size: 64, align: 64, offset: 6848)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1057, file: !14, line: 3065, baseType: !936, size: 32, align: 32, offset: 6912)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1057, file: !14, line: 3083, baseType: !936, size: 32, align: 32, offset: 6944)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1057, file: !14, line: 3092, baseType: !940, size: 64, align: 32, offset: 6976)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1057, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1057, file: !14, line: 3106, baseType: !940, size: 64, align: 32, offset: 7072)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1057, file: !14, line: 3113, baseType: !1560, size: 64, align: 64, offset: 7168)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1562)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568, !1569, !1570, !1573}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1563, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1563, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1563, file: !14, line: 720, baseType: !929, size: 64, align: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1563, file: !14, line: 724, baseType: !929, size: 64, align: 64, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1563, file: !14, line: 728, baseType: !936, size: 32, align: 32, offset: 192)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1563, file: !14, line: 734, baseType: !1571, size: 64, align: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1563, file: !14, line: 739, baseType: !1574, size: 64, align: 64, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1057, file: !14, line: 3129, baseType: !988, size: 64, align: 64, offset: 7232)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1057, file: !14, line: 3130, baseType: !988, size: 64, align: 64, offset: 7296)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1057, file: !14, line: 3131, baseType: !988, size: 64, align: 64, offset: 7360)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1057, file: !14, line: 3132, baseType: !988, size: 64, align: 64, offset: 7424)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1057, file: !14, line: 3139, baseType: !1470, size: 64, align: 64, offset: 7488)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1057, file: !14, line: 3147, baseType: !936, size: 32, align: 32, offset: 7552)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1057, file: !14, line: 3165, baseType: !936, size: 32, align: 32, offset: 7584)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1057, file: !14, line: 3172, baseType: !936, size: 32, align: 32, offset: 7616)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1057, file: !14, line: 3180, baseType: !936, size: 32, align: 32, offset: 7648)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1057, file: !14, line: 3191, baseType: !1384, size: 64, align: 64, offset: 7680)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1057, file: !14, line: 3199, baseType: !1083, size: 64, align: 64, offset: 7744)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1057, file: !14, line: 3207, baseType: !1470, size: 64, align: 64, offset: 7808)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1057, file: !14, line: 3214, baseType: !917, size: 32, align: 32, offset: 7872)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1057, file: !14, line: 3224, baseType: !1213, size: 64, align: 64, offset: 7936)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1057, file: !14, line: 3225, baseType: !936, size: 32, align: 32, offset: 8000)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1057, file: !14, line: 3249, baseType: !1115, size: 64, align: 64, offset: 8064)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1057, file: !14, line: 3256, baseType: !936, size: 32, align: 32, offset: 8128)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1057, file: !14, line: 3271, baseType: !936, size: 32, align: 32, offset: 8160)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1057, file: !14, line: 3279, baseType: !988, size: 64, align: 64, offset: 8192)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1057, file: !14, line: 3301, baseType: !1115, size: 64, align: 64, offset: 8256)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1057, file: !14, line: 3310, baseType: !936, size: 32, align: 32, offset: 8320)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1057, file: !14, line: 3337, baseType: !936, size: 32, align: 32, offset: 8352)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1057, file: !14, line: 3351, baseType: !936, size: 32, align: 32, offset: 8384)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1057, file: !14, line: 3359, baseType: !936, size: 32, align: 32, offset: 8416)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !926, file: !14, line: 3535, baseType: !1601, size: 64, align: 64, offset: 1024)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!936, !1055, !1604}
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !926, file: !14, line: 3541, baseType: !1607, size: 64, align: 64, offset: 1088)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1609)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1071, line: 223, size: 128, align: 64, elements: !1611)
!1611 = !{!1612, !1613}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1610, file: !1071, line: 224, baseType: !1496, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1610, file: !1071, line: 225, baseType: !1496, size: 64, align: 64, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !926, file: !14, line: 3549, baseType: !1615, size: 64, align: 64, offset: 1152)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !1050}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !926, file: !14, line: 3551, baseType: !1052, size: 64, align: 64, offset: 1216)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !926, file: !14, line: 3552, baseType: !1620, size: 64, align: 64, offset: 1280)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!936, !1055, !1083, !936, !1623}
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630, !1631, !1655}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1625, file: !14, line: 3921, baseType: !920, size: 16, align: 16)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1625, file: !14, line: 3922, baseType: !915, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1625, file: !14, line: 3923, baseType: !915, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1625, file: !14, line: 3924, baseType: !917, size: 32, align: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1625, file: !14, line: 3925, baseType: !1632, size: 64, align: 64, offset: 128)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1635)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1636)
!1636 = !{!1637, !1638, !1639, !1640, !1641, !1642, !1648, !1650, !1651, !1652, !1653, !1654}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1635, file: !14, line: 3886, baseType: !936, size: 32, align: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1635, file: !14, line: 3887, baseType: !936, size: 32, align: 32, offset: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1635, file: !14, line: 3888, baseType: !936, size: 32, align: 32, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1635, file: !14, line: 3889, baseType: !936, size: 32, align: 32, offset: 96)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1635, file: !14, line: 3890, baseType: !936, size: 32, align: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1635, file: !14, line: 3897, baseType: !1643, size: 768, align: 64, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1644)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1645)
!1645 = !{!1646, !1647}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1644, file: !14, line: 3855, baseType: !1082, size: 512, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1644, file: !14, line: 3857, baseType: !1087, size: 256, align: 32, offset: 512)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1635, file: !14, line: 3903, baseType: !1649, size: 256, align: 64, offset: 960)
!1649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 256, align: 64, elements: !1184)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1635, file: !14, line: 3904, baseType: !1191, size: 128, align: 32, offset: 1216)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1635, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1635, file: !14, line: 3908, baseType: !1470, size: 64, align: 64, offset: 1408)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1635, file: !14, line: 3915, baseType: !1470, size: 64, align: 64, offset: 1472)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1635, file: !14, line: 3917, baseType: !936, size: 32, align: 32, offset: 1536)
