; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jacosubdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jacosubdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!825 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!826 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!827 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!828 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!829 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!832 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!833 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!834 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!835 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!836 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!837 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!838 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!839 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!840 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!841 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850}
!844 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!845 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!846 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!847 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!848 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!849 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!850 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 85, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/jacosubdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "ALIGN_VB", value: 1)
!891 = !DIEnumerator(name: "ALIGN_VM", value: 2)
!892 = !DIEnumerator(name: "ALIGN_VT", value: 4)
!893 = !DIEnumerator(name: "ALIGN_JC", value: 8)
!894 = !DIEnumerator(name: "ALIGN_JL", value: 16)
!895 = !DIEnumerator(name: "ALIGN_JR", value: 32)
!896 = !{!897, !1500}
!897 = distinct !DIGlobalVariable(name: "ff_jacosub_decoder", scope: !0, file: !888, line: 196, type: !898, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_jacosub_decoder)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !900)
!900 = !{!901, !905, !906, !907, !908, !910, !919, !922, !925, !928, !934, !937, !979, !987, !988, !989, !991, !1399, !1405, !1410, !1414, !1415, !1455, !1475, !1479, !1480, !1484, !1488, !1489, !1493, !1494, !1495}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !899, file: !14, line: 3475, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !899, file: !14, line: 3480, baseType: !902, size: 64, align: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !899, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !899, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !899, file: !14, line: 3487, baseType: !909, size: 32, align: 32, offset: 192)
!909 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !899, file: !14, line: 3488, baseType: !911, size: 64, align: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !914, line: 61, baseType: !915)
!914 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !914, line: 58, size: 64, align: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !915, file: !914, line: 59, baseType: !909, size: 32, align: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !915, file: !914, line: 60, baseType: !909, size: 32, align: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !899, file: !14, line: 3489, baseType: !920, size: 64, align: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !899, file: !14, line: 3490, baseType: !923, size: 64, align: 64, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !899, file: !14, line: 3491, baseType: !926, size: 64, align: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !899, file: !14, line: 3492, baseType: !929, size: 64, align: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !932, line: 55, baseType: !933)
!932 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!933 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !899, file: !14, line: 3493, baseType: !935, size: 8, align: 8, offset: 576)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !932, line: 48, baseType: !936)
!936 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !899, file: !14, line: 3494, baseType: !938, size: 64, align: 64, offset: 640)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !942)
!942 = !{!943, !944, !949, !953, !954, !955, !956, !960, !966, !968, !972}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !941, file: !691, line: 72, baseType: !902, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !941, file: !691, line: 78, baseType: !945, size: 64, align: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!902, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !941, file: !691, line: 85, baseType: !950, size: 64, align: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !941, file: !691, line: 93, baseType: !909, size: 32, align: 32, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !941, file: !691, line: 99, baseType: !909, size: 32, align: 32, offset: 224)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !941, file: !691, line: 108, baseType: !909, size: 32, align: 32, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !941, file: !691, line: 113, baseType: !957, size: 64, align: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!948, !948, !948}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !941, file: !691, line: 123, baseType: !961, size: 64, align: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!964, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !941, file: !691, line: 130, baseType: !967, size: 32, align: 32, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !941, file: !691, line: 136, baseType: !969, size: 64, align: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!967, !948}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !941, file: !691, line: 142, baseType: !973, size: 64, align: 64, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!909, !976, !948, !902, !909}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !899, file: !14, line: 3495, baseType: !980, size: 64, align: 64, offset: 704)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !983, file: !14, line: 3402, baseType: !909, size: 32, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !14, line: 3403, baseType: !902, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !899, file: !14, line: 3507, baseType: !902, size: 64, align: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !899, file: !14, line: 3516, baseType: !909, size: 32, align: 32, offset: 832)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !899, file: !14, line: 3517, baseType: !990, size: 64, align: 64, offset: 896)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !899, file: !14, line: 3527, baseType: !992, size: 64, align: 64, offset: 960)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!909, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1005, !1006, !1008, !1009, !1012, !1013, !1016, !1017, !1018, !1019, !1020, !1021, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1136, !1140, !1141, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1330, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !997, file: !14, line: 1561, baseType: !938, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !997, file: !14, line: 1562, baseType: !909, size: 32, align: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !997, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !997, file: !14, line: 1565, baseType: !1003, size: 64, align: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !997, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !997, file: !14, line: 1581, baseType: !1007, size: 32, align: 32, offset: 224)
!1007 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !997, file: !14, line: 1583, baseType: !948, size: 64, align: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !997, file: !14, line: 1591, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !997, file: !14, line: 1598, baseType: !948, size: 64, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !997, file: !14, line: 1606, baseType: !1014, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !932, line: 40, baseType: !1015)
!1015 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !997, file: !14, line: 1614, baseType: !909, size: 32, align: 32, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !997, file: !14, line: 1622, baseType: !909, size: 32, align: 32, offset: 544)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !997, file: !14, line: 1628, baseType: !909, size: 32, align: 32, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !14, line: 1636, baseType: !909, size: 32, align: 32, offset: 608)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !997, file: !14, line: 1643, baseType: !909, size: 32, align: 32, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !997, file: !14, line: 1657, baseType: !1022, size: 64, align: 64, offset: 704)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !997, file: !14, line: 1658, baseType: !909, size: 32, align: 32, offset: 768)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !997, file: !14, line: 1679, baseType: !913, size: 64, align: 32, offset: 800)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !997, file: !14, line: 1688, baseType: !909, size: 32, align: 32, offset: 864)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !997, file: !14, line: 1712, baseType: !909, size: 32, align: 32, offset: 896)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !997, file: !14, line: 1729, baseType: !909, size: 32, align: 32, offset: 928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !997, file: !14, line: 1729, baseType: !909, size: 32, align: 32, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !997, file: !14, line: 1744, baseType: !909, size: 32, align: 32, offset: 992)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !997, file: !14, line: 1744, baseType: !909, size: 32, align: 32, offset: 1024)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !997, file: !14, line: 1751, baseType: !909, size: 32, align: 32, offset: 1056)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !997, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !997, file: !14, line: 1791, baseType: !1034, size: 64, align: 64, offset: 1152)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !1037, !1038, !1135, !909, !909, !909}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1042)
!1042 = !{!1043, !1047, !1049, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1087, !1089, !1090, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1123, !1124, !1125, !1126, !1127, !1128, !1131, !1132, !1133, !1134}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1041, file: !722, line: 282, baseType: !1044, size: 512, align: 64)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 512, align: 64, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 8)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1041, file: !722, line: 299, baseType: !1048, size: 256, align: 32, offset: 512)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 256, align: 32, elements: !1045)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1041, file: !722, line: 315, baseType: !1050, size: 64, align: 64, offset: 768)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1041, file: !722, line: 326, baseType: !909, size: 32, align: 32, offset: 832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1041, file: !722, line: 326, baseType: !909, size: 32, align: 32, offset: 864)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1041, file: !722, line: 334, baseType: !909, size: 32, align: 32, offset: 896)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1041, file: !722, line: 341, baseType: !909, size: 32, align: 32, offset: 928)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1041, file: !722, line: 346, baseType: !909, size: 32, align: 32, offset: 960)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1041, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1041, file: !722, line: 356, baseType: !913, size: 64, align: 32, offset: 1024)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1041, file: !722, line: 361, baseType: !1014, size: 64, align: 64, offset: 1088)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1041, file: !722, line: 369, baseType: !1014, size: 64, align: 64, offset: 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1041, file: !722, line: 377, baseType: !1014, size: 64, align: 64, offset: 1216)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1041, file: !722, line: 382, baseType: !909, size: 32, align: 32, offset: 1280)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1041, file: !722, line: 386, baseType: !909, size: 32, align: 32, offset: 1312)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1041, file: !722, line: 391, baseType: !909, size: 32, align: 32, offset: 1344)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1041, file: !722, line: 396, baseType: !948, size: 64, align: 64, offset: 1408)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1041, file: !722, line: 403, baseType: !1066, size: 512, align: 64, offset: 1472)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 512, align: 64, elements: !1045)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1041, file: !722, line: 410, baseType: !909, size: 32, align: 32, offset: 1984)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1041, file: !722, line: 415, baseType: !909, size: 32, align: 32, offset: 2016)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1041, file: !722, line: 420, baseType: !909, size: 32, align: 32, offset: 2048)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1041, file: !722, line: 425, baseType: !909, size: 32, align: 32, offset: 2080)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1041, file: !722, line: 435, baseType: !1014, size: 64, align: 64, offset: 2112)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1041, file: !722, line: 440, baseType: !909, size: 32, align: 32, offset: 2176)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1041, file: !722, line: 445, baseType: !931, size: 64, align: 64, offset: 2240)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1041, file: !722, line: 459, baseType: !1075, size: 512, align: 64, offset: 2304)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 512, align: 64, elements: !1045)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1078, line: 94, baseType: !1079)
!1078 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1078, line: 81, size: 192, align: 64, elements: !1080)
!1080 = !{!1081, !1085, !1086}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1079, file: !1078, line: 82, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1078, line: 73, baseType: !1084)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1078, line: 73, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !1078, line: 89, baseType: !1022, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !1078, line: 93, baseType: !909, size: 32, align: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1041, file: !722, line: 473, baseType: !1088, size: 64, align: 64, offset: 2816)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1041, file: !722, line: 477, baseType: !909, size: 32, align: 32, offset: 2880)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1041, file: !722, line: 479, baseType: !1091, size: 64, align: 64, offset: 2944)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1104}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1094, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !722, line: 203, baseType: !1022, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !722, line: 204, baseType: !909, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1094, file: !722, line: 205, baseType: !1100, size: 64, align: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1102, line: 86, baseType: !1103)
!1102 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1102, line: 86, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !722, line: 206, baseType: !1076, size: 64, align: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1041, file: !722, line: 480, baseType: !909, size: 32, align: 32, offset: 3008)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1041, file: !722, line: 505, baseType: !909, size: 32, align: 32, offset: 3040)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1041, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1041, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1041, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1041, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1041, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1041, file: !722, line: 532, baseType: !1014, size: 64, align: 64, offset: 3264)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1041, file: !722, line: 539, baseType: !1014, size: 64, align: 64, offset: 3328)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1041, file: !722, line: 547, baseType: !1014, size: 64, align: 64, offset: 3392)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1041, file: !722, line: 554, baseType: !1100, size: 64, align: 64, offset: 3456)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1041, file: !722, line: 563, baseType: !909, size: 32, align: 32, offset: 3520)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1041, file: !722, line: 572, baseType: !909, size: 32, align: 32, offset: 3552)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1041, file: !722, line: 581, baseType: !909, size: 32, align: 32, offset: 3584)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1041, file: !722, line: 588, baseType: !1120, size: 64, align: 64, offset: 3648)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !932, line: 36, baseType: !1122)
!1122 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1041, file: !722, line: 593, baseType: !909, size: 32, align: 32, offset: 3712)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1041, file: !722, line: 596, baseType: !909, size: 32, align: 32, offset: 3744)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1041, file: !722, line: 599, baseType: !1076, size: 64, align: 64, offset: 3776)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1041, file: !722, line: 605, baseType: !1076, size: 64, align: 64, offset: 3840)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1041, file: !722, line: 616, baseType: !1076, size: 64, align: 64, offset: 3904)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1041, file: !722, line: 626, baseType: !1129, size: 64, align: 64, offset: 3968)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1130, line: 216, baseType: !933)
!1130 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1041, file: !722, line: 627, baseType: !1129, size: 64, align: 64, offset: 4032)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1041, file: !722, line: 628, baseType: !1129, size: 64, align: 64, offset: 4096)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1041, file: !722, line: 629, baseType: !1129, size: 64, align: 64, offset: 4160)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1041, file: !722, line: 645, baseType: !1076, size: 64, align: 64, offset: 4224)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !997, file: !14, line: 1808, baseType: !1137, size: 64, align: 64, offset: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!473, !1037, !920}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !997, file: !14, line: 1816, baseType: !909, size: 32, align: 32, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !997, file: !14, line: 1825, baseType: !1142, size: 32, align: 32, offset: 1312)
!1142 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !997, file: !14, line: 1830, baseType: !909, size: 32, align: 32, offset: 1344)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !997, file: !14, line: 1838, baseType: !1142, size: 32, align: 32, offset: 1376)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !997, file: !14, line: 1846, baseType: !909, size: 32, align: 32, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !997, file: !14, line: 1851, baseType: !909, size: 32, align: 32, offset: 1440)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !997, file: !14, line: 1861, baseType: !1142, size: 32, align: 32, offset: 1472)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !997, file: !14, line: 1868, baseType: !1142, size: 32, align: 32, offset: 1504)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !997, file: !14, line: 1875, baseType: !1142, size: 32, align: 32, offset: 1536)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !997, file: !14, line: 1882, baseType: !1142, size: 32, align: 32, offset: 1568)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !997, file: !14, line: 1889, baseType: !1142, size: 32, align: 32, offset: 1600)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !997, file: !14, line: 1896, baseType: !1142, size: 32, align: 32, offset: 1632)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !997, file: !14, line: 1903, baseType: !1142, size: 32, align: 32, offset: 1664)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !997, file: !14, line: 1910, baseType: !909, size: 32, align: 32, offset: 1696)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !997, file: !14, line: 1915, baseType: !909, size: 32, align: 32, offset: 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !997, file: !14, line: 1926, baseType: !1135, size: 64, align: 64, offset: 1792)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !997, file: !14, line: 1935, baseType: !913, size: 64, align: 32, offset: 1856)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !997, file: !14, line: 1942, baseType: !909, size: 32, align: 32, offset: 1920)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !997, file: !14, line: 1948, baseType: !909, size: 32, align: 32, offset: 1952)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !997, file: !14, line: 1954, baseType: !909, size: 32, align: 32, offset: 1984)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !997, file: !14, line: 1960, baseType: !909, size: 32, align: 32, offset: 2016)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !997, file: !14, line: 1984, baseType: !909, size: 32, align: 32, offset: 2048)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !997, file: !14, line: 1991, baseType: !909, size: 32, align: 32, offset: 2080)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !997, file: !14, line: 1996, baseType: !909, size: 32, align: 32, offset: 2112)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !997, file: !14, line: 2004, baseType: !909, size: 32, align: 32, offset: 2144)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !997, file: !14, line: 2011, baseType: !909, size: 32, align: 32, offset: 2176)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !997, file: !14, line: 2018, baseType: !909, size: 32, align: 32, offset: 2208)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !997, file: !14, line: 2027, baseType: !909, size: 32, align: 32, offset: 2240)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !997, file: !14, line: 2034, baseType: !909, size: 32, align: 32, offset: 2272)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !997, file: !14, line: 2044, baseType: !909, size: 32, align: 32, offset: 2304)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !997, file: !14, line: 2054, baseType: !1172, size: 64, align: 64, offset: 2368)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !932, line: 49, baseType: !1174)
!1174 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !997, file: !14, line: 2061, baseType: !1172, size: 64, align: 64, offset: 2432)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !997, file: !14, line: 2066, baseType: !909, size: 32, align: 32, offset: 2496)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !997, file: !14, line: 2070, baseType: !909, size: 32, align: 32, offset: 2528)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !997, file: !14, line: 2078, baseType: !909, size: 32, align: 32, offset: 2560)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !997, file: !14, line: 2085, baseType: !909, size: 32, align: 32, offset: 2592)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !997, file: !14, line: 2092, baseType: !909, size: 32, align: 32, offset: 2624)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !997, file: !14, line: 2099, baseType: !909, size: 32, align: 32, offset: 2656)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !997, file: !14, line: 2106, baseType: !909, size: 32, align: 32, offset: 2688)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !997, file: !14, line: 2113, baseType: !909, size: 32, align: 32, offset: 2720)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !997, file: !14, line: 2120, baseType: !909, size: 32, align: 32, offset: 2752)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !997, file: !14, line: 2125, baseType: !909, size: 32, align: 32, offset: 2784)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !997, file: !14, line: 2133, baseType: !909, size: 32, align: 32, offset: 2816)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !997, file: !14, line: 2140, baseType: !909, size: 32, align: 32, offset: 2848)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !997, file: !14, line: 2145, baseType: !909, size: 32, align: 32, offset: 2880)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !997, file: !14, line: 2153, baseType: !909, size: 32, align: 32, offset: 2912)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !997, file: !14, line: 2158, baseType: !909, size: 32, align: 32, offset: 2944)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !997, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !997, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !997, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !997, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !997, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !997, file: !14, line: 2203, baseType: !909, size: 32, align: 32, offset: 3136)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !997, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !997, file: !14, line: 2212, baseType: !909, size: 32, align: 32, offset: 3200)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !997, file: !14, line: 2213, baseType: !909, size: 32, align: 32, offset: 3232)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !997, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !997, file: !14, line: 2232, baseType: !909, size: 32, align: 32, offset: 3296)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !997, file: !14, line: 2243, baseType: !909, size: 32, align: 32, offset: 3328)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !997, file: !14, line: 2249, baseType: !909, size: 32, align: 32, offset: 3360)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !997, file: !14, line: 2256, baseType: !909, size: 32, align: 32, offset: 3392)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !997, file: !14, line: 2263, baseType: !931, size: 64, align: 64, offset: 3456)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !997, file: !14, line: 2270, baseType: !931, size: 64, align: 64, offset: 3520)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !997, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !997, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !997, file: !14, line: 2367, baseType: !1210, size: 64, align: 64, offset: 3648)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!909, !1037, !1213, !909}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !997, file: !14, line: 2383, baseType: !909, size: 32, align: 32, offset: 3712)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !997, file: !14, line: 2386, baseType: !1142, size: 32, align: 32, offset: 3744)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !997, file: !14, line: 2387, baseType: !1142, size: 32, align: 32, offset: 3776)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !997, file: !14, line: 2394, baseType: !909, size: 32, align: 32, offset: 3808)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !997, file: !14, line: 2401, baseType: !909, size: 32, align: 32, offset: 3840)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !997, file: !14, line: 2408, baseType: !909, size: 32, align: 32, offset: 3872)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !997, file: !14, line: 2415, baseType: !909, size: 32, align: 32, offset: 3904)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !997, file: !14, line: 2422, baseType: !909, size: 32, align: 32, offset: 3936)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !997, file: !14, line: 2423, baseType: !1223, size: 64, align: 64, offset: 3968)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1225, file: !14, line: 827, baseType: !909, size: 32, align: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1225, file: !14, line: 828, baseType: !909, size: 32, align: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1225, file: !14, line: 829, baseType: !909, size: 32, align: 32, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1225, file: !14, line: 830, baseType: !1142, size: 32, align: 32, offset: 96)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !997, file: !14, line: 2430, baseType: !1014, size: 64, align: 64, offset: 4032)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !997, file: !14, line: 2437, baseType: !1014, size: 64, align: 64, offset: 4096)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !997, file: !14, line: 2444, baseType: !1142, size: 32, align: 32, offset: 4160)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !997, file: !14, line: 2451, baseType: !1142, size: 32, align: 32, offset: 4192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !997, file: !14, line: 2458, baseType: !909, size: 32, align: 32, offset: 4224)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !997, file: !14, line: 2469, baseType: !909, size: 32, align: 32, offset: 4256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !997, file: !14, line: 2475, baseType: !909, size: 32, align: 32, offset: 4288)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !997, file: !14, line: 2481, baseType: !909, size: 32, align: 32, offset: 4320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !997, file: !14, line: 2485, baseType: !909, size: 32, align: 32, offset: 4352)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !997, file: !14, line: 2489, baseType: !909, size: 32, align: 32, offset: 4384)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !997, file: !14, line: 2493, baseType: !909, size: 32, align: 32, offset: 4416)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !997, file: !14, line: 2501, baseType: !909, size: 32, align: 32, offset: 4448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !997, file: !14, line: 2506, baseType: !909, size: 32, align: 32, offset: 4480)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !997, file: !14, line: 2510, baseType: !909, size: 32, align: 32, offset: 4512)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !997, file: !14, line: 2514, baseType: !1014, size: 64, align: 64, offset: 4544)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !997, file: !14, line: 2528, baseType: !1247, size: 64, align: 64, offset: 4608)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{null, !1037, !948, !909, !909}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !997, file: !14, line: 2534, baseType: !909, size: 32, align: 32, offset: 4672)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !997, file: !14, line: 2545, baseType: !909, size: 32, align: 32, offset: 4704)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !997, file: !14, line: 2547, baseType: !909, size: 32, align: 32, offset: 4736)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !997, file: !14, line: 2549, baseType: !909, size: 32, align: 32, offset: 4768)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !997, file: !14, line: 2551, baseType: !909, size: 32, align: 32, offset: 4800)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !997, file: !14, line: 2553, baseType: !909, size: 32, align: 32, offset: 4832)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !997, file: !14, line: 2555, baseType: !909, size: 32, align: 32, offset: 4864)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !997, file: !14, line: 2557, baseType: !909, size: 32, align: 32, offset: 4896)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !997, file: !14, line: 2559, baseType: !909, size: 32, align: 32, offset: 4928)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !997, file: !14, line: 2563, baseType: !909, size: 32, align: 32, offset: 4960)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !997, file: !14, line: 2571, baseType: !1261, size: 64, align: 64, offset: 4992)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !997, file: !14, line: 2579, baseType: !1261, size: 64, align: 64, offset: 5056)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !997, file: !14, line: 2586, baseType: !909, size: 32, align: 32, offset: 5120)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !997, file: !14, line: 2615, baseType: !909, size: 32, align: 32, offset: 5152)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !997, file: !14, line: 2627, baseType: !909, size: 32, align: 32, offset: 5184)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !997, file: !14, line: 2637, baseType: !909, size: 32, align: 32, offset: 5216)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !997, file: !14, line: 2681, baseType: !909, size: 32, align: 32, offset: 5248)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !997, file: !14, line: 2709, baseType: !1014, size: 64, align: 64, offset: 5312)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !997, file: !14, line: 2716, baseType: !1270, size: 64, align: 64, offset: 5376)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1279, !1283, !1290, !1294, !1295, !1296, !1297, !1303, !1304, !1305, !1306, !1307}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1272, file: !14, line: 3642, baseType: !902, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1272, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1272, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1272, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1272, file: !14, line: 3669, baseType: !909, size: 32, align: 32, offset: 160)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1272, file: !14, line: 3682, baseType: !1280, size: 64, align: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!909, !995, !1213}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1272, file: !14, line: 3698, baseType: !1284, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!909, !995, !1287, !1289}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !932, line: 51, baseType: !1007)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1272, file: !14, line: 3712, baseType: !1291, size: 64, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!909, !995, !909, !1287, !1289}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1272, file: !14, line: 3726, baseType: !1284, size: 64, align: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1272, file: !14, line: 3737, baseType: !992, size: 64, align: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1272, file: !14, line: 3746, baseType: !909, size: 32, align: 32, offset: 512)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1272, file: !14, line: 3757, baseType: !1298, size: 64, align: 64, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !1301}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1272, file: !14, line: 3766, baseType: !992, size: 64, align: 64, offset: 640)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1272, file: !14, line: 3774, baseType: !992, size: 64, align: 64, offset: 704)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1272, file: !14, line: 3780, baseType: !909, size: 32, align: 32, offset: 768)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1272, file: !14, line: 3785, baseType: !909, size: 32, align: 32, offset: 800)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1272, file: !14, line: 3795, baseType: !1308, size: 64, align: 64, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!909, !995, !1076}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !997, file: !14, line: 2728, baseType: !948, size: 64, align: 64, offset: 5440)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !997, file: !14, line: 2735, baseType: !1066, size: 512, align: 64, offset: 5504)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !997, file: !14, line: 2742, baseType: !909, size: 32, align: 32, offset: 6016)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !997, file: !14, line: 2755, baseType: !909, size: 32, align: 32, offset: 6048)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !997, file: !14, line: 2776, baseType: !909, size: 32, align: 32, offset: 6080)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !997, file: !14, line: 2783, baseType: !909, size: 32, align: 32, offset: 6112)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !997, file: !14, line: 2791, baseType: !909, size: 32, align: 32, offset: 6144)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !997, file: !14, line: 2802, baseType: !1213, size: 64, align: 64, offset: 6208)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !997, file: !14, line: 2811, baseType: !909, size: 32, align: 32, offset: 6272)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !997, file: !14, line: 2821, baseType: !909, size: 32, align: 32, offset: 6304)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !997, file: !14, line: 2830, baseType: !909, size: 32, align: 32, offset: 6336)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !997, file: !14, line: 2840, baseType: !909, size: 32, align: 32, offset: 6368)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !997, file: !14, line: 2851, baseType: !1324, size: 64, align: 64, offset: 6400)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!909, !1037, !1327, !948, !1135, !909, !909}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!909, !1037, !948}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !997, file: !14, line: 2871, baseType: !1331, size: 64, align: 64, offset: 6464)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!909, !1037, !1334, !948, !1135, !909}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!909, !1037, !948, !909, !909}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !997, file: !14, line: 2878, baseType: !909, size: 32, align: 32, offset: 6528)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !997, file: !14, line: 2885, baseType: !909, size: 32, align: 32, offset: 6560)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !997, file: !14, line: 3005, baseType: !909, size: 32, align: 32, offset: 6592)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !997, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !997, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !997, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !997, file: !14, line: 3037, baseType: !1022, size: 64, align: 64, offset: 6720)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !997, file: !14, line: 3038, baseType: !909, size: 32, align: 32, offset: 6784)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !997, file: !14, line: 3050, baseType: !931, size: 64, align: 64, offset: 6848)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !997, file: !14, line: 3065, baseType: !909, size: 32, align: 32, offset: 6912)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !997, file: !14, line: 3083, baseType: !909, size: 32, align: 32, offset: 6944)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !997, file: !14, line: 3092, baseType: !913, size: 64, align: 32, offset: 6976)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !997, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !997, file: !14, line: 3106, baseType: !913, size: 64, align: 32, offset: 7072)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !997, file: !14, line: 3113, baseType: !1352, size: 64, align: 64, offset: 7168)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362, !1365}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1355, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1355, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1355, file: !14, line: 720, baseType: !902, size: 64, align: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1355, file: !14, line: 724, baseType: !902, size: 64, align: 64, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1355, file: !14, line: 728, baseType: !909, size: 32, align: 32, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1355, file: !14, line: 734, baseType: !1363, size: 64, align: 64, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1355, file: !14, line: 739, baseType: !1366, size: 64, align: 64, offset: 320)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !997, file: !14, line: 3129, baseType: !1014, size: 64, align: 64, offset: 7232)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !997, file: !14, line: 3130, baseType: !1014, size: 64, align: 64, offset: 7296)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !997, file: !14, line: 3131, baseType: !1014, size: 64, align: 64, offset: 7360)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !997, file: !14, line: 3132, baseType: !1014, size: 64, align: 64, offset: 7424)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !997, file: !14, line: 3139, baseType: !1261, size: 64, align: 64, offset: 7488)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !997, file: !14, line: 3147, baseType: !909, size: 32, align: 32, offset: 7552)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !997, file: !14, line: 3165, baseType: !909, size: 32, align: 32, offset: 7584)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !997, file: !14, line: 3172, baseType: !909, size: 32, align: 32, offset: 7616)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !997, file: !14, line: 3180, baseType: !909, size: 32, align: 32, offset: 7648)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !997, file: !14, line: 3191, baseType: !1172, size: 64, align: 64, offset: 7680)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !997, file: !14, line: 3199, baseType: !1022, size: 64, align: 64, offset: 7744)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !997, file: !14, line: 3207, baseType: !1261, size: 64, align: 64, offset: 7808)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !997, file: !14, line: 3214, baseType: !1007, size: 32, align: 32, offset: 7872)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !997, file: !14, line: 3224, baseType: !1382, size: 64, align: 64, offset: 7936)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1385)
!1385 = !{!1386, !1387, !1388}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1384, file: !14, line: 1412, baseType: !1022, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1384, file: !14, line: 1413, baseType: !909, size: 32, align: 32, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1384, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !997, file: !14, line: 3225, baseType: !909, size: 32, align: 32, offset: 8000)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !997, file: !14, line: 3249, baseType: !1076, size: 64, align: 64, offset: 8064)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !997, file: !14, line: 3256, baseType: !909, size: 32, align: 32, offset: 8128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !997, file: !14, line: 3271, baseType: !909, size: 32, align: 32, offset: 8160)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !997, file: !14, line: 3279, baseType: !1014, size: 64, align: 64, offset: 8192)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !997, file: !14, line: 3301, baseType: !1076, size: 64, align: 64, offset: 8256)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !997, file: !14, line: 3310, baseType: !909, size: 32, align: 32, offset: 8320)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !997, file: !14, line: 3337, baseType: !909, size: 32, align: 32, offset: 8352)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !997, file: !14, line: 3351, baseType: !909, size: 32, align: 32, offset: 8384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !997, file: !14, line: 3359, baseType: !909, size: 32, align: 32, offset: 8416)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !899, file: !14, line: 3535, baseType: !1400, size: 64, align: 64, offset: 1024)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!909, !995, !1403}
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !899, file: !14, line: 3541, baseType: !1406, size: 64, align: 64, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1408)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1409)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !899, file: !14, line: 3549, baseType: !1411, size: 64, align: 64, offset: 1152)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{null, !990}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !899, file: !14, line: 3551, baseType: !992, size: 64, align: 64, offset: 1216)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !899, file: !14, line: 3552, baseType: !1416, size: 64, align: 64, offset: 1280)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!909, !995, !1022, !909, !1419}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1454}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1421, file: !14, line: 3921, baseType: !1173, size: 16, align: 16)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1421, file: !14, line: 3922, baseType: !1289, size: 32, align: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1421, file: !14, line: 3923, baseType: !1289, size: 32, align: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1421, file: !14, line: 3924, baseType: !1007, size: 32, align: 32, offset: 96)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1421, file: !14, line: 3925, baseType: !1428, size: 64, align: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437, !1438, !1444, !1448, !1450, !1451, !1452, !1453}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1431, file: !14, line: 3886, baseType: !909, size: 32, align: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1431, file: !14, line: 3887, baseType: !909, size: 32, align: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1431, file: !14, line: 3888, baseType: !909, size: 32, align: 32, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1431, file: !14, line: 3889, baseType: !909, size: 32, align: 32, offset: 96)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1431, file: !14, line: 3890, baseType: !909, size: 32, align: 32, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1431, file: !14, line: 3897, baseType: !1439, size: 768, align: 64, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1441)
!1441 = !{!1442, !1443}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1440, file: !14, line: 3855, baseType: !1044, size: 512, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1440, file: !14, line: 3857, baseType: !1048, size: 256, align: 32, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1431, file: !14, line: 3903, baseType: !1445, size: 256, align: 64, offset: 960)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 256, align: 64, elements: !1446)
!1446 = !{!1447}
!1447 = !DISubrange(count: 4)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1431, file: !14, line: 3904, baseType: !1449, size: 128, align: 32, offset: 1216)
!1449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, align: 32, elements: !1446)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1431, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1431, file: !14, line: 3908, baseType: !1261, size: 64, align: 64, offset: 1408)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1431, file: !14, line: 3915, baseType: !1261, size: 64, align: 64, offset: 1472)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1431, file: !14, line: 3917, baseType: !909, size: 32, align: 32, offset: 1536)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1421, file: !14, line: 3926, baseType: !1014, size: 64, align: 64, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !899, file: !14, line: 3564, baseType: !1456, size: 64, align: 64, offset: 1344)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!909, !995, !1459, !1038, !1135}
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1461, file: !14, line: 1451, baseType: !1076, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1461, file: !14, line: 1461, baseType: !1014, size: 64, align: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1461, file: !14, line: 1467, baseType: !1014, size: 64, align: 64, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1461, file: !14, line: 1468, baseType: !1022, size: 64, align: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1461, file: !14, line: 1469, baseType: !909, size: 32, align: 32, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1461, file: !14, line: 1470, baseType: !909, size: 32, align: 32, offset: 288)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1461, file: !14, line: 1474, baseType: !909, size: 32, align: 32, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1461, file: !14, line: 1479, baseType: !1382, size: 64, align: 64, offset: 384)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1461, file: !14, line: 1480, baseType: !909, size: 32, align: 32, offset: 448)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1461, file: !14, line: 1486, baseType: !1014, size: 64, align: 64, offset: 512)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1461, file: !14, line: 1488, baseType: !1014, size: 64, align: 64, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1461, file: !14, line: 1497, baseType: !1014, size: 64, align: 64, offset: 640)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !899, file: !14, line: 3566, baseType: !1476, size: 64, align: 64, offset: 1408)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!909, !995, !948, !1135, !1459}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !899, file: !14, line: 3567, baseType: !992, size: 64, align: 64, offset: 1472)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !899, file: !14, line: 3576, baseType: !1481, size: 64, align: 64, offset: 1536)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!909, !995, !1038}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !899, file: !14, line: 3577, baseType: !1485, size: 64, align: 64, offset: 1600)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!909, !995, !1459}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !899, file: !14, line: 3584, baseType: !1280, size: 64, align: 64, offset: 1664)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !899, file: !14, line: 3589, baseType: !1490, size: 64, align: 64, offset: 1728)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !995}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !899, file: !14, line: 3594, baseType: !909, size: 32, align: 32, offset: 1792)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !899, file: !14, line: 3600, baseType: !902, size: 64, align: 64, offset: 1856)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !899, file: !14, line: 3609, baseType: !1496, size: 64, align: 64, offset: 1920)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1499)
!1499 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1500 = distinct !DIGlobalVariable(name: "ass_codes_map", scope: !0, file: !888, line: 68, type: !1501, isLocal: true, isDefinition: true, variable: [14 x %struct.anon]* @ass_codes_map)
!1501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1502, size: 2688, align: 64, elements: !1528)
!1502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 64, size: 192, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1503, file: !888, line: 65, baseType: !902, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1503, file: !888, line: 66, baseType: !902, size: 64, align: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1503, file: !888, line: 67, baseType: !1508, size: 64, align: 64, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!909, !1511, !902, !902}
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1513, line: 82, baseType: !1514)
!1513 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1513, line: 82, size: 8192, align: 64, elements: !1515)
!1515 = !{!1516, !1517, !1518, !1519, !1520, !1524}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1514, file: !1513, line: 82, baseType: !1261, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1514, file: !1513, line: 82, baseType: !1007, size: 32, align: 32, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1514, file: !1513, line: 82, baseType: !1007, size: 32, align: 32, offset: 96)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1514, file: !1513, line: 82, baseType: !1007, size: 32, align: 32, offset: 128)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1514, file: !1513, line: 82, baseType: !1521, size: 8, align: 8, offset: 160)
!1521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 8, align: 8, elements: !1522)
!1522 = !{!1523}
!1523 = !DISubrange(count: 1)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1514, file: !1513, line: 82, baseType: !1525, size: 8000, align: 8, offset: 168)
!1525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 8000, align: 8, elements: !1526)
!1526 = !{!1527}
!1527 = !DISubrange(count: 1000)
!1528 = !{!1529}
!1529 = !DISubrange(count: 14)
!1530 = !{i32 2, !"Dwarf Version", i32 4}
!1531 = !{i32 2, !"Debug Info Version", i32 3}
!1532 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1533 = distinct !DISubprogram(name: "jacosub_decode_frame", scope: !888, file: !888, line: 164, type: !1477, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1534)
!1534 = !{}
!1535 = !DILocalVariable(name: "c", arg: 1, scope: !1536, file: !1537, line: 33, type: !904)
!1536 = distinct !DISubprogram(name: "jss_whitespace", scope: !1537, file: !1537, line: 33, type: !1538, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1534)
!1537 = !DIFile(filename: "libavcodec/jacosub.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1538 = !DISubroutineType(types: !1539)
!1539 = !{!909, !904}
!1540 = !DIExpression()
!1541 = !DILocation(line: 33, column: 70, scope: !1536, inlinedAt: !1542)
!1542 = distinct !DILocation(line: 40, column: 12, scope: !1543, inlinedAt: !1547)
!1543 = !DILexicalBlockFile(scope: !1544, file: !1537, discriminator: 1)
!1544 = distinct !DISubprogram(name: "jss_skip_whitespace", scope: !1537, file: !1537, line: 38, type: !1545, isLocal: true, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1534)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!902, !902}
!1547 = distinct !DILocation(line: 179, column: 15, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1549, file: !888, line: 175, column: 15)
!1549 = distinct !DILexicalBlock(scope: !1533, file: !888, line: 175, column: 9)
!1550 = !DILocalVariable(name: "p", arg: 1, scope: !1544, file: !1537, line: 38, type: !902)
!1551 = !DILocation(line: 38, column: 90, scope: !1544, inlinedAt: !1547)
!1552 = !DILocalVariable(name: "avctx", arg: 1, scope: !1533, file: !888, line: 164, type: !995)
!1553 = !DILocation(line: 164, column: 49, scope: !1533)
!1554 = !DILocalVariable(name: "data", arg: 2, scope: !1533, file: !888, line: 165, type: !948)
!1555 = !DILocation(line: 165, column: 39, scope: !1533)
!1556 = !DILocalVariable(name: "got_sub_ptr", arg: 3, scope: !1533, file: !888, line: 165, type: !1135)
!1557 = !DILocation(line: 165, column: 50, scope: !1533)
!1558 = !DILocalVariable(name: "avpkt", arg: 4, scope: !1533, file: !888, line: 165, type: !1459)
!1559 = !DILocation(line: 165, column: 73, scope: !1533)
!1560 = !DILocalVariable(name: "ret", scope: !1533, file: !888, line: 167, type: !909)
!1561 = !DILocation(line: 167, column: 9, scope: !1533)
!1562 = !DILocalVariable(name: "sub", scope: !1533, file: !888, line: 168, type: !1563)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1421)
!1565 = !DILocation(line: 168, column: 17, scope: !1533)
!1566 = !DILocation(line: 168, column: 23, scope: !1533)
!1567 = !DILocalVariable(name: "ptr", scope: !1533, file: !888, line: 169, type: !902)
!1568 = !DILocation(line: 169, column: 17, scope: !1533)
!1569 = !DILocation(line: 169, column: 23, scope: !1533)
!1570 = !DILocation(line: 169, column: 30, scope: !1533)
!1571 = !DILocalVariable(name: "s", scope: !1533, file: !888, line: 170, type: !1572)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFASSDecoderContext", file: !1574, line: 48, baseType: !1575)
!1574 = !DIFile(filename: "libavcodec/ass.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFASSDecoderContext", file: !1574, line: 46, size: 32, align: 32, elements: !1576)
!1576 = !{!1577}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1575, file: !1574, line: 47, baseType: !909, size: 32, align: 32)
!1578 = !DILocation(line: 170, column: 26, scope: !1533)
!1579 = !DILocation(line: 170, column: 30, scope: !1533)
!1580 = !DILocation(line: 170, column: 37, scope: !1533)
!1581 = !DILocation(line: 172, column: 9, scope: !1582)
!1582 = distinct !DILexicalBlock(scope: !1533, file: !888, line: 172, column: 9)
!1583 = !DILocation(line: 172, column: 16, scope: !1582)
!1584 = !DILocation(line: 172, column: 21, scope: !1582)
!1585 = !DILocation(line: 172, column: 9, scope: !1533)
!1586 = !DILocation(line: 173, column: 9, scope: !1582)
!1587 = !DILocation(line: 175, column: 10, scope: !1549)
!1588 = !DILocation(line: 175, column: 9, scope: !1549)
!1589 = !DILocation(line: 175, column: 9, scope: !1533)
!1590 = !DILocalVariable(name: "buffer", scope: !1548, file: !888, line: 176, type: !1512)
!1591 = !DILocation(line: 176, column: 18, scope: !1548)
!1592 = !DILocation(line: 179, column: 35, scope: !1548)
!1593 = !DILocation(line: 179, column: 15, scope: !1548)
!1594 = !DILocation(line: 40, column: 5, scope: !1544, inlinedAt: !1547)
!1595 = !DILocation(line: 40, column: 28, scope: !1543, inlinedAt: !1547)
!1596 = !DILocation(line: 40, column: 27, scope: !1543, inlinedAt: !1547)
!1597 = !DILocation(line: 40, column: 12, scope: !1543, inlinedAt: !1547)
!1598 = !DILocation(line: 35, column: 12, scope: !1536, inlinedAt: !1542)
!1599 = !DILocation(line: 35, column: 14, scope: !1536, inlinedAt: !1542)
!1600 = !DILocation(line: 35, column: 21, scope: !1536, inlinedAt: !1542)
!1601 = !DILocation(line: 35, column: 25, scope: !1602, inlinedAt: !1542)
!1602 = !DILexicalBlockFile(scope: !1536, file: !1537, discriminator: 1)
!1603 = !DILocation(line: 35, column: 27, scope: !1602, inlinedAt: !1542)
!1604 = !DILocation(line: 35, column: 35, scope: !1602, inlinedAt: !1542)
!1605 = !DILocation(line: 35, column: 38, scope: !1606, inlinedAt: !1542)
!1606 = !DILexicalBlockFile(scope: !1536, file: !1537, discriminator: 2)
!1607 = !DILocation(line: 35, column: 40, scope: !1606, inlinedAt: !1542)
!1608 = !DILocation(line: 35, column: 21, scope: !1609, inlinedAt: !1542)
!1609 = !DILexicalBlockFile(scope: !1536, file: !1537, discriminator: 3)
!1610 = !DILocation(line: 35, column: 21, scope: !1611, inlinedAt: !1542)
!1611 = !DILexicalBlockFile(scope: !1536, file: !1537, discriminator: 4)
!1612 = !DILocation(line: 40, column: 5, scope: !1543, inlinedAt: !1547)
!1613 = !DILocation(line: 41, column: 10, scope: !1544, inlinedAt: !1547)
!1614 = !DILocation(line: 40, column: 5, scope: !1615, inlinedAt: !1547)
!1615 = !DILexicalBlockFile(scope: !1544, file: !1537, discriminator: 2)
!1616 = distinct !{!1616, !1617}
!1617 = !DILocation(line: 40, column: 5, scope: !1544)
!1618 = !DILocation(line: 42, column: 12, scope: !1544, inlinedAt: !1547)
!1619 = !DILocation(line: 179, column: 13, scope: !1548)
!1620 = !DILocation(line: 180, column: 22, scope: !1548)
!1621 = !DILocation(line: 180, column: 15, scope: !1548)
!1622 = !DILocation(line: 180, column: 13, scope: !1548)
!1623 = !DILocation(line: 180, column: 38, scope: !1624)
!1624 = distinct !DILexicalBlock(scope: !1548, file: !888, line: 180, column: 37)
!1625 = !DILocation(line: 180, column: 37, scope: !1548)
!1626 = !DILocation(line: 180, column: 43, scope: !1627)
!1627 = !DILexicalBlockFile(scope: !1624, file: !888, discriminator: 1)
!1628 = !DILocation(line: 180, column: 56, scope: !1629)
!1629 = !DILexicalBlockFile(scope: !1548, file: !888, discriminator: 2)
!1630 = !DILocation(line: 181, column: 22, scope: !1548)
!1631 = !DILocation(line: 181, column: 15, scope: !1548)
!1632 = !DILocation(line: 181, column: 13, scope: !1548)
!1633 = !DILocation(line: 181, column: 38, scope: !1634)
!1634 = distinct !DILexicalBlock(scope: !1548, file: !888, line: 181, column: 37)
!1635 = !DILocation(line: 181, column: 37, scope: !1548)
!1636 = !DILocation(line: 181, column: 43, scope: !1637)
!1637 = !DILexicalBlockFile(scope: !1634, file: !888, discriminator: 1)
!1638 = !DILocation(line: 181, column: 56, scope: !1629)
!1639 = !DILocation(line: 183, column: 9, scope: !1548)
!1640 = !DILocation(line: 184, column: 24, scope: !1548)
!1641 = !DILocation(line: 184, column: 40, scope: !1548)
!1642 = !DILocation(line: 184, column: 9, scope: !1548)
!1643 = !DILocation(line: 185, column: 31, scope: !1548)
!1644 = !DILocation(line: 185, column: 43, scope: !1548)
!1645 = !DILocation(line: 185, column: 48, scope: !1548)
!1646 = !DILocation(line: 185, column: 51, scope: !1548)
!1647 = !DILocation(line: 185, column: 60, scope: !1548)
!1648 = !DILocation(line: 185, column: 15, scope: !1548)
!1649 = !DILocation(line: 185, column: 13, scope: !1548)
!1650 = !DILocation(line: 186, column: 9, scope: !1548)
!1651 = !DILocation(line: 187, column: 13, scope: !1652)
!1652 = distinct !DILexicalBlock(scope: !1548, file: !888, line: 187, column: 13)
!1653 = !DILocation(line: 187, column: 17, scope: !1652)
!1654 = !DILocation(line: 187, column: 13, scope: !1548)
!1655 = !DILocation(line: 188, column: 20, scope: !1652)
!1656 = !DILocation(line: 188, column: 13, scope: !1652)
!1657 = !DILocation(line: 189, column: 5, scope: !1548)
!1658 = !DILocation(line: 175, column: 10, scope: !1659)
!1659 = !DILexicalBlockFile(scope: !1549, file: !888, discriminator: 1)
!1660 = !DILocation(line: 192, column: 20, scope: !1533)
!1661 = !DILocation(line: 192, column: 25, scope: !1533)
!1662 = !DILocation(line: 192, column: 35, scope: !1533)
!1663 = !DILocation(line: 192, column: 6, scope: !1533)
!1664 = !DILocation(line: 192, column: 18, scope: !1533)
!1665 = !DILocation(line: 193, column: 12, scope: !1533)
!1666 = !DILocation(line: 193, column: 19, scope: !1533)
!1667 = !DILocation(line: 193, column: 5, scope: !1533)
!1668 = !DILocation(line: 194, column: 1, scope: !1533)
!1669 = distinct !DISubprogram(name: "jacosub_to_ass", scope: !888, file: !888, line: 94, type: !1670, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1534)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{null, !995, !1511, !902}
!1672 = !DILocation(line: 33, column: 70, scope: !1536, inlinedAt: !1673)
!1673 = distinct !DILocation(line: 140, column: 20, scope: !1674)
!1674 = !DILexicalBlockFile(scope: !1675, file: !888, discriminator: 1)
!1675 = distinct !DILexicalBlock(scope: !1676, file: !888, line: 138, column: 47)
!1676 = distinct !DILexicalBlock(scope: !1677, file: !888, line: 138, column: 13)
!1677 = distinct !DILexicalBlock(scope: !1669, file: !888, line: 135, column: 34)
!1678 = !DILocation(line: 33, column: 70, scope: !1536, inlinedAt: !1679)
!1679 = distinct !DILocation(line: 40, column: 12, scope: !1543, inlinedAt: !1680)
!1680 = distinct !DILocation(line: 108, column: 15, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1682, file: !888, line: 101, column: 45)
!1682 = distinct !DILexicalBlock(scope: !1669, file: !888, line: 101, column: 9)
!1683 = !DILocation(line: 38, column: 90, scope: !1544, inlinedAt: !1680)
!1684 = !DILocation(line: 33, column: 70, scope: !1536, inlinedAt: !1685)
!1685 = distinct !DILocation(line: 106, column: 25, scope: !1686)
!1686 = !DILexicalBlockFile(scope: !1681, file: !888, discriminator: 1)
!1687 = !DILocalVariable(name: "avctx", arg: 1, scope: !1669, file: !888, line: 94, type: !995)
!1688 = !DILocation(line: 94, column: 44, scope: !1669)
!1689 = !DILocalVariable(name: "dst", arg: 2, scope: !1669, file: !888, line: 94, type: !1511)
!1690 = !DILocation(line: 94, column: 61, scope: !1669)
!1691 = !DILocalVariable(name: "src", arg: 3, scope: !1669, file: !888, line: 94, type: !902)
!1692 = !DILocation(line: 94, column: 78, scope: !1669)
!1693 = !DILocalVariable(name: "i", scope: !1669, file: !888, line: 96, type: !909)
!1694 = !DILocation(line: 96, column: 9, scope: !1669)
!1695 = !DILocalVariable(name: "valign", scope: !1669, file: !888, line: 96, type: !909)
!1696 = !DILocation(line: 96, column: 12, scope: !1669)
!1697 = !DILocalVariable(name: "halign", scope: !1669, file: !888, line: 96, type: !909)
!1698 = !DILocation(line: 96, column: 24, scope: !1669)
!1699 = !DILocalVariable(name: "c", scope: !1669, file: !888, line: 97, type: !904)
!1700 = !DILocation(line: 97, column: 10, scope: !1669)
!1701 = !DILocation(line: 97, column: 26, scope: !1669)
!1702 = !DILocation(line: 97, column: 25, scope: !1669)
!1703 = !DILocation(line: 97, column: 14, scope: !1669)
!1704 = !DILocalVariable(name: "directives", scope: !1669, file: !888, line: 98, type: !1705)
!1705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 1024, align: 8, elements: !1706)
!1706 = !{!1707}
!1707 = !DISubrange(count: 128)
!1708 = !DILocation(line: 98, column: 10, scope: !1669)
!1709 = !DILocation(line: 101, column: 10, scope: !1682)
!1710 = !DILocation(line: 101, column: 12, scope: !1682)
!1711 = !DILocation(line: 101, column: 19, scope: !1682)
!1712 = !DILocation(line: 101, column: 22, scope: !1713)
!1713 = !DILexicalBlockFile(scope: !1682, file: !888, discriminator: 1)
!1714 = !DILocation(line: 101, column: 24, scope: !1713)
!1715 = !DILocation(line: 101, column: 32, scope: !1713)
!1716 = !DILocation(line: 101, column: 35, scope: !1717)
!1717 = !DILexicalBlockFile(scope: !1682, file: !888, discriminator: 2)
!1718 = !DILocation(line: 101, column: 37, scope: !1717)
!1719 = !DILocation(line: 101, column: 9, scope: !1717)
!1720 = !DILocalVariable(name: "p", scope: !1681, file: !888, line: 102, type: !1261)
!1721 = !DILocation(line: 102, column: 15, scope: !1681)
!1722 = !DILocation(line: 102, column: 19, scope: !1681)
!1723 = !DILocalVariable(name: "pend", scope: !1681, file: !888, line: 103, type: !1261)
!1724 = !DILocation(line: 103, column: 15, scope: !1681)
!1725 = !DILocation(line: 103, column: 22, scope: !1681)
!1726 = !DILocation(line: 103, column: 33, scope: !1681)
!1727 = !DILocation(line: 103, column: 54, scope: !1681)
!1728 = !DILocation(line: 105, column: 9, scope: !1681)
!1729 = distinct !{!1729, !1728}
!1730 = !DILocation(line: 105, column: 34, scope: !1686)
!1731 = !DILocation(line: 105, column: 30, scope: !1686)
!1732 = !DILocation(line: 105, column: 19, scope: !1686)
!1733 = !DILocation(line: 105, column: 14, scope: !1686)
!1734 = !DILocation(line: 105, column: 17, scope: !1686)
!1735 = !DILocation(line: 105, column: 12, scope: !1686)
!1736 = !DILocation(line: 106, column: 17, scope: !1681)
!1737 = !DILocation(line: 106, column: 16, scope: !1681)
!1738 = !DILocation(line: 106, column: 21, scope: !1681)
!1739 = !DILocation(line: 106, column: 41, scope: !1686)
!1740 = !DILocation(line: 106, column: 40, scope: !1686)
!1741 = !DILocation(line: 106, column: 25, scope: !1686)
!1742 = !DILocation(line: 35, column: 12, scope: !1536, inlinedAt: !1685)
!1743 = !DILocation(line: 35, column: 14, scope: !1536, inlinedAt: !1685)
!1744 = !DILocation(line: 35, column: 21, scope: !1536, inlinedAt: !1685)
!1745 = !DILocation(line: 35, column: 25, scope: !1602, inlinedAt: !1685)
!1746 = !DILocation(line: 35, column: 27, scope: !1602, inlinedAt: !1685)
!1747 = !DILocation(line: 35, column: 35, scope: !1602, inlinedAt: !1685)
!1748 = !DILocation(line: 35, column: 38, scope: !1606, inlinedAt: !1685)
!1749 = !DILocation(line: 35, column: 40, scope: !1606, inlinedAt: !1685)
!1750 = !DILocation(line: 35, column: 21, scope: !1609, inlinedAt: !1685)
!1751 = !DILocation(line: 35, column: 21, scope: !1611, inlinedAt: !1685)
