; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_exss.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_exss.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DCAExssParser = type { %struct.AVCodecContext*, %struct.GetBitContext, i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [1 x %struct.DCAExssAsset] }

!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!900 = !DIEnumerator(name: "DCA_CSS_CORE", value: 1)
!901 = !DIEnumerator(name: "DCA_CSS_XXCH", value: 2)
!902 = !DIEnumerator(name: "DCA_CSS_X96", value: 4)
!903 = !DIEnumerator(name: "DCA_CSS_XCH", value: 8)
!904 = !DIEnumerator(name: "DCA_CSS_MASK", value: 15)
!905 = !DIEnumerator(name: "DCA_EXSS_CORE", value: 16)
!906 = !DIEnumerator(name: "DCA_EXSS_XBR", value: 32)
!907 = !DIEnumerator(name: "DCA_EXSS_XXCH", value: 64)
!908 = !DIEnumerator(name: "DCA_EXSS_X96", value: 128)
!909 = !DIEnumerator(name: "DCA_EXSS_LBR", value: 256)
!910 = !DIEnumerator(name: "DCA_EXSS_XLL", value: 512)
!911 = !DIEnumerator(name: "DCA_EXSS_RSV1", value: 1024)
!912 = !DIEnumerator(name: "DCA_EXSS_RSV2", value: 2048)
!913 = !DIEnumerator(name: "DCA_EXSS_MASK", value: 4080)
!914 = !{!915, !916, !917, !925}
!915 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!916 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !916)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !926)
!926 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!927 = !{i32 2, !"Dwarf Version", i32 4}
!928 = !{i32 2, !"Debug Info Version", i32 3}
!929 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!930 = distinct !DISubprogram(name: "ff_dca_exss_parse", scope: !931, file: !931, line: 378, type: !932, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1722)
!931 = !DIFile(filename: "libavcodec/dca_exss.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!932 = !DISubroutineType(types: !933)
!933 = !{!915, !934, !1056, !915}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCAExssParser", file: !936, line: 88, baseType: !937)
!936 = !DIFile(filename: "libavcodec/dca_exss.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCAExssParser", file: !936, line: 71, size: 1664, align: 64, elements: !938)
!938 = !{!939, !1666, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !937, file: !936, line: 72, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !943)
!943 = !{!944, !989, !990, !991, !1264, !1265, !1266, !1267, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1420, !1424, !1425, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1604, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !942, file: !35, line: 1561, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !949)
!949 = !{!950, !954, !959, !963, !964, !965, !966, !970, !976, !978, !982}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !948, file: !4, line: 72, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !948, file: !4, line: 78, baseType: !955, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!951, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !948, file: !4, line: 85, baseType: !960, size: 64, align: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !948, file: !4, line: 93, baseType: !915, size: 32, align: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !948, file: !4, line: 99, baseType: !915, size: 32, align: 32, offset: 224)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !948, file: !4, line: 108, baseType: !915, size: 32, align: 32, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !948, file: !4, line: 113, baseType: !967, size: 64, align: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!958, !958, !958}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !948, file: !4, line: 123, baseType: !971, size: 64, align: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !948, file: !4, line: 130, baseType: !977, size: 32, align: 32, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !948, file: !4, line: 136, baseType: !979, size: 64, align: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!977, !958}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !948, file: !4, line: 142, baseType: !983, size: 64, align: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!915, !986, !958, !951, !915}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !942, file: !35, line: 1562, baseType: !915, size: 32, align: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !942, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !942, file: !35, line: 1565, baseType: !992, size: 64, align: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1010, !1013, !1016, !1019, !1024, !1025, !1026, !1034, !1035, !1036, !1038, !1042, !1048, !1059, !1063, !1064, !1114, !1235, !1239, !1240, !1244, !1248, !1253, !1257, !1258, !1259}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !994, file: !35, line: 3475, baseType: !951, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !994, file: !35, line: 3480, baseType: !951, size: 64, align: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !994, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !994, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !994, file: !35, line: 3487, baseType: !915, size: 32, align: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !994, file: !35, line: 3488, baseType: !1002, size: 64, align: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1005, line: 61, baseType: !1006)
!1005 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1005, line: 58, size: 64, align: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1006, file: !1005, line: 59, baseType: !915, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1006, file: !1005, line: 60, baseType: !915, size: 32, align: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !994, file: !35, line: 3489, baseType: !1011, size: 64, align: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !994, file: !35, line: 3490, baseType: !1014, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !994, file: !35, line: 3491, baseType: !1017, size: 64, align: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !994, file: !35, line: 3492, baseType: !1020, size: 64, align: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1023)
!1023 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !994, file: !35, line: 3493, baseType: !925, size: 8, align: 8, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !994, file: !35, line: 3494, baseType: !945, size: 64, align: 64, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !994, file: !35, line: 3495, baseType: !1027, size: 64, align: 64, offset: 704)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1030, file: !35, line: 3402, baseType: !915, size: 32, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1030, file: !35, line: 3403, baseType: !951, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !994, file: !35, line: 3507, baseType: !951, size: 64, align: 64, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !994, file: !35, line: 3516, baseType: !915, size: 32, align: 32, offset: 832)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !35, line: 3517, baseType: !1037, size: 64, align: 64, offset: 896)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !994, file: !35, line: 3527, baseType: !1039, size: 64, align: 64, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!915, !940}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !994, file: !35, line: 3535, baseType: !1043, size: 64, align: 64, offset: 1024)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!915, !940, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !994, file: !35, line: 3541, baseType: !1049, size: 64, align: 64, offset: 1088)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1053, line: 223, size: 128, align: 64, elements: !1054)
!1053 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1054 = !{!1055, !1058}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1052, file: !1053, line: 224, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1052, file: !1053, line: 225, baseType: !1056, size: 64, align: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !994, file: !35, line: 3549, baseType: !1060, size: 64, align: 64, offset: 1152)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !1037}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !994, file: !35, line: 3551, baseType: !1039, size: 64, align: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !994, file: !35, line: 3552, baseType: !1065, size: 64, align: 64, offset: 1280)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!915, !940, !1068, !915, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1072)
!1072 = !{!1073, !1076, !1077, !1078, !1079, !1111}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1071, file: !35, line: 3921, baseType: !1074, size: 16, align: 16)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !1075)
!1075 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1071, file: !35, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1071, file: !35, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1071, file: !35, line: 3924, baseType: !916, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1071, file: !35, line: 3925, baseType: !1080, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1100, !1104, !1106, !1107, !1109, !1110}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1083, file: !35, line: 3886, baseType: !915, size: 32, align: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1083, file: !35, line: 3887, baseType: !915, size: 32, align: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1083, file: !35, line: 3888, baseType: !915, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1083, file: !35, line: 3889, baseType: !915, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1083, file: !35, line: 3890, baseType: !915, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1083, file: !35, line: 3897, baseType: !1091, size: 768, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1093)
!1093 = !{!1094, !1098}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !35, line: 3855, baseType: !1095, size: 512, align: 64)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 8)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1092, file: !35, line: 3857, baseType: !1099, size: 256, align: 32, offset: 512)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 256, align: 32, elements: !1096)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !35, line: 3903, baseType: !1101, size: 256, align: 64, offset: 960)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 256, align: 64, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 4)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1083, file: !35, line: 3904, baseType: !1105, size: 128, align: 32, offset: 1216)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 128, align: 32, elements: !1102)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1083, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1083, file: !35, line: 3908, baseType: !1108, size: 64, align: 64, offset: 1408)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1083, file: !35, line: 3915, baseType: !1108, size: 64, align: 64, offset: 1472)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1083, file: !35, line: 3917, baseType: !915, size: 32, align: 32, offset: 1536)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1071, file: !35, line: 3926, baseType: !1112, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1113)
!1113 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !994, file: !35, line: 3564, baseType: !1115, size: 64, align: 64, offset: 1344)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!915, !940, !1118, !1152, !1234}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1121)
!1121 = !{!1122, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1148, !1149, !1150, !1151}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1120, file: !35, line: 1451, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1125, line: 94, baseType: !1126)
!1125 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1125, line: 81, size: 192, align: 64, elements: !1127)
!1127 = !{!1128, !1132, !1133}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1126, file: !1125, line: 82, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1125, line: 73, baseType: !1131)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1125, line: 73, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !1125, line: 89, baseType: !1068, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !1125, line: 93, baseType: !915, size: 32, align: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1120, file: !35, line: 1461, baseType: !1112, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1120, file: !35, line: 1467, baseType: !1112, size: 64, align: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !35, line: 1468, baseType: !1068, size: 64, align: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !35, line: 1469, baseType: !915, size: 32, align: 32, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1120, file: !35, line: 1470, baseType: !915, size: 32, align: 32, offset: 288)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1120, file: !35, line: 1474, baseType: !915, size: 32, align: 32, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1120, file: !35, line: 1479, baseType: !1141, size: 64, align: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1144)
!1144 = !{!1145, !1146, !1147}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !35, line: 1412, baseType: !1068, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1143, file: !35, line: 1413, baseType: !915, size: 32, align: 32, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1143, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1120, file: !35, line: 1480, baseType: !915, size: 32, align: 32, offset: 448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1120, file: !35, line: 1486, baseType: !1112, size: 64, align: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1120, file: !35, line: 1488, baseType: !1112, size: 64, align: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1120, file: !35, line: 1497, baseType: !1112, size: 64, align: 64, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1186, !1188, !1189, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1222, !1223, !1224, !1225, !1226, !1227, !1230, !1231, !1232, !1233}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !758, line: 282, baseType: !1095, size: 512, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1155, file: !758, line: 299, baseType: !1099, size: 256, align: 32, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1155, file: !758, line: 315, baseType: !1160, size: 64, align: 64, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1155, file: !758, line: 326, baseType: !915, size: 32, align: 32, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1155, file: !758, line: 326, baseType: !915, size: 32, align: 32, offset: 864)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1155, file: !758, line: 334, baseType: !915, size: 32, align: 32, offset: 896)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1155, file: !758, line: 341, baseType: !915, size: 32, align: 32, offset: 928)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1155, file: !758, line: 346, baseType: !915, size: 32, align: 32, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1155, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1155, file: !758, line: 356, baseType: !1004, size: 64, align: 32, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1155, file: !758, line: 361, baseType: !1112, size: 64, align: 64, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1155, file: !758, line: 369, baseType: !1112, size: 64, align: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1155, file: !758, line: 377, baseType: !1112, size: 64, align: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1155, file: !758, line: 382, baseType: !915, size: 32, align: 32, offset: 1280)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1155, file: !758, line: 386, baseType: !915, size: 32, align: 32, offset: 1312)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1155, file: !758, line: 391, baseType: !915, size: 32, align: 32, offset: 1344)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1155, file: !758, line: 396, baseType: !958, size: 64, align: 64, offset: 1408)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1155, file: !758, line: 403, baseType: !1176, size: 512, align: 64, offset: 1472)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 512, align: 64, elements: !1096)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1155, file: !758, line: 410, baseType: !915, size: 32, align: 32, offset: 1984)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1155, file: !758, line: 415, baseType: !915, size: 32, align: 32, offset: 2016)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1155, file: !758, line: 420, baseType: !915, size: 32, align: 32, offset: 2048)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1155, file: !758, line: 425, baseType: !915, size: 32, align: 32, offset: 2080)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1155, file: !758, line: 435, baseType: !1112, size: 64, align: 64, offset: 2112)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1155, file: !758, line: 440, baseType: !915, size: 32, align: 32, offset: 2176)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1155, file: !758, line: 445, baseType: !1022, size: 64, align: 64, offset: 2240)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1155, file: !758, line: 459, baseType: !1185, size: 512, align: 64, offset: 2304)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 512, align: 64, elements: !1096)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1155, file: !758, line: 473, baseType: !1187, size: 64, align: 64, offset: 2816)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1155, file: !758, line: 477, baseType: !915, size: 32, align: 32, offset: 2880)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1155, file: !758, line: 479, baseType: !1190, size: 64, align: 64, offset: 2944)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1203}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1193, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1193, file: !758, line: 203, baseType: !1068, size: 64, align: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1193, file: !758, line: 204, baseType: !915, size: 32, align: 32, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1193, file: !758, line: 205, baseType: !1199, size: 64, align: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1201, line: 86, baseType: !1202)
!1201 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1201, line: 86, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1193, file: !758, line: 206, baseType: !1123, size: 64, align: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1155, file: !758, line: 480, baseType: !915, size: 32, align: 32, offset: 3008)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1155, file: !758, line: 505, baseType: !915, size: 32, align: 32, offset: 3040)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1155, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1155, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1155, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1155, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1155, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1155, file: !758, line: 532, baseType: !1112, size: 64, align: 64, offset: 3264)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1155, file: !758, line: 539, baseType: !1112, size: 64, align: 64, offset: 3328)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1155, file: !758, line: 547, baseType: !1112, size: 64, align: 64, offset: 3392)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1155, file: !758, line: 554, baseType: !1199, size: 64, align: 64, offset: 3456)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1155, file: !758, line: 563, baseType: !915, size: 32, align: 32, offset: 3520)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1155, file: !758, line: 572, baseType: !915, size: 32, align: 32, offset: 3552)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1155, file: !758, line: 581, baseType: !915, size: 32, align: 32, offset: 3584)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1155, file: !758, line: 588, baseType: !1219, size: 64, align: 64, offset: 3648)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1221)
!1221 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1155, file: !758, line: 593, baseType: !915, size: 32, align: 32, offset: 3712)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1155, file: !758, line: 596, baseType: !915, size: 32, align: 32, offset: 3744)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1155, file: !758, line: 599, baseType: !1123, size: 64, align: 64, offset: 3776)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1155, file: !758, line: 605, baseType: !1123, size: 64, align: 64, offset: 3840)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1155, file: !758, line: 616, baseType: !1123, size: 64, align: 64, offset: 3904)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1155, file: !758, line: 626, baseType: !1228, size: 64, align: 64, offset: 3968)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1229, line: 216, baseType: !1023)
!1229 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1155, file: !758, line: 627, baseType: !1228, size: 64, align: 64, offset: 4032)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1155, file: !758, line: 628, baseType: !1228, size: 64, align: 64, offset: 4096)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1155, file: !758, line: 629, baseType: !1228, size: 64, align: 64, offset: 4160)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1155, file: !758, line: 645, baseType: !1123, size: 64, align: 64, offset: 4224)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !994, file: !35, line: 3566, baseType: !1236, size: 64, align: 64, offset: 1408)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!915, !940, !958, !1234, !1118}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !994, file: !35, line: 3567, baseType: !1039, size: 64, align: 64, offset: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !994, file: !35, line: 3576, baseType: !1241, size: 64, align: 64, offset: 1536)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!915, !940, !1152}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !994, file: !35, line: 3577, baseType: !1245, size: 64, align: 64, offset: 1600)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!915, !940, !1118}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !994, file: !35, line: 3584, baseType: !1249, size: 64, align: 64, offset: 1664)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!915, !940, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !994, file: !35, line: 3589, baseType: !1254, size: 64, align: 64, offset: 1728)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !940}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !994, file: !35, line: 3594, baseType: !915, size: 32, align: 32, offset: 1792)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !994, file: !35, line: 3600, baseType: !951, size: 64, align: 64, offset: 1856)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !994, file: !35, line: 3609, baseType: !1260, size: 64, align: 64, offset: 1920)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1263)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !942, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !942, file: !35, line: 1581, baseType: !916, size: 32, align: 32, offset: 224)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !942, file: !35, line: 1583, baseType: !958, size: 64, align: 64, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !942, file: !35, line: 1591, baseType: !1268, size: 64, align: 64, offset: 320)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1053, line: 129, size: 1664, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1273, !1274, !1275, !1293, !1294, !1300, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1269, file: !1053, line: 136, baseType: !915, size: 32, align: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1269, file: !1053, line: 151, baseType: !915, size: 32, align: 32, offset: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1269, file: !1053, line: 157, baseType: !915, size: 32, align: 32, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1269, file: !1053, line: 159, baseType: !1252, size: 64, align: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1269, file: !1053, line: 161, baseType: !1276, size: 64, align: 64, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1053, line: 117, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1053, line: 100, size: 832, align: 64, elements: !1279)
!1279 = !{!1280, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1278, file: !1053, line: 105, baseType: !1281, size: 256, align: 64)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1282, size: 256, align: 64, elements: !1102)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1125, line: 238, baseType: !1284)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1125, line: 238, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1278, file: !1053, line: 110, baseType: !915, size: 32, align: 32, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1278, file: !1053, line: 111, baseType: !915, size: 32, align: 32, offset: 288)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1278, file: !1053, line: 111, baseType: !915, size: 32, align: 32, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1278, file: !1053, line: 112, baseType: !1099, size: 256, align: 32, offset: 352)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1278, file: !1053, line: 113, baseType: !1105, size: 128, align: 32, offset: 608)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1278, file: !1053, line: 114, baseType: !915, size: 32, align: 32, offset: 736)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1278, file: !1053, line: 115, baseType: !915, size: 32, align: 32, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1278, file: !1053, line: 116, baseType: !915, size: 32, align: 32, offset: 800)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1269, file: !1053, line: 163, baseType: !958, size: 64, align: 64, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1269, file: !1053, line: 165, baseType: !1295, size: 128, align: 64, offset: 320)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1053, line: 122, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1053, line: 119, size: 128, align: 64, elements: !1297)
!1297 = !{!1298, !1299}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1296, file: !1053, line: 120, baseType: !1118, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1296, file: !1053, line: 121, baseType: !1252, size: 64, align: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1269, file: !1053, line: 166, baseType: !1301, size: 128, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1053, line: 127, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1053, line: 124, size: 128, align: 64, elements: !1303)
!1303 = !{!1304, !1377}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1302, file: !1053, line: 125, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1335, !1339, !1340, !1374, !1375, !1376}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1308, file: !35, line: 5751, baseType: !945, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1308, file: !35, line: 5756, baseType: !1312, size: 64, align: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1315)
!1315 = !{!1316, !1317, !1320, !1321, !1322, !1326, !1330, !1334}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1314, file: !35, line: 5797, baseType: !951, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1314, file: !35, line: 5804, baseType: !1318, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1314, file: !35, line: 5815, baseType: !945, size: 64, align: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1314, file: !35, line: 5825, baseType: !915, size: 32, align: 32, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1314, file: !35, line: 5826, baseType: !1323, size: 64, align: 64, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!915, !1306}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1314, file: !35, line: 5827, baseType: !1327, size: 64, align: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!915, !1306, !1118}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1314, file: !35, line: 5828, baseType: !1331, size: 64, align: 64, offset: 384)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{null, !1306}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1314, file: !35, line: 5829, baseType: !1331, size: 64, align: 64, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1308, file: !35, line: 5762, baseType: !1336, size: 64, align: 64, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1338)
!1338 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1308, file: !35, line: 5768, baseType: !958, size: 64, align: 64, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1308, file: !35, line: 5775, baseType: !1341, size: 64, align: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1343, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1343, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1343, file: !35, line: 3948, baseType: !923, size: 32, align: 32, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1343, file: !35, line: 3958, baseType: !1068, size: 64, align: 64, offset: 128)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1343, file: !35, line: 3962, baseType: !915, size: 32, align: 32, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1343, file: !35, line: 3968, baseType: !915, size: 32, align: 32, offset: 224)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1343, file: !35, line: 3973, baseType: !1112, size: 64, align: 64, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1343, file: !35, line: 3986, baseType: !915, size: 32, align: 32, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1343, file: !35, line: 3999, baseType: !915, size: 32, align: 32, offset: 352)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1343, file: !35, line: 4004, baseType: !915, size: 32, align: 32, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1343, file: !35, line: 4005, baseType: !915, size: 32, align: 32, offset: 416)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1343, file: !35, line: 4010, baseType: !915, size: 32, align: 32, offset: 448)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1343, file: !35, line: 4011, baseType: !915, size: 32, align: 32, offset: 480)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1343, file: !35, line: 4020, baseType: !1004, size: 64, align: 32, offset: 512)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1343, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1343, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1343, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1343, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1343, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1343, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1343, file: !35, line: 4039, baseType: !915, size: 32, align: 32, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1343, file: !35, line: 4046, baseType: !1022, size: 64, align: 64, offset: 832)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1343, file: !35, line: 4050, baseType: !915, size: 32, align: 32, offset: 896)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1343, file: !35, line: 4054, baseType: !915, size: 32, align: 32, offset: 928)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1343, file: !35, line: 4061, baseType: !915, size: 32, align: 32, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1343, file: !35, line: 4065, baseType: !915, size: 32, align: 32, offset: 992)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1343, file: !35, line: 4073, baseType: !915, size: 32, align: 32, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1343, file: !35, line: 4080, baseType: !915, size: 32, align: 32, offset: 1056)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1343, file: !35, line: 4084, baseType: !915, size: 32, align: 32, offset: 1088)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1308, file: !35, line: 5781, baseType: !1341, size: 64, align: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1308, file: !35, line: 5787, baseType: !1004, size: 64, align: 32, offset: 384)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1308, file: !35, line: 5793, baseType: !1004, size: 64, align: 32, offset: 448)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1302, file: !1053, line: 126, baseType: !915, size: 32, align: 32, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1269, file: !1053, line: 172, baseType: !1118, size: 64, align: 64, offset: 576)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1269, file: !1053, line: 177, baseType: !1068, size: 64, align: 64, offset: 640)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1269, file: !1053, line: 178, baseType: !916, size: 32, align: 32, offset: 704)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1269, file: !1053, line: 180, baseType: !958, size: 64, align: 64, offset: 768)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1269, file: !1053, line: 185, baseType: !915, size: 32, align: 32, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1269, file: !1053, line: 190, baseType: !958, size: 64, align: 64, offset: 896)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1269, file: !1053, line: 195, baseType: !915, size: 32, align: 32, offset: 960)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1269, file: !1053, line: 200, baseType: !1118, size: 64, align: 64, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1269, file: !1053, line: 201, baseType: !915, size: 32, align: 32, offset: 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1269, file: !1053, line: 202, baseType: !1252, size: 64, align: 64, offset: 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1269, file: !1053, line: 203, baseType: !915, size: 32, align: 32, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1269, file: !1053, line: 205, baseType: !915, size: 32, align: 32, offset: 1248)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1269, file: !1053, line: 206, baseType: !915, size: 32, align: 32, offset: 1280)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1269, file: !1053, line: 209, baseType: !1228, size: 64, align: 64, offset: 1344)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1269, file: !1053, line: 212, baseType: !1228, size: 64, align: 64, offset: 1408)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1269, file: !1053, line: 213, baseType: !1252, size: 64, align: 64, offset: 1472)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1269, file: !1053, line: 215, baseType: !915, size: 32, align: 32, offset: 1536)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1269, file: !1053, line: 217, baseType: !915, size: 32, align: 32, offset: 1568)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1269, file: !1053, line: 220, baseType: !915, size: 32, align: 32, offset: 1600)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !942, file: !35, line: 1598, baseType: !958, size: 64, align: 64, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !942, file: !35, line: 1606, baseType: !1112, size: 64, align: 64, offset: 448)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !942, file: !35, line: 1614, baseType: !915, size: 32, align: 32, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !942, file: !35, line: 1622, baseType: !915, size: 32, align: 32, offset: 544)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !942, file: !35, line: 1628, baseType: !915, size: 32, align: 32, offset: 576)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !35, line: 1636, baseType: !915, size: 32, align: 32, offset: 608)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !942, file: !35, line: 1643, baseType: !915, size: 32, align: 32, offset: 640)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !942, file: !35, line: 1657, baseType: !1068, size: 64, align: 64, offset: 704)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !942, file: !35, line: 1658, baseType: !915, size: 32, align: 32, offset: 768)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !942, file: !35, line: 1679, baseType: !1004, size: 64, align: 32, offset: 800)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !942, file: !35, line: 1688, baseType: !915, size: 32, align: 32, offset: 864)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !942, file: !35, line: 1712, baseType: !915, size: 32, align: 32, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !942, file: !35, line: 1729, baseType: !915, size: 32, align: 32, offset: 928)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !942, file: !35, line: 1729, baseType: !915, size: 32, align: 32, offset: 960)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !942, file: !35, line: 1744, baseType: !915, size: 32, align: 32, offset: 992)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !942, file: !35, line: 1744, baseType: !915, size: 32, align: 32, offset: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !942, file: !35, line: 1751, baseType: !915, size: 32, align: 32, offset: 1056)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !942, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !942, file: !35, line: 1791, baseType: !1416, size: 64, align: 64, offset: 1152)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{null, !1419, !1152, !1234, !915, !915, !915}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !942, file: !35, line: 1808, baseType: !1421, size: 64, align: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!494, !1419, !1011}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !942, file: !35, line: 1816, baseType: !915, size: 32, align: 32, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !942, file: !35, line: 1825, baseType: !1426, size: 32, align: 32, offset: 1312)
!1426 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !942, file: !35, line: 1830, baseType: !915, size: 32, align: 32, offset: 1344)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !942, file: !35, line: 1838, baseType: !1426, size: 32, align: 32, offset: 1376)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !942, file: !35, line: 1846, baseType: !915, size: 32, align: 32, offset: 1408)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !942, file: !35, line: 1851, baseType: !915, size: 32, align: 32, offset: 1440)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !942, file: !35, line: 1861, baseType: !1426, size: 32, align: 32, offset: 1472)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !942, file: !35, line: 1868, baseType: !1426, size: 32, align: 32, offset: 1504)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !942, file: !35, line: 1875, baseType: !1426, size: 32, align: 32, offset: 1536)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !942, file: !35, line: 1882, baseType: !1426, size: 32, align: 32, offset: 1568)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !942, file: !35, line: 1889, baseType: !1426, size: 32, align: 32, offset: 1600)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !942, file: !35, line: 1896, baseType: !1426, size: 32, align: 32, offset: 1632)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !942, file: !35, line: 1903, baseType: !1426, size: 32, align: 32, offset: 1664)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !942, file: !35, line: 1910, baseType: !915, size: 32, align: 32, offset: 1696)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !942, file: !35, line: 1915, baseType: !915, size: 32, align: 32, offset: 1728)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !942, file: !35, line: 1926, baseType: !1234, size: 64, align: 64, offset: 1792)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !942, file: !35, line: 1935, baseType: !1004, size: 64, align: 32, offset: 1856)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !942, file: !35, line: 1942, baseType: !915, size: 32, align: 32, offset: 1920)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !942, file: !35, line: 1948, baseType: !915, size: 32, align: 32, offset: 1952)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !942, file: !35, line: 1954, baseType: !915, size: 32, align: 32, offset: 1984)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !942, file: !35, line: 1960, baseType: !915, size: 32, align: 32, offset: 2016)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !942, file: !35, line: 1984, baseType: !915, size: 32, align: 32, offset: 2048)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !942, file: !35, line: 1991, baseType: !915, size: 32, align: 32, offset: 2080)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !942, file: !35, line: 1996, baseType: !915, size: 32, align: 32, offset: 2112)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !942, file: !35, line: 2004, baseType: !915, size: 32, align: 32, offset: 2144)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !942, file: !35, line: 2011, baseType: !915, size: 32, align: 32, offset: 2176)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !942, file: !35, line: 2018, baseType: !915, size: 32, align: 32, offset: 2208)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !942, file: !35, line: 2027, baseType: !915, size: 32, align: 32, offset: 2240)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !942, file: !35, line: 2034, baseType: !915, size: 32, align: 32, offset: 2272)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !942, file: !35, line: 2044, baseType: !915, size: 32, align: 32, offset: 2304)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !942, file: !35, line: 2054, baseType: !1456, size: 64, align: 64, offset: 2368)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !942, file: !35, line: 2061, baseType: !1456, size: 64, align: 64, offset: 2432)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !942, file: !35, line: 2066, baseType: !915, size: 32, align: 32, offset: 2496)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !942, file: !35, line: 2070, baseType: !915, size: 32, align: 32, offset: 2528)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !942, file: !35, line: 2078, baseType: !915, size: 32, align: 32, offset: 2560)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !942, file: !35, line: 2085, baseType: !915, size: 32, align: 32, offset: 2592)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !942, file: !35, line: 2092, baseType: !915, size: 32, align: 32, offset: 2624)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !942, file: !35, line: 2099, baseType: !915, size: 32, align: 32, offset: 2656)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !942, file: !35, line: 2106, baseType: !915, size: 32, align: 32, offset: 2688)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !942, file: !35, line: 2113, baseType: !915, size: 32, align: 32, offset: 2720)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !942, file: !35, line: 2120, baseType: !915, size: 32, align: 32, offset: 2752)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !942, file: !35, line: 2125, baseType: !915, size: 32, align: 32, offset: 2784)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !942, file: !35, line: 2133, baseType: !915, size: 32, align: 32, offset: 2816)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !942, file: !35, line: 2140, baseType: !915, size: 32, align: 32, offset: 2848)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !942, file: !35, line: 2145, baseType: !915, size: 32, align: 32, offset: 2880)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !942, file: !35, line: 2153, baseType: !915, size: 32, align: 32, offset: 2912)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !942, file: !35, line: 2158, baseType: !915, size: 32, align: 32, offset: 2944)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !942, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !942, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !942, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !942, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !942, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !942, file: !35, line: 2203, baseType: !915, size: 32, align: 32, offset: 3136)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !942, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !942, file: !35, line: 2212, baseType: !915, size: 32, align: 32, offset: 3200)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !942, file: !35, line: 2213, baseType: !915, size: 32, align: 32, offset: 3232)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !942, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !942, file: !35, line: 2232, baseType: !915, size: 32, align: 32, offset: 3296)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !942, file: !35, line: 2243, baseType: !915, size: 32, align: 32, offset: 3328)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !942, file: !35, line: 2249, baseType: !915, size: 32, align: 32, offset: 3360)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !942, file: !35, line: 2256, baseType: !915, size: 32, align: 32, offset: 3392)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !942, file: !35, line: 2263, baseType: !1022, size: 64, align: 64, offset: 3456)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !942, file: !35, line: 2270, baseType: !1022, size: 64, align: 64, offset: 3520)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !942, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !942, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !942, file: !35, line: 2367, baseType: !1492, size: 64, align: 64, offset: 3648)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!915, !1419, !1252, !915}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !942, file: !35, line: 2383, baseType: !915, size: 32, align: 32, offset: 3712)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !942, file: !35, line: 2386, baseType: !1426, size: 32, align: 32, offset: 3744)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !942, file: !35, line: 2387, baseType: !1426, size: 32, align: 32, offset: 3776)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !942, file: !35, line: 2394, baseType: !915, size: 32, align: 32, offset: 3808)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !942, file: !35, line: 2401, baseType: !915, size: 32, align: 32, offset: 3840)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !942, file: !35, line: 2408, baseType: !915, size: 32, align: 32, offset: 3872)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !942, file: !35, line: 2415, baseType: !915, size: 32, align: 32, offset: 3904)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !942, file: !35, line: 2422, baseType: !915, size: 32, align: 32, offset: 3936)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !942, file: !35, line: 2423, baseType: !1504, size: 64, align: 64, offset: 3968)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1506)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1506, file: !35, line: 827, baseType: !915, size: 32, align: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1506, file: !35, line: 828, baseType: !915, size: 32, align: 32, offset: 32)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1506, file: !35, line: 829, baseType: !915, size: 32, align: 32, offset: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1506, file: !35, line: 830, baseType: !1426, size: 32, align: 32, offset: 96)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !942, file: !35, line: 2430, baseType: !1112, size: 64, align: 64, offset: 4032)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !942, file: !35, line: 2437, baseType: !1112, size: 64, align: 64, offset: 4096)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !942, file: !35, line: 2444, baseType: !1426, size: 32, align: 32, offset: 4160)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !942, file: !35, line: 2451, baseType: !1426, size: 32, align: 32, offset: 4192)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !942, file: !35, line: 2458, baseType: !915, size: 32, align: 32, offset: 4224)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !942, file: !35, line: 2469, baseType: !915, size: 32, align: 32, offset: 4256)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !942, file: !35, line: 2475, baseType: !915, size: 32, align: 32, offset: 4288)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !942, file: !35, line: 2481, baseType: !915, size: 32, align: 32, offset: 4320)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !942, file: !35, line: 2485, baseType: !915, size: 32, align: 32, offset: 4352)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !942, file: !35, line: 2489, baseType: !915, size: 32, align: 32, offset: 4384)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !942, file: !35, line: 2493, baseType: !915, size: 32, align: 32, offset: 4416)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !942, file: !35, line: 2501, baseType: !915, size: 32, align: 32, offset: 4448)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !942, file: !35, line: 2506, baseType: !915, size: 32, align: 32, offset: 4480)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !942, file: !35, line: 2510, baseType: !915, size: 32, align: 32, offset: 4512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !942, file: !35, line: 2514, baseType: !1112, size: 64, align: 64, offset: 4544)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !942, file: !35, line: 2528, baseType: !1528, size: 64, align: 64, offset: 4608)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{null, !1419, !958, !915, !915}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !942, file: !35, line: 2534, baseType: !915, size: 32, align: 32, offset: 4672)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !942, file: !35, line: 2545, baseType: !915, size: 32, align: 32, offset: 4704)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !942, file: !35, line: 2547, baseType: !915, size: 32, align: 32, offset: 4736)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !942, file: !35, line: 2549, baseType: !915, size: 32, align: 32, offset: 4768)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !942, file: !35, line: 2551, baseType: !915, size: 32, align: 32, offset: 4800)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !942, file: !35, line: 2553, baseType: !915, size: 32, align: 32, offset: 4832)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !942, file: !35, line: 2555, baseType: !915, size: 32, align: 32, offset: 4864)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !942, file: !35, line: 2557, baseType: !915, size: 32, align: 32, offset: 4896)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !942, file: !35, line: 2559, baseType: !915, size: 32, align: 32, offset: 4928)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !942, file: !35, line: 2563, baseType: !915, size: 32, align: 32, offset: 4960)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !942, file: !35, line: 2571, baseType: !1108, size: 64, align: 64, offset: 4992)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !942, file: !35, line: 2579, baseType: !1108, size: 64, align: 64, offset: 5056)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !942, file: !35, line: 2586, baseType: !915, size: 32, align: 32, offset: 5120)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !942, file: !35, line: 2615, baseType: !915, size: 32, align: 32, offset: 5152)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !942, file: !35, line: 2627, baseType: !915, size: 32, align: 32, offset: 5184)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !942, file: !35, line: 2637, baseType: !915, size: 32, align: 32, offset: 5216)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !942, file: !35, line: 2681, baseType: !915, size: 32, align: 32, offset: 5248)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !942, file: !35, line: 2709, baseType: !1112, size: 64, align: 64, offset: 5312)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !942, file: !35, line: 2716, baseType: !1550, size: 64, align: 64, offset: 5376)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1552)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557, !1558, !1559, !1560, !1564, !1568, !1569, !1570, !1571, !1577, !1578, !1579, !1580, !1581}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1552, file: !35, line: 3642, baseType: !951, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1552, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1552, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1552, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1552, file: !35, line: 3669, baseType: !915, size: 32, align: 32, offset: 160)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1552, file: !35, line: 3682, baseType: !1249, size: 64, align: 64, offset: 192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1552, file: !35, line: 3698, baseType: !1561, size: 64, align: 64, offset: 256)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!915, !940, !1056, !923}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1552, file: !35, line: 3712, baseType: !1565, size: 64, align: 64, offset: 320)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!915, !940, !915, !1056, !923}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1552, file: !35, line: 3726, baseType: !1561, size: 64, align: 64, offset: 384)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1552, file: !35, line: 3737, baseType: !1039, size: 64, align: 64, offset: 448)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1552, file: !35, line: 3746, baseType: !915, size: 32, align: 32, offset: 512)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1552, file: !35, line: 3757, baseType: !1572, size: 64, align: 64, offset: 576)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{null, !1575}
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1552, file: !35, line: 3766, baseType: !1039, size: 64, align: 64, offset: 640)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1552, file: !35, line: 3774, baseType: !1039, size: 64, align: 64, offset: 704)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1552, file: !35, line: 3780, baseType: !915, size: 32, align: 32, offset: 768)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1552, file: !35, line: 3785, baseType: !915, size: 32, align: 32, offset: 800)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1552, file: !35, line: 3795, baseType: !1582, size: 64, align: 64, offset: 832)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!915, !940, !1123}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !942, file: !35, line: 2728, baseType: !958, size: 64, align: 64, offset: 5440)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !942, file: !35, line: 2735, baseType: !1176, size: 512, align: 64, offset: 5504)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !942, file: !35, line: 2742, baseType: !915, size: 32, align: 32, offset: 6016)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !942, file: !35, line: 2755, baseType: !915, size: 32, align: 32, offset: 6048)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !942, file: !35, line: 2776, baseType: !915, size: 32, align: 32, offset: 6080)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !942, file: !35, line: 2783, baseType: !915, size: 32, align: 32, offset: 6112)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !942, file: !35, line: 2791, baseType: !915, size: 32, align: 32, offset: 6144)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !942, file: !35, line: 2802, baseType: !1252, size: 64, align: 64, offset: 6208)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !942, file: !35, line: 2811, baseType: !915, size: 32, align: 32, offset: 6272)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !942, file: !35, line: 2821, baseType: !915, size: 32, align: 32, offset: 6304)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !942, file: !35, line: 2830, baseType: !915, size: 32, align: 32, offset: 6336)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !942, file: !35, line: 2840, baseType: !915, size: 32, align: 32, offset: 6368)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !942, file: !35, line: 2851, baseType: !1598, size: 64, align: 64, offset: 6400)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!915, !1419, !1601, !958, !1234, !915, !915}
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!915, !1419, !958}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !942, file: !35, line: 2871, baseType: !1605, size: 64, align: 64, offset: 6464)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!915, !1419, !1608, !958, !1234, !915}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!915, !1419, !958, !915, !915}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !942, file: !35, line: 2878, baseType: !915, size: 32, align: 32, offset: 6528)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !942, file: !35, line: 2885, baseType: !915, size: 32, align: 32, offset: 6560)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !942, file: !35, line: 3005, baseType: !915, size: 32, align: 32, offset: 6592)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !942, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !942, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !942, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !942, file: !35, line: 3037, baseType: !1068, size: 64, align: 64, offset: 6720)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !942, file: !35, line: 3038, baseType: !915, size: 32, align: 32, offset: 6784)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !942, file: !35, line: 3050, baseType: !1022, size: 64, align: 64, offset: 6848)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !942, file: !35, line: 3065, baseType: !915, size: 32, align: 32, offset: 6912)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !942, file: !35, line: 3083, baseType: !915, size: 32, align: 32, offset: 6944)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !942, file: !35, line: 3092, baseType: !1004, size: 64, align: 32, offset: 6976)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !942, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !942, file: !35, line: 3106, baseType: !1004, size: 64, align: 32, offset: 7072)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !942, file: !35, line: 3113, baseType: !1626, size: 64, align: 64, offset: 7168)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1628)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1630)
!1630 = !{!1631, !1632, !1633, !1634, !1635, !1636, !1639}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1629, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1629, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1629, file: !35, line: 720, baseType: !951, size: 64, align: 64, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1629, file: !35, line: 724, baseType: !951, size: 64, align: 64, offset: 128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1629, file: !35, line: 728, baseType: !915, size: 32, align: 32, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1629, file: !35, line: 734, baseType: !1637, size: 64, align: 64, offset: 256)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1629, file: !35, line: 739, baseType: !1640, size: 64, align: 64, offset: 320)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !942, file: !35, line: 3129, baseType: !1112, size: 64, align: 64, offset: 7232)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !942, file: !35, line: 3130, baseType: !1112, size: 64, align: 64, offset: 7296)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !942, file: !35, line: 3131, baseType: !1112, size: 64, align: 64, offset: 7360)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !942, file: !35, line: 3132, baseType: !1112, size: 64, align: 64, offset: 7424)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !942, file: !35, line: 3139, baseType: !1108, size: 64, align: 64, offset: 7488)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !942, file: !35, line: 3147, baseType: !915, size: 32, align: 32, offset: 7552)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !942, file: !35, line: 3165, baseType: !915, size: 32, align: 32, offset: 7584)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !942, file: !35, line: 3172, baseType: !915, size: 32, align: 32, offset: 7616)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !942, file: !35, line: 3180, baseType: !915, size: 32, align: 32, offset: 7648)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !942, file: !35, line: 3191, baseType: !1456, size: 64, align: 64, offset: 7680)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !942, file: !35, line: 3199, baseType: !1068, size: 64, align: 64, offset: 7744)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !942, file: !35, line: 3207, baseType: !1108, size: 64, align: 64, offset: 7808)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !942, file: !35, line: 3214, baseType: !916, size: 32, align: 32, offset: 7872)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !942, file: !35, line: 3224, baseType: !1141, size: 64, align: 64, offset: 7936)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !942, file: !35, line: 3225, baseType: !915, size: 32, align: 32, offset: 8000)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !942, file: !35, line: 3249, baseType: !1123, size: 64, align: 64, offset: 8064)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !942, file: !35, line: 3256, baseType: !915, size: 32, align: 32, offset: 8128)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !942, file: !35, line: 3271, baseType: !915, size: 32, align: 32, offset: 8160)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !942, file: !35, line: 3279, baseType: !1112, size: 64, align: 64, offset: 8192)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !942, file: !35, line: 3301, baseType: !1123, size: 64, align: 64, offset: 8256)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !942, file: !35, line: 3310, baseType: !915, size: 32, align: 32, offset: 8320)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !942, file: !35, line: 3337, baseType: !915, size: 32, align: 32, offset: 8352)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !942, file: !35, line: 3351, baseType: !915, size: 32, align: 32, offset: 8384)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !942, file: !35, line: 3359, baseType: !915, size: 32, align: 32, offset: 8416)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !937, file: !936, line: 73, baseType: !1667, size: 256, align: 64, offset: 64)
!1667 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1668, line: 70, baseType: !1669)
!1668 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1668, line: 61, size: 256, align: 64, elements: !1670)
!1670 = !{!1671, !1672, !1673, !1674, !1675}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1669, file: !1668, line: 62, baseType: !1056, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1669, file: !1668, line: 62, baseType: !1056, size: 64, align: 64, offset: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1669, file: !1668, line: 67, baseType: !915, size: 32, align: 32, offset: 128)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1669, file: !1668, line: 68, baseType: !915, size: 32, align: 32, offset: 160)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1669, file: !1668, line: 69, baseType: !915, size: 32, align: 32, offset: 192)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "exss_index", scope: !937, file: !936, line: 75, baseType: !915, size: 32, align: 32, offset: 320)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "exss_size_nbits", scope: !937, file: !936, line: 76, baseType: !915, size: 32, align: 32, offset: 352)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "exss_size", scope: !937, file: !936, line: 77, baseType: !915, size: 32, align: 32, offset: 384)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "static_fields_present", scope: !937, file: !936, line: 79, baseType: !915, size: 32, align: 32, offset: 416)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "npresents", scope: !937, file: !936, line: 80, baseType: !915, size: 32, align: 32, offset: 448)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "nassets", scope: !937, file: !936, line: 81, baseType: !915, size: 32, align: 32, offset: 480)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mix_metadata_enabled", scope: !937, file: !936, line: 83, baseType: !915, size: 32, align: 32, offset: 512)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "nmixoutconfigs", scope: !937, file: !936, line: 84, baseType: !915, size: 32, align: 32, offset: 544)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "nmixoutchs", scope: !937, file: !936, line: 85, baseType: !1105, size: 128, align: 32, offset: 576)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "assets", scope: !937, file: !936, line: 87, baseType: !1686, size: 960, align: 32, offset: 704)
!1686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1687, size: 960, align: 32, elements: !1720)
!1687 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCAExssAsset", file: !936, line: 69, baseType: !1688)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCAExssAsset", file: !936, line: 29, size: 960, align: 32, elements: !1689)
!1689 = !{!1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "asset_offset", scope: !1688, file: !936, line: 30, baseType: !915, size: 32, align: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "asset_size", scope: !1688, file: !936, line: 31, baseType: !915, size: 32, align: 32, offset: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "asset_index", scope: !1688, file: !936, line: 32, baseType: !915, size: 32, align: 32, offset: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_bit_res", scope: !1688, file: !936, line: 34, baseType: !915, size: 32, align: 32, offset: 96)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "max_sample_rate", scope: !1688, file: !936, line: 35, baseType: !915, size: 32, align: 32, offset: 128)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels_total", scope: !1688, file: !936, line: 36, baseType: !915, size: 32, align: 32, offset: 160)
