; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--faxcompr.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--faxcompr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }

!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TiffCompr", file: !888, line: 92, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/tiff.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!890 = !DIEnumerator(name: "TIFF_RAW", value: 1)
!891 = !DIEnumerator(name: "TIFF_CCITT_RLE", value: 2)
!892 = !DIEnumerator(name: "TIFF_G3", value: 3)
!893 = !DIEnumerator(name: "TIFF_G4", value: 4)
!894 = !DIEnumerator(name: "TIFF_LZW", value: 5)
!895 = !DIEnumerator(name: "TIFF_JPEG", value: 6)
!896 = !DIEnumerator(name: "TIFF_NEWJPEG", value: 7)
!897 = !DIEnumerator(name: "TIFF_ADOBE_DEFLATE", value: 8)
!898 = !DIEnumerator(name: "TIFF_PACKBITS", value: 32773)
!899 = !DIEnumerator(name: "TIFF_DEFLATE", value: 32946)
!900 = !DIEnumerator(name: "TIFF_LZMA", value: 34925)
!901 = !{!902, !903, !904, !912, !914, !915}
!902 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!903 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !907, line: 221, size: 32, align: 8, elements: !908)
!907 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !906, file: !907, line: 221, baseType: !910, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !911, line: 51, baseType: !903)
!911 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !911, line: 48, baseType: !913)
!913 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!916 = !{!917, !929, !933, !934, !938, !951, !952, !957, !958, !964, !968}
!917 = distinct !DIGlobalVariable(name: "code_table1", scope: !918, file: !919, line: 101, type: !923, isLocal: true, isDefinition: true, variable: [528 x [2 x i16]]* @ff_ccitt_unpack_init.code_table1)
!918 = distinct !DISubprogram(name: "ff_ccitt_unpack_init", scope: !919, file: !919, line: 99, type: !920, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !922)
!919 = !DIFile(filename: "libavcodec/faxcompr.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!920 = !DISubroutineType(types: !921)
!921 = !{null}
!922 = !{}
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 16896, align: 16, elements: !926)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !911, line: 37, baseType: !925)
!925 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!926 = !{!927, !928}
!927 = !DISubrange(count: 528)
!928 = !DISubrange(count: 2)
!929 = distinct !DIGlobalVariable(name: "code_table2", scope: !918, file: !919, line: 102, type: !930, isLocal: true, isDefinition: true, variable: [648 x [2 x i16]]* @ff_ccitt_unpack_init.code_table2)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 20736, align: 16, elements: !931)
!931 = !{!932, !928}
!932 = !DISubrange(count: 648)
!933 = distinct !DIGlobalVariable(name: "initialized", scope: !918, file: !919, line: 104, type: !902, isLocal: true, isDefinition: true, variable: i32* @ff_ccitt_unpack_init.initialized)
!934 = distinct !DIGlobalVariable(name: "table", scope: !918, file: !919, line: 119, type: !935, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ccitt_unpack_init.table)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 16384, align: 16, elements: !936)
!936 = !{!937, !928}
!937 = !DISubrange(count: 512)
!938 = distinct !DIGlobalVariable(name: "ccitt_vlc", scope: !0, file: !919, line: 97, type: !939, isLocal: true, isDefinition: true, variable: [2 x %struct.VLC]* @ccitt_vlc)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 384, align: 64, elements: !948)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !941, line: 30, baseType: !942)
!941 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !941, line: 26, size: 192, align: 64, elements: !943)
!943 = !{!944, !945, !949, !950}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !942, file: !941, line: 27, baseType: !902, size: 32, align: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !942, file: !941, line: 28, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 32, align: 16, elements: !948)
!948 = !{!928}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !942, file: !941, line: 29, baseType: !902, size: 32, align: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !942, file: !941, line: 29, baseType: !902, size: 32, align: 32, offset: 160)
!951 = distinct !DIGlobalVariable(name: "ccitt_group3_2d_vlc", scope: !0, file: !919, line: 97, type: !940, isLocal: true, isDefinition: true, variable: %struct.VLC* @ccitt_group3_2d_vlc)
!952 = distinct !DIGlobalVariable(name: "ccitt_codes_lens", scope: !0, file: !919, line: 69, type: !953, isLocal: true, isDefinition: true, variable: [2 x [104 x i8]]* @ccitt_codes_lens)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 1664, align: 8, elements: !955)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!955 = !{!928, !956}
!956 = !DISubrange(count: 104)
!957 = distinct !DIGlobalVariable(name: "ccitt_codes_bits", scope: !0, file: !919, line: 45, type: !953, isLocal: true, isDefinition: true, variable: [2 x [104 x i8]]* @ccitt_codes_bits)
!958 = distinct !DIGlobalVariable(name: "ccitt_syms", scope: !0, file: !919, line: 34, type: !959, isLocal: true, isDefinition: true, variable: [104 x i16]* @ccitt_syms)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 1664, align: 16, elements: !963)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !911, line: 49, baseType: !962)
!962 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!963 = !{!956}
!964 = distinct !DIGlobalVariable(name: "ccitt_group3_2d_lens", scope: !0, file: !919, line: 93, type: !965, isLocal: true, isDefinition: true, variable: [11 x i8]* @ccitt_group3_2d_lens)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 88, align: 8, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 11)
!968 = distinct !DIGlobalVariable(name: "ccitt_group3_2d_bits", scope: !0, file: !919, line: 89, type: !965, isLocal: true, isDefinition: true, variable: [11 x i8]* @ccitt_group3_2d_bits)
!969 = !{i32 2, !"Dwarf Version", i32 4}
!970 = !{i32 2, !"Debug Info Version", i32 3}
!971 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!972 = !DILocalVariable(name: "i", scope: !918, file: !919, line: 103, type: !902)
!973 = !DIExpression()
!974 = !DILocation(line: 103, column: 9, scope: !918)
!975 = !DILocation(line: 106, column: 9, scope: !976)
!976 = distinct !DILexicalBlock(scope: !918, file: !919, line: 106, column: 9)
!977 = !DILocation(line: 106, column: 9, scope: !918)
!978 = !DILocation(line: 107, column: 9, scope: !976)
!979 = !DILocation(line: 108, column: 24, scope: !918)
!980 = !DILocation(line: 109, column: 34, scope: !918)
!981 = !DILocation(line: 110, column: 24, scope: !918)
!982 = !DILocation(line: 111, column: 34, scope: !918)
!983 = !DILocation(line: 112, column: 12, scope: !984)
!984 = distinct !DILexicalBlock(scope: !918, file: !919, line: 112, column: 5)
!985 = !DILocation(line: 112, column: 10, scope: !984)
!986 = !DILocation(line: 112, column: 17, scope: !987)
!987 = !DILexicalBlockFile(scope: !988, file: !919, discriminator: 1)
!988 = distinct !DILexicalBlock(scope: !984, file: !919, line: 112, column: 5)
!989 = !DILocation(line: 112, column: 19, scope: !987)
!990 = !DILocation(line: 112, column: 5, scope: !987)
!991 = !DILocation(line: 113, column: 39, scope: !992)
!992 = distinct !DILexicalBlock(scope: !988, file: !919, line: 112, column: 29)
!993 = !DILocation(line: 113, column: 29, scope: !992)
!994 = !DILocation(line: 114, column: 45, scope: !992)
!995 = !DILocation(line: 114, column: 28, scope: !992)
!996 = !DILocation(line: 115, column: 45, scope: !992)
!997 = !DILocation(line: 115, column: 28, scope: !992)
!998 = !DILocation(line: 113, column: 9, scope: !992)
!999 = !DILocation(line: 118, column: 5, scope: !992)
!1000 = !DILocation(line: 112, column: 25, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !988, file: !919, discriminator: 2)
!1002 = !DILocation(line: 112, column: 5, scope: !1001)
!1003 = distinct !{!1003, !1004}
!1004 = !DILocation(line: 112, column: 5, scope: !918)
!1005 = !DILocation(line: 119, column: 5, scope: !918)
!1006 = distinct !{!1006, !1005}
!1007 = !DILocation(line: 119, column: 70, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !1009, file: !919, discriminator: 1)
!1009 = distinct !DILexicalBlock(scope: !918, file: !919, line: 119, column: 8)
!1010 = !DILocation(line: 119, column: 119, scope: !1008)
!1011 = !DILocation(line: 119, column: 126, scope: !1008)
!1012 = !DILocation(line: 119, column: 16, scope: !1008)
!1013 = !DILocation(line: 122, column: 17, scope: !918)
!1014 = !DILocation(line: 123, column: 1, scope: !918)
!1015 = !DILocation(line: 123, column: 1, scope: !1016)
!1016 = !DILexicalBlockFile(scope: !918, file: !919, discriminator: 1)
!1017 = distinct !DISubprogram(name: "ff_ccitt_unpack", scope: !919, file: !919, line: 381, type: !1018, isLocal: false, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !922)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!902, !1020, !1508, !902, !1141, !902, !902, !887, !902}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1023)
!1023 = !{!1024, !1068, !1069, !1070, !1335, !1336, !1337, !1338, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1364, !1368, !1369, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1549, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1022, file: !35, line: 1561, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1029)
!1029 = !{!1030, !1034, !1038, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1028, file: !4, line: 72, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1028, file: !4, line: 78, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!1031, !915}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1028, file: !4, line: 85, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1028, file: !4, line: 93, baseType: !902, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1028, file: !4, line: 99, baseType: !902, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1028, file: !4, line: 108, baseType: !902, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1028, file: !4, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!915, !915, !915}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1028, file: !4, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1028, file: !4, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1028, file: !4, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !915}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1028, file: !4, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!902, !1065, !915, !1031, !902}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1022, file: !35, line: 1562, baseType: !902, size: 32, align: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1022, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1022, file: !35, line: 1565, baseType: !1071, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1089, !1092, !1095, !1098, !1103, !1104, !1105, !1113, !1114, !1115, !1117, !1121, !1127, !1132, !1136, !1137, !1185, !1306, !1310, !1311, !1315, !1319, !1324, !1328, !1329, !1330}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !35, line: 3475, baseType: !1031, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1073, file: !35, line: 3480, baseType: !1031, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1073, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1073, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1073, file: !35, line: 3487, baseType: !902, size: 32, align: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1073, file: !35, line: 3488, baseType: !1081, size: 64, align: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1084, line: 61, baseType: !1085)
!1084 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1084, line: 58, size: 64, align: 32, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1085, file: !1084, line: 59, baseType: !902, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1085, file: !1084, line: 60, baseType: !902, size: 32, align: 32, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1073, file: !35, line: 3489, baseType: !1090, size: 64, align: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1073, file: !35, line: 3490, baseType: !1093, size: 64, align: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1073, file: !35, line: 3491, baseType: !1096, size: 64, align: 64, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1073, file: !35, line: 3492, baseType: !1099, size: 64, align: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !911, line: 55, baseType: !1102)
!1102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1073, file: !35, line: 3493, baseType: !912, size: 8, align: 8, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1073, file: !35, line: 3494, baseType: !1025, size: 64, align: 64, offset: 640)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1073, file: !35, line: 3495, baseType: !1106, size: 64, align: 64, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1109, file: !35, line: 3402, baseType: !902, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1109, file: !35, line: 3403, baseType: !1031, size: 64, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1073, file: !35, line: 3507, baseType: !1031, size: 64, align: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1073, file: !35, line: 3516, baseType: !902, size: 32, align: 32, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !35, line: 3517, baseType: !1116, size: 64, align: 64, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1073, file: !35, line: 3527, baseType: !1118, size: 64, align: 64, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!902, !1020}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1073, file: !35, line: 3535, baseType: !1122, size: 64, align: 64, offset: 1024)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!902, !1020, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1073, file: !35, line: 3541, baseType: !1128, size: 64, align: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1131)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1073, file: !35, line: 3549, baseType: !1133, size: 64, align: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !1116}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1073, file: !35, line: 3551, baseType: !1118, size: 64, align: 64, offset: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1073, file: !35, line: 3552, baseType: !1138, size: 64, align: 64, offset: 1280)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!902, !1020, !1141, !902, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1182}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1144, file: !35, line: 3921, baseType: !961, size: 16, align: 16)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1144, file: !35, line: 3922, baseType: !910, size: 32, align: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1144, file: !35, line: 3923, baseType: !910, size: 32, align: 32, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1144, file: !35, line: 3924, baseType: !903, size: 32, align: 32, offset: 96)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1144, file: !35, line: 3925, baseType: !1151, size: 64, align: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1161, !1171, !1175, !1177, !1178, !1180, !1181}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1154, file: !35, line: 3886, baseType: !902, size: 32, align: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1154, file: !35, line: 3887, baseType: !902, size: 32, align: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1154, file: !35, line: 3888, baseType: !902, size: 32, align: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1154, file: !35, line: 3889, baseType: !902, size: 32, align: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1154, file: !35, line: 3890, baseType: !902, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1154, file: !35, line: 3897, baseType: !1162, size: 768, align: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1164)
!1164 = !{!1165, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !35, line: 3855, baseType: !1166, size: 512, align: 64)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 512, align: 64, elements: !1167)
!1167 = !{!1168}
!1168 = !DISubrange(count: 8)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1163, file: !35, line: 3857, baseType: !1170, size: 256, align: 32, offset: 512)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 256, align: 32, elements: !1167)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !35, line: 3903, baseType: !1172, size: 256, align: 64, offset: 960)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 256, align: 64, elements: !1173)
!1173 = !{!1174}
!1174 = !DISubrange(count: 4)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1154, file: !35, line: 3904, baseType: !1176, size: 128, align: 32, offset: 1216)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, align: 32, elements: !1173)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1154, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1154, file: !35, line: 3908, baseType: !1179, size: 64, align: 64, offset: 1408)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1154, file: !35, line: 3915, baseType: !1179, size: 64, align: 64, offset: 1472)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !35, line: 3917, baseType: !902, size: 32, align: 32, offset: 1536)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1144, file: !35, line: 3926, baseType: !1183, size: 64, align: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !911, line: 40, baseType: !1184)
!1184 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1073, file: !35, line: 3564, baseType: !1186, size: 64, align: 64, offset: 1344)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!902, !1020, !1189, !1223, !1305}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1192)
!1192 = !{!1193, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1219, !1220, !1221, !1222}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !35, line: 1451, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1196, line: 94, baseType: !1197)
!1196 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1196, line: 81, size: 192, align: 64, elements: !1198)
!1198 = !{!1199, !1203, !1204}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1197, file: !1196, line: 82, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1196, line: 73, baseType: !1202)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1196, line: 73, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !1196, line: 89, baseType: !1141, size: 64, align: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !1196, line: 93, baseType: !902, size: 32, align: 32, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1191, file: !35, line: 1461, baseType: !1183, size: 64, align: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1191, file: !35, line: 1467, baseType: !1183, size: 64, align: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !35, line: 1468, baseType: !1141, size: 64, align: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !35, line: 1469, baseType: !902, size: 32, align: 32, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1191, file: !35, line: 1470, baseType: !902, size: 32, align: 32, offset: 288)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !35, line: 1474, baseType: !902, size: 32, align: 32, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1191, file: !35, line: 1479, baseType: !1212, size: 64, align: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !35, line: 1412, baseType: !1141, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1214, file: !35, line: 1413, baseType: !902, size: 32, align: 32, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1214, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1191, file: !35, line: 1480, baseType: !902, size: 32, align: 32, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1191, file: !35, line: 1486, baseType: !1183, size: 64, align: 64, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1191, file: !35, line: 1488, baseType: !1183, size: 64, align: 64, offset: 576)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1191, file: !35, line: 1497, baseType: !1183, size: 64, align: 64, offset: 640)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1257, !1259, !1260, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1295, !1296, !1297, !1298, !1301, !1302, !1303, !1304}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1226, file: !758, line: 282, baseType: !1166, size: 512, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1226, file: !758, line: 299, baseType: !1170, size: 256, align: 32, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1226, file: !758, line: 315, baseType: !1231, size: 64, align: 64, offset: 768)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1226, file: !758, line: 326, baseType: !902, size: 32, align: 32, offset: 832)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1226, file: !758, line: 326, baseType: !902, size: 32, align: 32, offset: 864)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1226, file: !758, line: 334, baseType: !902, size: 32, align: 32, offset: 896)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1226, file: !758, line: 341, baseType: !902, size: 32, align: 32, offset: 928)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1226, file: !758, line: 346, baseType: !902, size: 32, align: 32, offset: 960)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1226, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1226, file: !758, line: 356, baseType: !1083, size: 64, align: 32, offset: 1024)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1226, file: !758, line: 361, baseType: !1183, size: 64, align: 64, offset: 1088)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1226, file: !758, line: 369, baseType: !1183, size: 64, align: 64, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1226, file: !758, line: 377, baseType: !1183, size: 64, align: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1226, file: !758, line: 382, baseType: !902, size: 32, align: 32, offset: 1280)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1226, file: !758, line: 386, baseType: !902, size: 32, align: 32, offset: 1312)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1226, file: !758, line: 391, baseType: !902, size: 32, align: 32, offset: 1344)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1226, file: !758, line: 396, baseType: !915, size: 64, align: 64, offset: 1408)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1226, file: !758, line: 403, baseType: !1247, size: 512, align: 64, offset: 1472)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 512, align: 64, elements: !1167)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1226, file: !758, line: 410, baseType: !902, size: 32, align: 32, offset: 1984)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1226, file: !758, line: 415, baseType: !902, size: 32, align: 32, offset: 2016)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1226, file: !758, line: 420, baseType: !902, size: 32, align: 32, offset: 2048)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1226, file: !758, line: 425, baseType: !902, size: 32, align: 32, offset: 2080)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1226, file: !758, line: 435, baseType: !1183, size: 64, align: 64, offset: 2112)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1226, file: !758, line: 440, baseType: !902, size: 32, align: 32, offset: 2176)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1226, file: !758, line: 445, baseType: !1101, size: 64, align: 64, offset: 2240)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1226, file: !758, line: 459, baseType: !1256, size: 512, align: 64, offset: 2304)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 512, align: 64, elements: !1167)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1226, file: !758, line: 473, baseType: !1258, size: 64, align: 64, offset: 2816)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1226, file: !758, line: 477, baseType: !902, size: 32, align: 32, offset: 2880)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1226, file: !758, line: 479, baseType: !1261, size: 64, align: 64, offset: 2944)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1274}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1264, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1264, file: !758, line: 203, baseType: !1141, size: 64, align: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1264, file: !758, line: 204, baseType: !902, size: 32, align: 32, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1264, file: !758, line: 205, baseType: !1270, size: 64, align: 64, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1272, line: 86, baseType: !1273)
!1272 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1273 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1272, line: 86, flags: DIFlagFwdDecl)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1264, file: !758, line: 206, baseType: !1194, size: 64, align: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1226, file: !758, line: 480, baseType: !902, size: 32, align: 32, offset: 3008)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1226, file: !758, line: 505, baseType: !902, size: 32, align: 32, offset: 3040)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1226, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1226, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1226, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1226, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1226, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1226, file: !758, line: 532, baseType: !1183, size: 64, align: 64, offset: 3264)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1226, file: !758, line: 539, baseType: !1183, size: 64, align: 64, offset: 3328)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1226, file: !758, line: 547, baseType: !1183, size: 64, align: 64, offset: 3392)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1226, file: !758, line: 554, baseType: !1270, size: 64, align: 64, offset: 3456)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1226, file: !758, line: 563, baseType: !902, size: 32, align: 32, offset: 3520)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1226, file: !758, line: 572, baseType: !902, size: 32, align: 32, offset: 3552)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1226, file: !758, line: 581, baseType: !902, size: 32, align: 32, offset: 3584)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1226, file: !758, line: 588, baseType: !1290, size: 64, align: 64, offset: 3648)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !911, line: 36, baseType: !1292)
!1292 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1226, file: !758, line: 593, baseType: !902, size: 32, align: 32, offset: 3712)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1226, file: !758, line: 596, baseType: !902, size: 32, align: 32, offset: 3744)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1226, file: !758, line: 599, baseType: !1194, size: 64, align: 64, offset: 3776)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1226, file: !758, line: 605, baseType: !1194, size: 64, align: 64, offset: 3840)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1226, file: !758, line: 616, baseType: !1194, size: 64, align: 64, offset: 3904)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1226, file: !758, line: 626, baseType: !1299, size: 64, align: 64, offset: 3968)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1300, line: 216, baseType: !1102)
!1300 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1226, file: !758, line: 627, baseType: !1299, size: 64, align: 64, offset: 4032)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1226, file: !758, line: 628, baseType: !1299, size: 64, align: 64, offset: 4096)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1226, file: !758, line: 629, baseType: !1299, size: 64, align: 64, offset: 4160)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1226, file: !758, line: 645, baseType: !1194, size: 64, align: 64, offset: 4224)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1073, file: !35, line: 3566, baseType: !1307, size: 64, align: 64, offset: 1408)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!902, !1020, !915, !1305, !1189}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1073, file: !35, line: 3567, baseType: !1118, size: 64, align: 64, offset: 1472)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1073, file: !35, line: 3576, baseType: !1312, size: 64, align: 64, offset: 1536)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!902, !1020, !1223}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1073, file: !35, line: 3577, baseType: !1316, size: 64, align: 64, offset: 1600)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!902, !1020, !1189}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1073, file: !35, line: 3584, baseType: !1320, size: 64, align: 64, offset: 1664)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!902, !1020, !1323}
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1073, file: !35, line: 3589, baseType: !1325, size: 64, align: 64, offset: 1728)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{null, !1020}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1073, file: !35, line: 3594, baseType: !902, size: 32, align: 32, offset: 1792)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1073, file: !35, line: 3600, baseType: !1031, size: 64, align: 64, offset: 1856)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1073, file: !35, line: 3609, baseType: !1331, size: 64, align: 64, offset: 1920)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1334)
!1334 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1022, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1022, file: !35, line: 1581, baseType: !903, size: 32, align: 32, offset: 224)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1022, file: !35, line: 1583, baseType: !915, size: 64, align: 64, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1022, file: !35, line: 1591, baseType: !1339, size: 64, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1022, file: !35, line: 1598, baseType: !915, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1022, file: !35, line: 1606, baseType: !1183, size: 64, align: 64, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1022, file: !35, line: 1614, baseType: !902, size: 32, align: 32, offset: 512)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1022, file: !35, line: 1622, baseType: !902, size: 32, align: 32, offset: 544)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1022, file: !35, line: 1628, baseType: !902, size: 32, align: 32, offset: 576)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1022, file: !35, line: 1636, baseType: !902, size: 32, align: 32, offset: 608)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1022, file: !35, line: 1643, baseType: !902, size: 32, align: 32, offset: 640)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1022, file: !35, line: 1657, baseType: !1141, size: 64, align: 64, offset: 704)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1022, file: !35, line: 1658, baseType: !902, size: 32, align: 32, offset: 768)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1022, file: !35, line: 1679, baseType: !1083, size: 64, align: 32, offset: 800)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1022, file: !35, line: 1688, baseType: !902, size: 32, align: 32, offset: 864)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1022, file: !35, line: 1712, baseType: !902, size: 32, align: 32, offset: 896)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1022, file: !35, line: 1729, baseType: !902, size: 32, align: 32, offset: 928)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1022, file: !35, line: 1729, baseType: !902, size: 32, align: 32, offset: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1022, file: !35, line: 1744, baseType: !902, size: 32, align: 32, offset: 992)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1022, file: !35, line: 1744, baseType: !902, size: 32, align: 32, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1022, file: !35, line: 1751, baseType: !902, size: 32, align: 32, offset: 1056)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1022, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1022, file: !35, line: 1791, baseType: !1360, size: 64, align: 64, offset: 1152)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{null, !1363, !1223, !1305, !902, !902, !902}
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1022, file: !35, line: 1808, baseType: !1365, size: 64, align: 64, offset: 1216)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!494, !1363, !1090}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1022, file: !35, line: 1816, baseType: !902, size: 32, align: 32, offset: 1280)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1022, file: !35, line: 1825, baseType: !1370, size: 32, align: 32, offset: 1312)
!1370 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1022, file: !35, line: 1830, baseType: !902, size: 32, align: 32, offset: 1344)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1022, file: !35, line: 1838, baseType: !1370, size: 32, align: 32, offset: 1376)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1022, file: !35, line: 1846, baseType: !902, size: 32, align: 32, offset: 1408)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1022, file: !35, line: 1851, baseType: !902, size: 32, align: 32, offset: 1440)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1022, file: !35, line: 1861, baseType: !1370, size: 32, align: 32, offset: 1472)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1022, file: !35, line: 1868, baseType: !1370, size: 32, align: 32, offset: 1504)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1022, file: !35, line: 1875, baseType: !1370, size: 32, align: 32, offset: 1536)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1022, file: !35, line: 1882, baseType: !1370, size: 32, align: 32, offset: 1568)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1022, file: !35, line: 1889, baseType: !1370, size: 32, align: 32, offset: 1600)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1022, file: !35, line: 1896, baseType: !1370, size: 32, align: 32, offset: 1632)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1022, file: !35, line: 1903, baseType: !1370, size: 32, align: 32, offset: 1664)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1022, file: !35, line: 1910, baseType: !902, size: 32, align: 32, offset: 1696)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1022, file: !35, line: 1915, baseType: !902, size: 32, align: 32, offset: 1728)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1022, file: !35, line: 1926, baseType: !1305, size: 64, align: 64, offset: 1792)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1022, file: !35, line: 1935, baseType: !1083, size: 64, align: 32, offset: 1856)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1022, file: !35, line: 1942, baseType: !902, size: 32, align: 32, offset: 1920)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1022, file: !35, line: 1948, baseType: !902, size: 32, align: 32, offset: 1952)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1022, file: !35, line: 1954, baseType: !902, size: 32, align: 32, offset: 1984)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1022, file: !35, line: 1960, baseType: !902, size: 32, align: 32, offset: 2016)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1022, file: !35, line: 1984, baseType: !902, size: 32, align: 32, offset: 2048)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1022, file: !35, line: 1991, baseType: !902, size: 32, align: 32, offset: 2080)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1022, file: !35, line: 1996, baseType: !902, size: 32, align: 32, offset: 2112)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1022, file: !35, line: 2004, baseType: !902, size: 32, align: 32, offset: 2144)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1022, file: !35, line: 2011, baseType: !902, size: 32, align: 32, offset: 2176)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1022, file: !35, line: 2018, baseType: !902, size: 32, align: 32, offset: 2208)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1022, file: !35, line: 2027, baseType: !902, size: 32, align: 32, offset: 2240)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1022, file: !35, line: 2034, baseType: !902, size: 32, align: 32, offset: 2272)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1022, file: !35, line: 2044, baseType: !902, size: 32, align: 32, offset: 2304)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1022, file: !35, line: 2054, baseType: !1400, size: 64, align: 64, offset: 2368)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1022, file: !35, line: 2061, baseType: !1400, size: 64, align: 64, offset: 2432)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1022, file: !35, line: 2066, baseType: !902, size: 32, align: 32, offset: 2496)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1022, file: !35, line: 2070, baseType: !902, size: 32, align: 32, offset: 2528)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1022, file: !35, line: 2078, baseType: !902, size: 32, align: 32, offset: 2560)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1022, file: !35, line: 2085, baseType: !902, size: 32, align: 32, offset: 2592)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1022, file: !35, line: 2092, baseType: !902, size: 32, align: 32, offset: 2624)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1022, file: !35, line: 2099, baseType: !902, size: 32, align: 32, offset: 2656)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1022, file: !35, line: 2106, baseType: !902, size: 32, align: 32, offset: 2688)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1022, file: !35, line: 2113, baseType: !902, size: 32, align: 32, offset: 2720)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1022, file: !35, line: 2120, baseType: !902, size: 32, align: 32, offset: 2752)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1022, file: !35, line: 2125, baseType: !902, size: 32, align: 32, offset: 2784)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1022, file: !35, line: 2133, baseType: !902, size: 32, align: 32, offset: 2816)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1022, file: !35, line: 2140, baseType: !902, size: 32, align: 32, offset: 2848)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1022, file: !35, line: 2145, baseType: !902, size: 32, align: 32, offset: 2880)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1022, file: !35, line: 2153, baseType: !902, size: 32, align: 32, offset: 2912)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1022, file: !35, line: 2158, baseType: !902, size: 32, align: 32, offset: 2944)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1022, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1022, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1022, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1022, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1022, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1022, file: !35, line: 2203, baseType: !902, size: 32, align: 32, offset: 3136)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1022, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1022, file: !35, line: 2212, baseType: !902, size: 32, align: 32, offset: 3200)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1022, file: !35, line: 2213, baseType: !902, size: 32, align: 32, offset: 3232)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1022, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1022, file: !35, line: 2232, baseType: !902, size: 32, align: 32, offset: 3296)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1022, file: !35, line: 2243, baseType: !902, size: 32, align: 32, offset: 3328)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1022, file: !35, line: 2249, baseType: !902, size: 32, align: 32, offset: 3360)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1022, file: !35, line: 2256, baseType: !902, size: 32, align: 32, offset: 3392)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1022, file: !35, line: 2263, baseType: !1101, size: 64, align: 64, offset: 3456)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1022, file: !35, line: 2270, baseType: !1101, size: 64, align: 64, offset: 3520)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1022, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1022, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1022, file: !35, line: 2367, baseType: !1436, size: 64, align: 64, offset: 3648)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!902, !1363, !1323, !902}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1022, file: !35, line: 2383, baseType: !902, size: 32, align: 32, offset: 3712)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1022, file: !35, line: 2386, baseType: !1370, size: 32, align: 32, offset: 3744)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1022, file: !35, line: 2387, baseType: !1370, size: 32, align: 32, offset: 3776)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1022, file: !35, line: 2394, baseType: !902, size: 32, align: 32, offset: 3808)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1022, file: !35, line: 2401, baseType: !902, size: 32, align: 32, offset: 3840)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1022, file: !35, line: 2408, baseType: !902, size: 32, align: 32, offset: 3872)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1022, file: !35, line: 2415, baseType: !902, size: 32, align: 32, offset: 3904)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1022, file: !35, line: 2422, baseType: !902, size: 32, align: 32, offset: 3936)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1022, file: !35, line: 2423, baseType: !1448, size: 64, align: 64, offset: 3968)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1450, file: !35, line: 827, baseType: !902, size: 32, align: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1450, file: !35, line: 828, baseType: !902, size: 32, align: 32, offset: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1450, file: !35, line: 829, baseType: !902, size: 32, align: 32, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1450, file: !35, line: 830, baseType: !1370, size: 32, align: 32, offset: 96)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1022, file: !35, line: 2430, baseType: !1183, size: 64, align: 64, offset: 4032)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1022, file: !35, line: 2437, baseType: !1183, size: 64, align: 64, offset: 4096)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1022, file: !35, line: 2444, baseType: !1370, size: 32, align: 32, offset: 4160)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1022, file: !35, line: 2451, baseType: !1370, size: 32, align: 32, offset: 4192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1022, file: !35, line: 2458, baseType: !902, size: 32, align: 32, offset: 4224)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1022, file: !35, line: 2469, baseType: !902, size: 32, align: 32, offset: 4256)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1022, file: !35, line: 2475, baseType: !902, size: 32, align: 32, offset: 4288)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1022, file: !35, line: 2481, baseType: !902, size: 32, align: 32, offset: 4320)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1022, file: !35, line: 2485, baseType: !902, size: 32, align: 32, offset: 4352)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1022, file: !35, line: 2489, baseType: !902, size: 32, align: 32, offset: 4384)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1022, file: !35, line: 2493, baseType: !902, size: 32, align: 32, offset: 4416)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1022, file: !35, line: 2501, baseType: !902, size: 32, align: 32, offset: 4448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1022, file: !35, line: 2506, baseType: !902, size: 32, align: 32, offset: 4480)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1022, file: !35, line: 2510, baseType: !902, size: 32, align: 32, offset: 4512)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1022, file: !35, line: 2514, baseType: !1183, size: 64, align: 64, offset: 4544)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1022, file: !35, line: 2528, baseType: !1472, size: 64, align: 64, offset: 4608)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{null, !1363, !915, !902, !902}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1022, file: !35, line: 2534, baseType: !902, size: 32, align: 32, offset: 4672)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1022, file: !35, line: 2545, baseType: !902, size: 32, align: 32, offset: 4704)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1022, file: !35, line: 2547, baseType: !902, size: 32, align: 32, offset: 4736)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1022, file: !35, line: 2549, baseType: !902, size: 32, align: 32, offset: 4768)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1022, file: !35, line: 2551, baseType: !902, size: 32, align: 32, offset: 4800)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1022, file: !35, line: 2553, baseType: !902, size: 32, align: 32, offset: 4832)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1022, file: !35, line: 2555, baseType: !902, size: 32, align: 32, offset: 4864)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1022, file: !35, line: 2557, baseType: !902, size: 32, align: 32, offset: 4896)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1022, file: !35, line: 2559, baseType: !902, size: 32, align: 32, offset: 4928)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1022, file: !35, line: 2563, baseType: !902, size: 32, align: 32, offset: 4960)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1022, file: !35, line: 2571, baseType: !1179, size: 64, align: 64, offset: 4992)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1022, file: !35, line: 2579, baseType: !1179, size: 64, align: 64, offset: 5056)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1022, file: !35, line: 2586, baseType: !902, size: 32, align: 32, offset: 5120)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1022, file: !35, line: 2615, baseType: !902, size: 32, align: 32, offset: 5152)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1022, file: !35, line: 2627, baseType: !902, size: 32, align: 32, offset: 5184)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1022, file: !35, line: 2637, baseType: !902, size: 32, align: 32, offset: 5216)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1022, file: !35, line: 2681, baseType: !902, size: 32, align: 32, offset: 5248)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1022, file: !35, line: 2709, baseType: !1183, size: 64, align: 64, offset: 5312)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1022, file: !35, line: 2716, baseType: !1494, size: 64, align: 64, offset: 5376)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1497)
!1497 = !{!1498, !1499, !1500, !1501, !1502, !1503, !1504, !1509, !1513, !1514, !1515, !1516, !1522, !1523, !1524, !1525, !1526}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1496, file: !35, line: 3642, baseType: !1031, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1496, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1496, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1496, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1496, file: !35, line: 3669, baseType: !902, size: 32, align: 32, offset: 160)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1496, file: !35, line: 3682, baseType: !1320, size: 64, align: 64, offset: 192)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1496, file: !35, line: 3698, baseType: !1505, size: 64, align: 64, offset: 256)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!902, !1020, !1508, !910}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1496, file: !35, line: 3712, baseType: !1510, size: 64, align: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!902, !1020, !902, !1508, !910}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1496, file: !35, line: 3726, baseType: !1505, size: 64, align: 64, offset: 384)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1496, file: !35, line: 3737, baseType: !1118, size: 64, align: 64, offset: 448)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1496, file: !35, line: 3746, baseType: !902, size: 32, align: 32, offset: 512)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1496, file: !35, line: 3757, baseType: !1517, size: 64, align: 64, offset: 576)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{null, !1520}
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1496, file: !35, line: 3766, baseType: !1118, size: 64, align: 64, offset: 640)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1496, file: !35, line: 3774, baseType: !1118, size: 64, align: 64, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1496, file: !35, line: 3780, baseType: !902, size: 32, align: 32, offset: 768)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1496, file: !35, line: 3785, baseType: !902, size: 32, align: 32, offset: 800)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1496, file: !35, line: 3795, baseType: !1527, size: 64, align: 64, offset: 832)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!902, !1020, !1194}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1022, file: !35, line: 2728, baseType: !915, size: 64, align: 64, offset: 5440)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1022, file: !35, line: 2735, baseType: !1247, size: 512, align: 64, offset: 5504)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1022, file: !35, line: 2742, baseType: !902, size: 32, align: 32, offset: 6016)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1022, file: !35, line: 2755, baseType: !902, size: 32, align: 32, offset: 6048)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1022, file: !35, line: 2776, baseType: !902, size: 32, align: 32, offset: 6080)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1022, file: !35, line: 2783, baseType: !902, size: 32, align: 32, offset: 6112)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1022, file: !35, line: 2791, baseType: !902, size: 32, align: 32, offset: 6144)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1022, file: !35, line: 2802, baseType: !1323, size: 64, align: 64, offset: 6208)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1022, file: !35, line: 2811, baseType: !902, size: 32, align: 32, offset: 6272)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1022, file: !35, line: 2821, baseType: !902, size: 32, align: 32, offset: 6304)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1022, file: !35, line: 2830, baseType: !902, size: 32, align: 32, offset: 6336)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1022, file: !35, line: 2840, baseType: !902, size: 32, align: 32, offset: 6368)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1022, file: !35, line: 2851, baseType: !1543, size: 64, align: 64, offset: 6400)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!902, !1363, !1546, !915, !1305, !902, !902}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!902, !1363, !915}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1022, file: !35, line: 2871, baseType: !1550, size: 64, align: 64, offset: 6464)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!902, !1363, !1553, !915, !1305, !902}
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!902, !1363, !915, !902, !902}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1022, file: !35, line: 2878, baseType: !902, size: 32, align: 32, offset: 6528)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1022, file: !35, line: 2885, baseType: !902, size: 32, align: 32, offset: 6560)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1022, file: !35, line: 3005, baseType: !902, size: 32, align: 32, offset: 6592)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1022, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1022, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1022, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1022, file: !35, line: 3037, baseType: !1141, size: 64, align: 64, offset: 6720)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1022, file: !35, line: 3038, baseType: !902, size: 32, align: 32, offset: 6784)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1022, file: !35, line: 3050, baseType: !1101, size: 64, align: 64, offset: 6848)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1022, file: !35, line: 3065, baseType: !902, size: 32, align: 32, offset: 6912)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1022, file: !35, line: 3083, baseType: !902, size: 32, align: 32, offset: 6944)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1022, file: !35, line: 3092, baseType: !1083, size: 64, align: 32, offset: 6976)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1022, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1022, file: !35, line: 3106, baseType: !1083, size: 64, align: 32, offset: 7072)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1022, file: !35, line: 3113, baseType: !1571, size: 64, align: 64, offset: 7168)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1573)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579, !1580, !1581, !1584}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1574, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1574, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1574, file: !35, line: 720, baseType: !1031, size: 64, align: 64, offset: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1574, file: !35, line: 724, baseType: !1031, size: 64, align: 64, offset: 128)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1574, file: !35, line: 728, baseType: !902, size: 32, align: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1574, file: !35, line: 734, baseType: !1582, size: 64, align: 64, offset: 256)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1574, file: !35, line: 739, baseType: !1585, size: 64, align: 64, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1022, file: !35, line: 3129, baseType: !1183, size: 64, align: 64, offset: 7232)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1022, file: !35, line: 3130, baseType: !1183, size: 64, align: 64, offset: 7296)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1022, file: !35, line: 3131, baseType: !1183, size: 64, align: 64, offset: 7360)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1022, file: !35, line: 3132, baseType: !1183, size: 64, align: 64, offset: 7424)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1022, file: !35, line: 3139, baseType: !1179, size: 64, align: 64, offset: 7488)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1022, file: !35, line: 3147, baseType: !902, size: 32, align: 32, offset: 7552)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1022, file: !35, line: 3165, baseType: !902, size: 32, align: 32, offset: 7584)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1022, file: !35, line: 3172, baseType: !902, size: 32, align: 32, offset: 7616)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1022, file: !35, line: 3180, baseType: !902, size: 32, align: 32, offset: 7648)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1022, file: !35, line: 3191, baseType: !1400, size: 64, align: 64, offset: 7680)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1022, file: !35, line: 3199, baseType: !1141, size: 64, align: 64, offset: 7744)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1022, file: !35, line: 3207, baseType: !1179, size: 64, align: 64, offset: 7808)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1022, file: !35, line: 3214, baseType: !903, size: 32, align: 32, offset: 7872)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1022, file: !35, line: 3224, baseType: !1212, size: 64, align: 64, offset: 7936)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1022, file: !35, line: 3225, baseType: !902, size: 32, align: 32, offset: 8000)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1022, file: !35, line: 3249, baseType: !1194, size: 64, align: 64, offset: 8064)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1022, file: !35, line: 3256, baseType: !902, size: 32, align: 32, offset: 8128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1022, file: !35, line: 3271, baseType: !902, size: 32, align: 32, offset: 8160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1022, file: !35, line: 3279, baseType: !1183, size: 64, align: 64, offset: 8192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1022, file: !35, line: 3301, baseType: !1194, size: 64, align: 64, offset: 8256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1022, file: !35, line: 3310, baseType: !902, size: 32, align: 32, offset: 8320)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1022, file: !35, line: 3337, baseType: !902, size: 32, align: 32, offset: 8352)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1022, file: !35, line: 3351, baseType: !902, size: 32, align: 32, offset: 8384)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1022, file: !35, line: 3359, baseType: !902, size: 32, align: 32, offset: 8416)
!1611 = !DILocalVariable(name: "avctx", arg: 1, scope: !1017, file: !919, line: 381, type: !1020)
!1612 = !DILocation(line: 381, column: 37, scope: !1017)
!1613 = !DILocalVariable(name: "src", arg: 2, scope: !1017, file: !919, line: 381, type: !1508)
!1614 = !DILocation(line: 381, column: 59, scope: !1017)
!1615 = !DILocalVariable(name: "srcsize", arg: 3, scope: !1017, file: !919, line: 381, type: !902)
!1616 = !DILocation(line: 381, column: 68, scope: !1017)
!1617 = !DILocalVariable(name: "dst", arg: 4, scope: !1017, file: !919, line: 382, type: !1141)
!1618 = !DILocation(line: 382, column: 30, scope: !1017)
!1619 = !DILocalVariable(name: "height", arg: 5, scope: !1017, file: !919, line: 382, type: !902)
!1620 = !DILocation(line: 382, column: 39, scope: !1017)
!1621 = !DILocalVariable(name: "stride", arg: 6, scope: !1017, file: !919, line: 382, type: !902)
!1622 = !DILocation(line: 382, column: 51, scope: !1017)
!1623 = !DILocalVariable(name: "compr", arg: 7, scope: !1017, file: !919, line: 383, type: !887)
!1624 = !DILocation(line: 383, column: 36, scope: !1017)
!1625 = !DILocalVariable(name: "opts", arg: 8, scope: !1017, file: !919, line: 383, type: !902)
!1626 = !DILocation(line: 383, column: 47, scope: !1017)
!1627 = !DILocalVariable(name: "j", scope: !1017, file: !919, line: 385, type: !902)
!1628 = !DILocation(line: 385, column: 9, scope: !1017)
!1629 = !DILocalVariable(name: "gb", scope: !1017, file: !919, line: 386, type: !1630)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1631, line: 70, baseType: !1632)
!1631 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1631, line: 61, size: 256, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1632, file: !1631, line: 62, baseType: !1508, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1632, file: !1631, line: 62, baseType: !1508, size: 64, align: 64, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1632, file: !1631, line: 67, baseType: !902, size: 32, align: 32, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1632, file: !1631, line: 68, baseType: !902, size: 32, align: 32, offset: 160)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1632, file: !1631, line: 69, baseType: !902, size: 32, align: 32, offset: 192)
!1639 = !DILocation(line: 386, column: 19, scope: !1017)
!1640 = !DILocalVariable(name: "runs", scope: !1017, file: !919, line: 387, type: !1305)
!1641 = !DILocation(line: 387, column: 10, scope: !1017)
!1642 = !DILocalVariable(name: "ref", scope: !1017, file: !919, line: 387, type: !1305)
!1643 = !DILocation(line: 387, column: 17, scope: !1017)
!1644 = !DILocalVariable(name: "runend", scope: !1017, file: !919, line: 387, type: !1305)
!1645 = !DILocation(line: 387, column: 29, scope: !1017)
!1646 = !DILocalVariable(name: "ret", scope: !1017, file: !919, line: 388, type: !902)
!1647 = !DILocation(line: 388, column: 9, scope: !1017)
!1648 = !DILocalVariable(name: "runsize", scope: !1017, file: !919, line: 389, type: !902)
!1649 = !DILocation(line: 389, column: 9, scope: !1017)
!1650 = !DILocation(line: 389, column: 19, scope: !1017)
!1651 = !DILocation(line: 389, column: 26, scope: !1017)
!1652 = !DILocation(line: 389, column: 32, scope: !1017)
!1653 = !DILocalVariable(name: "has_eol", scope: !1017, file: !919, line: 390, type: !902)
!1654 = !DILocation(line: 390, column: 9, scope: !1017)
!1655 = !DILocation(line: 392, column: 28, scope: !1017)
!1656 = !DILocation(line: 392, column: 12, scope: !1017)
!1657 = !DILocation(line: 392, column: 10, scope: !1017)
!1658 = !DILocation(line: 393, column: 27, scope: !1017)
!1659 = !DILocation(line: 393, column: 11, scope: !1017)
!1660 = !DILocation(line: 393, column: 9, scope: !1017)
!1661 = !DILocation(line: 394, column: 10, scope: !1662)
!1662 = distinct !DILexicalBlock(scope: !1017, file: !919, line: 394, column: 9)
!1663 = !DILocation(line: 394, column: 15, scope: !1662)
!1664 = !DILocation(line: 394, column: 19, scope: !1665)
!1665 = !DILexicalBlockFile(scope: !1662, file: !919, discriminator: 1)
!1666 = !DILocation(line: 394, column: 9, scope: !1665)
!1667 = !DILocation(line: 395, column: 13, scope: !1668)
!1668 = distinct !DILexicalBlock(scope: !1662, file: !919, line: 394, column: 24)
!1669 = !DILocation(line: 396, column: 9, scope: !1668)
!1670 = !DILocation(line: 398, column: 14, scope: !1017)
!1671 = !DILocation(line: 398, column: 21, scope: !1017)
!1672 = !DILocation(line: 398, column: 5, scope: !1017)
!1673 = !DILocation(line: 398, column: 12, scope: !1017)
!1674 = !DILocation(line: 399, column: 5, scope: !1017)
!1675 = !DILocation(line: 399, column: 12, scope: !1017)
!1676 = !DILocation(line: 400, column: 5, scope: !1017)
!1677 = !DILocation(line: 400, column: 12, scope: !1017)
!1678 = !DILocation(line: 401, column: 36, scope: !1679)
!1679 = distinct !DILexicalBlock(scope: !1017, file: !919, line: 401, column: 9)
!1680 = !DILocation(line: 401, column: 41, scope: !1679)
!1681 = !DILocation(line: 401, column: 16, scope: !1679)
!1682 = !DILocation(line: 401, column: 14, scope: !1679)
!1683 = !DILocation(line: 401, column: 51, scope: !1679)
!1684 = !DILocation(line: 401, column: 9, scope: !1017)
!1685 = !DILocation(line: 402, column: 9, scope: !1679)
!1686 = !DILocation(line: 403, column: 15, scope: !1017)
!1687 = !DILocation(line: 403, column: 34, scope: !1017)
!1688 = !DILocation(line: 403, column: 39, scope: !1017)
!1689 = !DILocation(line: 403, column: 42, scope: !1690)
!1690 = !DILexicalBlockFile(scope: !1017, file: !919, discriminator: 1)
!1691 = !DILocation(line: 403, column: 61, scope: !1690)
!1692 = !DILocation(line: 403, column: 39, scope: !1690)
!1693 = !DILocation(line: 403, column: 39, scope: !1694)
!1694 = !DILexicalBlockFile(scope: !1017, file: !919, discriminator: 2)
!1695 = !DILocation(line: 403, column: 13, scope: !1694)
!1696 = !DILocation(line: 405, column: 12, scope: !1697)
!1697 = distinct !DILexicalBlock(scope: !1017, file: !919, line: 405, column: 5)
!1698 = !DILocation(line: 405, column: 10, scope: !1697)
!1699 = !DILocation(line: 405, column: 17, scope: !1700)
!1700 = !DILexicalBlockFile(scope: !1701, file: !919, discriminator: 1)
!1701 = distinct !DILexicalBlock(scope: !1697, file: !919, line: 405, column: 5)
!1702 = !DILocation(line: 405, column: 21, scope: !1700)
!1703 = !DILocation(line: 405, column: 19, scope: !1700)
!1704 = !DILocation(line: 405, column: 5, scope: !1700)
!1705 = !DILocation(line: 406, column: 18, scope: !1706)
!1706 = distinct !DILexicalBlock(scope: !1701, file: !919, line: 405, column: 34)
!1707 = !DILocation(line: 406, column: 25, scope: !1706)
!1708 = !DILocation(line: 406, column: 23, scope: !1706)
!1709 = !DILocation(line: 406, column: 16, scope: !1706)
!1710 = !DILocation(line: 407, column: 13, scope: !1711)
!1711 = distinct !DILexicalBlock(scope: !1706, file: !919, line: 407, column: 13)
!1712 = !DILocation(line: 407, column: 19, scope: !1711)
!1713 = !DILocation(line: 407, column: 13, scope: !1706)
!1714 = !DILocation(line: 408, column: 41, scope: !1715)
!1715 = distinct !DILexicalBlock(scope: !1711, file: !919, line: 407, column: 31)
!1716 = !DILocation(line: 408, column: 53, scope: !1715)
!1717 = !DILocation(line: 408, column: 60, scope: !1715)
!1718 = !DILocation(line: 408, column: 67, scope: !1715)
!1719 = !DILocation(line: 408, column: 73, scope: !1715)
!1720 = !DILocation(line: 409, column: 41, scope: !1715)
!1721 = !DILocation(line: 408, column: 19, scope: !1715)
!1722 = !DILocation(line: 408, column: 17, scope: !1715)
!1723 = !DILocation(line: 410, column: 17, scope: !1724)
!1724 = distinct !DILexicalBlock(scope: !1715, file: !919, line: 410, column: 17)
!1725 = !DILocation(line: 410, column: 21, scope: !1724)
!1726 = !DILocation(line: 410, column: 17, scope: !1715)
!1727 = !DILocation(line: 411, column: 17, scope: !1724)
!1728 = !DILocation(line: 412, column: 9, scope: !1715)
!1729 = !DILocalVariable(name: "g3d1", scope: !1730, file: !919, line: 413, type: !902)
!1730 = distinct !DILexicalBlock(scope: !1711, file: !919, line: 412, column: 16)
!1731 = !DILocation(line: 413, column: 17, scope: !1730)
!1732 = !DILocation(line: 413, column: 25, scope: !1730)
!1733 = !DILocation(line: 413, column: 31, scope: !1730)
!1734 = !DILocation(line: 413, column: 43, scope: !1730)
!1735 = !DILocation(line: 413, column: 48, scope: !1736)
!1736 = !DILexicalBlockFile(scope: !1730, file: !919, discriminator: 1)
!1737 = !DILocation(line: 413, column: 53, scope: !1736)
!1738 = !DILocation(line: 413, column: 46, scope: !1736)
!1739 = !DILocation(line: 413, column: 43, scope: !1740)
!1740 = !DILexicalBlockFile(scope: !1730, file: !919, discriminator: 2)
!1741 = !DILocation(line: 413, column: 17, scope: !1740)
!1742 = !DILocation(line: 414, column: 17, scope: !1743)
!1743 = distinct !DILexicalBlock(scope: !1730, file: !919, line: 414, column: 17)
!1744 = !DILocation(line: 414, column: 23, scope: !1743)
!1745 = !DILocation(line: 414, column: 41, scope: !1743)
!1746 = !DILocation(line: 415, column: 17, scope: !1743)
!1747 = !DILocation(line: 415, column: 25, scope: !1743)
!1748 = !DILocation(line: 416, column: 45, scope: !1743)
!1749 = !DILocation(line: 416, column: 53, scope: !1743)
!1750 = !DILocation(line: 416, column: 17, scope: !1743)
!1751 = !DILocation(line: 416, column: 58, scope: !1743)
!1752 = !DILocation(line: 414, column: 17, scope: !1736)
!1753 = !DILocation(line: 417, column: 17, scope: !1743)
!1754 = !DILocation(line: 418, column: 17, scope: !1755)
!1755 = distinct !DILexicalBlock(scope: !1730, file: !919, line: 418, column: 17)
!1756 = !DILocation(line: 418, column: 23, scope: !1755)
!1757 = !DILocation(line: 418, column: 41, scope: !1755)
!1758 = !DILocation(line: 418, column: 44, scope: !1759)
!1759 = !DILexicalBlockFile(scope: !1755, file: !919, discriminator: 1)
!1760 = !DILocation(line: 418, column: 49, scope: !1759)
!1761 = !DILocation(line: 418, column: 52, scope: !1762)
!1762 = !DILexicalBlockFile(scope: !1755, file: !919, discriminator: 2)
!1763 = !DILocation(line: 418, column: 17, scope: !1762)
!1764 = !DILocation(line: 419, column: 45, scope: !1755)
!1765 = !DILocation(line: 419, column: 57, scope: !1755)
!1766 = !DILocation(line: 419, column: 64, scope: !1755)
!1767 = !DILocation(line: 419, column: 71, scope: !1755)
!1768 = !DILocation(line: 420, column: 45, scope: !1755)
!1769 = !DILocation(line: 419, column: 23, scope: !1755)
!1770 = !DILocation(line: 419, column: 21, scope: !1755)
!1771 = !DILocation(line: 419, column: 17, scope: !1755)
!1772 = !DILocation(line: 422, column: 45, scope: !1755)
!1773 = !DILocation(line: 422, column: 57, scope: !1755)
!1774 = !DILocation(line: 422, column: 64, scope: !1755)
!1775 = !DILocation(line: 422, column: 71, scope: !1755)
!1776 = !DILocation(line: 423, column: 45, scope: !1755)
!1777 = !DILocation(line: 423, column: 53, scope: !1755)
!1778 = !DILocation(line: 422, column: 23, scope: !1755)
!1779 = !DILocation(line: 422, column: 21, scope: !1755)
!1780 = !DILocation(line: 424, column: 17, scope: !1781)
!1781 = distinct !DILexicalBlock(scope: !1730, file: !919, line: 424, column: 17)
!1782 = !DILocation(line: 424, column: 23, scope: !1781)
!1783 = !DILocation(line: 424, column: 17, scope: !1730)
!1784 = !DILocation(line: 425, column: 17, scope: !1781)
!1785 = !DILocation(line: 427, column: 13, scope: !1786)
!1786 = distinct !DILexicalBlock(scope: !1706, file: !919, line: 427, column: 13)
!1787 = !DILocation(line: 427, column: 20, scope: !1786)
!1788 = !DILocation(line: 427, column: 36, scope: !1786)
!1789 = !DILocation(line: 427, column: 45, scope: !1786)
!1790 = !DILocation(line: 427, column: 48, scope: !1791)
!1791 = !DILexicalBlockFile(scope: !1786, file: !919, discriminator: 1)
!1792 = !DILocation(line: 427, column: 52, scope: !1791)
!1793 = !DILocation(line: 427, column: 13, scope: !1791)
!1794 = !DILocation(line: 428, column: 13, scope: !1786)
!1795 = !DILocation(line: 430, column: 13, scope: !1796)
!1796 = distinct !DILexicalBlock(scope: !1706, file: !919, line: 430, column: 13)
!1797 = !DILocation(line: 430, column: 17, scope: !1796)
!1798 = !DILocation(line: 430, column: 13, scope: !1706)
!1799 = !DILocation(line: 431, column: 22, scope: !1800)
!1800 = distinct !DILexicalBlock(scope: !1796, file: !919, line: 430, column: 22)
!1801 = !DILocation(line: 431, column: 27, scope: !1800)
!1802 = !DILocation(line: 431, column: 35, scope: !1800)
!1803 = !DILocation(line: 431, column: 42, scope: !1800)
!1804 = !DILocation(line: 431, column: 49, scope: !1800)
!1805 = !DILocation(line: 431, column: 13, scope: !1800)
!1806 = !DILocation(line: 432, column: 9, scope: !1800)
!1807 = !DILocation(line: 433, column: 22, scope: !1808)
!1808 = distinct !DILexicalBlock(scope: !1796, file: !919, line: 432, column: 16)
!1809 = !DILocation(line: 433, column: 27, scope: !1808)
!1810 = !DILocation(line: 433, column: 35, scope: !1808)
!1811 = !DILocation(line: 433, column: 42, scope: !1808)
!1812 = !DILocation(line: 433, column: 49, scope: !1808)
!1813 = !DILocation(line: 433, column: 13, scope: !1808)
!1814 = !DILocation(line: 434, column: 13, scope: !1808)
