; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlz.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlz.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MLZ = type { i32, i32, i32, i32, i32, i32, %struct.MLZDict*, i8* }
%struct.MLZDict = type { i32, i32, i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [45 x i8] c"String code %d exceeds maximum value of %d.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"output chars overflow\0A\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"Too many MLZ codes\0A\00", align 1
@.str.3 = private unnamed_addr constant [19 x i8] c"MLZ offset error.\0A\00", align 1
@.str.4 = private unnamed_addr constant [22 x i8] c"MLZ dic index error.\0A\00", align 1
@.str.5 = private unnamed_addr constant [23 x i8] c"MLZ dic offset error.\0A\00", align 1

; Function Attrs: cold nounwind optsize uwtable
define void @ff_mlz_init_dict(i8* %context, %struct.MLZ* %mlz) #0 !dbg !8 {
entry:
  %context.addr = alloca i8*, align 8
  %mlz.addr = alloca %struct.MLZ*, align 8
  store i8* %context, i8** %context.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %context.addr, metadata !35, metadata !36), !dbg !37
  store %struct.MLZ* %mlz, %struct.MLZ** %mlz.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mlz.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!8 = distinct !DISubprogram(name: "ff_mlz_init_dict", scope: !9, file: !9, line: 23, type: !10, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "libavcodec/mlz.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12, !13}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLZ", file: !15, line: 56, baseType: !16)
!15 = !DIFile(filename: "libavcodec/mlz.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLZ", file: !15, line: 47, size: 320, align: 64, elements: !17)
!17 = !{!18, !19, !20, !22, !23, !24, !25, !34}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "dic_code_bit", scope: !16, file: !15, line: 48, baseType: !4, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "current_dic_index_max", scope: !16, file: !15, line: 49, baseType: !4, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "bump_code", scope: !16, file: !15, line: 50, baseType: !21, size: 32, align: 32, offset: 64)
!21 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flush_code", scope: !16, file: !15, line: 51, baseType: !21, size: 32, align: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next_code", scope: !16, file: !15, line: 52, baseType: !4, size: 32, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_flag", scope: !16, file: !15, line: 53, baseType: !4, size: 32, align: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !16, file: !15, line: 54, baseType: !26, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLZDict", file: !15, line: 43, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLZDict", file: !15, line: 38, size: 128, align: 32, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "string_code", scope: !28, file: !15, line: 39, baseType: !4, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "parent_code", scope: !28, file: !15, line: 40, baseType: !4, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "char_code", scope: !28, file: !15, line: 41, baseType: !4, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "match_len", scope: !28, file: !15, line: 42, baseType: !4, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !16, file: !15, line: 55, baseType: !12, size: 64, align: 64, offset: 256)
!35 = !DILocalVariable(name: "context", arg: 1, scope: !8, file: !9, line: 23, type: !12)
!36 = !DIExpression()
!37 = !DILocation(line: 23, column: 51, scope: !8)
!38 = !DILocalVariable(name: "mlz", arg: 2, scope: !8, file: !9, line: 23, type: !13)
!39 = !DILocation(line: 23, column: 65, scope: !8)
!40 = !DILocation(line: 24, column: 17, scope: !8)
!41 = !DILocation(line: 24, column: 5, scope: !8)
!42 = !DILocation(line: 24, column: 10, scope: !8)
!43 = !DILocation(line: 24, column: 15, scope: !8)
!44 = !DILocation(line: 26, column: 5, scope: !8)
!45 = !DILocation(line: 26, column: 10, scope: !8)
!46 = !DILocation(line: 26, column: 21, scope: !8)
!47 = !DILocation(line: 27, column: 5, scope: !8)
!48 = !DILocation(line: 27, column: 10, scope: !8)
!49 = !DILocation(line: 27, column: 32, scope: !8)
!50 = !DILocation(line: 28, column: 5, scope: !8)
!51 = !DILocation(line: 28, column: 10, scope: !8)
!52 = !DILocation(line: 28, column: 23, scope: !8)
!53 = !DILocation(line: 29, column: 5, scope: !8)
!54 = !DILocation(line: 29, column: 10, scope: !8)
!55 = !DILocation(line: 29, column: 20, scope: !8)
!56 = !DILocation(line: 30, column: 5, scope: !8)
!57 = !DILocation(line: 30, column: 10, scope: !8)
!58 = !DILocation(line: 30, column: 20, scope: !8)
!59 = !DILocation(line: 31, column: 5, scope: !8)
!60 = !DILocation(line: 31, column: 10, scope: !8)
!61 = !DILocation(line: 31, column: 22, scope: !8)
!62 = !DILocation(line: 32, column: 20, scope: !8)
!63 = !DILocation(line: 32, column: 5, scope: !8)
!64 = !DILocation(line: 32, column: 10, scope: !8)
!65 = !DILocation(line: 32, column: 18, scope: !8)
!66 = !DILocation(line: 33, column: 1, scope: !8)
!67 = distinct !DISubprogram(name: "ff_mlz_flush_dict", scope: !9, file: !9, line: 35, type: !68, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !13}
!70 = !DILocalVariable(name: "mlz", arg: 1, scope: !67, file: !9, line: 35, type: !13)
!71 = !DILocation(line: 35, column: 51, scope: !67)
!72 = !DILocalVariable(name: "dict", scope: !67, file: !9, line: 36, type: !26)
!73 = !DILocation(line: 36, column: 14, scope: !67)
!74 = !DILocation(line: 36, column: 21, scope: !67)
!75 = !DILocation(line: 36, column: 26, scope: !67)
!76 = !DILocalVariable(name: "i", scope: !67, file: !9, line: 37, type: !4)
!77 = !DILocation(line: 37, column: 9, scope: !67)
!78 = !DILocation(line: 38, column: 13, scope: !79)
!79 = distinct !DILexicalBlock(scope: !67, file: !9, line: 38, column: 5)
!80 = !DILocation(line: 38, column: 11, scope: !79)
!81 = !DILocation(line: 38, column: 18, scope: !82)
!82 = !DILexicalBlockFile(scope: !83, file: !9, discriminator: 1)
!83 = distinct !DILexicalBlock(scope: !79, file: !9, line: 38, column: 5)
!84 = !DILocation(line: 38, column: 20, scope: !82)
!85 = !DILocation(line: 38, column: 5, scope: !82)
!86 = !DILocation(line: 39, column: 14, scope: !87)
!87 = distinct !DILexicalBlock(scope: !83, file: !9, line: 38, column: 35)
!88 = !DILocation(line: 39, column: 9, scope: !87)
!89 = !DILocation(line: 39, column: 17, scope: !87)
!90 = !DILocation(line: 39, column: 29, scope: !87)
!91 = !DILocation(line: 40, column: 14, scope: !87)
!92 = !DILocation(line: 40, column: 9, scope: !87)
!93 = !DILocation(line: 40, column: 17, scope: !87)
!94 = !DILocation(line: 40, column: 29, scope: !87)
!95 = !DILocation(line: 41, column: 14, scope: !87)
!96 = !DILocation(line: 41, column: 9, scope: !87)
!97 = !DILocation(line: 41, column: 17, scope: !87)
!98 = !DILocation(line: 41, column: 27, scope: !87)
!99 = !DILocation(line: 42, column: 5, scope: !87)
!100 = !DILocation(line: 38, column: 30, scope: !101)
!101 = !DILexicalBlockFile(scope: !83, file: !9, discriminator: 2)
!102 = !DILocation(line: 38, column: 5, scope: !101)
!103 = distinct !{!103, !104}
!104 = !DILocation(line: 38, column: 5, scope: !67)
!105 = !DILocation(line: 43, column: 5, scope: !67)
!106 = !DILocation(line: 43, column: 10, scope: !67)
!107 = !DILocation(line: 43, column: 32, scope: !67)
!108 = !DILocation(line: 44, column: 5, scope: !67)
!109 = !DILocation(line: 44, column: 10, scope: !67)
!110 = !DILocation(line: 44, column: 23, scope: !67)
!111 = !DILocation(line: 45, column: 22, scope: !67)
!112 = !DILocation(line: 45, column: 27, scope: !67)
!113 = !DILocation(line: 45, column: 49, scope: !67)
!114 = !DILocation(line: 45, column: 5, scope: !67)
!115 = !DILocation(line: 45, column: 10, scope: !67)
!116 = !DILocation(line: 45, column: 20, scope: !67)
!117 = !DILocation(line: 46, column: 5, scope: !67)
!118 = !DILocation(line: 46, column: 10, scope: !67)
!119 = !DILocation(line: 46, column: 20, scope: !67)
!120 = !DILocation(line: 47, column: 5, scope: !67)
!121 = !DILocation(line: 47, column: 10, scope: !67)
!122 = !DILocation(line: 47, column: 22, scope: !67)
!123 = !DILocation(line: 48, column: 1, scope: !67)
!124 = distinct !DISubprogram(name: "ff_mlz_decompression", scope: !9, file: !9, line: 123, type: !125, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!125 = !DISubroutineType(types: !126)
!126 = !{!4, !13, !127, !4, !142}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !129, line: 70, baseType: !130)
!129 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !129, line: 61, size: 256, align: 64, elements: !131)
!131 = !{!132, !138, !139, !140, !141}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !130, file: !129, line: 62, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !136, line: 48, baseType: !137)
!136 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!137 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !130, file: !129, line: 62, baseType: !133, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !130, file: !129, line: 67, baseType: !4, size: 32, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !130, file: !129, line: 68, baseType: !4, size: 32, align: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !130, file: !129, line: 69, baseType: !4, size: 32, align: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!143 = !DILocalVariable(name: "mlz", arg: 1, scope: !124, file: !9, line: 123, type: !13)
!144 = !DILocation(line: 123, column: 31, scope: !124)
!145 = !DILocalVariable(name: "gb", arg: 2, scope: !124, file: !9, line: 123, type: !127)
!146 = !DILocation(line: 123, column: 51, scope: !124)
!147 = !DILocalVariable(name: "size", arg: 3, scope: !124, file: !9, line: 123, type: !4)
!148 = !DILocation(line: 123, column: 59, scope: !124)
!149 = !DILocalVariable(name: "buff", arg: 4, scope: !124, file: !9, line: 123, type: !142)
!150 = !DILocation(line: 123, column: 80, scope: !124)
!151 = !DILocalVariable(name: "dict", scope: !124, file: !9, line: 124, type: !26)
!152 = !DILocation(line: 124, column: 14, scope: !124)
!153 = !DILocation(line: 124, column: 21, scope: !124)
!154 = !DILocation(line: 124, column: 26, scope: !124)
!155 = !DILocalVariable(name: "output_chars", scope: !124, file: !9, line: 125, type: !156)
!156 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!157 = !DILocation(line: 125, column: 19, scope: !124)
!158 = !DILocalVariable(name: "string_code", scope: !124, file: !9, line: 126, type: !4)
!159 = !DILocation(line: 126, column: 9, scope: !124)
!160 = !DILocalVariable(name: "last_string_code", scope: !124, file: !9, line: 126, type: !4)
!161 = !DILocation(line: 126, column: 22, scope: !124)
!162 = !DILocalVariable(name: "char_code", scope: !124, file: !9, line: 126, type: !4)
!163 = !DILocation(line: 126, column: 40, scope: !124)
!164 = !DILocation(line: 128, column: 17, scope: !124)
!165 = !DILocation(line: 129, column: 15, scope: !124)
!166 = !DILocation(line: 130, column: 22, scope: !124)
!167 = !DILocation(line: 131, column: 18, scope: !124)
!168 = !DILocation(line: 133, column: 5, scope: !124)
!169 = !DILocation(line: 133, column: 12, scope: !170)
!170 = !DILexicalBlockFile(scope: !124, file: !9, discriminator: 1)
!171 = !DILocation(line: 133, column: 27, scope: !170)
!172 = !DILocation(line: 133, column: 25, scope: !170)
!173 = !DILocation(line: 133, column: 5, scope: !170)
!174 = !DILocation(line: 134, column: 34, scope: !175)
!175 = distinct !DILexicalBlock(scope: !124, file: !9, line: 133, column: 33)
!176 = !DILocation(line: 134, column: 38, scope: !175)
!177 = !DILocation(line: 134, column: 43, scope: !175)
!178 = !DILocation(line: 134, column: 23, scope: !175)
!179 = !DILocation(line: 134, column: 21, scope: !175)
!180 = !DILocation(line: 135, column: 17, scope: !175)
!181 = !DILocation(line: 135, column: 9, scope: !175)
!182 = !DILocation(line: 138, column: 35, scope: !183)
!183 = distinct !DILexicalBlock(scope: !175, file: !9, line: 135, column: 30)
!184 = !DILocation(line: 138, column: 17, scope: !183)
!185 = !DILocation(line: 139, column: 27, scope: !183)
!186 = !DILocation(line: 140, column: 34, scope: !183)
!187 = !DILocation(line: 141, column: 17, scope: !183)
!188 = !DILocation(line: 143, column: 17, scope: !183)
!189 = !DILocation(line: 143, column: 22, scope: !183)
!190 = !DILocation(line: 143, column: 34, scope: !183)
!191 = !DILocation(line: 144, column: 17, scope: !183)
!192 = !DILocation(line: 146, column: 21, scope: !193)
!193 = distinct !DILexicalBlock(scope: !183, file: !9, line: 146, column: 21)
!194 = !DILocation(line: 146, column: 35, scope: !193)
!195 = !DILocation(line: 146, column: 40, scope: !193)
!196 = !DILocation(line: 146, column: 33, scope: !193)
!197 = !DILocation(line: 146, column: 21, scope: !183)
!198 = !DILocation(line: 147, column: 28, scope: !199)
!199 = distinct !DILexicalBlock(scope: !193, file: !9, line: 146, column: 63)
!200 = !DILocation(line: 147, column: 33, scope: !199)
!201 = !DILocation(line: 147, column: 95, scope: !199)
!202 = !DILocation(line: 147, column: 108, scope: !199)
