; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dec_float.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3dec_float.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!986 = !DIEnumerator(name: "AC3_DHEADPHONMOD_OFF", value: 1)
!987 = !DIEnumerator(name: "AC3_DHEADPHONMOD_ON", value: 2)
!988 = !DIEnumerator(name: "AC3_DHEADPHONMOD_RESERVED", value: 3)
!989 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AC3PreferredStereoDownmixMode", file: !961, line: 159, size: 32, align: 32, elements: !990)
!990 = !{!991, !992, !993, !994}
!991 = !DIEnumerator(name: "AC3_DMIXMOD_NOTINDICATED", value: 0)
!992 = !DIEnumerator(name: "AC3_DMIXMOD_LTRT", value: 1)
!993 = !DIEnumerator(name: "AC3_DMIXMOD_LORO", value: 2)
!994 = !DIEnumerator(name: "AC3_DMIXMOD_DPLII", value: 3)
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AC3DolbySurroundEXMode", file: !961, line: 143, size: 32, align: 32, elements: !996)
!996 = !{!997, !998, !999, !1000}
!997 = !DIEnumerator(name: "AC3_DSUREXMOD_NOTINDICATED", value: 0)
!998 = !DIEnumerator(name: "AC3_DSUREXMOD_OFF", value: 1)
!999 = !DIEnumerator(name: "AC3_DSUREXMOD_ON", value: 2)
!1000 = !DIEnumerator(name: "AC3_DSUREXMOD_PLIIZ", value: 3)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !961, line: 115, size: 32, align: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006}
!1003 = !DIEnumerator(name: "DBA_REUSE", value: 0)
!1004 = !DIEnumerator(name: "DBA_NEW", value: 1)
!1005 = !DIEnumerator(name: "DBA_NONE", value: 2)
!1006 = !DIEnumerator(name: "DBA_RESERVED", value: 3)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 50, size: 32, align: 32, elements: !1009)
!1008 = !DIFile(filename: "libavcodec/eac3dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1009 = !{!1010, !1011, !1012, !1013}
!1010 = !DIEnumerator(name: "EAC3_GAQ_NO", value: 0)
!1011 = !DIEnumerator(name: "EAC3_GAQ_12", value: 1)
!1012 = !DIEnumerator(name: "EAC3_GAQ_14", value: 2)
!1013 = !DIEnumerator(name: "EAC3_GAQ_124", value: 3)
!1014 = !{!1015, !1016, !1017, !1026, !1027, !1029, !1030, !1032, !1033, !1039, !1038, !1041, !1043}
!1015 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1016 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1020, line: 222, size: 16, align: 8, elements: !1021)
!1020 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1019, file: !1020, line: 222, baseType: !1023, size: 16, align: 16)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1024, line: 49, baseType: !1025)
!1024 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1025 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORTFLOAT", file: !961, line: 97, baseType: !1032)
!1032 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1020, line: 221, size: 32, align: 8, elements: !1036)
!1036 = !{!1037}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1035, file: !1020, line: 221, baseType: !1038, size: 32, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1024, line: 51, baseType: !1016)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1024, line: 48, baseType: !1040)
!1040 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1024, line: 40, baseType: !1042)
!1042 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1024, line: 38, baseType: !1015)
!1044 = !{!1045, !1799, !1800, !1805, !1806, !1812, !1817, !1821, !1823, !1827, !1828, !1832, !1833, !1838, !1842, !1844, !1847}
!1045 = distinct !DIGlobalVariable(name: "ff_ac3_decoder", scope: !0, file: !1046, line: 56, type: !1047, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_ac3_decoder)
!1046 = !DIFile(filename: "libavcodec/ac3dec_float.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1049)
!1049 = !{!1050, !1054, !1055, !1056, !1057, !1058, !1067, !1070, !1073, !1076, !1081, !1082, !1155, !1163, !1164, !1165, !1167, !1714, !1720, !1728, !1732, !1733, !1770, !1774, !1778, !1779, !1783, !1787, !1788, !1792, !1793, !1794}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !14, line: 3475, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1048, file: !14, line: 3480, baseType: !1051, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1048, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1048, file: !14, line: 3487, baseType: !1015, size: 32, align: 32, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1048, file: !14, line: 3488, baseType: !1059, size: 64, align: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1062, line: 61, baseType: !1063)
!1062 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1062, line: 58, size: 64, align: 32, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1063, file: !1062, line: 59, baseType: !1015, size: 32, align: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1063, file: !1062, line: 60, baseType: !1015, size: 32, align: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1048, file: !14, line: 3489, baseType: !1068, size: 64, align: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1048, file: !14, line: 3490, baseType: !1071, size: 64, align: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1048, file: !14, line: 3491, baseType: !1074, size: 64, align: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1048, file: !14, line: 3492, baseType: !1077, size: 64, align: 64, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1024, line: 55, baseType: !1080)
!1080 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1048, file: !14, line: 3493, baseType: !1039, size: 8, align: 8, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1048, file: !14, line: 3494, baseType: !1083, size: 64, align: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1093, !1114, !1115, !1116, !1117, !1121, !1127, !1129, !1133}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1086, file: !713, line: 72, baseType: !1051, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1086, file: !713, line: 78, baseType: !1090, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!1051, !1029}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1086, file: !713, line: 85, baseType: !1094, size: 64, align: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1110, !1111, !1112, !1113}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1096, file: !691, line: 247, baseType: !1051, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1096, file: !691, line: 253, baseType: !1051, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1096, file: !691, line: 259, baseType: !1015, size: 32, align: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1096, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1096, file: !691, line: 271, baseType: !1103, size: 64, align: 64, offset: 192)
!1103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1096, file: !691, line: 265, size: 64, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1108, !1109}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1103, file: !691, line: 266, baseType: !1041, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1103, file: !691, line: 267, baseType: !1107, size: 64, align: 64)
!1107 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1103, file: !691, line: 268, baseType: !1051, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1103, file: !691, line: 270, baseType: !1061, size: 64, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1096, file: !691, line: 272, baseType: !1107, size: 64, align: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1096, file: !691, line: 273, baseType: !1107, size: 64, align: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !691, line: 275, baseType: !1015, size: 32, align: 32, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1096, file: !691, line: 300, baseType: !1051, size: 64, align: 64, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1086, file: !713, line: 93, baseType: !1015, size: 32, align: 32, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1086, file: !713, line: 99, baseType: !1015, size: 32, align: 32, offset: 224)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1086, file: !713, line: 108, baseType: !1015, size: 32, align: 32, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1086, file: !713, line: 113, baseType: !1118, size: 64, align: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!1029, !1029, !1029}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1086, file: !713, line: 123, baseType: !1122, size: 64, align: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!1125, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1086, file: !713, line: 130, baseType: !1128, size: 32, align: 32, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1086, file: !713, line: 136, baseType: !1130, size: 64, align: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1128, !1029}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1086, file: !713, line: 142, baseType: !1134, size: 64, align: 64, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!1015, !1137, !1029, !1051, !1015}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1140)
!1140 = !{!1141, !1153, !1154}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1139, file: !691, line: 360, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1145, file: !691, line: 307, baseType: !1051, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1145, file: !691, line: 313, baseType: !1107, size: 64, align: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1145, file: !691, line: 313, baseType: !1107, size: 64, align: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1145, file: !691, line: 318, baseType: !1107, size: 64, align: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1145, file: !691, line: 318, baseType: !1107, size: 64, align: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1145, file: !691, line: 323, baseType: !1015, size: 32, align: 32, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1139, file: !691, line: 364, baseType: !1015, size: 32, align: 32, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1139, file: !691, line: 368, baseType: !1015, size: 32, align: 32, offset: 96)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1048, file: !14, line: 3495, baseType: !1156, size: 64, align: 64, offset: 704)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1159, file: !14, line: 3402, baseType: !1015, size: 32, align: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1159, file: !14, line: 3403, baseType: !1051, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1048, file: !14, line: 3507, baseType: !1051, size: 64, align: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1048, file: !14, line: 3516, baseType: !1015, size: 32, align: 32, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !14, line: 3517, baseType: !1166, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1048, file: !14, line: 3527, baseType: !1168, size: 64, align: 64, offset: 960)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!1015, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1181, !1182, !1183, !1184, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1652, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1173, file: !14, line: 1561, baseType: !1083, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1173, file: !14, line: 1562, baseType: !1015, size: 32, align: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1173, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1173, file: !14, line: 1565, baseType: !1179, size: 64, align: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1173, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1173, file: !14, line: 1581, baseType: !1016, size: 32, align: 32, offset: 224)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1173, file: !14, line: 1583, baseType: !1029, size: 64, align: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1173, file: !14, line: 1591, baseType: !1185, size: 64, align: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1187, line: 129, size: 1664, align: 64, elements: !1188)
!1187 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1188 = !{!1189, !1190, !1191, !1192, !1290, !1311, !1312, !1341, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1186, file: !1187, line: 136, baseType: !1015, size: 32, align: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1186, file: !1187, line: 151, baseType: !1015, size: 32, align: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1186, file: !1187, line: 157, baseType: !1015, size: 32, align: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1186, file: !1187, line: 159, baseType: !1193, size: 64, align: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1196)
!1196 = !{!1197, !1202, !1204, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1242, !1244, !1245, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278, !1279, !1280, !1281, !1282, !1283, !1286, !1287, !1288, !1289}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1195, file: !744, line: 282, baseType: !1198, size: 512, align: 64)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 512, align: 64, elements: !1200)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1200 = !{!1201}
!1201 = !DISubrange(count: 8)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1195, file: !744, line: 299, baseType: !1203, size: 256, align: 32, offset: 512)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 256, align: 32, elements: !1200)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1195, file: !744, line: 315, baseType: !1205, size: 64, align: 64, offset: 768)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1195, file: !744, line: 326, baseType: !1015, size: 32, align: 32, offset: 832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1195, file: !744, line: 326, baseType: !1015, size: 32, align: 32, offset: 864)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1195, file: !744, line: 334, baseType: !1015, size: 32, align: 32, offset: 896)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1195, file: !744, line: 341, baseType: !1015, size: 32, align: 32, offset: 928)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1195, file: !744, line: 346, baseType: !1015, size: 32, align: 32, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1195, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1195, file: !744, line: 356, baseType: !1061, size: 64, align: 32, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1195, file: !744, line: 361, baseType: !1041, size: 64, align: 64, offset: 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1195, file: !744, line: 369, baseType: !1041, size: 64, align: 64, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1195, file: !744, line: 377, baseType: !1041, size: 64, align: 64, offset: 1216)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1195, file: !744, line: 382, baseType: !1015, size: 32, align: 32, offset: 1280)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1195, file: !744, line: 386, baseType: !1015, size: 32, align: 32, offset: 1312)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1195, file: !744, line: 391, baseType: !1015, size: 32, align: 32, offset: 1344)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1195, file: !744, line: 396, baseType: !1029, size: 64, align: 64, offset: 1408)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1195, file: !744, line: 403, baseType: !1221, size: 512, align: 64, offset: 1472)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 512, align: 64, elements: !1200)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1195, file: !744, line: 410, baseType: !1015, size: 32, align: 32, offset: 1984)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1195, file: !744, line: 415, baseType: !1015, size: 32, align: 32, offset: 2016)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1195, file: !744, line: 420, baseType: !1015, size: 32, align: 32, offset: 2048)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1195, file: !744, line: 425, baseType: !1015, size: 32, align: 32, offset: 2080)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1195, file: !744, line: 435, baseType: !1041, size: 64, align: 64, offset: 2112)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1195, file: !744, line: 440, baseType: !1015, size: 32, align: 32, offset: 2176)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1195, file: !744, line: 445, baseType: !1079, size: 64, align: 64, offset: 2240)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1195, file: !744, line: 459, baseType: !1230, size: 512, align: 64, offset: 2304)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 512, align: 64, elements: !1200)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1233, line: 94, baseType: !1234)
!1233 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1233, line: 81, size: 192, align: 64, elements: !1235)
!1235 = !{!1236, !1240, !1241}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1234, file: !1233, line: 82, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1233, line: 73, baseType: !1239)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1233, line: 73, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !1233, line: 89, baseType: !1199, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !1233, line: 93, baseType: !1015, size: 32, align: 32, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1195, file: !744, line: 473, baseType: !1243, size: 64, align: 64, offset: 2816)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1195, file: !744, line: 477, baseType: !1015, size: 32, align: 32, offset: 2880)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1195, file: !744, line: 479, baseType: !1246, size: 64, align: 64, offset: 2944)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1259}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1249, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1249, file: !744, line: 203, baseType: !1199, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1249, file: !744, line: 204, baseType: !1015, size: 32, align: 32, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1249, file: !744, line: 205, baseType: !1255, size: 64, align: 64, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1257, line: 86, baseType: !1258)
!1257 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1257, line: 86, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1249, file: !744, line: 206, baseType: !1231, size: 64, align: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1195, file: !744, line: 480, baseType: !1015, size: 32, align: 32, offset: 3008)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1195, file: !744, line: 505, baseType: !1015, size: 32, align: 32, offset: 3040)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1195, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1195, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1195, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1195, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1195, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1195, file: !744, line: 532, baseType: !1041, size: 64, align: 64, offset: 3264)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1195, file: !744, line: 539, baseType: !1041, size: 64, align: 64, offset: 3328)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1195, file: !744, line: 547, baseType: !1041, size: 64, align: 64, offset: 3392)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1195, file: !744, line: 554, baseType: !1255, size: 64, align: 64, offset: 3456)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1195, file: !744, line: 563, baseType: !1015, size: 32, align: 32, offset: 3520)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1195, file: !744, line: 572, baseType: !1015, size: 32, align: 32, offset: 3552)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1195, file: !744, line: 581, baseType: !1015, size: 32, align: 32, offset: 3584)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1195, file: !744, line: 588, baseType: !1275, size: 64, align: 64, offset: 3648)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1024, line: 36, baseType: !1277)
!1277 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1195, file: !744, line: 593, baseType: !1015, size: 32, align: 32, offset: 3712)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1195, file: !744, line: 596, baseType: !1015, size: 32, align: 32, offset: 3744)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1195, file: !744, line: 599, baseType: !1231, size: 64, align: 64, offset: 3776)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1195, file: !744, line: 605, baseType: !1231, size: 64, align: 64, offset: 3840)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1195, file: !744, line: 616, baseType: !1231, size: 64, align: 64, offset: 3904)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1195, file: !744, line: 626, baseType: !1284, size: 64, align: 64, offset: 3968)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1285, line: 216, baseType: !1080)
!1285 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1195, file: !744, line: 627, baseType: !1284, size: 64, align: 64, offset: 4032)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1195, file: !744, line: 628, baseType: !1284, size: 64, align: 64, offset: 4096)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1195, file: !744, line: 629, baseType: !1284, size: 64, align: 64, offset: 4160)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1195, file: !744, line: 645, baseType: !1231, size: 64, align: 64, offset: 4224)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1186, file: !1187, line: 161, baseType: !1291, size: 64, align: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1187, line: 117, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1187, line: 100, size: 832, align: 64, elements: !1294)
!1294 = !{!1295, !1302, !1303, !1304, !1305, !1306, !1308, !1309, !1310}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1293, file: !1187, line: 105, baseType: !1296, size: 256, align: 64)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1297, size: 256, align: 64, elements: !1300)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1233, line: 238, baseType: !1299)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1233, line: 238, flags: DIFlagFwdDecl)
!1300 = !{!1301}
!1301 = !DISubrange(count: 4)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1293, file: !1187, line: 110, baseType: !1015, size: 32, align: 32, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1293, file: !1187, line: 111, baseType: !1015, size: 32, align: 32, offset: 288)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1293, file: !1187, line: 111, baseType: !1015, size: 32, align: 32, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1293, file: !1187, line: 112, baseType: !1203, size: 256, align: 32, offset: 352)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1293, file: !1187, line: 113, baseType: !1307, size: 128, align: 32, offset: 608)
!1307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 128, align: 32, elements: !1300)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1293, file: !1187, line: 114, baseType: !1015, size: 32, align: 32, offset: 736)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1293, file: !1187, line: 115, baseType: !1015, size: 32, align: 32, offset: 768)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1293, file: !1187, line: 116, baseType: !1015, size: 32, align: 32, offset: 800)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1186, file: !1187, line: 163, baseType: !1029, size: 64, align: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1186, file: !1187, line: 165, baseType: !1313, size: 128, align: 64, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1187, line: 122, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1187, line: 119, size: 128, align: 64, elements: !1315)
!1315 = !{!1316, !1340}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1314, file: !1187, line: 120, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1336, !1337, !1338, !1339}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1319, file: !14, line: 1451, baseType: !1231, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1319, file: !14, line: 1461, baseType: !1041, size: 64, align: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1319, file: !14, line: 1467, baseType: !1041, size: 64, align: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1319, file: !14, line: 1468, baseType: !1199, size: 64, align: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1319, file: !14, line: 1469, baseType: !1015, size: 32, align: 32, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1319, file: !14, line: 1470, baseType: !1015, size: 32, align: 32, offset: 288)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !14, line: 1474, baseType: !1015, size: 32, align: 32, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1319, file: !14, line: 1479, baseType: !1329, size: 64, align: 64, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1332)
!1332 = !{!1333, !1334, !1335}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1331, file: !14, line: 1412, baseType: !1199, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1331, file: !14, line: 1413, baseType: !1015, size: 32, align: 32, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1331, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1319, file: !14, line: 1480, baseType: !1015, size: 32, align: 32, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1319, file: !14, line: 1486, baseType: !1041, size: 64, align: 64, offset: 512)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1319, file: !14, line: 1488, baseType: !1041, size: 64, align: 64, offset: 576)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1319, file: !14, line: 1497, baseType: !1041, size: 64, align: 64, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1314, file: !1187, line: 121, baseType: !1193, size: 64, align: 64, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1186, file: !1187, line: 166, baseType: !1342, size: 128, align: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1187, line: 127, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1187, line: 124, size: 128, align: 64, elements: !1344)
!1344 = !{!1345, !1418}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1343, file: !1187, line: 125, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1350)
!1350 = !{!1351, !1352, !1376, !1380, !1381, !1415, !1416, !1417}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1349, file: !14, line: 5751, baseType: !1083, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1349, file: !14, line: 5756, baseType: !1353, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1356)
!1356 = !{!1357, !1358, !1361, !1362, !1363, !1367, !1371, !1375}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1355, file: !14, line: 5797, baseType: !1051, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1355, file: !14, line: 5804, baseType: !1359, size: 64, align: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1355, file: !14, line: 5815, baseType: !1083, size: 64, align: 64, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1355, file: !14, line: 5825, baseType: !1015, size: 32, align: 32, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1355, file: !14, line: 5826, baseType: !1364, size: 64, align: 64, offset: 256)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!1015, !1347}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1355, file: !14, line: 5827, baseType: !1368, size: 64, align: 64, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!1015, !1347, !1317}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1355, file: !14, line: 5828, baseType: !1372, size: 64, align: 64, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{null, !1347}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1355, file: !14, line: 5829, baseType: !1372, size: 64, align: 64, offset: 448)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1349, file: !14, line: 5762, baseType: !1377, size: 64, align: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1379)
!1379 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1349, file: !14, line: 5768, baseType: !1029, size: 64, align: 64, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1349, file: !14, line: 5775, baseType: !1382, size: 64, align: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1384, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1384, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1384, file: !14, line: 3948, baseType: !1038, size: 32, align: 32, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1384, file: !14, line: 3958, baseType: !1199, size: 64, align: 64, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1384, file: !14, line: 3962, baseType: !1015, size: 32, align: 32, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1384, file: !14, line: 3968, baseType: !1015, size: 32, align: 32, offset: 224)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1384, file: !14, line: 3973, baseType: !1041, size: 64, align: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1384, file: !14, line: 3986, baseType: !1015, size: 32, align: 32, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1384, file: !14, line: 3999, baseType: !1015, size: 32, align: 32, offset: 352)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1384, file: !14, line: 4004, baseType: !1015, size: 32, align: 32, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1384, file: !14, line: 4005, baseType: !1015, size: 32, align: 32, offset: 416)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1384, file: !14, line: 4010, baseType: !1015, size: 32, align: 32, offset: 448)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1384, file: !14, line: 4011, baseType: !1015, size: 32, align: 32, offset: 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1384, file: !14, line: 4020, baseType: !1061, size: 64, align: 32, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1384, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1384, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1384, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1384, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1384, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1384, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1384, file: !14, line: 4039, baseType: !1015, size: 32, align: 32, offset: 768)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1384, file: !14, line: 4046, baseType: !1079, size: 64, align: 64, offset: 832)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1384, file: !14, line: 4050, baseType: !1015, size: 32, align: 32, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1384, file: !14, line: 4054, baseType: !1015, size: 32, align: 32, offset: 928)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1384, file: !14, line: 4061, baseType: !1015, size: 32, align: 32, offset: 960)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1384, file: !14, line: 4065, baseType: !1015, size: 32, align: 32, offset: 992)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1384, file: !14, line: 4073, baseType: !1015, size: 32, align: 32, offset: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1384, file: !14, line: 4080, baseType: !1015, size: 32, align: 32, offset: 1056)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1384, file: !14, line: 4084, baseType: !1015, size: 32, align: 32, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1349, file: !14, line: 5781, baseType: !1382, size: 64, align: 64, offset: 320)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1349, file: !14, line: 5787, baseType: !1061, size: 64, align: 32, offset: 384)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1349, file: !14, line: 5793, baseType: !1061, size: 64, align: 32, offset: 448)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1343, file: !1187, line: 126, baseType: !1015, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1186, file: !1187, line: 172, baseType: !1317, size: 64, align: 64, offset: 576)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1186, file: !1187, line: 177, baseType: !1199, size: 64, align: 64, offset: 640)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1186, file: !1187, line: 178, baseType: !1016, size: 32, align: 32, offset: 704)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1186, file: !1187, line: 180, baseType: !1029, size: 64, align: 64, offset: 768)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1186, file: !1187, line: 185, baseType: !1015, size: 32, align: 32, offset: 832)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1186, file: !1187, line: 190, baseType: !1029, size: 64, align: 64, offset: 896)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1186, file: !1187, line: 195, baseType: !1015, size: 32, align: 32, offset: 960)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1186, file: !1187, line: 200, baseType: !1317, size: 64, align: 64, offset: 1024)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1186, file: !1187, line: 201, baseType: !1015, size: 32, align: 32, offset: 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1186, file: !1187, line: 202, baseType: !1193, size: 64, align: 64, offset: 1152)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1186, file: !1187, line: 203, baseType: !1015, size: 32, align: 32, offset: 1216)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1186, file: !1187, line: 205, baseType: !1015, size: 32, align: 32, offset: 1248)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1186, file: !1187, line: 206, baseType: !1015, size: 32, align: 32, offset: 1280)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1186, file: !1187, line: 209, baseType: !1284, size: 64, align: 64, offset: 1344)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1186, file: !1187, line: 212, baseType: !1284, size: 64, align: 64, offset: 1408)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1186, file: !1187, line: 213, baseType: !1193, size: 64, align: 64, offset: 1472)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1186, file: !1187, line: 215, baseType: !1015, size: 32, align: 32, offset: 1536)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1186, file: !1187, line: 217, baseType: !1015, size: 32, align: 32, offset: 1568)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1186, file: !1187, line: 220, baseType: !1015, size: 32, align: 32, offset: 1600)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1173, file: !14, line: 1598, baseType: !1029, size: 64, align: 64, offset: 384)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1173, file: !14, line: 1606, baseType: !1041, size: 64, align: 64, offset: 448)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1173, file: !14, line: 1614, baseType: !1015, size: 32, align: 32, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1173, file: !14, line: 1622, baseType: !1015, size: 32, align: 32, offset: 544)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1173, file: !14, line: 1628, baseType: !1015, size: 32, align: 32, offset: 576)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !14, line: 1636, baseType: !1015, size: 32, align: 32, offset: 608)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1173, file: !14, line: 1643, baseType: !1015, size: 32, align: 32, offset: 640)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1173, file: !14, line: 1657, baseType: !1199, size: 64, align: 64, offset: 704)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1173, file: !14, line: 1658, baseType: !1015, size: 32, align: 32, offset: 768)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1173, file: !14, line: 1679, baseType: !1061, size: 64, align: 32, offset: 800)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1173, file: !14, line: 1688, baseType: !1015, size: 32, align: 32, offset: 864)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1173, file: !14, line: 1712, baseType: !1015, size: 32, align: 32, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1173, file: !14, line: 1729, baseType: !1015, size: 32, align: 32, offset: 928)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1173, file: !14, line: 1729, baseType: !1015, size: 32, align: 32, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1173, file: !14, line: 1744, baseType: !1015, size: 32, align: 32, offset: 992)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1173, file: !14, line: 1744, baseType: !1015, size: 32, align: 32, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1173, file: !14, line: 1751, baseType: !1015, size: 32, align: 32, offset: 1056)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1173, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1173, file: !14, line: 1791, baseType: !1457, size: 64, align: 64, offset: 1152)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{null, !1460, !1461, !1463, !1015, !1015, !1015}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1173, file: !14, line: 1808, baseType: !1465, size: 64, align: 64, offset: 1216)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!473, !1460, !1068}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1173, file: !14, line: 1816, baseType: !1015, size: 32, align: 32, offset: 1280)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1173, file: !14, line: 1825, baseType: !1032, size: 32, align: 32, offset: 1312)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1173, file: !14, line: 1830, baseType: !1015, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1173, file: !14, line: 1838, baseType: !1032, size: 32, align: 32, offset: 1376)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1173, file: !14, line: 1846, baseType: !1015, size: 32, align: 32, offset: 1408)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1173, file: !14, line: 1851, baseType: !1015, size: 32, align: 32, offset: 1440)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1173, file: !14, line: 1861, baseType: !1032, size: 32, align: 32, offset: 1472)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1173, file: !14, line: 1868, baseType: !1032, size: 32, align: 32, offset: 1504)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1173, file: !14, line: 1875, baseType: !1032, size: 32, align: 32, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1173, file: !14, line: 1882, baseType: !1032, size: 32, align: 32, offset: 1568)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1173, file: !14, line: 1889, baseType: !1032, size: 32, align: 32, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1173, file: !14, line: 1896, baseType: !1032, size: 32, align: 32, offset: 1632)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1173, file: !14, line: 1903, baseType: !1032, size: 32, align: 32, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1173, file: !14, line: 1910, baseType: !1015, size: 32, align: 32, offset: 1696)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1173, file: !14, line: 1915, baseType: !1015, size: 32, align: 32, offset: 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1173, file: !14, line: 1926, baseType: !1463, size: 64, align: 64, offset: 1792)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1173, file: !14, line: 1935, baseType: !1061, size: 64, align: 32, offset: 1856)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1173, file: !14, line: 1942, baseType: !1015, size: 32, align: 32, offset: 1920)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1173, file: !14, line: 1948, baseType: !1015, size: 32, align: 32, offset: 1952)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1173, file: !14, line: 1954, baseType: !1015, size: 32, align: 32, offset: 1984)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1173, file: !14, line: 1960, baseType: !1015, size: 32, align: 32, offset: 2016)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1173, file: !14, line: 1984, baseType: !1015, size: 32, align: 32, offset: 2048)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1173, file: !14, line: 1991, baseType: !1015, size: 32, align: 32, offset: 2080)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1173, file: !14, line: 1996, baseType: !1015, size: 32, align: 32, offset: 2112)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1173, file: !14, line: 2004, baseType: !1015, size: 32, align: 32, offset: 2144)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1173, file: !14, line: 2011, baseType: !1015, size: 32, align: 32, offset: 2176)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1173, file: !14, line: 2018, baseType: !1015, size: 32, align: 32, offset: 2208)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1173, file: !14, line: 2027, baseType: !1015, size: 32, align: 32, offset: 2240)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1173, file: !14, line: 2034, baseType: !1015, size: 32, align: 32, offset: 2272)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1173, file: !14, line: 2044, baseType: !1015, size: 32, align: 32, offset: 2304)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1173, file: !14, line: 2054, baseType: !1026, size: 64, align: 64, offset: 2368)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1173, file: !14, line: 2061, baseType: !1026, size: 64, align: 64, offset: 2432)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1173, file: !14, line: 2066, baseType: !1015, size: 32, align: 32, offset: 2496)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1173, file: !14, line: 2070, baseType: !1015, size: 32, align: 32, offset: 2528)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1173, file: !14, line: 2078, baseType: !1015, size: 32, align: 32, offset: 2560)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1173, file: !14, line: 2085, baseType: !1015, size: 32, align: 32, offset: 2592)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1173, file: !14, line: 2092, baseType: !1015, size: 32, align: 32, offset: 2624)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1173, file: !14, line: 2099, baseType: !1015, size: 32, align: 32, offset: 2656)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1173, file: !14, line: 2106, baseType: !1015, size: 32, align: 32, offset: 2688)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1173, file: !14, line: 2113, baseType: !1015, size: 32, align: 32, offset: 2720)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1173, file: !14, line: 2120, baseType: !1015, size: 32, align: 32, offset: 2752)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1173, file: !14, line: 2125, baseType: !1015, size: 32, align: 32, offset: 2784)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1173, file: !14, line: 2133, baseType: !1015, size: 32, align: 32, offset: 2816)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1173, file: !14, line: 2140, baseType: !1015, size: 32, align: 32, offset: 2848)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1173, file: !14, line: 2145, baseType: !1015, size: 32, align: 32, offset: 2880)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1173, file: !14, line: 2153, baseType: !1015, size: 32, align: 32, offset: 2912)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1173, file: !14, line: 2158, baseType: !1015, size: 32, align: 32, offset: 2944)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1173, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1173, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1173, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1173, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1173, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1173, file: !14, line: 2203, baseType: !1015, size: 32, align: 32, offset: 3136)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1173, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1173, file: !14, line: 2212, baseType: !1015, size: 32, align: 32, offset: 3200)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1173, file: !14, line: 2213, baseType: !1015, size: 32, align: 32, offset: 3232)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1173, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1173, file: !14, line: 2232, baseType: !1015, size: 32, align: 32, offset: 3296)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1173, file: !14, line: 2243, baseType: !1015, size: 32, align: 32, offset: 3328)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1173, file: !14, line: 2249, baseType: !1015, size: 32, align: 32, offset: 3360)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1173, file: !14, line: 2256, baseType: !1015, size: 32, align: 32, offset: 3392)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1173, file: !14, line: 2263, baseType: !1079, size: 64, align: 64, offset: 3456)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1173, file: !14, line: 2270, baseType: !1079, size: 64, align: 64, offset: 3520)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1173, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1173, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1173, file: !14, line: 2367, baseType: !1534, size: 64, align: 64, offset: 3648)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!1015, !1460, !1193, !1015}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1173, file: !14, line: 2383, baseType: !1015, size: 32, align: 32, offset: 3712)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1173, file: !14, line: 2386, baseType: !1032, size: 32, align: 32, offset: 3744)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1173, file: !14, line: 2387, baseType: !1032, size: 32, align: 32, offset: 3776)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1173, file: !14, line: 2394, baseType: !1015, size: 32, align: 32, offset: 3808)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1173, file: !14, line: 2401, baseType: !1015, size: 32, align: 32, offset: 3840)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1173, file: !14, line: 2408, baseType: !1015, size: 32, align: 32, offset: 3872)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1173, file: !14, line: 2415, baseType: !1015, size: 32, align: 32, offset: 3904)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1173, file: !14, line: 2422, baseType: !1015, size: 32, align: 32, offset: 3936)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1173, file: !14, line: 2423, baseType: !1546, size: 64, align: 64, offset: 3968)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1548, file: !14, line: 827, baseType: !1015, size: 32, align: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1548, file: !14, line: 828, baseType: !1015, size: 32, align: 32, offset: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1548, file: !14, line: 829, baseType: !1015, size: 32, align: 32, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1548, file: !14, line: 830, baseType: !1032, size: 32, align: 32, offset: 96)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1173, file: !14, line: 2430, baseType: !1041, size: 64, align: 64, offset: 4032)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1173, file: !14, line: 2437, baseType: !1041, size: 64, align: 64, offset: 4096)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1173, file: !14, line: 2444, baseType: !1032, size: 32, align: 32, offset: 4160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1173, file: !14, line: 2451, baseType: !1032, size: 32, align: 32, offset: 4192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1173, file: !14, line: 2458, baseType: !1015, size: 32, align: 32, offset: 4224)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1173, file: !14, line: 2469, baseType: !1015, size: 32, align: 32, offset: 4256)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1173, file: !14, line: 2475, baseType: !1015, size: 32, align: 32, offset: 4288)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1173, file: !14, line: 2481, baseType: !1015, size: 32, align: 32, offset: 4320)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1173, file: !14, line: 2485, baseType: !1015, size: 32, align: 32, offset: 4352)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1173, file: !14, line: 2489, baseType: !1015, size: 32, align: 32, offset: 4384)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1173, file: !14, line: 2493, baseType: !1015, size: 32, align: 32, offset: 4416)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1173, file: !14, line: 2501, baseType: !1015, size: 32, align: 32, offset: 4448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1173, file: !14, line: 2506, baseType: !1015, size: 32, align: 32, offset: 4480)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1173, file: !14, line: 2510, baseType: !1015, size: 32, align: 32, offset: 4512)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1173, file: !14, line: 2514, baseType: !1041, size: 64, align: 64, offset: 4544)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1173, file: !14, line: 2528, baseType: !1570, size: 64, align: 64, offset: 4608)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1460, !1029, !1015, !1015}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1173, file: !14, line: 2534, baseType: !1015, size: 32, align: 32, offset: 4672)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1173, file: !14, line: 2545, baseType: !1015, size: 32, align: 32, offset: 4704)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1173, file: !14, line: 2547, baseType: !1015, size: 32, align: 32, offset: 4736)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1173, file: !14, line: 2549, baseType: !1015, size: 32, align: 32, offset: 4768)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1173, file: !14, line: 2551, baseType: !1015, size: 32, align: 32, offset: 4800)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1173, file: !14, line: 2553, baseType: !1015, size: 32, align: 32, offset: 4832)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1173, file: !14, line: 2555, baseType: !1015, size: 32, align: 32, offset: 4864)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1173, file: !14, line: 2557, baseType: !1015, size: 32, align: 32, offset: 4896)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1173, file: !14, line: 2559, baseType: !1015, size: 32, align: 32, offset: 4928)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1173, file: !14, line: 2563, baseType: !1015, size: 32, align: 32, offset: 4960)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1173, file: !14, line: 2571, baseType: !1584, size: 64, align: 64, offset: 4992)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1173, file: !14, line: 2579, baseType: !1584, size: 64, align: 64, offset: 5056)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1173, file: !14, line: 2586, baseType: !1015, size: 32, align: 32, offset: 5120)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1173, file: !14, line: 2615, baseType: !1015, size: 32, align: 32, offset: 5152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1173, file: !14, line: 2627, baseType: !1015, size: 32, align: 32, offset: 5184)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1173, file: !14, line: 2637, baseType: !1015, size: 32, align: 32, offset: 5216)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1173, file: !14, line: 2681, baseType: !1015, size: 32, align: 32, offset: 5248)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1173, file: !14, line: 2709, baseType: !1041, size: 64, align: 64, offset: 5312)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1173, file: !14, line: 2716, baseType: !1593, size: 64, align: 64, offset: 5376)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1606, !1612, !1616, !1617, !1618, !1619, !1625, !1626, !1627, !1628, !1629}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !14, line: 3642, baseType: !1051, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1595, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1595, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1595, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1595, file: !14, line: 3669, baseType: !1015, size: 32, align: 32, offset: 160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1595, file: !14, line: 3682, baseType: !1603, size: 64, align: 64, offset: 192)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!1015, !1171, !1193}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1595, file: !14, line: 3698, baseType: !1607, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!1015, !1171, !1610, !1038}
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1595, file: !14, line: 3712, baseType: !1613, size: 64, align: 64, offset: 320)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!1015, !1171, !1015, !1610, !1038}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1595, file: !14, line: 3726, baseType: !1607, size: 64, align: 64, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1595, file: !14, line: 3737, baseType: !1168, size: 64, align: 64, offset: 448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1595, file: !14, line: 3746, baseType: !1015, size: 32, align: 32, offset: 512)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1595, file: !14, line: 3757, baseType: !1620, size: 64, align: 64, offset: 576)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{null, !1623}
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1595, file: !14, line: 3766, baseType: !1168, size: 64, align: 64, offset: 640)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1595, file: !14, line: 3774, baseType: !1168, size: 64, align: 64, offset: 704)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1595, file: !14, line: 3780, baseType: !1015, size: 32, align: 32, offset: 768)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1595, file: !14, line: 3785, baseType: !1015, size: 32, align: 32, offset: 800)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1595, file: !14, line: 3795, baseType: !1630, size: 64, align: 64, offset: 832)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!1015, !1171, !1231}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1173, file: !14, line: 2728, baseType: !1029, size: 64, align: 64, offset: 5440)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1173, file: !14, line: 2735, baseType: !1221, size: 512, align: 64, offset: 5504)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1173, file: !14, line: 2742, baseType: !1015, size: 32, align: 32, offset: 6016)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1173, file: !14, line: 2755, baseType: !1015, size: 32, align: 32, offset: 6048)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1173, file: !14, line: 2776, baseType: !1015, size: 32, align: 32, offset: 6080)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1173, file: !14, line: 2783, baseType: !1015, size: 32, align: 32, offset: 6112)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1173, file: !14, line: 2791, baseType: !1015, size: 32, align: 32, offset: 6144)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1173, file: !14, line: 2802, baseType: !1193, size: 64, align: 64, offset: 6208)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1173, file: !14, line: 2811, baseType: !1015, size: 32, align: 32, offset: 6272)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1173, file: !14, line: 2821, baseType: !1015, size: 32, align: 32, offset: 6304)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1173, file: !14, line: 2830, baseType: !1015, size: 32, align: 32, offset: 6336)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1173, file: !14, line: 2840, baseType: !1015, size: 32, align: 32, offset: 6368)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1173, file: !14, line: 2851, baseType: !1646, size: 64, align: 64, offset: 6400)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!1015, !1460, !1649, !1029, !1463, !1015, !1015}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!1015, !1460, !1029}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1173, file: !14, line: 2871, baseType: !1653, size: 64, align: 64, offset: 6464)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!1015, !1460, !1656, !1029, !1463, !1015}
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!1015, !1460, !1029, !1015, !1015}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1173, file: !14, line: 2878, baseType: !1015, size: 32, align: 32, offset: 6528)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1173, file: !14, line: 2885, baseType: !1015, size: 32, align: 32, offset: 6560)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1173, file: !14, line: 3005, baseType: !1015, size: 32, align: 32, offset: 6592)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1173, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1173, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1173, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1173, file: !14, line: 3037, baseType: !1199, size: 64, align: 64, offset: 6720)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1173, file: !14, line: 3038, baseType: !1015, size: 32, align: 32, offset: 6784)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1173, file: !14, line: 3050, baseType: !1079, size: 64, align: 64, offset: 6848)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1173, file: !14, line: 3065, baseType: !1015, size: 32, align: 32, offset: 6912)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1173, file: !14, line: 3083, baseType: !1015, size: 32, align: 32, offset: 6944)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1173, file: !14, line: 3092, baseType: !1061, size: 64, align: 32, offset: 6976)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1173, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1173, file: !14, line: 3106, baseType: !1061, size: 64, align: 32, offset: 7072)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1173, file: !14, line: 3113, baseType: !1674, size: 64, align: 64, offset: 7168)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1676)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1677)
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1678)
!1678 = !{!1679, !1680, !1681, !1682, !1683, !1684, !1687}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1677, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1677, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1677, file: !14, line: 720, baseType: !1051, size: 64, align: 64, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1677, file: !14, line: 724, baseType: !1051, size: 64, align: 64, offset: 128)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1677, file: !14, line: 728, baseType: !1015, size: 32, align: 32, offset: 192)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1677, file: !14, line: 734, baseType: !1685, size: 64, align: 64, offset: 256)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1677, file: !14, line: 739, baseType: !1688, size: 64, align: 64, offset: 320)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1173, file: !14, line: 3129, baseType: !1041, size: 64, align: 64, offset: 7232)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1173, file: !14, line: 3130, baseType: !1041, size: 64, align: 64, offset: 7296)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1173, file: !14, line: 3131, baseType: !1041, size: 64, align: 64, offset: 7360)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1173, file: !14, line: 3132, baseType: !1041, size: 64, align: 64, offset: 7424)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1173, file: !14, line: 3139, baseType: !1584, size: 64, align: 64, offset: 7488)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1173, file: !14, line: 3147, baseType: !1015, size: 32, align: 32, offset: 7552)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1173, file: !14, line: 3165, baseType: !1015, size: 32, align: 32, offset: 7584)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1173, file: !14, line: 3172, baseType: !1015, size: 32, align: 32, offset: 7616)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1173, file: !14, line: 3180, baseType: !1015, size: 32, align: 32, offset: 7648)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1173, file: !14, line: 3191, baseType: !1026, size: 64, align: 64, offset: 7680)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1173, file: !14, line: 3199, baseType: !1199, size: 64, align: 64, offset: 7744)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1173, file: !14, line: 3207, baseType: !1584, size: 64, align: 64, offset: 7808)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1173, file: !14, line: 3214, baseType: !1016, size: 32, align: 32, offset: 7872)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1173, file: !14, line: 3224, baseType: !1329, size: 64, align: 64, offset: 7936)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1173, file: !14, line: 3225, baseType: !1015, size: 32, align: 32, offset: 8000)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1173, file: !14, line: 3249, baseType: !1231, size: 64, align: 64, offset: 8064)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1173, file: !14, line: 3256, baseType: !1015, size: 32, align: 32, offset: 8128)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1173, file: !14, line: 3271, baseType: !1015, size: 32, align: 32, offset: 8160)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1173, file: !14, line: 3279, baseType: !1041, size: 64, align: 64, offset: 8192)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1173, file: !14, line: 3301, baseType: !1231, size: 64, align: 64, offset: 8256)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1173, file: !14, line: 3310, baseType: !1015, size: 32, align: 32, offset: 8320)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1173, file: !14, line: 3337, baseType: !1015, size: 32, align: 32, offset: 8352)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1173, file: !14, line: 3351, baseType: !1015, size: 32, align: 32, offset: 8384)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1173, file: !14, line: 3359, baseType: !1015, size: 32, align: 32, offset: 8416)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1048, file: !14, line: 3535, baseType: !1715, size: 64, align: 64, offset: 1024)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!1015, !1171, !1718}
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1172)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1048, file: !14, line: 3541, baseType: !1721, size: 64, align: 64, offset: 1088)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1723)
!1723 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1724)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1187, line: 223, size: 128, align: 64, elements: !1725)
!1725 = !{!1726, !1727}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1724, file: !1187, line: 224, baseType: !1610, size: 64, align: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1724, file: !1187, line: 225, baseType: !1610, size: 64, align: 64, offset: 64)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1048, file: !14, line: 3549, baseType: !1729, size: 64, align: 64, offset: 1152)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64, align: 64)
!1730 = !DISubroutineType(types: !1731)
!1731 = !{null, !1166}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1048, file: !14, line: 3551, baseType: !1168, size: 64, align: 64, offset: 1216)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1048, file: !14, line: 3552, baseType: !1734, size: 64, align: 64, offset: 1280)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DISubroutineType(types: !1736)
!1736 = !{!1015, !1171, !1199, !1015, !1737}
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1739)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1740)
!1740 = !{!1741, !1742, !1743, !1744, !1745, !1769}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1739, file: !14, line: 3921, baseType: !1023, size: 16, align: 16)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1739, file: !14, line: 3922, baseType: !1038, size: 32, align: 32, offset: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1739, file: !14, line: 3923, baseType: !1038, size: 32, align: 32, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1739, file: !14, line: 3924, baseType: !1016, size: 32, align: 32, offset: 96)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1739, file: !14, line: 3925, baseType: !1746, size: 64, align: 64, offset: 128)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1749)
!1749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1750)
!1750 = !{!1751, !1752, !1753, !1754, !1755, !1756, !1762, !1764, !1765, !1766, !1767, !1768}
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1749, file: !14, line: 3886, baseType: !1015, size: 32, align: 32)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1749, file: !14, line: 3887, baseType: !1015, size: 32, align: 32, offset: 32)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1749, file: !14, line: 3888, baseType: !1015, size: 32, align: 32, offset: 64)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1749, file: !14, line: 3889, baseType: !1015, size: 32, align: 32, offset: 96)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1749, file: !14, line: 3890, baseType: !1015, size: 32, align: 32, offset: 128)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1749, file: !14, line: 3897, baseType: !1757, size: 768, align: 64, offset: 192)
!1757 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1758)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1759)
!1759 = !{!1760, !1761}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1758, file: !14, line: 3855, baseType: !1198, size: 512, align: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1758, file: !14, line: 3857, baseType: !1203, size: 256, align: 32, offset: 512)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1749, file: !14, line: 3903, baseType: !1763, size: 256, align: 64, offset: 960)
!1763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 256, align: 64, elements: !1300)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1749, file: !14, line: 3904, baseType: !1307, size: 128, align: 32, offset: 1216)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1749, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1749, file: !14, line: 3908, baseType: !1584, size: 64, align: 64, offset: 1408)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1749, file: !14, line: 3915, baseType: !1584, size: 64, align: 64, offset: 1472)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1749, file: !14, line: 3917, baseType: !1015, size: 32, align: 32, offset: 1536)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1739, file: !14, line: 3926, baseType: !1041, size: 64, align: 64, offset: 192)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1048, file: !14, line: 3564, baseType: !1771, size: 64, align: 64, offset: 1344)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64, align: 64)
!1772 = !DISubroutineType(types: !1773)
!1773 = !{!1015, !1171, !1317, !1461, !1463}
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1048, file: !14, line: 3566, baseType: !1775, size: 64, align: 64, offset: 1408)
!1775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1776, size: 64, align: 64)
!1776 = !DISubroutineType(types: !1777)
!1777 = !{!1015, !1171, !1029, !1463, !1317}
