; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_xll.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dca_xll.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DCAXllDecoder = type { %struct.AVCodecContext*, %struct.GetBitContext, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i8], [3 x %struct.DCAXllChSet], i32*, i32, i32, i32, i32, i32, i32, i8*, i32, i32, %struct.DCADSPContext*, i32, [32 x i32*] }

!988 = !{!989, !993, !994, !996, !997, !1004, !1006, !995}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !991, line: 37, baseType: !992)
!991 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!992 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!993 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !991, line: 38, baseType: !996)
!996 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1000, line: 221, size: 32, align: 8, elements: !1001)
!1000 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1001 = !{!1002}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !999, file: !1000, line: 221, baseType: !1003, size: 32, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !991, line: 51, baseType: !993)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !991, line: 48, baseType: !1005)
!1005 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !991, line: 40, baseType: !1007)
!1007 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1008 = !{i32 2, !"Dwarf Version", i32 4}
!1009 = !{i32 2, !"Debug Info Version", i32 3}
!1010 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1011 = distinct !DISubprogram(name: "ff_dca_xll_parse", scope: !1012, file: !1012, line: 1161, type: !1013, isLocal: false, isDefinition: true, scopeLine: 1162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2038)
!1012 = !DIFile(filename: "libavcodec/dca_xll.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!996, !1015, !1149, !2003}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCAXllDecoder", file: !1017, line: 142, baseType: !1018)
!1017 = !DIFile(filename: "libavcodec/dca_xll.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCAXllDecoder", file: !1017, line: 105, size: 72448, align: 256, elements: !1019)
!1019 = !{!1020, !1745, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !2000, !2001}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1018, file: !1017, line: 106, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1024)
!1024 = !{!1025, !1070, !1071, !1072, !1343, !1344, !1345, !1346, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1499, !1503, !1504, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1683, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1023, file: !35, line: 1561, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1030)
!1030 = !{!1031, !1035, !1040, !1044, !1045, !1046, !1047, !1051, !1057, !1059, !1063}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1029, file: !4, line: 72, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1029, file: !4, line: 78, baseType: !1036, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1032, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1029, file: !4, line: 85, baseType: !1041, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1029, file: !4, line: 93, baseType: !996, size: 32, align: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1029, file: !4, line: 99, baseType: !996, size: 32, align: 32, offset: 224)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1029, file: !4, line: 108, baseType: !996, size: 32, align: 32, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1029, file: !4, line: 113, baseType: !1048, size: 64, align: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1039, !1039, !1039}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1029, file: !4, line: 123, baseType: !1052, size: 64, align: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1055, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1029, file: !4, line: 130, baseType: !1058, size: 32, align: 32, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1029, file: !4, line: 136, baseType: !1060, size: 64, align: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1058, !1039}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1029, file: !4, line: 142, baseType: !1064, size: 64, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!996, !1067, !1039, !1032, !996}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1023, file: !35, line: 1562, baseType: !996, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1023, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1023, file: !35, line: 1565, baseType: !1073, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1091, !1094, !1097, !1100, !1105, !1106, !1107, !1115, !1116, !1117, !1119, !1123, !1129, !1140, !1144, !1145, !1193, !1314, !1318, !1319, !1323, !1327, !1332, !1336, !1337, !1338}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1075, file: !35, line: 3475, baseType: !1032, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1075, file: !35, line: 3480, baseType: !1032, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1075, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1075, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1075, file: !35, line: 3487, baseType: !996, size: 32, align: 32, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1075, file: !35, line: 3488, baseType: !1083, size: 64, align: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1086, line: 61, baseType: !1087)
!1086 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1086, line: 58, size: 64, align: 32, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1087, file: !1086, line: 59, baseType: !996, size: 32, align: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1087, file: !1086, line: 60, baseType: !996, size: 32, align: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1075, file: !35, line: 3489, baseType: !1092, size: 64, align: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1075, file: !35, line: 3490, baseType: !1095, size: 64, align: 64, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1075, file: !35, line: 3491, baseType: !1098, size: 64, align: 64, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1075, file: !35, line: 3492, baseType: !1101, size: 64, align: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !991, line: 55, baseType: !1104)
!1104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1075, file: !35, line: 3493, baseType: !1004, size: 8, align: 8, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1075, file: !35, line: 3494, baseType: !1026, size: 64, align: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1075, file: !35, line: 3495, baseType: !1108, size: 64, align: 64, offset: 704)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1111, file: !35, line: 3402, baseType: !996, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1111, file: !35, line: 3403, baseType: !1032, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1075, file: !35, line: 3507, baseType: !1032, size: 64, align: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1075, file: !35, line: 3516, baseType: !996, size: 32, align: 32, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1075, file: !35, line: 3517, baseType: !1118, size: 64, align: 64, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1075, file: !35, line: 3527, baseType: !1120, size: 64, align: 64, offset: 960)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!996, !1021}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1075, file: !35, line: 3535, baseType: !1124, size: 64, align: 64, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!996, !1021, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1075, file: !35, line: 3541, baseType: !1130, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1134, line: 223, size: 128, align: 64, elements: !1135)
!1134 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1135 = !{!1136, !1139}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1133, file: !1134, line: 224, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1133, file: !1134, line: 225, baseType: !1137, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1075, file: !35, line: 3549, baseType: !1141, size: 64, align: 64, offset: 1152)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !1118}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1075, file: !35, line: 3551, baseType: !1120, size: 64, align: 64, offset: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1075, file: !35, line: 3552, baseType: !1146, size: 64, align: 64, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!996, !1021, !1149, !996, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1153)
!1153 = !{!1154, !1157, !1158, !1159, !1160, !1192}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1152, file: !35, line: 3921, baseType: !1155, size: 16, align: 16)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !991, line: 49, baseType: !1156)
!1156 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1152, file: !35, line: 3922, baseType: !1003, size: 32, align: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1152, file: !35, line: 3923, baseType: !1003, size: 32, align: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1152, file: !35, line: 3924, baseType: !993, size: 32, align: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1152, file: !35, line: 3925, baseType: !1161, size: 64, align: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170, !1171, !1181, !1185, !1187, !1188, !1190, !1191}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1164, file: !35, line: 3886, baseType: !996, size: 32, align: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1164, file: !35, line: 3887, baseType: !996, size: 32, align: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1164, file: !35, line: 3888, baseType: !996, size: 32, align: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1164, file: !35, line: 3889, baseType: !996, size: 32, align: 32, offset: 96)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1164, file: !35, line: 3890, baseType: !996, size: 32, align: 32, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1164, file: !35, line: 3897, baseType: !1172, size: 768, align: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1174)
!1174 = !{!1175, !1179}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !35, line: 3855, baseType: !1176, size: 512, align: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 512, align: 64, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 8)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1173, file: !35, line: 3857, baseType: !1180, size: 256, align: 32, offset: 512)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 256, align: 32, elements: !1177)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !35, line: 3903, baseType: !1182, size: 256, align: 64, offset: 960)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 256, align: 64, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 4)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1164, file: !35, line: 3904, baseType: !1186, size: 128, align: 32, offset: 1216)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 128, align: 32, elements: !1183)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1164, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1164, file: !35, line: 3908, baseType: !1189, size: 64, align: 64, offset: 1408)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1164, file: !35, line: 3915, baseType: !1189, size: 64, align: 64, offset: 1472)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !35, line: 3917, baseType: !996, size: 32, align: 32, offset: 1536)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1152, file: !35, line: 3926, baseType: !1006, size: 64, align: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1075, file: !35, line: 3564, baseType: !1194, size: 64, align: 64, offset: 1344)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!996, !1021, !1197, !1231, !1313}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1200)
!1200 = !{!1201, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1227, !1228, !1229, !1230}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1199, file: !35, line: 1451, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1204, line: 94, baseType: !1205)
!1204 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1204, line: 81, size: 192, align: 64, elements: !1206)
!1206 = !{!1207, !1211, !1212}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1205, file: !1204, line: 82, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1204, line: 73, baseType: !1210)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1204, line: 73, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !1204, line: 89, baseType: !1149, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !1204, line: 93, baseType: !996, size: 32, align: 32, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1199, file: !35, line: 1461, baseType: !1006, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1199, file: !35, line: 1467, baseType: !1006, size: 64, align: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !35, line: 1468, baseType: !1149, size: 64, align: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1199, file: !35, line: 1469, baseType: !996, size: 32, align: 32, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1199, file: !35, line: 1470, baseType: !996, size: 32, align: 32, offset: 288)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !35, line: 1474, baseType: !996, size: 32, align: 32, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1199, file: !35, line: 1479, baseType: !1220, size: 64, align: 64, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1223)
!1223 = !{!1224, !1225, !1226}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1222, file: !35, line: 1412, baseType: !1149, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1222, file: !35, line: 1413, baseType: !996, size: 32, align: 32, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1222, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1199, file: !35, line: 1480, baseType: !996, size: 32, align: 32, offset: 448)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1199, file: !35, line: 1486, baseType: !1006, size: 64, align: 64, offset: 512)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1199, file: !35, line: 1488, baseType: !1006, size: 64, align: 64, offset: 576)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1199, file: !35, line: 1497, baseType: !1006, size: 64, align: 64, offset: 640)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1265, !1267, !1268, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1302, !1303, !1304, !1305, !1306, !1309, !1310, !1311, !1312}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !758, line: 282, baseType: !1176, size: 512, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1234, file: !758, line: 299, baseType: !1180, size: 256, align: 32, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1234, file: !758, line: 315, baseType: !1239, size: 64, align: 64, offset: 768)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1234, file: !758, line: 326, baseType: !996, size: 32, align: 32, offset: 832)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1234, file: !758, line: 326, baseType: !996, size: 32, align: 32, offset: 864)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1234, file: !758, line: 334, baseType: !996, size: 32, align: 32, offset: 896)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1234, file: !758, line: 341, baseType: !996, size: 32, align: 32, offset: 928)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1234, file: !758, line: 346, baseType: !996, size: 32, align: 32, offset: 960)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1234, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1234, file: !758, line: 356, baseType: !1085, size: 64, align: 32, offset: 1024)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1234, file: !758, line: 361, baseType: !1006, size: 64, align: 64, offset: 1088)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1234, file: !758, line: 369, baseType: !1006, size: 64, align: 64, offset: 1152)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1234, file: !758, line: 377, baseType: !1006, size: 64, align: 64, offset: 1216)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1234, file: !758, line: 382, baseType: !996, size: 32, align: 32, offset: 1280)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1234, file: !758, line: 386, baseType: !996, size: 32, align: 32, offset: 1312)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1234, file: !758, line: 391, baseType: !996, size: 32, align: 32, offset: 1344)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1234, file: !758, line: 396, baseType: !1039, size: 64, align: 64, offset: 1408)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1234, file: !758, line: 403, baseType: !1255, size: 512, align: 64, offset: 1472)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 512, align: 64, elements: !1177)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1234, file: !758, line: 410, baseType: !996, size: 32, align: 32, offset: 1984)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1234, file: !758, line: 415, baseType: !996, size: 32, align: 32, offset: 2016)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1234, file: !758, line: 420, baseType: !996, size: 32, align: 32, offset: 2048)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1234, file: !758, line: 425, baseType: !996, size: 32, align: 32, offset: 2080)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1234, file: !758, line: 435, baseType: !1006, size: 64, align: 64, offset: 2112)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1234, file: !758, line: 440, baseType: !996, size: 32, align: 32, offset: 2176)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1234, file: !758, line: 445, baseType: !1103, size: 64, align: 64, offset: 2240)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !758, line: 459, baseType: !1264, size: 512, align: 64, offset: 2304)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 512, align: 64, elements: !1177)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1234, file: !758, line: 473, baseType: !1266, size: 64, align: 64, offset: 2816)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1234, file: !758, line: 477, baseType: !996, size: 32, align: 32, offset: 2880)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1234, file: !758, line: 479, baseType: !1269, size: 64, align: 64, offset: 2944)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1282}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1272, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1272, file: !758, line: 203, baseType: !1149, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1272, file: !758, line: 204, baseType: !996, size: 32, align: 32, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1272, file: !758, line: 205, baseType: !1278, size: 64, align: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1280, line: 86, baseType: !1281)
!1280 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1280, line: 86, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1272, file: !758, line: 206, baseType: !1202, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1234, file: !758, line: 480, baseType: !996, size: 32, align: 32, offset: 3008)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1234, file: !758, line: 505, baseType: !996, size: 32, align: 32, offset: 3040)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1234, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1234, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1234, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1234, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1234, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1234, file: !758, line: 532, baseType: !1006, size: 64, align: 64, offset: 3264)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1234, file: !758, line: 539, baseType: !1006, size: 64, align: 64, offset: 3328)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1234, file: !758, line: 547, baseType: !1006, size: 64, align: 64, offset: 3392)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1234, file: !758, line: 554, baseType: !1278, size: 64, align: 64, offset: 3456)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1234, file: !758, line: 563, baseType: !996, size: 32, align: 32, offset: 3520)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1234, file: !758, line: 572, baseType: !996, size: 32, align: 32, offset: 3552)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1234, file: !758, line: 581, baseType: !996, size: 32, align: 32, offset: 3584)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1234, file: !758, line: 588, baseType: !1298, size: 64, align: 64, offset: 3648)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !991, line: 36, baseType: !1300)
!1300 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1234, file: !758, line: 593, baseType: !996, size: 32, align: 32, offset: 3712)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1234, file: !758, line: 596, baseType: !996, size: 32, align: 32, offset: 3744)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1234, file: !758, line: 599, baseType: !1202, size: 64, align: 64, offset: 3776)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1234, file: !758, line: 605, baseType: !1202, size: 64, align: 64, offset: 3840)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1234, file: !758, line: 616, baseType: !1202, size: 64, align: 64, offset: 3904)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1234, file: !758, line: 626, baseType: !1307, size: 64, align: 64, offset: 3968)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1308, line: 216, baseType: !1104)
!1308 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1234, file: !758, line: 627, baseType: !1307, size: 64, align: 64, offset: 4032)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1234, file: !758, line: 628, baseType: !1307, size: 64, align: 64, offset: 4096)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1234, file: !758, line: 629, baseType: !1307, size: 64, align: 64, offset: 4160)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1234, file: !758, line: 645, baseType: !1202, size: 64, align: 64, offset: 4224)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1075, file: !35, line: 3566, baseType: !1315, size: 64, align: 64, offset: 1408)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!996, !1021, !1039, !1313, !1197}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1075, file: !35, line: 3567, baseType: !1120, size: 64, align: 64, offset: 1472)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1075, file: !35, line: 3576, baseType: !1320, size: 64, align: 64, offset: 1536)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!996, !1021, !1231}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1075, file: !35, line: 3577, baseType: !1324, size: 64, align: 64, offset: 1600)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!996, !1021, !1197}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1075, file: !35, line: 3584, baseType: !1328, size: 64, align: 64, offset: 1664)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!996, !1021, !1331}
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1075, file: !35, line: 3589, baseType: !1333, size: 64, align: 64, offset: 1728)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{null, !1021}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1075, file: !35, line: 3594, baseType: !996, size: 32, align: 32, offset: 1792)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1075, file: !35, line: 3600, baseType: !1032, size: 64, align: 64, offset: 1856)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1075, file: !35, line: 3609, baseType: !1339, size: 64, align: 64, offset: 1920)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1023, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1023, file: !35, line: 1581, baseType: !993, size: 32, align: 32, offset: 224)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1023, file: !35, line: 1583, baseType: !1039, size: 64, align: 64, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1023, file: !35, line: 1591, baseType: !1347, size: 64, align: 64, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1134, line: 129, size: 1664, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1353, !1354, !1372, !1373, !1379, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1348, file: !1134, line: 136, baseType: !996, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1348, file: !1134, line: 151, baseType: !996, size: 32, align: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1348, file: !1134, line: 157, baseType: !996, size: 32, align: 32, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1348, file: !1134, line: 159, baseType: !1331, size: 64, align: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1348, file: !1134, line: 161, baseType: !1355, size: 64, align: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1134, line: 117, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1134, line: 100, size: 832, align: 64, elements: !1358)
!1358 = !{!1359, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1357, file: !1134, line: 105, baseType: !1360, size: 256, align: 64)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1361, size: 256, align: 64, elements: !1183)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1204, line: 238, baseType: !1363)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1204, line: 238, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1357, file: !1134, line: 110, baseType: !996, size: 32, align: 32, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1357, file: !1134, line: 111, baseType: !996, size: 32, align: 32, offset: 288)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1357, file: !1134, line: 111, baseType: !996, size: 32, align: 32, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1357, file: !1134, line: 112, baseType: !1180, size: 256, align: 32, offset: 352)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1357, file: !1134, line: 113, baseType: !1186, size: 128, align: 32, offset: 608)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1357, file: !1134, line: 114, baseType: !996, size: 32, align: 32, offset: 736)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1357, file: !1134, line: 115, baseType: !996, size: 32, align: 32, offset: 768)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1357, file: !1134, line: 116, baseType: !996, size: 32, align: 32, offset: 800)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1348, file: !1134, line: 163, baseType: !1039, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1348, file: !1134, line: 165, baseType: !1374, size: 128, align: 64, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1134, line: 122, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1134, line: 119, size: 128, align: 64, elements: !1376)
!1376 = !{!1377, !1378}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1375, file: !1134, line: 120, baseType: !1197, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1375, file: !1134, line: 121, baseType: !1331, size: 64, align: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1348, file: !1134, line: 166, baseType: !1380, size: 128, align: 64, offset: 448)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1134, line: 127, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1134, line: 124, size: 128, align: 64, elements: !1382)
!1382 = !{!1383, !1456}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1381, file: !1134, line: 125, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1388)
!1388 = !{!1389, !1390, !1414, !1418, !1419, !1453, !1454, !1455}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1387, file: !35, line: 5751, baseType: !1026, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1387, file: !35, line: 5756, baseType: !1391, size: 64, align: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1394)
!1394 = !{!1395, !1396, !1399, !1400, !1401, !1405, !1409, !1413}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1393, file: !35, line: 5797, baseType: !1032, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1393, file: !35, line: 5804, baseType: !1397, size: 64, align: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1393, file: !35, line: 5815, baseType: !1026, size: 64, align: 64, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1393, file: !35, line: 5825, baseType: !996, size: 32, align: 32, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1393, file: !35, line: 5826, baseType: !1402, size: 64, align: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!996, !1385}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1393, file: !35, line: 5827, baseType: !1406, size: 64, align: 64, offset: 320)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!996, !1385, !1197}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1393, file: !35, line: 5828, baseType: !1410, size: 64, align: 64, offset: 384)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1385}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1393, file: !35, line: 5829, baseType: !1410, size: 64, align: 64, offset: 448)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1387, file: !35, line: 5762, baseType: !1415, size: 64, align: 64, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1417)
!1417 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1387, file: !35, line: 5768, baseType: !1039, size: 64, align: 64, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1387, file: !35, line: 5775, baseType: !1420, size: 64, align: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1423)
!1423 = !{!1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1422, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1422, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1422, file: !35, line: 3948, baseType: !1003, size: 32, align: 32, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1422, file: !35, line: 3958, baseType: !1149, size: 64, align: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1422, file: !35, line: 3962, baseType: !996, size: 32, align: 32, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1422, file: !35, line: 3968, baseType: !996, size: 32, align: 32, offset: 224)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1422, file: !35, line: 3973, baseType: !1006, size: 64, align: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1422, file: !35, line: 3986, baseType: !996, size: 32, align: 32, offset: 320)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1422, file: !35, line: 3999, baseType: !996, size: 32, align: 32, offset: 352)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1422, file: !35, line: 4004, baseType: !996, size: 32, align: 32, offset: 384)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1422, file: !35, line: 4005, baseType: !996, size: 32, align: 32, offset: 416)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1422, file: !35, line: 4010, baseType: !996, size: 32, align: 32, offset: 448)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1422, file: !35, line: 4011, baseType: !996, size: 32, align: 32, offset: 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1422, file: !35, line: 4020, baseType: !1085, size: 64, align: 32, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1422, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1422, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1422, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1422, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1422, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1422, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1422, file: !35, line: 4039, baseType: !996, size: 32, align: 32, offset: 768)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1422, file: !35, line: 4046, baseType: !1103, size: 64, align: 64, offset: 832)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1422, file: !35, line: 4050, baseType: !996, size: 32, align: 32, offset: 896)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1422, file: !35, line: 4054, baseType: !996, size: 32, align: 32, offset: 928)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1422, file: !35, line: 4061, baseType: !996, size: 32, align: 32, offset: 960)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1422, file: !35, line: 4065, baseType: !996, size: 32, align: 32, offset: 992)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1422, file: !35, line: 4073, baseType: !996, size: 32, align: 32, offset: 1024)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1422, file: !35, line: 4080, baseType: !996, size: 32, align: 32, offset: 1056)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1422, file: !35, line: 4084, baseType: !996, size: 32, align: 32, offset: 1088)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1387, file: !35, line: 5781, baseType: !1420, size: 64, align: 64, offset: 320)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1387, file: !35, line: 5787, baseType: !1085, size: 64, align: 32, offset: 384)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1387, file: !35, line: 5793, baseType: !1085, size: 64, align: 32, offset: 448)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1381, file: !1134, line: 126, baseType: !996, size: 32, align: 32, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1348, file: !1134, line: 172, baseType: !1197, size: 64, align: 64, offset: 576)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1348, file: !1134, line: 177, baseType: !1149, size: 64, align: 64, offset: 640)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1348, file: !1134, line: 178, baseType: !993, size: 32, align: 32, offset: 704)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1348, file: !1134, line: 180, baseType: !1039, size: 64, align: 64, offset: 768)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1348, file: !1134, line: 185, baseType: !996, size: 32, align: 32, offset: 832)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1348, file: !1134, line: 190, baseType: !1039, size: 64, align: 64, offset: 896)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1348, file: !1134, line: 195, baseType: !996, size: 32, align: 32, offset: 960)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1348, file: !1134, line: 200, baseType: !1197, size: 64, align: 64, offset: 1024)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1348, file: !1134, line: 201, baseType: !996, size: 32, align: 32, offset: 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1348, file: !1134, line: 202, baseType: !1331, size: 64, align: 64, offset: 1152)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1348, file: !1134, line: 203, baseType: !996, size: 32, align: 32, offset: 1216)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1348, file: !1134, line: 205, baseType: !996, size: 32, align: 32, offset: 1248)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1348, file: !1134, line: 206, baseType: !996, size: 32, align: 32, offset: 1280)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1348, file: !1134, line: 209, baseType: !1307, size: 64, align: 64, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1348, file: !1134, line: 212, baseType: !1307, size: 64, align: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1348, file: !1134, line: 213, baseType: !1331, size: 64, align: 64, offset: 1472)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1348, file: !1134, line: 215, baseType: !996, size: 32, align: 32, offset: 1536)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1348, file: !1134, line: 217, baseType: !996, size: 32, align: 32, offset: 1568)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1348, file: !1134, line: 220, baseType: !996, size: 32, align: 32, offset: 1600)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1023, file: !35, line: 1598, baseType: !1039, size: 64, align: 64, offset: 384)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1023, file: !35, line: 1606, baseType: !1006, size: 64, align: 64, offset: 448)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1023, file: !35, line: 1614, baseType: !996, size: 32, align: 32, offset: 512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1023, file: !35, line: 1622, baseType: !996, size: 32, align: 32, offset: 544)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1023, file: !35, line: 1628, baseType: !996, size: 32, align: 32, offset: 576)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !35, line: 1636, baseType: !996, size: 32, align: 32, offset: 608)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1023, file: !35, line: 1643, baseType: !996, size: 32, align: 32, offset: 640)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1023, file: !35, line: 1657, baseType: !1149, size: 64, align: 64, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1023, file: !35, line: 1658, baseType: !996, size: 32, align: 32, offset: 768)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1023, file: !35, line: 1679, baseType: !1085, size: 64, align: 32, offset: 800)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1023, file: !35, line: 1688, baseType: !996, size: 32, align: 32, offset: 864)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1023, file: !35, line: 1712, baseType: !996, size: 32, align: 32, offset: 896)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1023, file: !35, line: 1729, baseType: !996, size: 32, align: 32, offset: 928)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1023, file: !35, line: 1729, baseType: !996, size: 32, align: 32, offset: 960)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1023, file: !35, line: 1744, baseType: !996, size: 32, align: 32, offset: 992)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1023, file: !35, line: 1744, baseType: !996, size: 32, align: 32, offset: 1024)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1023, file: !35, line: 1751, baseType: !996, size: 32, align: 32, offset: 1056)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1023, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1023, file: !35, line: 1791, baseType: !1495, size: 64, align: 64, offset: 1152)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1498, !1231, !1313, !996, !996, !996}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1023, file: !35, line: 1808, baseType: !1500, size: 64, align: 64, offset: 1216)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!494, !1498, !1092}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1023, file: !35, line: 1816, baseType: !996, size: 32, align: 32, offset: 1280)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1023, file: !35, line: 1825, baseType: !1505, size: 32, align: 32, offset: 1312)
!1505 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1023, file: !35, line: 1830, baseType: !996, size: 32, align: 32, offset: 1344)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1023, file: !35, line: 1838, baseType: !1505, size: 32, align: 32, offset: 1376)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1023, file: !35, line: 1846, baseType: !996, size: 32, align: 32, offset: 1408)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1023, file: !35, line: 1851, baseType: !996, size: 32, align: 32, offset: 1440)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1023, file: !35, line: 1861, baseType: !1505, size: 32, align: 32, offset: 1472)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1023, file: !35, line: 1868, baseType: !1505, size: 32, align: 32, offset: 1504)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1023, file: !35, line: 1875, baseType: !1505, size: 32, align: 32, offset: 1536)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1023, file: !35, line: 1882, baseType: !1505, size: 32, align: 32, offset: 1568)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1023, file: !35, line: 1889, baseType: !1505, size: 32, align: 32, offset: 1600)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1023, file: !35, line: 1896, baseType: !1505, size: 32, align: 32, offset: 1632)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1023, file: !35, line: 1903, baseType: !1505, size: 32, align: 32, offset: 1664)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1023, file: !35, line: 1910, baseType: !996, size: 32, align: 32, offset: 1696)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1023, file: !35, line: 1915, baseType: !996, size: 32, align: 32, offset: 1728)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1023, file: !35, line: 1926, baseType: !1313, size: 64, align: 64, offset: 1792)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1023, file: !35, line: 1935, baseType: !1085, size: 64, align: 32, offset: 1856)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1023, file: !35, line: 1942, baseType: !996, size: 32, align: 32, offset: 1920)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1023, file: !35, line: 1948, baseType: !996, size: 32, align: 32, offset: 1952)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1023, file: !35, line: 1954, baseType: !996, size: 32, align: 32, offset: 1984)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1023, file: !35, line: 1960, baseType: !996, size: 32, align: 32, offset: 2016)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1023, file: !35, line: 1984, baseType: !996, size: 32, align: 32, offset: 2048)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1023, file: !35, line: 1991, baseType: !996, size: 32, align: 32, offset: 2080)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1023, file: !35, line: 1996, baseType: !996, size: 32, align: 32, offset: 2112)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1023, file: !35, line: 2004, baseType: !996, size: 32, align: 32, offset: 2144)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1023, file: !35, line: 2011, baseType: !996, size: 32, align: 32, offset: 2176)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1023, file: !35, line: 2018, baseType: !996, size: 32, align: 32, offset: 2208)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1023, file: !35, line: 2027, baseType: !996, size: 32, align: 32, offset: 2240)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1023, file: !35, line: 2034, baseType: !996, size: 32, align: 32, offset: 2272)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1023, file: !35, line: 2044, baseType: !996, size: 32, align: 32, offset: 2304)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1023, file: !35, line: 2054, baseType: !1535, size: 64, align: 64, offset: 2368)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1023, file: !35, line: 2061, baseType: !1535, size: 64, align: 64, offset: 2432)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1023, file: !35, line: 2066, baseType: !996, size: 32, align: 32, offset: 2496)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1023, file: !35, line: 2070, baseType: !996, size: 32, align: 32, offset: 2528)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1023, file: !35, line: 2078, baseType: !996, size: 32, align: 32, offset: 2560)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1023, file: !35, line: 2085, baseType: !996, size: 32, align: 32, offset: 2592)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1023, file: !35, line: 2092, baseType: !996, size: 32, align: 32, offset: 2624)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1023, file: !35, line: 2099, baseType: !996, size: 32, align: 32, offset: 2656)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1023, file: !35, line: 2106, baseType: !996, size: 32, align: 32, offset: 2688)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1023, file: !35, line: 2113, baseType: !996, size: 32, align: 32, offset: 2720)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1023, file: !35, line: 2120, baseType: !996, size: 32, align: 32, offset: 2752)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1023, file: !35, line: 2125, baseType: !996, size: 32, align: 32, offset: 2784)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1023, file: !35, line: 2133, baseType: !996, size: 32, align: 32, offset: 2816)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1023, file: !35, line: 2140, baseType: !996, size: 32, align: 32, offset: 2848)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1023, file: !35, line: 2145, baseType: !996, size: 32, align: 32, offset: 2880)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1023, file: !35, line: 2153, baseType: !996, size: 32, align: 32, offset: 2912)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1023, file: !35, line: 2158, baseType: !996, size: 32, align: 32, offset: 2944)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1023, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1023, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1023, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1023, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1023, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1023, file: !35, line: 2203, baseType: !996, size: 32, align: 32, offset: 3136)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1023, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1023, file: !35, line: 2212, baseType: !996, size: 32, align: 32, offset: 3200)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1023, file: !35, line: 2213, baseType: !996, size: 32, align: 32, offset: 3232)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1023, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1023, file: !35, line: 2232, baseType: !996, size: 32, align: 32, offset: 3296)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1023, file: !35, line: 2243, baseType: !996, size: 32, align: 32, offset: 3328)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1023, file: !35, line: 2249, baseType: !996, size: 32, align: 32, offset: 3360)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1023, file: !35, line: 2256, baseType: !996, size: 32, align: 32, offset: 3392)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1023, file: !35, line: 2263, baseType: !1103, size: 64, align: 64, offset: 3456)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1023, file: !35, line: 2270, baseType: !1103, size: 64, align: 64, offset: 3520)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1023, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1023, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1023, file: !35, line: 2367, baseType: !1571, size: 64, align: 64, offset: 3648)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!996, !1498, !1331, !996}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1023, file: !35, line: 2383, baseType: !996, size: 32, align: 32, offset: 3712)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1023, file: !35, line: 2386, baseType: !1505, size: 32, align: 32, offset: 3744)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1023, file: !35, line: 2387, baseType: !1505, size: 32, align: 32, offset: 3776)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1023, file: !35, line: 2394, baseType: !996, size: 32, align: 32, offset: 3808)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1023, file: !35, line: 2401, baseType: !996, size: 32, align: 32, offset: 3840)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1023, file: !35, line: 2408, baseType: !996, size: 32, align: 32, offset: 3872)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1023, file: !35, line: 2415, baseType: !996, size: 32, align: 32, offset: 3904)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1023, file: !35, line: 2422, baseType: !996, size: 32, align: 32, offset: 3936)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1023, file: !35, line: 2423, baseType: !1583, size: 64, align: 64, offset: 3968)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1585, file: !35, line: 827, baseType: !996, size: 32, align: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1585, file: !35, line: 828, baseType: !996, size: 32, align: 32, offset: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1585, file: !35, line: 829, baseType: !996, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1585, file: !35, line: 830, baseType: !1505, size: 32, align: 32, offset: 96)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1023, file: !35, line: 2430, baseType: !1006, size: 64, align: 64, offset: 4032)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1023, file: !35, line: 2437, baseType: !1006, size: 64, align: 64, offset: 4096)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1023, file: !35, line: 2444, baseType: !1505, size: 32, align: 32, offset: 4160)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1023, file: !35, line: 2451, baseType: !1505, size: 32, align: 32, offset: 4192)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1023, file: !35, line: 2458, baseType: !996, size: 32, align: 32, offset: 4224)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1023, file: !35, line: 2469, baseType: !996, size: 32, align: 32, offset: 4256)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1023, file: !35, line: 2475, baseType: !996, size: 32, align: 32, offset: 4288)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1023, file: !35, line: 2481, baseType: !996, size: 32, align: 32, offset: 4320)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1023, file: !35, line: 2485, baseType: !996, size: 32, align: 32, offset: 4352)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1023, file: !35, line: 2489, baseType: !996, size: 32, align: 32, offset: 4384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1023, file: !35, line: 2493, baseType: !996, size: 32, align: 32, offset: 4416)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1023, file: !35, line: 2501, baseType: !996, size: 32, align: 32, offset: 4448)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1023, file: !35, line: 2506, baseType: !996, size: 32, align: 32, offset: 4480)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1023, file: !35, line: 2510, baseType: !996, size: 32, align: 32, offset: 4512)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1023, file: !35, line: 2514, baseType: !1006, size: 64, align: 64, offset: 4544)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1023, file: !35, line: 2528, baseType: !1607, size: 64, align: 64, offset: 4608)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{null, !1498, !1039, !996, !996}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1023, file: !35, line: 2534, baseType: !996, size: 32, align: 32, offset: 4672)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1023, file: !35, line: 2545, baseType: !996, size: 32, align: 32, offset: 4704)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1023, file: !35, line: 2547, baseType: !996, size: 32, align: 32, offset: 4736)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1023, file: !35, line: 2549, baseType: !996, size: 32, align: 32, offset: 4768)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1023, file: !35, line: 2551, baseType: !996, size: 32, align: 32, offset: 4800)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1023, file: !35, line: 2553, baseType: !996, size: 32, align: 32, offset: 4832)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1023, file: !35, line: 2555, baseType: !996, size: 32, align: 32, offset: 4864)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1023, file: !35, line: 2557, baseType: !996, size: 32, align: 32, offset: 4896)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1023, file: !35, line: 2559, baseType: !996, size: 32, align: 32, offset: 4928)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1023, file: !35, line: 2563, baseType: !996, size: 32, align: 32, offset: 4960)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1023, file: !35, line: 2571, baseType: !1189, size: 64, align: 64, offset: 4992)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1023, file: !35, line: 2579, baseType: !1189, size: 64, align: 64, offset: 5056)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1023, file: !35, line: 2586, baseType: !996, size: 32, align: 32, offset: 5120)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1023, file: !35, line: 2615, baseType: !996, size: 32, align: 32, offset: 5152)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1023, file: !35, line: 2627, baseType: !996, size: 32, align: 32, offset: 5184)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1023, file: !35, line: 2637, baseType: !996, size: 32, align: 32, offset: 5216)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1023, file: !35, line: 2681, baseType: !996, size: 32, align: 32, offset: 5248)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1023, file: !35, line: 2709, baseType: !1006, size: 64, align: 64, offset: 5312)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1023, file: !35, line: 2716, baseType: !1629, size: 64, align: 64, offset: 5376)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1631)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1636, !1637, !1638, !1639, !1643, !1647, !1648, !1649, !1650, !1656, !1657, !1658, !1659, !1660}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1631, file: !35, line: 3642, baseType: !1032, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1631, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1631, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1631, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1631, file: !35, line: 3669, baseType: !996, size: 32, align: 32, offset: 160)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1631, file: !35, line: 3682, baseType: !1328, size: 64, align: 64, offset: 192)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1631, file: !35, line: 3698, baseType: !1640, size: 64, align: 64, offset: 256)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!996, !1021, !1137, !1003}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1631, file: !35, line: 3712, baseType: !1644, size: 64, align: 64, offset: 320)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!996, !1021, !996, !1137, !1003}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1631, file: !35, line: 3726, baseType: !1640, size: 64, align: 64, offset: 384)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1631, file: !35, line: 3737, baseType: !1120, size: 64, align: 64, offset: 448)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1631, file: !35, line: 3746, baseType: !996, size: 32, align: 32, offset: 512)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1631, file: !35, line: 3757, baseType: !1651, size: 64, align: 64, offset: 576)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{null, !1654}
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1631, file: !35, line: 3766, baseType: !1120, size: 64, align: 64, offset: 640)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1631, file: !35, line: 3774, baseType: !1120, size: 64, align: 64, offset: 704)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1631, file: !35, line: 3780, baseType: !996, size: 32, align: 32, offset: 768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1631, file: !35, line: 3785, baseType: !996, size: 32, align: 32, offset: 800)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1631, file: !35, line: 3795, baseType: !1661, size: 64, align: 64, offset: 832)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!996, !1021, !1202}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1023, file: !35, line: 2728, baseType: !1039, size: 64, align: 64, offset: 5440)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1023, file: !35, line: 2735, baseType: !1255, size: 512, align: 64, offset: 5504)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1023, file: !35, line: 2742, baseType: !996, size: 32, align: 32, offset: 6016)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1023, file: !35, line: 2755, baseType: !996, size: 32, align: 32, offset: 6048)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1023, file: !35, line: 2776, baseType: !996, size: 32, align: 32, offset: 6080)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1023, file: !35, line: 2783, baseType: !996, size: 32, align: 32, offset: 6112)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1023, file: !35, line: 2791, baseType: !996, size: 32, align: 32, offset: 6144)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1023, file: !35, line: 2802, baseType: !1331, size: 64, align: 64, offset: 6208)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1023, file: !35, line: 2811, baseType: !996, size: 32, align: 32, offset: 6272)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1023, file: !35, line: 2821, baseType: !996, size: 32, align: 32, offset: 6304)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1023, file: !35, line: 2830, baseType: !996, size: 32, align: 32, offset: 6336)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1023, file: !35, line: 2840, baseType: !996, size: 32, align: 32, offset: 6368)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1023, file: !35, line: 2851, baseType: !1677, size: 64, align: 64, offset: 6400)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!996, !1498, !1680, !1039, !1313, !996, !996}
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!996, !1498, !1039}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1023, file: !35, line: 2871, baseType: !1684, size: 64, align: 64, offset: 6464)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!996, !1498, !1687, !1039, !1313, !996}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!996, !1498, !1039, !996, !996}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1023, file: !35, line: 2878, baseType: !996, size: 32, align: 32, offset: 6528)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1023, file: !35, line: 2885, baseType: !996, size: 32, align: 32, offset: 6560)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1023, file: !35, line: 3005, baseType: !996, size: 32, align: 32, offset: 6592)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1023, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1023, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1023, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1023, file: !35, line: 3037, baseType: !1149, size: 64, align: 64, offset: 6720)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1023, file: !35, line: 3038, baseType: !996, size: 32, align: 32, offset: 6784)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1023, file: !35, line: 3050, baseType: !1103, size: 64, align: 64, offset: 6848)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1023, file: !35, line: 3065, baseType: !996, size: 32, align: 32, offset: 6912)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1023, file: !35, line: 3083, baseType: !996, size: 32, align: 32, offset: 6944)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1023, file: !35, line: 3092, baseType: !1085, size: 64, align: 32, offset: 6976)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1023, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1023, file: !35, line: 3106, baseType: !1085, size: 64, align: 32, offset: 7072)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1023, file: !35, line: 3113, baseType: !1705, size: 64, align: 64, offset: 7168)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1707)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1708)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1709)
!1709 = !{!1710, !1711, !1712, !1713, !1714, !1715, !1718}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1708, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1708, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1708, file: !35, line: 720, baseType: !1032, size: 64, align: 64, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1708, file: !35, line: 724, baseType: !1032, size: 64, align: 64, offset: 128)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1708, file: !35, line: 728, baseType: !996, size: 32, align: 32, offset: 192)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1708, file: !35, line: 734, baseType: !1716, size: 64, align: 64, offset: 256)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1708, file: !35, line: 739, baseType: !1719, size: 64, align: 64, offset: 320)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1023, file: !35, line: 3129, baseType: !1006, size: 64, align: 64, offset: 7232)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1023, file: !35, line: 3130, baseType: !1006, size: 64, align: 64, offset: 7296)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1023, file: !35, line: 3131, baseType: !1006, size: 64, align: 64, offset: 7360)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1023, file: !35, line: 3132, baseType: !1006, size: 64, align: 64, offset: 7424)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1023, file: !35, line: 3139, baseType: !1189, size: 64, align: 64, offset: 7488)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1023, file: !35, line: 3147, baseType: !996, size: 32, align: 32, offset: 7552)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1023, file: !35, line: 3165, baseType: !996, size: 32, align: 32, offset: 7584)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1023, file: !35, line: 3172, baseType: !996, size: 32, align: 32, offset: 7616)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1023, file: !35, line: 3180, baseType: !996, size: 32, align: 32, offset: 7648)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1023, file: !35, line: 3191, baseType: !1535, size: 64, align: 64, offset: 7680)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1023, file: !35, line: 3199, baseType: !1149, size: 64, align: 64, offset: 7744)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1023, file: !35, line: 3207, baseType: !1189, size: 64, align: 64, offset: 7808)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1023, file: !35, line: 3214, baseType: !993, size: 32, align: 32, offset: 7872)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1023, file: !35, line: 3224, baseType: !1220, size: 64, align: 64, offset: 7936)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1023, file: !35, line: 3225, baseType: !996, size: 32, align: 32, offset: 8000)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1023, file: !35, line: 3249, baseType: !1202, size: 64, align: 64, offset: 8064)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1023, file: !35, line: 3256, baseType: !996, size: 32, align: 32, offset: 8128)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1023, file: !35, line: 3271, baseType: !996, size: 32, align: 32, offset: 8160)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1023, file: !35, line: 3279, baseType: !1006, size: 64, align: 64, offset: 8192)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1023, file: !35, line: 3301, baseType: !1202, size: 64, align: 64, offset: 8256)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1023, file: !35, line: 3310, baseType: !996, size: 32, align: 32, offset: 8320)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1023, file: !35, line: 3337, baseType: !996, size: 32, align: 32, offset: 8352)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1023, file: !35, line: 3351, baseType: !996, size: 32, align: 32, offset: 8384)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1023, file: !35, line: 3359, baseType: !996, size: 32, align: 32, offset: 8416)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1018, file: !1017, line: 107, baseType: !1746, size: 256, align: 64, offset: 64)
!1746 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1747, line: 70, baseType: !1748)
!1747 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1747, line: 61, size: 256, align: 64, elements: !1749)
!1749 = !{!1750, !1751, !1752, !1753, !1754}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1748, file: !1747, line: 62, baseType: !1137, size: 64, align: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1748, file: !1747, line: 62, baseType: !1137, size: 64, align: 64, offset: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1748, file: !1747, line: 67, baseType: !996, size: 32, align: 32, offset: 128)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1748, file: !1747, line: 68, baseType: !996, size: 32, align: 32, offset: 160)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1748, file: !1747, line: 69, baseType: !996, size: 32, align: 32, offset: 192)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1018, file: !1017, line: 109, baseType: !996, size: 32, align: 32, offset: 320)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "nchsets", scope: !1018, file: !1017, line: 110, baseType: !996, size: 32, align: 32, offset: 352)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "nframesegs", scope: !1018, file: !1017, line: 111, baseType: !996, size: 32, align: 32, offset: 384)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "nsegsamples_log2", scope: !1018, file: !1017, line: 112, baseType: !996, size: 32, align: 32, offset: 416)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "nsegsamples", scope: !1018, file: !1017, line: 113, baseType: !996, size: 32, align: 32, offset: 448)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "nframesamples_log2", scope: !1018, file: !1017, line: 114, baseType: !996, size: 32, align: 32, offset: 480)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "nframesamples", scope: !1018, file: !1017, line: 115, baseType: !996, size: 32, align: 32, offset: 512)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "seg_size_nbits", scope: !1018, file: !1017, line: 116, baseType: !996, size: 32, align: 32, offset: 544)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "band_crc_present", scope: !1018, file: !1017, line: 117, baseType: !996, size: 32, align: 32, offset: 576)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "scalable_lsbs", scope: !1018, file: !1017, line: 118, baseType: !996, size: 32, align: 32, offset: 608)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "ch_mask_nbits", scope: !1018, file: !1017, line: 119, baseType: !996, size: 32, align: 32, offset: 640)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_lsb_width", scope: !1018, file: !1017, line: 120, baseType: !996, size: 32, align: 32, offset: 672)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "chset", scope: !1018, file: !1017, line: 122, baseType: !1768, size: 69120, align: 256, offset: 768)
!1768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1769, size: 69120, align: 256, elements: !1830)
!1769 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCAXllChSet", file: !1017, line: 103, baseType: !1770)
!1770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCAXllChSet", file: !1017, line: 64, size: 23040, align: 256, elements: !1771)
!1771 = !{!1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1787, !1791, !1792, !1793, !1794, !1795, !1796, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1828, !1832}
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels", scope: !1770, file: !1017, line: 66, baseType: !996, size: 32, align: 32)
