; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--lpc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--lpc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LPCContext = type { i32, i32, i32, double*, double*, void (i32*, i32, double*)*, void (double*, i32, i32, double*)*, [16 x i8], [2 x %struct.LLSModel] }
%struct.LLSModel = type { [36 x [36 x double]], [32 x [32 x double]], [32 x double], i32, void (%struct.LLSModel*, double*)*, double (%struct.LLSModel*, double*, i32)*, [8 x i8] }

@.str = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [69 x i8] c"lpc_type == FF_LPC_TYPE_CHOLESKY || lpc_type == FF_LPC_TYPE_LEVINSON\00", align 1
@.str.2 = private unnamed_addr constant [17 x i8] c"libavcodec/lpc.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ff_lpc_calc_ref_coefs(%struct.LPCContext* %s, i32* %samples, i32 %order, double* %ref) #0 !dbg !20 {
entry:
  %s.addr = alloca %struct.LPCContext*, align 8
  %samples.addr = alloca i32*, align 8
  %order.addr = alloca i32, align 4
  %ref.addr = alloca double*, align 8
  %autoc = alloca [33 x double], align 16
  store %struct.LPCContext* %s, %struct.LPCContext** %s.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--lpc.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFLPCType", file: !4, line: 43, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "FF_LPC_TYPE_DEFAULT", value: -1)
!7 = !DIEnumerator(name: "FF_LPC_TYPE_NONE", value: 0)
!8 = !DIEnumerator(name: "FF_LPC_TYPE_FIXED", value: 1)
!9 = !DIEnumerator(name: "FF_LPC_TYPE_LEVINSON", value: 2)
!10 = !DIEnumerator(name: "FF_LPC_TYPE_CHOLESKY", value: 3)
!11 = !DIEnumerator(name: "FF_LPC_TYPE_NB", value: 4)
!12 = !{!13, !14, !15, !16}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPC_TYPE_U", file: !4, line: 124, baseType: !16)
!16 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!20 = distinct !DISubprogram(name: "ff_lpc_calc_ref_coefs", scope: !21, file: !21, line: 159, type: !22, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !78)
!21 = !DIFile(filename: "libavcodec/lpc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !25, !39, !24, !33}
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPCContext", file: !4, line: 87, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LPCContext", file: !4, line: 52, size: 302080, align: 256, elements: !28)
!28 = !{!29, !30, !31, !32, !34, !35, !43, !49}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !27, file: !4, line: 53, baseType: !24, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !27, file: !4, line: 54, baseType: !24, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_type", scope: !27, file: !4, line: 55, baseType: !3, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_buffer", scope: !27, file: !4, line: 56, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "windowed_samples", scope: !27, file: !4, line: 57, baseType: !33, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_apply_welch_window", scope: !27, file: !4, line: 67, baseType: !36, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !24, !33}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !42, line: 38, baseType: !24)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_compute_autocorr", scope: !27, file: !4, line: 82, baseType: !44, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47, !24, !24, !33}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "lls_models", scope: !27, file: !4, line: 86, baseType: !50, size: 301568, align: 256, offset: 512)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 301568, align: 256, elements: !76)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLSModel", file: !52, line: 58, baseType: !53)
!52 = !DIFile(filename: "./libavutil/lls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LLSModel", file: !52, line: 38, size: 150784, align: 256, elements: !54)
!54 = !{!55, !59, !63, !66, !67, !72}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "covariance", scope: !53, file: !52, line: 39, baseType: !56, size: 82944, align: 64)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 82944, align: 64, elements: !57)
!57 = !{!58, !58}
!58 = !DISubrange(count: 36)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !53, file: !52, line: 40, baseType: !60, size: 65536, align: 64, offset: 82944)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 65536, align: 64, elements: !61)
!61 = !{!62, !62}
!62 = !DISubrange(count: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !53, file: !52, line: 41, baseType: !64, size: 2048, align: 64, offset: 148480)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 64, elements: !65)
!65 = !{!62}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "indep_count", scope: !53, file: !52, line: 42, baseType: !24, size: 32, align: 32, offset: 150528)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "update_lls", scope: !53, file: !52, line: 50, baseType: !68, size: 64, align: 64, offset: 150592)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !47}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate_lls", scope: !53, file: !52, line: 57, baseType: !73, size: 64, align: 64, offset: 150656)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!16, !71, !47, !24}
!76 = !{!77}
!77 = !DISubrange(count: 2)
!78 = !{}
!79 = !DILocalVariable(name: "s", arg: 1, scope: !20, file: !21, line: 159, type: !25)
!80 = !DIExpression()
!81 = !DILocation(line: 159, column: 39, scope: !20)
!82 = !DILocalVariable(name: "samples", arg: 2, scope: !20, file: !21, line: 160, type: !39)
!83 = !DILocation(line: 160, column: 42, scope: !20)
!84 = !DILocalVariable(name: "order", arg: 3, scope: !20, file: !21, line: 160, type: !24)
!85 = !DILocation(line: 160, column: 55, scope: !20)
!86 = !DILocalVariable(name: "ref", arg: 4, scope: !20, file: !21, line: 160, type: !33)
!87 = !DILocation(line: 160, column: 70, scope: !20)
!88 = !DILocalVariable(name: "autoc", scope: !20, file: !21, line: 162, type: !89)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2112, align: 64, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 33)
!92 = !DILocation(line: 162, column: 12, scope: !20)
!93 = !DILocation(line: 164, column: 5, scope: !20)
!94 = !DILocation(line: 164, column: 8, scope: !20)
!95 = !DILocation(line: 164, column: 31, scope: !20)
!96 = !DILocation(line: 164, column: 40, scope: !20)
!97 = !DILocation(line: 164, column: 43, scope: !20)
!98 = !DILocation(line: 164, column: 54, scope: !20)
!99 = !DILocation(line: 164, column: 57, scope: !20)
!100 = !DILocation(line: 165, column: 5, scope: !20)
!101 = !DILocation(line: 165, column: 8, scope: !20)
!102 = !DILocation(line: 165, column: 29, scope: !20)
!103 = !DILocation(line: 165, column: 32, scope: !20)
!104 = !DILocation(line: 165, column: 50, scope: !20)
!105 = !DILocation(line: 165, column: 53, scope: !20)
!106 = !DILocation(line: 165, column: 64, scope: !20)
!107 = !DILocation(line: 165, column: 71, scope: !20)
!108 = !DILocation(line: 166, column: 23, scope: !20)
!109 = !DILocation(line: 166, column: 30, scope: !20)
!110 = !DILocation(line: 166, column: 37, scope: !20)
!111 = !DILocation(line: 166, column: 5, scope: !20)
!112 = !DILocation(line: 168, column: 12, scope: !20)
!113 = !DILocation(line: 168, column: 5, scope: !20)
!114 = distinct !DISubprogram(name: "compute_ref_coefs", scope: !4, file: !4, line: 135, type: !115, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !78)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !24, !120, !120}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPC_TYPE", file: !4, line: 123, baseType: !16)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!121 = !DILocalVariable(name: "autoc", arg: 1, scope: !114, file: !4, line: 135, type: !117)
!122 = !DILocation(line: 135, column: 54, scope: !114)
!123 = !DILocalVariable(name: "max_order", arg: 2, scope: !114, file: !4, line: 135, type: !24)
!124 = !DILocation(line: 135, column: 65, scope: !114)
!125 = !DILocalVariable(name: "ref", arg: 3, scope: !114, file: !4, line: 136, type: !120)
!126 = !DILocation(line: 136, column: 48, scope: !114)
!127 = !DILocalVariable(name: "error", arg: 4, scope: !114, file: !4, line: 136, type: !120)
!128 = !DILocation(line: 136, column: 63, scope: !114)
!129 = !DILocalVariable(name: "i", scope: !114, file: !4, line: 138, type: !24)
!130 = !DILocation(line: 138, column: 9, scope: !114)
!131 = !DILocalVariable(name: "j", scope: !114, file: !4, line: 138, type: !24)
!132 = !DILocation(line: 138, column: 12, scope: !114)
!133 = !DILocalVariable(name: "err", scope: !114, file: !4, line: 139, type: !119)
!134 = !DILocation(line: 139, column: 14, scope: !114)
