; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vc1dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--vc1dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVProfile = type { i32, i8* }
%struct.AVCodecHWConfigInternal = type { %struct.AVCodecHWConfig, %struct.AVHWAccel* }
%struct.AVCodecHWConfig = type { i32, i32, i32 }
%struct.AVHWAccel = type { i8*, i32, i32, i32, i32, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, i32 (%struct.AVCodecContext*, i32, i8*, i32)*, i32 (%struct.AVCodecContext*, i8*, i32)*, i32 (%struct.AVCodecContext*)*, i32, void (%struct.MpegEncContext*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*)*, i32, i32, i32 (%struct.AVCodecContext*, %struct.AVBufferRef*)* }

!912 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!913 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922}
!916 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!917 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!918 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!919 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!920 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!921 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!922 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !924, line: 123, size: 32, align: 32, elements: !925)
!924 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = !{!926, !927, !928, !929}
!926 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!927 = !DIEnumerator(name: "FMT_H261", value: 1)
!928 = !DIEnumerator(name: "FMT_H263", value: 2)
!929 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !931, line: 37, size: 32, align: 32, elements: !932)
!931 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!932 = !{!933, !934, !935, !936, !937, !938}
!933 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!934 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!935 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!936 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!937 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!938 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameCodingMode", file: !940, line: 148, size: 32, align: 32, elements: !941)
!940 = !DIFile(filename: "libavcodec/vc1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!941 = !{!942, !943, !944}
!942 = !DIEnumerator(name: "PROGRESSIVE", value: 0)
!943 = !DIEnumerator(name: "ILACE_FRAME", value: 1)
!944 = !DIEnumerator(name: "ILACE_FIELD", value: 2)
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Profile", file: !946, line: 48, size: 32, align: 32, elements: !947)
!946 = !DIFile(filename: "libavcodec/vc1_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!947 = !{!948, !949, !950, !951}
!948 = !DIEnumerator(name: "PROFILE_SIMPLE", value: 0)
!949 = !DIEnumerator(name: "PROFILE_MAIN", value: 1)
!950 = !DIEnumerator(name: "PROFILE_COMPLEX", value: 2)
!951 = !DIEnumerator(name: "PROFILE_ADVANCED", value: 3)
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VC1Code", file: !946, line: 33, size: 32, align: 32, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960}
!954 = !DIEnumerator(name: "VC1_CODE_RES0", value: 256)
!955 = !DIEnumerator(name: "VC1_CODE_ENDOFSEQ", value: 266)
!956 = !DIEnumerator(name: "VC1_CODE_SLICE", value: 267)
!957 = !DIEnumerator(name: "VC1_CODE_FIELD", value: 268)
!958 = !DIEnumerator(name: "VC1_CODE_FRAME", value: 269)
!959 = !DIEnumerator(name: "VC1_CODE_ENTRYPOINT", value: 270)
!960 = !DIEnumerator(name: "VC1_CODE_SEQHDR", value: 271)
!961 = !{!962, !971, !970, !972, !974}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !965, line: 221, size: 32, align: 8, elements: !966)
!965 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !{!967}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !964, file: !965, line: 221, baseType: !968, size: 32, align: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !969, line: 51, baseType: !970)
!969 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!970 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!971 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !969, line: 48, baseType: !973)
!973 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!975 = !{!976, !2644, !2645, !2646, !2647}
!976 = distinct !DIGlobalVariable(name: "ff_vc1_decoder", scope: !0, file: !977, line: 1191, type: !978, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_vc1_decoder)
!977 = !DIFile(filename: "libavcodec/vc1dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !57, line: 3610, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !980)
!980 = !{!981, !985, !986, !987, !988, !989, !998, !1001, !1004, !1007, !1012, !1013, !1088, !1096, !1097, !1098, !1100, !2546, !2552, !2560, !2564, !2565, !2602, !2606, !2610, !2611, !2615, !2619, !2620, !2624, !2625, !2626}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !979, file: !57, line: 3475, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !979, file: !57, line: 3480, baseType: !982, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !979, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !979, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !979, file: !57, line: 3487, baseType: !971, size: 32, align: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !979, file: !57, line: 3488, baseType: !990, size: 64, align: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !993, line: 61, baseType: !994)
!993 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !993, line: 58, size: 64, align: 32, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !994, file: !993, line: 59, baseType: !971, size: 32, align: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !994, file: !993, line: 60, baseType: !971, size: 32, align: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !979, file: !57, line: 3489, baseType: !999, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !979, file: !57, line: 3490, baseType: !1002, size: 64, align: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !979, file: !57, line: 3491, baseType: !1005, size: 64, align: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !979, file: !57, line: 3492, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !969, line: 55, baseType: !1011)
!1011 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !979, file: !57, line: 3493, baseType: !972, size: 8, align: 8, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !979, file: !57, line: 3494, baseType: !1014, size: 64, align: 64, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1024, !1047, !1048, !1049, !1050, !1054, !1060, !1062, !1066}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1017, file: !26, line: 72, baseType: !982, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1017, file: !26, line: 78, baseType: !1021, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!982, !974}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1017, file: !26, line: 85, baseType: !1025, size: 64, align: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1043, !1044, !1045, !1046}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !4, line: 247, baseType: !982, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1027, file: !4, line: 253, baseType: !982, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1027, file: !4, line: 259, baseType: !971, size: 32, align: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1027, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1027, file: !4, line: 271, baseType: !1034, size: 64, align: 64, offset: 192)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1027, file: !4, line: 265, size: 64, align: 64, elements: !1035)
!1035 = !{!1036, !1039, !1041, !1042}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1034, file: !4, line: 266, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !969, line: 40, baseType: !1038)
!1038 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1034, file: !4, line: 267, baseType: !1040, size: 64, align: 64)
!1040 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1034, file: !4, line: 268, baseType: !982, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1034, file: !4, line: 270, baseType: !992, size: 64, align: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1027, file: !4, line: 272, baseType: !1040, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1027, file: !4, line: 273, baseType: !1040, size: 64, align: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1027, file: !4, line: 275, baseType: !971, size: 32, align: 32, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1027, file: !4, line: 300, baseType: !982, size: 64, align: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1017, file: !26, line: 93, baseType: !971, size: 32, align: 32, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1017, file: !26, line: 99, baseType: !971, size: 32, align: 32, offset: 224)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1017, file: !26, line: 108, baseType: !971, size: 32, align: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1017, file: !26, line: 113, baseType: !1051, size: 64, align: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!974, !974, !974}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1017, file: !26, line: 123, baseType: !1055, size: 64, align: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!1058, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1017, file: !26, line: 130, baseType: !1061, size: 32, align: 32, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1017, file: !26, line: 136, baseType: !1063, size: 64, align: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!1061, !974}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1017, file: !26, line: 142, baseType: !1067, size: 64, align: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!971, !1070, !974, !982, !971}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1073)
!1073 = !{!1074, !1086, !1087}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1072, file: !4, line: 360, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1078, file: !4, line: 307, baseType: !982, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1078, file: !4, line: 313, baseType: !1040, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1078, file: !4, line: 313, baseType: !1040, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1078, file: !4, line: 318, baseType: !1040, size: 64, align: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1078, file: !4, line: 318, baseType: !1040, size: 64, align: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1078, file: !4, line: 323, baseType: !971, size: 32, align: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1072, file: !4, line: 364, baseType: !971, size: 32, align: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1072, file: !4, line: 368, baseType: !971, size: 32, align: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !979, file: !57, line: 3495, baseType: !1089, size: 64, align: 64, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1092, file: !57, line: 3402, baseType: !971, size: 32, align: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !57, line: 3403, baseType: !982, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !979, file: !57, line: 3507, baseType: !982, size: 64, align: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !979, file: !57, line: 3516, baseType: !971, size: 32, align: 32, offset: 832)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !979, file: !57, line: 3517, baseType: !1099, size: 64, align: 64, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !979, file: !57, line: 3527, baseType: !1101, size: 64, align: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!971, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1114, !1115, !1116, !1117, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1397, !1401, !1402, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2484, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1106, file: !57, line: 1561, baseType: !1014, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1106, file: !57, line: 1562, baseType: !971, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1106, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1106, file: !57, line: 1565, baseType: !1112, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1106, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1106, file: !57, line: 1581, baseType: !970, size: 32, align: 32, offset: 224)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1106, file: !57, line: 1583, baseType: !974, size: 64, align: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1106, file: !57, line: 1591, baseType: !1118, size: 64, align: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1120, line: 129, size: 1664, align: 64, elements: !1121)
!1120 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1121 = !{!1122, !1123, !1124, !1125, !1223, !1244, !1245, !1274, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1119, file: !1120, line: 136, baseType: !971, size: 32, align: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1119, file: !1120, line: 151, baseType: !971, size: 32, align: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1119, file: !1120, line: 157, baseType: !971, size: 32, align: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1119, file: !1120, line: 159, baseType: !1126, size: 64, align: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1129)
!1129 = !{!1130, !1135, !1137, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1175, !1177, !1178, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1219, !1220, !1221, !1222}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !780, line: 282, baseType: !1131, size: 512, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 512, align: 64, elements: !1133)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1133 = !{!1134}
!1134 = !DISubrange(count: 8)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1128, file: !780, line: 299, baseType: !1136, size: 256, align: 32, offset: 512)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, align: 32, elements: !1133)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1128, file: !780, line: 315, baseType: !1138, size: 64, align: 64, offset: 768)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1128, file: !780, line: 326, baseType: !971, size: 32, align: 32, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1128, file: !780, line: 326, baseType: !971, size: 32, align: 32, offset: 864)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1128, file: !780, line: 334, baseType: !971, size: 32, align: 32, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1128, file: !780, line: 341, baseType: !971, size: 32, align: 32, offset: 928)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1128, file: !780, line: 346, baseType: !971, size: 32, align: 32, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1128, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1128, file: !780, line: 356, baseType: !992, size: 64, align: 32, offset: 1024)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1128, file: !780, line: 361, baseType: !1037, size: 64, align: 64, offset: 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1128, file: !780, line: 369, baseType: !1037, size: 64, align: 64, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1128, file: !780, line: 377, baseType: !1037, size: 64, align: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1128, file: !780, line: 382, baseType: !971, size: 32, align: 32, offset: 1280)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1128, file: !780, line: 386, baseType: !971, size: 32, align: 32, offset: 1312)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1128, file: !780, line: 391, baseType: !971, size: 32, align: 32, offset: 1344)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1128, file: !780, line: 396, baseType: !974, size: 64, align: 64, offset: 1408)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1128, file: !780, line: 403, baseType: !1154, size: 512, align: 64, offset: 1472)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 512, align: 64, elements: !1133)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1128, file: !780, line: 410, baseType: !971, size: 32, align: 32, offset: 1984)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1128, file: !780, line: 415, baseType: !971, size: 32, align: 32, offset: 2016)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1128, file: !780, line: 420, baseType: !971, size: 32, align: 32, offset: 2048)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1128, file: !780, line: 425, baseType: !971, size: 32, align: 32, offset: 2080)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1128, file: !780, line: 435, baseType: !1037, size: 64, align: 64, offset: 2112)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1128, file: !780, line: 440, baseType: !971, size: 32, align: 32, offset: 2176)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1128, file: !780, line: 445, baseType: !1010, size: 64, align: 64, offset: 2240)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1128, file: !780, line: 459, baseType: !1163, size: 512, align: 64, offset: 2304)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 512, align: 64, elements: !1133)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1166, line: 94, baseType: !1167)
!1166 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1166, line: 81, size: 192, align: 64, elements: !1168)
!1168 = !{!1169, !1173, !1174}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1167, file: !1166, line: 82, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1166, line: 73, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1166, line: 73, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !1166, line: 89, baseType: !1132, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !1166, line: 93, baseType: !971, size: 32, align: 32, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1128, file: !780, line: 473, baseType: !1176, size: 64, align: 64, offset: 2816)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1128, file: !780, line: 477, baseType: !971, size: 32, align: 32, offset: 2880)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1128, file: !780, line: 479, baseType: !1179, size: 64, align: 64, offset: 2944)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1192}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1182, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !780, line: 203, baseType: !1132, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1182, file: !780, line: 204, baseType: !971, size: 32, align: 32, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1182, file: !780, line: 205, baseType: !1188, size: 64, align: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1190, line: 86, baseType: !1191)
!1190 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1190, line: 86, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1182, file: !780, line: 206, baseType: !1164, size: 64, align: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1128, file: !780, line: 480, baseType: !971, size: 32, align: 32, offset: 3008)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !780, line: 505, baseType: !971, size: 32, align: 32, offset: 3040)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1128, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1128, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1128, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1128, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1128, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1128, file: !780, line: 532, baseType: !1037, size: 64, align: 64, offset: 3264)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1128, file: !780, line: 539, baseType: !1037, size: 64, align: 64, offset: 3328)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1128, file: !780, line: 547, baseType: !1037, size: 64, align: 64, offset: 3392)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1128, file: !780, line: 554, baseType: !1188, size: 64, align: 64, offset: 3456)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1128, file: !780, line: 563, baseType: !971, size: 32, align: 32, offset: 3520)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1128, file: !780, line: 572, baseType: !971, size: 32, align: 32, offset: 3552)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1128, file: !780, line: 581, baseType: !971, size: 32, align: 32, offset: 3584)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1128, file: !780, line: 588, baseType: !1208, size: 64, align: 64, offset: 3648)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !969, line: 36, baseType: !1210)
!1210 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1128, file: !780, line: 593, baseType: !971, size: 32, align: 32, offset: 3712)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1128, file: !780, line: 596, baseType: !971, size: 32, align: 32, offset: 3744)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1128, file: !780, line: 599, baseType: !1164, size: 64, align: 64, offset: 3776)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1128, file: !780, line: 605, baseType: !1164, size: 64, align: 64, offset: 3840)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1128, file: !780, line: 616, baseType: !1164, size: 64, align: 64, offset: 3904)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1128, file: !780, line: 626, baseType: !1217, size: 64, align: 64, offset: 3968)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1218, line: 216, baseType: !1011)
!1218 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1128, file: !780, line: 627, baseType: !1217, size: 64, align: 64, offset: 4032)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1128, file: !780, line: 628, baseType: !1217, size: 64, align: 64, offset: 4096)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1128, file: !780, line: 629, baseType: !1217, size: 64, align: 64, offset: 4160)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1128, file: !780, line: 645, baseType: !1164, size: 64, align: 64, offset: 4224)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1119, file: !1120, line: 161, baseType: !1224, size: 64, align: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1120, line: 117, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1120, line: 100, size: 832, align: 64, elements: !1227)
!1227 = !{!1228, !1235, !1236, !1237, !1238, !1239, !1241, !1242, !1243}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1226, file: !1120, line: 105, baseType: !1229, size: 256, align: 64)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1230, size: 256, align: 64, elements: !1233)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1166, line: 238, baseType: !1232)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1166, line: 238, flags: DIFlagFwdDecl)
!1233 = !{!1234}
!1234 = !DISubrange(count: 4)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1226, file: !1120, line: 110, baseType: !971, size: 32, align: 32, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1226, file: !1120, line: 111, baseType: !971, size: 32, align: 32, offset: 288)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1226, file: !1120, line: 111, baseType: !971, size: 32, align: 32, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1226, file: !1120, line: 112, baseType: !1136, size: 256, align: 32, offset: 352)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1226, file: !1120, line: 113, baseType: !1240, size: 128, align: 32, offset: 608)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, align: 32, elements: !1233)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1226, file: !1120, line: 114, baseType: !971, size: 32, align: 32, offset: 736)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1226, file: !1120, line: 115, baseType: !971, size: 32, align: 32, offset: 768)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1226, file: !1120, line: 116, baseType: !971, size: 32, align: 32, offset: 800)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1119, file: !1120, line: 163, baseType: !974, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1119, file: !1120, line: 165, baseType: !1246, size: 128, align: 64, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1120, line: 122, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1120, line: 119, size: 128, align: 64, elements: !1248)
!1248 = !{!1249, !1273}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1247, file: !1120, line: 120, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1269, !1270, !1271, !1272}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1252, file: !57, line: 1451, baseType: !1164, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1252, file: !57, line: 1461, baseType: !1037, size: 64, align: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1252, file: !57, line: 1467, baseType: !1037, size: 64, align: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !57, line: 1468, baseType: !1132, size: 64, align: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1252, file: !57, line: 1469, baseType: !971, size: 32, align: 32, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1252, file: !57, line: 1470, baseType: !971, size: 32, align: 32, offset: 288)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1252, file: !57, line: 1474, baseType: !971, size: 32, align: 32, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1252, file: !57, line: 1479, baseType: !1262, size: 64, align: 64, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1264, file: !57, line: 1412, baseType: !1132, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1264, file: !57, line: 1413, baseType: !971, size: 32, align: 32, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1264, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1252, file: !57, line: 1480, baseType: !971, size: 32, align: 32, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1252, file: !57, line: 1486, baseType: !1037, size: 64, align: 64, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1252, file: !57, line: 1488, baseType: !1037, size: 64, align: 64, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1252, file: !57, line: 1497, baseType: !1037, size: 64, align: 64, offset: 640)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1247, file: !1120, line: 121, baseType: !1126, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1119, file: !1120, line: 166, baseType: !1275, size: 128, align: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1120, line: 127, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1120, line: 124, size: 128, align: 64, elements: !1277)
!1277 = !{!1278, !1351}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1276, file: !1120, line: 125, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1283)
!1283 = !{!1284, !1285, !1309, !1313, !1314, !1348, !1349, !1350}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1282, file: !57, line: 5751, baseType: !1014, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1282, file: !57, line: 5756, baseType: !1286, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1294, !1295, !1296, !1300, !1304, !1308}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1288, file: !57, line: 5797, baseType: !982, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1288, file: !57, line: 5804, baseType: !1292, size: 64, align: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1288, file: !57, line: 5815, baseType: !1014, size: 64, align: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1288, file: !57, line: 5825, baseType: !971, size: 32, align: 32, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1288, file: !57, line: 5826, baseType: !1297, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!971, !1280}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1288, file: !57, line: 5827, baseType: !1301, size: 64, align: 64, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!971, !1280, !1250}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1288, file: !57, line: 5828, baseType: !1305, size: 64, align: 64, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{null, !1280}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1288, file: !57, line: 5829, baseType: !1305, size: 64, align: 64, offset: 448)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1282, file: !57, line: 5762, baseType: !1310, size: 64, align: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1312)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1282, file: !57, line: 5768, baseType: !974, size: 64, align: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1282, file: !57, line: 5775, baseType: !1315, size: 64, align: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1317, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1317, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1317, file: !57, line: 3948, baseType: !968, size: 32, align: 32, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1317, file: !57, line: 3958, baseType: !1132, size: 64, align: 64, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1317, file: !57, line: 3962, baseType: !971, size: 32, align: 32, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1317, file: !57, line: 3968, baseType: !971, size: 32, align: 32, offset: 224)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1317, file: !57, line: 3973, baseType: !1037, size: 64, align: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1317, file: !57, line: 3986, baseType: !971, size: 32, align: 32, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1317, file: !57, line: 3999, baseType: !971, size: 32, align: 32, offset: 352)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1317, file: !57, line: 4004, baseType: !971, size: 32, align: 32, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1317, file: !57, line: 4005, baseType: !971, size: 32, align: 32, offset: 416)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1317, file: !57, line: 4010, baseType: !971, size: 32, align: 32, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1317, file: !57, line: 4011, baseType: !971, size: 32, align: 32, offset: 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1317, file: !57, line: 4020, baseType: !992, size: 64, align: 32, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1317, file: !57, line: 4025, baseType: !894, size: 32, align: 32, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1317, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1317, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1317, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1317, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1317, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1317, file: !57, line: 4039, baseType: !971, size: 32, align: 32, offset: 768)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1317, file: !57, line: 4046, baseType: !1010, size: 64, align: 64, offset: 832)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1317, file: !57, line: 4050, baseType: !971, size: 32, align: 32, offset: 896)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1317, file: !57, line: 4054, baseType: !971, size: 32, align: 32, offset: 928)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1317, file: !57, line: 4061, baseType: !971, size: 32, align: 32, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1317, file: !57, line: 4065, baseType: !971, size: 32, align: 32, offset: 992)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1317, file: !57, line: 4073, baseType: !971, size: 32, align: 32, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1317, file: !57, line: 4080, baseType: !971, size: 32, align: 32, offset: 1056)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1317, file: !57, line: 4084, baseType: !971, size: 32, align: 32, offset: 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1282, file: !57, line: 5781, baseType: !1315, size: 64, align: 64, offset: 320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1282, file: !57, line: 5787, baseType: !992, size: 64, align: 32, offset: 384)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1282, file: !57, line: 5793, baseType: !992, size: 64, align: 32, offset: 448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1276, file: !1120, line: 126, baseType: !971, size: 32, align: 32, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1119, file: !1120, line: 172, baseType: !1250, size: 64, align: 64, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1119, file: !1120, line: 177, baseType: !1132, size: 64, align: 64, offset: 640)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1119, file: !1120, line: 178, baseType: !970, size: 32, align: 32, offset: 704)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1119, file: !1120, line: 180, baseType: !974, size: 64, align: 64, offset: 768)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1119, file: !1120, line: 185, baseType: !971, size: 32, align: 32, offset: 832)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1119, file: !1120, line: 190, baseType: !974, size: 64, align: 64, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1119, file: !1120, line: 195, baseType: !971, size: 32, align: 32, offset: 960)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1119, file: !1120, line: 200, baseType: !1250, size: 64, align: 64, offset: 1024)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1119, file: !1120, line: 201, baseType: !971, size: 32, align: 32, offset: 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1119, file: !1120, line: 202, baseType: !1126, size: 64, align: 64, offset: 1152)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1119, file: !1120, line: 203, baseType: !971, size: 32, align: 32, offset: 1216)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1119, file: !1120, line: 205, baseType: !971, size: 32, align: 32, offset: 1248)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1119, file: !1120, line: 206, baseType: !971, size: 32, align: 32, offset: 1280)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1119, file: !1120, line: 209, baseType: !1217, size: 64, align: 64, offset: 1344)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1119, file: !1120, line: 212, baseType: !1217, size: 64, align: 64, offset: 1408)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1119, file: !1120, line: 213, baseType: !1126, size: 64, align: 64, offset: 1472)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1119, file: !1120, line: 215, baseType: !971, size: 32, align: 32, offset: 1536)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1119, file: !1120, line: 217, baseType: !971, size: 32, align: 32, offset: 1568)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1119, file: !1120, line: 220, baseType: !971, size: 32, align: 32, offset: 1600)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1106, file: !57, line: 1598, baseType: !974, size: 64, align: 64, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1106, file: !57, line: 1606, baseType: !1037, size: 64, align: 64, offset: 448)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1106, file: !57, line: 1614, baseType: !971, size: 32, align: 32, offset: 512)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1106, file: !57, line: 1622, baseType: !971, size: 32, align: 32, offset: 544)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1106, file: !57, line: 1628, baseType: !971, size: 32, align: 32, offset: 576)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !57, line: 1636, baseType: !971, size: 32, align: 32, offset: 608)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1106, file: !57, line: 1643, baseType: !971, size: 32, align: 32, offset: 640)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1106, file: !57, line: 1657, baseType: !1132, size: 64, align: 64, offset: 704)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1106, file: !57, line: 1658, baseType: !971, size: 32, align: 32, offset: 768)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1106, file: !57, line: 1679, baseType: !992, size: 64, align: 32, offset: 800)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1106, file: !57, line: 1688, baseType: !971, size: 32, align: 32, offset: 864)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1106, file: !57, line: 1712, baseType: !971, size: 32, align: 32, offset: 896)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1106, file: !57, line: 1729, baseType: !971, size: 32, align: 32, offset: 928)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1106, file: !57, line: 1729, baseType: !971, size: 32, align: 32, offset: 960)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1106, file: !57, line: 1744, baseType: !971, size: 32, align: 32, offset: 992)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1106, file: !57, line: 1744, baseType: !971, size: 32, align: 32, offset: 1024)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1106, file: !57, line: 1751, baseType: !971, size: 32, align: 32, offset: 1056)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1106, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1106, file: !57, line: 1791, baseType: !1390, size: 64, align: 64, offset: 1152)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{null, !1393, !1394, !1396, !971, !971, !971}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1106, file: !57, line: 1808, baseType: !1398, size: 64, align: 64, offset: 1216)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!516, !1393, !999}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1106, file: !57, line: 1816, baseType: !971, size: 32, align: 32, offset: 1280)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1106, file: !57, line: 1825, baseType: !1403, size: 32, align: 32, offset: 1312)
!1403 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1106, file: !57, line: 1830, baseType: !971, size: 32, align: 32, offset: 1344)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1106, file: !57, line: 1838, baseType: !1403, size: 32, align: 32, offset: 1376)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1106, file: !57, line: 1846, baseType: !971, size: 32, align: 32, offset: 1408)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1106, file: !57, line: 1851, baseType: !971, size: 32, align: 32, offset: 1440)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1106, file: !57, line: 1861, baseType: !1403, size: 32, align: 32, offset: 1472)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1106, file: !57, line: 1868, baseType: !1403, size: 32, align: 32, offset: 1504)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1106, file: !57, line: 1875, baseType: !1403, size: 32, align: 32, offset: 1536)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1106, file: !57, line: 1882, baseType: !1403, size: 32, align: 32, offset: 1568)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1106, file: !57, line: 1889, baseType: !1403, size: 32, align: 32, offset: 1600)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1106, file: !57, line: 1896, baseType: !1403, size: 32, align: 32, offset: 1632)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1106, file: !57, line: 1903, baseType: !1403, size: 32, align: 32, offset: 1664)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1106, file: !57, line: 1910, baseType: !971, size: 32, align: 32, offset: 1696)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1106, file: !57, line: 1915, baseType: !971, size: 32, align: 32, offset: 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1106, file: !57, line: 1926, baseType: !1396, size: 64, align: 64, offset: 1792)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1106, file: !57, line: 1935, baseType: !992, size: 64, align: 32, offset: 1856)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1106, file: !57, line: 1942, baseType: !971, size: 32, align: 32, offset: 1920)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1106, file: !57, line: 1948, baseType: !971, size: 32, align: 32, offset: 1952)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1106, file: !57, line: 1954, baseType: !971, size: 32, align: 32, offset: 1984)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1106, file: !57, line: 1960, baseType: !971, size: 32, align: 32, offset: 2016)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1106, file: !57, line: 1984, baseType: !971, size: 32, align: 32, offset: 2048)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1106, file: !57, line: 1991, baseType: !971, size: 32, align: 32, offset: 2080)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1106, file: !57, line: 1996, baseType: !971, size: 32, align: 32, offset: 2112)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1106, file: !57, line: 2004, baseType: !971, size: 32, align: 32, offset: 2144)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1106, file: !57, line: 2011, baseType: !971, size: 32, align: 32, offset: 2176)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1106, file: !57, line: 2018, baseType: !971, size: 32, align: 32, offset: 2208)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1106, file: !57, line: 2027, baseType: !971, size: 32, align: 32, offset: 2240)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1106, file: !57, line: 2034, baseType: !971, size: 32, align: 32, offset: 2272)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1106, file: !57, line: 2044, baseType: !971, size: 32, align: 32, offset: 2304)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1106, file: !57, line: 2054, baseType: !1433, size: 64, align: 64, offset: 2368)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !969, line: 49, baseType: !1435)
!1435 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1106, file: !57, line: 2061, baseType: !1433, size: 64, align: 64, offset: 2432)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1106, file: !57, line: 2066, baseType: !971, size: 32, align: 32, offset: 2496)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1106, file: !57, line: 2070, baseType: !971, size: 32, align: 32, offset: 2528)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1106, file: !57, line: 2078, baseType: !971, size: 32, align: 32, offset: 2560)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1106, file: !57, line: 2085, baseType: !971, size: 32, align: 32, offset: 2592)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1106, file: !57, line: 2092, baseType: !971, size: 32, align: 32, offset: 2624)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1106, file: !57, line: 2099, baseType: !971, size: 32, align: 32, offset: 2656)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1106, file: !57, line: 2106, baseType: !971, size: 32, align: 32, offset: 2688)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1106, file: !57, line: 2113, baseType: !971, size: 32, align: 32, offset: 2720)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1106, file: !57, line: 2120, baseType: !971, size: 32, align: 32, offset: 2752)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1106, file: !57, line: 2125, baseType: !971, size: 32, align: 32, offset: 2784)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1106, file: !57, line: 2133, baseType: !971, size: 32, align: 32, offset: 2816)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1106, file: !57, line: 2140, baseType: !971, size: 32, align: 32, offset: 2848)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1106, file: !57, line: 2145, baseType: !971, size: 32, align: 32, offset: 2880)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1106, file: !57, line: 2153, baseType: !971, size: 32, align: 32, offset: 2912)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1106, file: !57, line: 2158, baseType: !971, size: 32, align: 32, offset: 2944)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1106, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1106, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1106, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1106, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1106, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1106, file: !57, line: 2203, baseType: !971, size: 32, align: 32, offset: 3136)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1106, file: !57, line: 2209, baseType: !894, size: 32, align: 32, offset: 3168)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1106, file: !57, line: 2212, baseType: !971, size: 32, align: 32, offset: 3200)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1106, file: !57, line: 2213, baseType: !971, size: 32, align: 32, offset: 3232)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1106, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1106, file: !57, line: 2232, baseType: !971, size: 32, align: 32, offset: 3296)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1106, file: !57, line: 2243, baseType: !971, size: 32, align: 32, offset: 3328)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1106, file: !57, line: 2249, baseType: !971, size: 32, align: 32, offset: 3360)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1106, file: !57, line: 2256, baseType: !971, size: 32, align: 32, offset: 3392)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1106, file: !57, line: 2263, baseType: !1010, size: 64, align: 64, offset: 3456)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1106, file: !57, line: 2270, baseType: !1010, size: 64, align: 64, offset: 3520)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1106, file: !57, line: 2277, baseType: !902, size: 32, align: 32, offset: 3584)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1106, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1106, file: !57, line: 2367, baseType: !1471, size: 64, align: 64, offset: 3648)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!971, !1393, !1126, !971}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1106, file: !57, line: 2383, baseType: !971, size: 32, align: 32, offset: 3712)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1106, file: !57, line: 2386, baseType: !1403, size: 32, align: 32, offset: 3744)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1106, file: !57, line: 2387, baseType: !1403, size: 32, align: 32, offset: 3776)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1106, file: !57, line: 2394, baseType: !971, size: 32, align: 32, offset: 3808)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1106, file: !57, line: 2401, baseType: !971, size: 32, align: 32, offset: 3840)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1106, file: !57, line: 2408, baseType: !971, size: 32, align: 32, offset: 3872)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1106, file: !57, line: 2415, baseType: !971, size: 32, align: 32, offset: 3904)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1106, file: !57, line: 2422, baseType: !971, size: 32, align: 32, offset: 3936)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1106, file: !57, line: 2423, baseType: !1483, size: 64, align: 64, offset: 3968)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1490}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1485, file: !57, line: 827, baseType: !971, size: 32, align: 32)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1485, file: !57, line: 828, baseType: !971, size: 32, align: 32, offset: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1485, file: !57, line: 829, baseType: !971, size: 32, align: 32, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1485, file: !57, line: 830, baseType: !1403, size: 32, align: 32, offset: 96)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1106, file: !57, line: 2430, baseType: !1037, size: 64, align: 64, offset: 4032)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1106, file: !57, line: 2437, baseType: !1037, size: 64, align: 64, offset: 4096)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1106, file: !57, line: 2444, baseType: !1403, size: 32, align: 32, offset: 4160)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1106, file: !57, line: 2451, baseType: !1403, size: 32, align: 32, offset: 4192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1106, file: !57, line: 2458, baseType: !971, size: 32, align: 32, offset: 4224)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1106, file: !57, line: 2469, baseType: !971, size: 32, align: 32, offset: 4256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1106, file: !57, line: 2475, baseType: !971, size: 32, align: 32, offset: 4288)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1106, file: !57, line: 2481, baseType: !971, size: 32, align: 32, offset: 4320)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1106, file: !57, line: 2485, baseType: !971, size: 32, align: 32, offset: 4352)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1106, file: !57, line: 2489, baseType: !971, size: 32, align: 32, offset: 4384)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1106, file: !57, line: 2493, baseType: !971, size: 32, align: 32, offset: 4416)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1106, file: !57, line: 2501, baseType: !971, size: 32, align: 32, offset: 4448)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1106, file: !57, line: 2506, baseType: !971, size: 32, align: 32, offset: 4480)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1106, file: !57, line: 2510, baseType: !971, size: 32, align: 32, offset: 4512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1106, file: !57, line: 2514, baseType: !1037, size: 64, align: 64, offset: 4544)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1106, file: !57, line: 2528, baseType: !1507, size: 64, align: 64, offset: 4608)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1393, !974, !971, !971}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1106, file: !57, line: 2534, baseType: !971, size: 32, align: 32, offset: 4672)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1106, file: !57, line: 2545, baseType: !971, size: 32, align: 32, offset: 4704)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1106, file: !57, line: 2547, baseType: !971, size: 32, align: 32, offset: 4736)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1106, file: !57, line: 2549, baseType: !971, size: 32, align: 32, offset: 4768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1106, file: !57, line: 2551, baseType: !971, size: 32, align: 32, offset: 4800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1106, file: !57, line: 2553, baseType: !971, size: 32, align: 32, offset: 4832)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1106, file: !57, line: 2555, baseType: !971, size: 32, align: 32, offset: 4864)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1106, file: !57, line: 2557, baseType: !971, size: 32, align: 32, offset: 4896)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1106, file: !57, line: 2559, baseType: !971, size: 32, align: 32, offset: 4928)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1106, file: !57, line: 2563, baseType: !971, size: 32, align: 32, offset: 4960)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1106, file: !57, line: 2571, baseType: !1521, size: 64, align: 64, offset: 4992)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1106, file: !57, line: 2579, baseType: !1521, size: 64, align: 64, offset: 5056)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1106, file: !57, line: 2586, baseType: !971, size: 32, align: 32, offset: 5120)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1106, file: !57, line: 2615, baseType: !971, size: 32, align: 32, offset: 5152)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1106, file: !57, line: 2627, baseType: !971, size: 32, align: 32, offset: 5184)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1106, file: !57, line: 2637, baseType: !971, size: 32, align: 32, offset: 5216)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1106, file: !57, line: 2681, baseType: !971, size: 32, align: 32, offset: 5248)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1106, file: !57, line: 2709, baseType: !1037, size: 64, align: 64, offset: 5312)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1106, file: !57, line: 2716, baseType: !1530, size: 64, align: 64, offset: 5376)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1532)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1533)
!1533 = !{!1534, !1535, !1536, !1537, !1538, !1539, !1543, !1549, !1553, !1554, !1555, !1556, !2457, !2458, !2459, !2460, !2461}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1532, file: !57, line: 3642, baseType: !982, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1532, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1532, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1532, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1532, file: !57, line: 3669, baseType: !971, size: 32, align: 32, offset: 160)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1532, file: !57, line: 3682, baseType: !1540, size: 64, align: 64, offset: 192)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!971, !1104, !1126}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1532, file: !57, line: 3698, baseType: !1544, size: 64, align: 64, offset: 256)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!971, !1104, !1547, !968}
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1532, file: !57, line: 3712, baseType: !1550, size: 64, align: 64, offset: 320)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!971, !1104, !971, !1547, !968}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1532, file: !57, line: 3726, baseType: !1544, size: 64, align: 64, offset: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1532, file: !57, line: 3737, baseType: !1101, size: 64, align: 64, offset: 448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1532, file: !57, line: 3746, baseType: !971, size: 32, align: 32, offset: 512)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1532, file: !57, line: 3757, baseType: !1557, size: 64, align: 64, offset: 576)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{null, !1560}
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1562, line: 81, size: 86208, align: 64, elements: !1563)
!1562 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1563 = !{!1564, !1566, !1567, !1568, !1569, !1573, !1574, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1621, !1622, !1677, !1679, !1680, !1681, !1682, !1683, !1694, !1695, !1696, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1712, !1714, !1716, !1717, !1718, !1719, !1720, !1721, !1726, !1728, !1729, !1730, !1731, !1732, !1733, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1760, !1761, !1762, !1763, !1779, !1786, !1798, !1814, !1836, !1876, !1889, !1916, !1931, !1945, !1958, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1979, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1992, !1994, !1995, !1996, !1997, !1998, !1999, !2002, !2004, !2006, !2007, !2010, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2077, !2078, !2080, !2081, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2103, !2104, !2105, !2108, !2109, !2110, !2111, !2113, !2115, !2116, !2117, !2118, !2119, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2201, !2202, !2203, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2332, !2333, !2334, !2335, !2339, !2340, !2344, !2348, !2352, !2353, !2358, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2373, !2374, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2392, !2393, !2394, !2444, !2445, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1561, file: !1562, line: 82, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1561, file: !1562, line: 84, baseType: !971, size: 32, align: 32, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1561, file: !1562, line: 84, baseType: !971, size: 32, align: 32, offset: 96)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1561, file: !1562, line: 85, baseType: !971, size: 32, align: 32, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1561, file: !1562, line: 86, baseType: !1570, size: 384, align: 32, offset: 160)
!1570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 384, align: 32, elements: !1571)
!1571 = !{!1572}
!1572 = !DISubrange(count: 12)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1561, file: !1562, line: 87, baseType: !971, size: 32, align: 32, offset: 544)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1561, file: !1562, line: 90, baseType: !1575, size: 1088, align: 64, offset: 576)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !931, line: 35, baseType: !1576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !931, line: 31, size: 1088, align: 64, elements: !1577)
!1577 = !{!1578, !1579, !1583}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1576, file: !931, line: 32, baseType: !1547, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1576, file: !931, line: 33, baseType: !1580, size: 512, align: 8, offset: 64)
!1580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 512, align: 8, elements: !1581)
!1581 = !{!1582}
!1582 = !DISubrange(count: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1576, file: !931, line: 34, baseType: !1580, size: 512, align: 8, offset: 576)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1561, file: !1562, line: 91, baseType: !1575, size: 1088, align: 64, offset: 1664)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1561, file: !1562, line: 92, baseType: !1575, size: 1088, align: 64, offset: 2752)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1561, file: !1562, line: 93, baseType: !1575, size: 1088, align: 64, offset: 3840)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1561, file: !1562, line: 98, baseType: !1393, size: 64, align: 64, offset: 4928)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1561, file: !1562, line: 100, baseType: !971, size: 32, align: 32, offset: 4992)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1561, file: !1562, line: 100, baseType: !971, size: 32, align: 32, offset: 5024)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1561, file: !1562, line: 101, baseType: !971, size: 32, align: 32, offset: 5056)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1561, file: !1562, line: 102, baseType: !971, size: 32, align: 32, offset: 5088)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1561, file: !1562, line: 103, baseType: !1037, size: 64, align: 64, offset: 5120)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1561, file: !1562, line: 104, baseType: !923, size: 32, align: 32, offset: 5184)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1561, file: !1562, line: 105, baseType: !971, size: 32, align: 32, offset: 5216)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1561, file: !1562, line: 106, baseType: !971, size: 32, align: 32, offset: 5248)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1561, file: !1562, line: 109, baseType: !971, size: 32, align: 32, offset: 5280)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1561, file: !1562, line: 110, baseType: !971, size: 32, align: 32, offset: 5312)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1561, file: !1562, line: 112, baseType: !56, size: 32, align: 32, offset: 5344)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1561, file: !1562, line: 113, baseType: !971, size: 32, align: 32, offset: 5376)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1561, file: !1562, line: 114, baseType: !971, size: 32, align: 32, offset: 5408)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1561, file: !1562, line: 115, baseType: !971, size: 32, align: 32, offset: 5440)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1561, file: !1562, line: 116, baseType: !971, size: 32, align: 32, offset: 5472)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1561, file: !1562, line: 117, baseType: !971, size: 32, align: 32, offset: 5504)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1561, file: !1562, line: 118, baseType: !971, size: 32, align: 32, offset: 5536)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1561, file: !1562, line: 119, baseType: !971, size: 32, align: 32, offset: 5568)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1561, file: !1562, line: 120, baseType: !971, size: 32, align: 32, offset: 5600)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1561, file: !1562, line: 124, baseType: !971, size: 32, align: 32, offset: 5632)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1561, file: !1562, line: 125, baseType: !971, size: 32, align: 32, offset: 5664)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1561, file: !1562, line: 126, baseType: !971, size: 32, align: 32, offset: 5696)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1561, file: !1562, line: 127, baseType: !971, size: 32, align: 32, offset: 5728)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1561, file: !1562, line: 128, baseType: !971, size: 32, align: 32, offset: 5760)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1561, file: !1562, line: 129, baseType: !971, size: 32, align: 32, offset: 5792)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1561, file: !1562, line: 129, baseType: !971, size: 32, align: 32, offset: 5824)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1561, file: !1562, line: 130, baseType: !971, size: 32, align: 32, offset: 5856)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1561, file: !1562, line: 131, baseType: !971, size: 32, align: 32, offset: 5888)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1561, file: !1562, line: 132, baseType: !971, size: 32, align: 32, offset: 5920)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1561, file: !1562, line: 132, baseType: !971, size: 32, align: 32, offset: 5952)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1561, file: !1562, line: 133, baseType: !971, size: 32, align: 32, offset: 5984)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1561, file: !1562, line: 134, baseType: !1620, size: 64, align: 64, offset: 6016)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1218, line: 149, baseType: !1038)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1561, file: !1562, line: 135, baseType: !1620, size: 64, align: 64, offset: 6080)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1561, file: !1562, line: 136, baseType: !1623, size: 64, align: 64, offset: 6144)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1625, line: 91, baseType: !1626)
!1625 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1625, line: 45, size: 2624, align: 64, elements: !1627)
!1627 = !{!1628, !1630, !1641, !1642, !1643, !1645, !1651, !1652, !1654, !1655, !1656, !1657, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1626, file: !1625, line: 46, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1626, file: !1625, line: 47, baseType: !1631, size: 256, align: 64, offset: 64)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1632, line: 40, baseType: !1633)
!1632 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1632, line: 34, size: 256, align: 64, elements: !1634)
!1634 = !{!1635, !1636, !1640}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1633, file: !1632, line: 35, baseType: !1126, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1633, file: !1632, line: 36, baseType: !1637, size: 128, align: 64, offset: 64)
!1637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 128, align: 64, elements: !1638)
!1638 = !{!1639}
!1639 = !DISubrange(count: 2)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1633, file: !1632, line: 39, baseType: !1164, size: 64, align: 64, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1626, file: !1625, line: 49, baseType: !1164, size: 64, align: 64, offset: 320)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1626, file: !1625, line: 50, baseType: !1208, size: 64, align: 64, offset: 384)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1626, file: !1625, line: 52, baseType: !1644, size: 128, align: 64, offset: 448)
!1644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 128, align: 64, elements: !1638)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1626, file: !1625, line: 53, baseType: !1646, size: 128, align: 64, offset: 576)
!1646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1647, size: 128, align: 64, elements: !1638)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1649, size: 32, align: 16, elements: !1638)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !969, line: 37, baseType: !1650)
!1650 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1626, file: !1625, line: 55, baseType: !1164, size: 64, align: 64, offset: 704)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1626, file: !1625, line: 56, baseType: !1653, size: 64, align: 64, offset: 768)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1626, file: !1625, line: 58, baseType: !1164, size: 64, align: 64, offset: 832)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1626, file: !1625, line: 59, baseType: !1132, size: 64, align: 64, offset: 896)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1626, file: !1625, line: 61, baseType: !1644, size: 128, align: 64, offset: 960)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1626, file: !1625, line: 62, baseType: !1658, size: 128, align: 64, offset: 1088)
!1658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1208, size: 128, align: 64, elements: !1638)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1626, file: !1625, line: 64, baseType: !1164, size: 64, align: 64, offset: 1216)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1626, file: !1625, line: 65, baseType: !1433, size: 64, align: 64, offset: 1280)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1626, file: !1625, line: 67, baseType: !1164, size: 64, align: 64, offset: 1344)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1626, file: !1625, line: 68, baseType: !1433, size: 64, align: 64, offset: 1408)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1626, file: !1625, line: 70, baseType: !971, size: 32, align: 32, offset: 1472)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1626, file: !1625, line: 71, baseType: !971, size: 32, align: 32, offset: 1504)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1626, file: !1625, line: 73, baseType: !1164, size: 64, align: 64, offset: 1536)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1626, file: !1625, line: 74, baseType: !1132, size: 64, align: 64, offset: 1600)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1626, file: !1625, line: 76, baseType: !1164, size: 64, align: 64, offset: 1664)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1626, file: !1625, line: 77, baseType: !974, size: 64, align: 64, offset: 1728)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1626, file: !1625, line: 79, baseType: !971, size: 32, align: 32, offset: 1792)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1626, file: !1625, line: 81, baseType: !1037, size: 64, align: 64, offset: 1856)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1626, file: !1625, line: 82, baseType: !1037, size: 64, align: 64, offset: 1920)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1626, file: !1625, line: 84, baseType: !971, size: 32, align: 32, offset: 1984)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1626, file: !1625, line: 85, baseType: !971, size: 32, align: 32, offset: 2016)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1626, file: !1625, line: 87, baseType: !971, size: 32, align: 32, offset: 2048)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1626, file: !1625, line: 88, baseType: !971, size: 32, align: 32, offset: 2080)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1626, file: !1625, line: 90, baseType: !1154, size: 512, align: 64, offset: 2112)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1561, file: !1562, line: 137, baseType: !1678, size: 64, align: 64, offset: 6208)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_input_picture", scope: !1561, file: !1562, line: 138, baseType: !1678, size: 64, align: 64, offset: 6272)
