; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dv_profile.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--dv_profile.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVDVProfile = type { i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, [2 x %struct.AVRational], i32, i32, i8*, i32, [3 x i32], [5 x i32], [9 x i8]* }
%struct.AVRational = type { i32, i32 }

!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !4, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !235, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !235, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !235, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !891, line: 221, size: 32, align: 8, elements: !892)
!891 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !890, file: !891, line: 221, baseType: !894, size: 32, align: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 51, baseType: !896)
!895 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!896 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!897 = !{!898, !949, !953, !956, !960}
!898 = distinct !DIGlobalVariable(name: "dv_profiles", scope: !0, file: !899, line: 73, type: !900, isLocal: true, isDefinition: true, variable: [10 x %struct.AVDVProfile]* @dv_profiles)
!899 = !DIFile(filename: "libavcodec/dv_profile.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 9600, align: 64, elements: !947)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDVProfile", file: !903, line: 59, baseType: !904)
!903 = !DIFile(filename: "libavcodec/dv_profile.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDVProfile", file: !903, line: 39, size: 960, align: 64, elements: !905)
!905 = !{!906, !908, !909, !910, !911, !912, !919, !920, !921, !922, !926, !927, !928, !933, !934, !938, !942}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dsf", scope: !904, file: !903, line: 40, baseType: !907, size: 32, align: 32)
!907 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "video_stype", scope: !904, file: !903, line: 41, baseType: !907, size: 32, align: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !904, file: !903, line: 42, baseType: !907, size: 32, align: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "difseg_size", scope: !904, file: !903, line: 43, baseType: !907, size: 32, align: 32, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "n_difchan", scope: !904, file: !903, line: 44, baseType: !907, size: 32, align: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !904, file: !903, line: 45, baseType: !913, size: 64, align: 32, offset: 160)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !914, line: 61, baseType: !915)
!914 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !914, line: 58, size: 64, align: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !915, file: !914, line: 59, baseType: !907, size: 32, align: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !915, file: !914, line: 60, baseType: !907, size: 32, align: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ltc_divisor", scope: !904, file: !903, line: 46, baseType: !907, size: 32, align: 32, offset: 224)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !904, file: !903, line: 47, baseType: !907, size: 32, align: 32, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !904, file: !903, line: 48, baseType: !907, size: 32, align: 32, offset: 288)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !904, file: !903, line: 49, baseType: !923, size: 128, align: 32, offset: 320)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, align: 32, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 2)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !904, file: !903, line: 50, baseType: !3, size: 32, align: 32, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bpm", scope: !904, file: !903, line: 51, baseType: !907, size: 32, align: 32, offset: 480)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "block_sizes", scope: !904, file: !903, line: 52, baseType: !929, size: 64, align: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 48, baseType: !932)
!932 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "audio_stride", scope: !904, file: !903, line: 53, baseType: !907, size: 32, align: 32, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "audio_min_samples", scope: !904, file: !903, line: 54, baseType: !935, size: 96, align: 32, offset: 608)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 96, align: 32, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 3)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "audio_samples_dist", scope: !904, file: !903, line: 56, baseType: !939, size: 160, align: 32, offset: 704)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 160, align: 32, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 5)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "audio_shuffle", scope: !904, file: !903, line: 58, baseType: !943, size: 64, align: 64, offset: 896)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 72, align: 8, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 9)
!947 = !{!948}
!948 = !DISubrange(count: 10)
!949 = distinct !DIGlobalVariable(name: "block_sizes_dv2550", scope: !0, file: !899, line: 65, type: !950, isLocal: true, isDefinition: true, variable: [8 x i8]* @block_sizes_dv2550)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 64, align: 8, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 8)
!953 = distinct !DIGlobalVariable(name: "dv_audio_shuffle525", scope: !0, file: !899, line: 34, type: !954, isLocal: true, isDefinition: true, variable: [10 x [9 x i8]]* @dv_audio_shuffle525)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 720, align: 8, elements: !955)
!955 = !{!948, !946}
!956 = distinct !DIGlobalVariable(name: "dv_audio_shuffle625", scope: !0, file: !899, line: 48, type: !957, isLocal: true, isDefinition: true, variable: [12 x [9 x i8]]* @dv_audio_shuffle625)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 864, align: 8, elements: !958)
!958 = !{!959, !946}
!959 = !DISubrange(count: 12)
!960 = distinct !DIGlobalVariable(name: "block_sizes_dv100", scope: !0, file: !899, line: 69, type: !950, isLocal: true, isDefinition: true, variable: [8 x i8]* @block_sizes_dv100)
!961 = !{i32 2, !"Dwarf Version", i32 4}
!962 = !{i32 2, !"Debug Info Version", i32 3}
!963 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!964 = distinct !DISubprogram(name: "ff_dv_print_profiles", scope: !899, file: !899, line: 246, type: !965, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !968)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !967, !907}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!968 = !{}
!969 = !DILocalVariable(name: "logctx", arg: 1, scope: !964, file: !899, line: 246, type: !967)
!970 = !DIExpression()
!971 = !DILocation(line: 246, column: 33, scope: !964)
!972 = !DILocalVariable(name: "loglevel", arg: 2, scope: !964, file: !899, line: 246, type: !907)
!973 = !DILocation(line: 246, column: 45, scope: !964)
!974 = !DILocalVariable(name: "i", scope: !964, file: !899, line: 248, type: !907)
!975 = !DILocation(line: 248, column: 9, scope: !964)
!976 = !DILocation(line: 249, column: 12, scope: !977)
!977 = distinct !DILexicalBlock(scope: !964, file: !899, line: 249, column: 5)
!978 = !DILocation(line: 249, column: 10, scope: !977)
!979 = !DILocation(line: 249, column: 17, scope: !980)
!980 = !DILexicalBlockFile(scope: !981, file: !899, discriminator: 1)
!981 = distinct !DILexicalBlock(scope: !977, file: !899, line: 249, column: 5)
!982 = !DILocation(line: 249, column: 19, scope: !980)
!983 = !DILocation(line: 249, column: 5, scope: !980)
!984 = !DILocalVariable(name: "p", scope: !985, file: !899, line: 250, type: !986)
!985 = distinct !DILexicalBlock(scope: !981, file: !899, line: 249, column: 76)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!987 = !DILocation(line: 250, column: 28, scope: !985)
!988 = !DILocation(line: 250, column: 45, scope: !985)
!989 = !DILocation(line: 250, column: 33, scope: !985)
!990 = !DILocation(line: 251, column: 16, scope: !985)
!991 = !DILocation(line: 251, column: 24, scope: !985)
!992 = !DILocation(line: 253, column: 16, scope: !985)
!993 = !DILocation(line: 253, column: 19, scope: !985)
!994 = !DILocation(line: 253, column: 26, scope: !985)
!995 = !DILocation(line: 253, column: 29, scope: !985)
!996 = !DILocation(line: 253, column: 57, scope: !985)
!997 = !DILocation(line: 253, column: 60, scope: !985)
!998 = !DILocation(line: 253, column: 37, scope: !985)
!999 = !DILocation(line: 254, column: 16, scope: !985)
!1000 = !DILocation(line: 254, column: 19, scope: !985)
!1001 = !DILocation(line: 254, column: 29, scope: !985)
!1002 = !DILocation(line: 254, column: 34, scope: !985)
!1003 = !DILocation(line: 254, column: 37, scope: !985)
!1004 = !DILocation(line: 254, column: 47, scope: !985)
!1005 = !DILocation(line: 251, column: 9, scope: !985)
!1006 = !DILocation(line: 255, column: 5, scope: !985)
!1007 = !DILocation(line: 249, column: 72, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !981, file: !899, discriminator: 2)
!1009 = !DILocation(line: 249, column: 5, scope: !1008)
!1010 = distinct !{!1010, !1011}
!1011 = !DILocation(line: 249, column: 5, scope: !964)
!1012 = !DILocation(line: 256, column: 1, scope: !964)
!1013 = distinct !DISubprogram(name: "ff_dv_frame_profile", scope: !899, file: !899, line: 260, type: !1014, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !968)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!986, !1016, !986, !929, !896}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !235, line: 3360, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !235, line: 1556, size: 8448, align: 64, elements: !1019)
!1019 = !{!1020, !1064, !1065, !1066, !1325, !1326, !1327, !1328, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1354, !1358, !1359, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1538, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1018, file: !235, line: 1561, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !204, line: 143, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !204, line: 67, size: 640, align: 64, elements: !1025)
!1025 = !{!1026, !1030, !1034, !1038, !1039, !1040, !1041, !1045, !1051, !1053, !1057}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1024, file: !204, line: 72, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1024, file: !204, line: 78, baseType: !1031, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1027, !967}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1024, file: !204, line: 85, baseType: !1035, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 85, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1024, file: !204, line: 93, baseType: !907, size: 32, align: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1024, file: !204, line: 99, baseType: !907, size: 32, align: 32, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1024, file: !204, line: 108, baseType: !907, size: 32, align: 32, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1024, file: !204, line: 113, baseType: !1042, size: 64, align: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!967, !967, !967}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1024, file: !204, line: 123, baseType: !1046, size: 64, align: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1049, !1049}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1024, file: !204, line: 130, baseType: !1052, size: 32, align: 32, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !204, line: 48, baseType: !203)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1024, file: !204, line: 136, baseType: !1054, size: 64, align: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1052, !967}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1024, file: !204, line: 142, baseType: !1058, size: 64, align: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!907, !1061, !967, !1027, !907}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 60, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1018, file: !235, line: 1562, baseType: !907, size: 32, align: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1018, file: !235, line: 1564, baseType: !224, size: 32, align: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1018, file: !235, line: 1565, baseType: !1067, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !235, line: 3468, size: 1984, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1079, !1082, !1085, !1088, !1093, !1094, !1095, !1103, !1104, !1105, !1107, !1111, !1117, !1122, !1126, !1127, !1175, !1296, !1300, !1301, !1305, !1309, !1314, !1318, !1319, !1320}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1069, file: !235, line: 3475, baseType: !1027, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1069, file: !235, line: 3480, baseType: !1027, size: 64, align: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1069, file: !235, line: 3481, baseType: !224, size: 32, align: 32, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1069, file: !235, line: 3482, baseType: !234, size: 32, align: 32, offset: 160)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1069, file: !235, line: 3487, baseType: !907, size: 32, align: 32, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1069, file: !235, line: 3488, baseType: !1077, size: 64, align: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1069, file: !235, line: 3489, baseType: !1080, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1069, file: !235, line: 3490, baseType: !1083, size: 64, align: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1069, file: !235, line: 3491, baseType: !1086, size: 64, align: 64, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1069, file: !235, line: 3492, baseType: !1089, size: 64, align: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 55, baseType: !1092)
!1092 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1069, file: !235, line: 3493, baseType: !931, size: 8, align: 8, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1069, file: !235, line: 3494, baseType: !1021, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1069, file: !235, line: 3495, baseType: !1096, size: 64, align: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !235, line: 3404, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !235, line: 3401, size: 128, align: 64, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1099, file: !235, line: 3402, baseType: !907, size: 32, align: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1099, file: !235, line: 3403, baseType: !1027, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1069, file: !235, line: 3507, baseType: !1027, size: 64, align: 64, offset: 768)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1069, file: !235, line: 3516, baseType: !907, size: 32, align: 32, offset: 832)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1069, file: !235, line: 3517, baseType: !1106, size: 64, align: 64, offset: 896)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1069, file: !235, line: 3527, baseType: !1108, size: 64, align: 64, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!907, !1016}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1069, file: !235, line: 3535, baseType: !1112, size: 64, align: 64, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!907, !1016, !1115}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1069, file: !235, line: 3541, baseType: !1118, size: 64, align: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !235, line: 3461, baseType: !1121)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !235, line: 3461, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1069, file: !235, line: 3549, baseType: !1123, size: 64, align: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !1106}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1069, file: !235, line: 3551, baseType: !1108, size: 64, align: 64, offset: 1216)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1069, file: !235, line: 3552, baseType: !1128, size: 64, align: 64, offset: 1280)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!907, !1016, !1131, !907, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !235, line: 3920, size: 256, align: 64, elements: !1135)
!1135 = !{!1136, !1139, !1140, !1141, !1142, !1172}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1134, file: !235, line: 3921, baseType: !1137, size: 16, align: 16)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !895, line: 49, baseType: !1138)
!1138 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1134, file: !235, line: 3922, baseType: !894, size: 32, align: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1134, file: !235, line: 3923, baseType: !894, size: 32, align: 32, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1134, file: !235, line: 3924, baseType: !896, size: 32, align: 32, offset: 96)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1134, file: !235, line: 3925, baseType: !1143, size: 64, align: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !235, line: 3918, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !235, line: 3885, size: 1600, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1161, !1165, !1167, !1168, !1170, !1171}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1146, file: !235, line: 3886, baseType: !907, size: 32, align: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1146, file: !235, line: 3887, baseType: !907, size: 32, align: 32, offset: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1146, file: !235, line: 3888, baseType: !907, size: 32, align: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1146, file: !235, line: 3889, baseType: !907, size: 32, align: 32, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1146, file: !235, line: 3890, baseType: !907, size: 32, align: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1146, file: !235, line: 3897, baseType: !1154, size: 768, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !235, line: 3858, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !235, line: 3853, size: 768, align: 64, elements: !1156)
!1156 = !{!1157, !1159}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !235, line: 3855, baseType: !1158, size: 512, align: 64)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !951)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1155, file: !235, line: 3857, baseType: !1160, size: 256, align: 32, offset: 512)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 256, align: 32, elements: !951)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !235, line: 3903, baseType: !1162, size: 256, align: 64, offset: 960)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 256, align: 64, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 4)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1146, file: !235, line: 3904, baseType: !1166, size: 128, align: 32, offset: 1216)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 128, align: 32, elements: !1163)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1146, file: !235, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1146, file: !235, line: 3908, baseType: !1169, size: 64, align: 64, offset: 1408)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1146, file: !235, line: 3915, baseType: !1169, size: 64, align: 64, offset: 1472)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1146, file: !235, line: 3917, baseType: !907, size: 32, align: 32, offset: 1536)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1134, file: !235, line: 3926, baseType: !1173, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !895, line: 40, baseType: !1174)
!1174 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1069, file: !235, line: 3564, baseType: !1176, size: 64, align: 64, offset: 1344)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!907, !1016, !1179, !1213, !1295}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !235, line: 1499, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !235, line: 1445, size: 704, align: 64, elements: !1182)
!1182 = !{!1183, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1209, !1210, !1211, !1212}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1181, file: !235, line: 1451, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1186, line: 94, baseType: !1187)
!1186 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1186, line: 81, size: 192, align: 64, elements: !1188)
!1188 = !{!1189, !1193, !1194}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1187, file: !1186, line: 82, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1186, line: 73, baseType: !1192)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1186, line: 73, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !1186, line: 89, baseType: !1131, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1187, file: !1186, line: 93, baseType: !907, size: 32, align: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1181, file: !235, line: 1461, baseType: !1173, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1181, file: !235, line: 1467, baseType: !1173, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !235, line: 1468, baseType: !1131, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !235, line: 1469, baseType: !907, size: 32, align: 32, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1181, file: !235, line: 1470, baseType: !907, size: 32, align: 32, offset: 288)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1181, file: !235, line: 1474, baseType: !907, size: 32, align: 32, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1181, file: !235, line: 1479, baseType: !1202, size: 64, align: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !235, line: 1415, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !235, line: 1411, size: 128, align: 64, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !235, line: 1412, baseType: !1131, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !235, line: 1413, baseType: !907, size: 32, align: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !235, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1181, file: !235, line: 1480, baseType: !907, size: 32, align: 32, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1181, file: !235, line: 1486, baseType: !1173, size: 64, align: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1181, file: !235, line: 1488, baseType: !1173, size: 64, align: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1181, file: !235, line: 1497, baseType: !1173, size: 64, align: 64, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1247, !1249, !1250, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1291, !1292, !1293, !1294}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !758, line: 282, baseType: !1158, size: 512, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1216, file: !758, line: 299, baseType: !1160, size: 256, align: 32, offset: 512)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1216, file: !758, line: 315, baseType: !1221, size: 64, align: 64, offset: 768)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1216, file: !758, line: 326, baseType: !907, size: 32, align: 32, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1216, file: !758, line: 326, baseType: !907, size: 32, align: 32, offset: 864)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1216, file: !758, line: 334, baseType: !907, size: 32, align: 32, offset: 896)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1216, file: !758, line: 341, baseType: !907, size: 32, align: 32, offset: 928)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1216, file: !758, line: 346, baseType: !907, size: 32, align: 32, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1216, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1216, file: !758, line: 356, baseType: !913, size: 64, align: 32, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1216, file: !758, line: 361, baseType: !1173, size: 64, align: 64, offset: 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1216, file: !758, line: 369, baseType: !1173, size: 64, align: 64, offset: 1152)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1216, file: !758, line: 377, baseType: !1173, size: 64, align: 64, offset: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1216, file: !758, line: 382, baseType: !907, size: 32, align: 32, offset: 1280)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1216, file: !758, line: 386, baseType: !907, size: 32, align: 32, offset: 1312)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1216, file: !758, line: 391, baseType: !907, size: 32, align: 32, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1216, file: !758, line: 396, baseType: !967, size: 64, align: 64, offset: 1408)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1216, file: !758, line: 403, baseType: !1237, size: 512, align: 64, offset: 1472)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, align: 64, elements: !951)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1216, file: !758, line: 410, baseType: !907, size: 32, align: 32, offset: 1984)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1216, file: !758, line: 415, baseType: !907, size: 32, align: 32, offset: 2016)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1216, file: !758, line: 420, baseType: !907, size: 32, align: 32, offset: 2048)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1216, file: !758, line: 425, baseType: !907, size: 32, align: 32, offset: 2080)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1216, file: !758, line: 435, baseType: !1173, size: 64, align: 64, offset: 2112)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1216, file: !758, line: 440, baseType: !907, size: 32, align: 32, offset: 2176)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1216, file: !758, line: 445, baseType: !1091, size: 64, align: 64, offset: 2240)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1216, file: !758, line: 459, baseType: !1246, size: 512, align: 64, offset: 2304)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 512, align: 64, elements: !951)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1216, file: !758, line: 473, baseType: !1248, size: 64, align: 64, offset: 2816)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1216, file: !758, line: 477, baseType: !907, size: 32, align: 32, offset: 2880)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1216, file: !758, line: 479, baseType: !1251, size: 64, align: 64, offset: 2944)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1264}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !758, line: 203, baseType: !1131, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !758, line: 204, baseType: !907, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1254, file: !758, line: 205, baseType: !1260, size: 64, align: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1262, line: 86, baseType: !1263)
!1262 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1262, line: 86, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1254, file: !758, line: 206, baseType: !1184, size: 64, align: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1216, file: !758, line: 480, baseType: !907, size: 32, align: 32, offset: 3008)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1216, file: !758, line: 505, baseType: !907, size: 32, align: 32, offset: 3040)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1216, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1216, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1216, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1216, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1216, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1216, file: !758, line: 532, baseType: !1173, size: 64, align: 64, offset: 3264)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1216, file: !758, line: 539, baseType: !1173, size: 64, align: 64, offset: 3328)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1216, file: !758, line: 547, baseType: !1173, size: 64, align: 64, offset: 3392)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1216, file: !758, line: 554, baseType: !1260, size: 64, align: 64, offset: 3456)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1216, file: !758, line: 563, baseType: !907, size: 32, align: 32, offset: 3520)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1216, file: !758, line: 572, baseType: !907, size: 32, align: 32, offset: 3552)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1216, file: !758, line: 581, baseType: !907, size: 32, align: 32, offset: 3584)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1216, file: !758, line: 588, baseType: !1280, size: 64, align: 64, offset: 3648)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 36, baseType: !1282)
!1282 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1216, file: !758, line: 593, baseType: !907, size: 32, align: 32, offset: 3712)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1216, file: !758, line: 596, baseType: !907, size: 32, align: 32, offset: 3744)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1216, file: !758, line: 599, baseType: !1184, size: 64, align: 64, offset: 3776)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1216, file: !758, line: 605, baseType: !1184, size: 64, align: 64, offset: 3840)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1216, file: !758, line: 616, baseType: !1184, size: 64, align: 64, offset: 3904)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1216, file: !758, line: 626, baseType: !1289, size: 64, align: 64, offset: 3968)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1290, line: 216, baseType: !1092)
!1290 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1216, file: !758, line: 627, baseType: !1289, size: 64, align: 64, offset: 4032)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1216, file: !758, line: 628, baseType: !1289, size: 64, align: 64, offset: 4096)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1216, file: !758, line: 629, baseType: !1289, size: 64, align: 64, offset: 4160)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1216, file: !758, line: 645, baseType: !1184, size: 64, align: 64, offset: 4224)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1069, file: !235, line: 3566, baseType: !1297, size: 64, align: 64, offset: 1408)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!907, !1016, !967, !1295, !1179}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1069, file: !235, line: 3567, baseType: !1108, size: 64, align: 64, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1069, file: !235, line: 3576, baseType: !1302, size: 64, align: 64, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!907, !1016, !1213}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1069, file: !235, line: 3577, baseType: !1306, size: 64, align: 64, offset: 1600)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!907, !1016, !1179}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1069, file: !235, line: 3584, baseType: !1310, size: 64, align: 64, offset: 1664)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!907, !1016, !1313}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1069, file: !235, line: 3589, baseType: !1315, size: 64, align: 64, offset: 1728)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1016}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1069, file: !235, line: 3594, baseType: !907, size: 32, align: 32, offset: 1792)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1069, file: !235, line: 3600, baseType: !1027, size: 64, align: 64, offset: 1856)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1069, file: !235, line: 3609, baseType: !1321, size: 64, align: 64, offset: 1920)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1324)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !235, line: 3609, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1018, file: !235, line: 1566, baseType: !234, size: 32, align: 32, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1018, file: !235, line: 1581, baseType: !896, size: 32, align: 32, offset: 224)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1018, file: !235, line: 1583, baseType: !967, size: 64, align: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1018, file: !235, line: 1591, baseType: !1329, size: 64, align: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !235, line: 1532, flags: DIFlagFwdDecl)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1018, file: !235, line: 1598, baseType: !967, size: 64, align: 64, offset: 384)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1018, file: !235, line: 1606, baseType: !1173, size: 64, align: 64, offset: 448)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1018, file: !235, line: 1614, baseType: !907, size: 32, align: 32, offset: 512)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1018, file: !235, line: 1622, baseType: !907, size: 32, align: 32, offset: 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1018, file: !235, line: 1628, baseType: !907, size: 32, align: 32, offset: 576)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !235, line: 1636, baseType: !907, size: 32, align: 32, offset: 608)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1018, file: !235, line: 1643, baseType: !907, size: 32, align: 32, offset: 640)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1018, file: !235, line: 1657, baseType: !1131, size: 64, align: 64, offset: 704)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1018, file: !235, line: 1658, baseType: !907, size: 32, align: 32, offset: 768)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1018, file: !235, line: 1679, baseType: !913, size: 64, align: 32, offset: 800)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1018, file: !235, line: 1688, baseType: !907, size: 32, align: 32, offset: 864)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1018, file: !235, line: 1712, baseType: !907, size: 32, align: 32, offset: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1018, file: !235, line: 1729, baseType: !907, size: 32, align: 32, offset: 928)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1018, file: !235, line: 1729, baseType: !907, size: 32, align: 32, offset: 960)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1018, file: !235, line: 1744, baseType: !907, size: 32, align: 32, offset: 992)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1018, file: !235, line: 1744, baseType: !907, size: 32, align: 32, offset: 1024)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1018, file: !235, line: 1751, baseType: !907, size: 32, align: 32, offset: 1056)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1018, file: !235, line: 1766, baseType: !3, size: 32, align: 32, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1018, file: !235, line: 1791, baseType: !1350, size: 64, align: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{null, !1353, !1213, !1295, !907, !907, !907}
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1018, file: !235, line: 1808, baseType: !1355, size: 64, align: 64, offset: 1216)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!3, !1353, !1080}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1018, file: !235, line: 1816, baseType: !907, size: 32, align: 32, offset: 1280)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1018, file: !235, line: 1825, baseType: !1360, size: 32, align: 32, offset: 1312)
!1360 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1018, file: !235, line: 1830, baseType: !907, size: 32, align: 32, offset: 1344)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1018, file: !235, line: 1838, baseType: !1360, size: 32, align: 32, offset: 1376)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1018, file: !235, line: 1846, baseType: !907, size: 32, align: 32, offset: 1408)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1018, file: !235, line: 1851, baseType: !907, size: 32, align: 32, offset: 1440)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1018, file: !235, line: 1861, baseType: !1360, size: 32, align: 32, offset: 1472)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1018, file: !235, line: 1868, baseType: !1360, size: 32, align: 32, offset: 1504)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1018, file: !235, line: 1875, baseType: !1360, size: 32, align: 32, offset: 1536)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1018, file: !235, line: 1882, baseType: !1360, size: 32, align: 32, offset: 1568)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1018, file: !235, line: 1889, baseType: !1360, size: 32, align: 32, offset: 1600)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1018, file: !235, line: 1896, baseType: !1360, size: 32, align: 32, offset: 1632)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1018, file: !235, line: 1903, baseType: !1360, size: 32, align: 32, offset: 1664)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1018, file: !235, line: 1910, baseType: !907, size: 32, align: 32, offset: 1696)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1018, file: !235, line: 1915, baseType: !907, size: 32, align: 32, offset: 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1018, file: !235, line: 1926, baseType: !1295, size: 64, align: 64, offset: 1792)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1018, file: !235, line: 1935, baseType: !913, size: 64, align: 32, offset: 1856)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1018, file: !235, line: 1942, baseType: !907, size: 32, align: 32, offset: 1920)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1018, file: !235, line: 1948, baseType: !907, size: 32, align: 32, offset: 1952)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1018, file: !235, line: 1954, baseType: !907, size: 32, align: 32, offset: 1984)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1018, file: !235, line: 1960, baseType: !907, size: 32, align: 32, offset: 2016)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1018, file: !235, line: 1984, baseType: !907, size: 32, align: 32, offset: 2048)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1018, file: !235, line: 1991, baseType: !907, size: 32, align: 32, offset: 2080)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1018, file: !235, line: 1996, baseType: !907, size: 32, align: 32, offset: 2112)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1018, file: !235, line: 2004, baseType: !907, size: 32, align: 32, offset: 2144)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1018, file: !235, line: 2011, baseType: !907, size: 32, align: 32, offset: 2176)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1018, file: !235, line: 2018, baseType: !907, size: 32, align: 32, offset: 2208)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1018, file: !235, line: 2027, baseType: !907, size: 32, align: 32, offset: 2240)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1018, file: !235, line: 2034, baseType: !907, size: 32, align: 32, offset: 2272)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1018, file: !235, line: 2044, baseType: !907, size: 32, align: 32, offset: 2304)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1018, file: !235, line: 2054, baseType: !1390, size: 64, align: 64, offset: 2368)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1018, file: !235, line: 2061, baseType: !1390, size: 64, align: 64, offset: 2432)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1018, file: !235, line: 2066, baseType: !907, size: 32, align: 32, offset: 2496)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1018, file: !235, line: 2070, baseType: !907, size: 32, align: 32, offset: 2528)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1018, file: !235, line: 2078, baseType: !907, size: 32, align: 32, offset: 2560)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1018, file: !235, line: 2085, baseType: !907, size: 32, align: 32, offset: 2592)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1018, file: !235, line: 2092, baseType: !907, size: 32, align: 32, offset: 2624)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1018, file: !235, line: 2099, baseType: !907, size: 32, align: 32, offset: 2656)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1018, file: !235, line: 2106, baseType: !907, size: 32, align: 32, offset: 2688)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1018, file: !235, line: 2113, baseType: !907, size: 32, align: 32, offset: 2720)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1018, file: !235, line: 2120, baseType: !907, size: 32, align: 32, offset: 2752)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1018, file: !235, line: 2125, baseType: !907, size: 32, align: 32, offset: 2784)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1018, file: !235, line: 2133, baseType: !907, size: 32, align: 32, offset: 2816)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1018, file: !235, line: 2140, baseType: !907, size: 32, align: 32, offset: 2848)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1018, file: !235, line: 2145, baseType: !907, size: 32, align: 32, offset: 2880)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1018, file: !235, line: 2153, baseType: !907, size: 32, align: 32, offset: 2912)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1018, file: !235, line: 2158, baseType: !907, size: 32, align: 32, offset: 2944)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1018, file: !235, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1018, file: !235, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1018, file: !235, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1018, file: !235, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1018, file: !235, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1018, file: !235, line: 2203, baseType: !907, size: 32, align: 32, offset: 3136)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1018, file: !235, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1018, file: !235, line: 2212, baseType: !907, size: 32, align: 32, offset: 3200)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1018, file: !235, line: 2213, baseType: !907, size: 32, align: 32, offset: 3232)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1018, file: !235, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1018, file: !235, line: 2232, baseType: !907, size: 32, align: 32, offset: 3296)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1018, file: !235, line: 2243, baseType: !907, size: 32, align: 32, offset: 3328)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1018, file: !235, line: 2249, baseType: !907, size: 32, align: 32, offset: 3360)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1018, file: !235, line: 2256, baseType: !907, size: 32, align: 32, offset: 3392)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1018, file: !235, line: 2263, baseType: !1091, size: 64, align: 64, offset: 3456)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1018, file: !235, line: 2270, baseType: !1091, size: 64, align: 64, offset: 3520)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1018, file: !235, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1018, file: !235, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1018, file: !235, line: 2367, baseType: !1426, size: 64, align: 64, offset: 3648)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!907, !1353, !1313, !907}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1018, file: !235, line: 2383, baseType: !907, size: 32, align: 32, offset: 3712)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1018, file: !235, line: 2386, baseType: !1360, size: 32, align: 32, offset: 3744)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1018, file: !235, line: 2387, baseType: !1360, size: 32, align: 32, offset: 3776)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1018, file: !235, line: 2394, baseType: !907, size: 32, align: 32, offset: 3808)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1018, file: !235, line: 2401, baseType: !907, size: 32, align: 32, offset: 3840)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1018, file: !235, line: 2408, baseType: !907, size: 32, align: 32, offset: 3872)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1018, file: !235, line: 2415, baseType: !907, size: 32, align: 32, offset: 3904)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1018, file: !235, line: 2422, baseType: !907, size: 32, align: 32, offset: 3936)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1018, file: !235, line: 2423, baseType: !1438, size: 64, align: 64, offset: 3968)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !235, line: 831, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !235, line: 826, size: 128, align: 32, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1440, file: !235, line: 827, baseType: !907, size: 32, align: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1440, file: !235, line: 828, baseType: !907, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1440, file: !235, line: 829, baseType: !907, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1440, file: !235, line: 830, baseType: !1360, size: 32, align: 32, offset: 96)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1018, file: !235, line: 2430, baseType: !1173, size: 64, align: 64, offset: 4032)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1018, file: !235, line: 2437, baseType: !1173, size: 64, align: 64, offset: 4096)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1018, file: !235, line: 2444, baseType: !1360, size: 32, align: 32, offset: 4160)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1018, file: !235, line: 2451, baseType: !1360, size: 32, align: 32, offset: 4192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1018, file: !235, line: 2458, baseType: !907, size: 32, align: 32, offset: 4224)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1018, file: !235, line: 2469, baseType: !907, size: 32, align: 32, offset: 4256)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1018, file: !235, line: 2475, baseType: !907, size: 32, align: 32, offset: 4288)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1018, file: !235, line: 2481, baseType: !907, size: 32, align: 32, offset: 4320)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1018, file: !235, line: 2485, baseType: !907, size: 32, align: 32, offset: 4352)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1018, file: !235, line: 2489, baseType: !907, size: 32, align: 32, offset: 4384)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1018, file: !235, line: 2493, baseType: !907, size: 32, align: 32, offset: 4416)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1018, file: !235, line: 2501, baseType: !907, size: 32, align: 32, offset: 4448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1018, file: !235, line: 2506, baseType: !907, size: 32, align: 32, offset: 4480)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1018, file: !235, line: 2510, baseType: !907, size: 32, align: 32, offset: 4512)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1018, file: !235, line: 2514, baseType: !1173, size: 64, align: 64, offset: 4544)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1018, file: !235, line: 2528, baseType: !1462, size: 64, align: 64, offset: 4608)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1353, !967, !907, !907}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1018, file: !235, line: 2534, baseType: !907, size: 32, align: 32, offset: 4672)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1018, file: !235, line: 2545, baseType: !907, size: 32, align: 32, offset: 4704)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1018, file: !235, line: 2547, baseType: !907, size: 32, align: 32, offset: 4736)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1018, file: !235, line: 2549, baseType: !907, size: 32, align: 32, offset: 4768)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1018, file: !235, line: 2551, baseType: !907, size: 32, align: 32, offset: 4800)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1018, file: !235, line: 2553, baseType: !907, size: 32, align: 32, offset: 4832)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1018, file: !235, line: 2555, baseType: !907, size: 32, align: 32, offset: 4864)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1018, file: !235, line: 2557, baseType: !907, size: 32, align: 32, offset: 4896)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1018, file: !235, line: 2559, baseType: !907, size: 32, align: 32, offset: 4928)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1018, file: !235, line: 2563, baseType: !907, size: 32, align: 32, offset: 4960)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1018, file: !235, line: 2571, baseType: !1169, size: 64, align: 64, offset: 4992)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1018, file: !235, line: 2579, baseType: !1169, size: 64, align: 64, offset: 5056)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1018, file: !235, line: 2586, baseType: !907, size: 32, align: 32, offset: 5120)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1018, file: !235, line: 2615, baseType: !907, size: 32, align: 32, offset: 5152)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1018, file: !235, line: 2627, baseType: !907, size: 32, align: 32, offset: 5184)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1018, file: !235, line: 2637, baseType: !907, size: 32, align: 32, offset: 5216)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1018, file: !235, line: 2681, baseType: !907, size: 32, align: 32, offset: 5248)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1018, file: !235, line: 2709, baseType: !1173, size: 64, align: 64, offset: 5312)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1018, file: !235, line: 2716, baseType: !1484, size: 64, align: 64, offset: 5376)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !235, line: 3636, size: 896, align: 64, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491, !1492, !1493, !1494, !1498, !1502, !1503, !1504, !1505, !1511, !1512, !1513, !1514, !1515}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1486, file: !235, line: 3642, baseType: !1027, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1486, file: !235, line: 3649, baseType: !224, size: 32, align: 32, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1486, file: !235, line: 3656, baseType: !234, size: 32, align: 32, offset: 96)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1486, file: !235, line: 3663, baseType: !3, size: 32, align: 32, offset: 128)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1486, file: !235, line: 3669, baseType: !907, size: 32, align: 32, offset: 160)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1486, file: !235, line: 3682, baseType: !1310, size: 64, align: 64, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1486, file: !235, line: 3698, baseType: !1495, size: 64, align: 64, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!907, !1016, !929, !894}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1486, file: !235, line: 3712, baseType: !1499, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!907, !1016, !907, !929, !894}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1486, file: !235, line: 3726, baseType: !1495, size: 64, align: 64, offset: 384)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1486, file: !235, line: 3737, baseType: !1108, size: 64, align: 64, offset: 448)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1486, file: !235, line: 3746, baseType: !907, size: 32, align: 32, offset: 512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1486, file: !235, line: 3757, baseType: !1506, size: 64, align: 64, offset: 576)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !1509}
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !235, line: 3617, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1486, file: !235, line: 3766, baseType: !1108, size: 64, align: 64, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1486, file: !235, line: 3774, baseType: !1108, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1486, file: !235, line: 3780, baseType: !907, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1486, file: !235, line: 3785, baseType: !907, size: 32, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1486, file: !235, line: 3795, baseType: !1516, size: 64, align: 64, offset: 832)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!907, !1016, !1184}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1018, file: !235, line: 2728, baseType: !967, size: 64, align: 64, offset: 5440)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1018, file: !235, line: 2735, baseType: !1237, size: 512, align: 64, offset: 5504)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1018, file: !235, line: 2742, baseType: !907, size: 32, align: 32, offset: 6016)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1018, file: !235, line: 2755, baseType: !907, size: 32, align: 32, offset: 6048)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1018, file: !235, line: 2776, baseType: !907, size: 32, align: 32, offset: 6080)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1018, file: !235, line: 2783, baseType: !907, size: 32, align: 32, offset: 6112)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1018, file: !235, line: 2791, baseType: !907, size: 32, align: 32, offset: 6144)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1018, file: !235, line: 2802, baseType: !1313, size: 64, align: 64, offset: 6208)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1018, file: !235, line: 2811, baseType: !907, size: 32, align: 32, offset: 6272)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1018, file: !235, line: 2821, baseType: !907, size: 32, align: 32, offset: 6304)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1018, file: !235, line: 2830, baseType: !907, size: 32, align: 32, offset: 6336)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1018, file: !235, line: 2840, baseType: !907, size: 32, align: 32, offset: 6368)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1018, file: !235, line: 2851, baseType: !1532, size: 64, align: 64, offset: 6400)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!907, !1353, !1535, !967, !1295, !907, !907}
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!907, !1353, !967}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1018, file: !235, line: 2871, baseType: !1539, size: 64, align: 64, offset: 6464)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!907, !1353, !1542, !967, !1295, !907}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!907, !1353, !967, !907, !907}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1018, file: !235, line: 2878, baseType: !907, size: 32, align: 32, offset: 6528)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1018, file: !235, line: 2885, baseType: !907, size: 32, align: 32, offset: 6560)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1018, file: !235, line: 3005, baseType: !907, size: 32, align: 32, offset: 6592)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1018, file: !235, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1018, file: !235, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1018, file: !235, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1018, file: !235, line: 3037, baseType: !1131, size: 64, align: 64, offset: 6720)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1018, file: !235, line: 3038, baseType: !907, size: 32, align: 32, offset: 6784)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1018, file: !235, line: 3050, baseType: !1091, size: 64, align: 64, offset: 6848)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1018, file: !235, line: 3065, baseType: !907, size: 32, align: 32, offset: 6912)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1018, file: !235, line: 3083, baseType: !907, size: 32, align: 32, offset: 6944)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1018, file: !235, line: 3092, baseType: !913, size: 64, align: 32, offset: 6976)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1018, file: !235, line: 3099, baseType: !3, size: 32, align: 32, offset: 7040)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1018, file: !235, line: 3106, baseType: !913, size: 64, align: 32, offset: 7072)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1018, file: !235, line: 3113, baseType: !1560, size: 64, align: 64, offset: 7168)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1562)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !235, line: 740, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !235, line: 712, size: 384, align: 64, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568, !1569, !1570, !1573}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1563, file: !235, line: 713, baseType: !234, size: 32, align: 32)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1563, file: !235, line: 714, baseType: !224, size: 32, align: 32, offset: 32)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1563, file: !235, line: 720, baseType: !1027, size: 64, align: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1563, file: !235, line: 724, baseType: !1027, size: 64, align: 64, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1563, file: !235, line: 728, baseType: !907, size: 32, align: 32, offset: 192)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1563, file: !235, line: 734, baseType: !1571, size: 64, align: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1563, file: !235, line: 739, baseType: !1574, size: 64, align: 64, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1018, file: !235, line: 3129, baseType: !1173, size: 64, align: 64, offset: 7232)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1018, file: !235, line: 3130, baseType: !1173, size: 64, align: 64, offset: 7296)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1018, file: !235, line: 3131, baseType: !1173, size: 64, align: 64, offset: 7360)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1018, file: !235, line: 3132, baseType: !1173, size: 64, align: 64, offset: 7424)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1018, file: !235, line: 3139, baseType: !1169, size: 64, align: 64, offset: 7488)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1018, file: !235, line: 3147, baseType: !907, size: 32, align: 32, offset: 7552)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1018, file: !235, line: 3165, baseType: !907, size: 32, align: 32, offset: 7584)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1018, file: !235, line: 3172, baseType: !907, size: 32, align: 32, offset: 7616)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1018, file: !235, line: 3180, baseType: !907, size: 32, align: 32, offset: 7648)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1018, file: !235, line: 3191, baseType: !1390, size: 64, align: 64, offset: 7680)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1018, file: !235, line: 3199, baseType: !1131, size: 64, align: 64, offset: 7744)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1018, file: !235, line: 3207, baseType: !1169, size: 64, align: 64, offset: 7808)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1018, file: !235, line: 3214, baseType: !896, size: 32, align: 32, offset: 7872)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1018, file: !235, line: 3224, baseType: !1202, size: 64, align: 64, offset: 7936)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1018, file: !235, line: 3225, baseType: !907, size: 32, align: 32, offset: 8000)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1018, file: !235, line: 3249, baseType: !1184, size: 64, align: 64, offset: 8064)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1018, file: !235, line: 3256, baseType: !907, size: 32, align: 32, offset: 8128)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1018, file: !235, line: 3271, baseType: !907, size: 32, align: 32, offset: 8160)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1018, file: !235, line: 3279, baseType: !1173, size: 64, align: 64, offset: 8192)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1018, file: !235, line: 3301, baseType: !1184, size: 64, align: 64, offset: 8256)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1018, file: !235, line: 3310, baseType: !907, size: 32, align: 32, offset: 8320)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1018, file: !235, line: 3337, baseType: !907, size: 32, align: 32, offset: 8352)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1018, file: !235, line: 3351, baseType: !907, size: 32, align: 32, offset: 8384)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1018, file: !235, line: 3359, baseType: !907, size: 32, align: 32, offset: 8416)
!1600 = !DILocalVariable(name: "codec", arg: 1, scope: !1013, file: !899, line: 260, type: !1016)
!1601 = !DILocation(line: 260, column: 56, scope: !1013)
!1602 = !DILocalVariable(name: "sys", arg: 2, scope: !1013, file: !899, line: 260, type: !986)
!1603 = !DILocation(line: 260, column: 82, scope: !1013)
!1604 = !DILocalVariable(name: "frame", arg: 3, scope: !1013, file: !899, line: 261, type: !929)
!1605 = !DILocation(line: 261, column: 55, scope: !1013)
!1606 = !DILocalVariable(name: "buf_size", arg: 4, scope: !1013, file: !899, line: 261, type: !896)
!1607 = !DILocation(line: 261, column: 71, scope: !1013)
!1608 = !DILocalVariable(name: "i", scope: !1013, file: !899, line: 264, type: !907)
!1609 = !DILocation(line: 264, column: 9, scope: !1013)
!1610 = !DILocalVariable(name: "dsf", scope: !1013, file: !899, line: 264, type: !907)
!1611 = !DILocation(line: 264, column: 12, scope: !1013)
!1612 = !DILocalVariable(name: "stype", scope: !1013, file: !899, line: 264, type: !907)
!1613 = !DILocation(line: 264, column: 17, scope: !1013)
!1614 = !DILocation(line: 266, column: 8, scope: !1615)
!1615 = distinct !DILexicalBlock(scope: !1013, file: !899, line: 266, column: 8)
!1616 = !DILocation(line: 266, column: 17, scope: !1615)
!1617 = !DILocation(line: 266, column: 8, scope: !1013)
!1618 = !DILocation(line: 267, column: 9, scope: !1615)
!1619 = !DILocation(line: 269, column: 12, scope: !1013)
!1620 = !DILocation(line: 269, column: 21, scope: !1013)
!1621 = !DILocation(line: 269, column: 29, scope: !1013)
!1622 = !DILocation(line: 269, column: 9, scope: !1013)
!1623 = !DILocation(line: 270, column: 13, scope: !1013)
!1624 = !DILocation(line: 270, column: 36, scope: !1013)
!1625 = !DILocation(line: 270, column: 11, scope: !1013)
!1626 = !DILocation(line: 273, column: 10, scope: !1627)
!1627 = distinct !DILexicalBlock(scope: !1013, file: !899, line: 273, column: 9)
!1628 = !DILocation(line: 273, column: 14, scope: !1627)
!1629 = !DILocation(line: 273, column: 19, scope: !1627)
!1630 = !DILocation(line: 273, column: 22, scope: !1631)
!1631 = !DILexicalBlockFile(scope: !1627, file: !899, discriminator: 1)
!1632 = !DILocation(line: 273, column: 28, scope: !1631)
!1633 = !DILocation(line: 273, column: 33, scope: !1631)
!1634 = !DILocation(line: 273, column: 36, scope: !1635)
!1635 = !DILexicalBlockFile(scope: !1627, file: !899, discriminator: 2)
!1636 = !DILocation(line: 273, column: 45, scope: !1635)
!1637 = !DILocation(line: 273, column: 54, scope: !1635)
!1638 = !DILocation(line: 274, column: 10, scope: !1627)
!1639 = !DILocation(line: 274, column: 16, scope: !1627)
!1640 = !DILocation(line: 274, column: 22, scope: !1627)
!1641 = !DILocation(line: 274, column: 25, scope: !1631)
!1642 = !DILocation(line: 274, column: 31, scope: !1631)
!1643 = !DILocation(line: 274, column: 34, scope: !1635)
!1644 = !DILocation(line: 274, column: 41, scope: !1635)
!1645 = !DILocation(line: 274, column: 94, scope: !1635)
!1646 = !DILocation(line: 274, column: 50, scope: !1635)
!1647 = !DILocation(line: 274, column: 97, scope: !1635)
!1648 = !DILocation(line: 274, column: 100, scope: !1649)
!1649 = !DILexicalBlockFile(scope: !1627, file: !899, discriminator: 3)
!1650 = !DILocation(line: 274, column: 107, scope: !1649)
!1651 = !DILocation(line: 274, column: 118, scope: !1649)
!1652 = !DILocation(line: 274, column: 124, scope: !1649)
!1653 = !DILocation(line: 274, column: 127, scope: !1654)
!1654 = !DILexicalBlockFile(scope: !1627, file: !899, discriminator: 4)
!1655 = !DILocation(line: 274, column: 134, scope: !1654)
!1656 = !DILocation(line: 274, column: 146, scope: !1654)
!1657 = !DILocation(line: 273, column: 9, scope: !1658)
!1658 = !DILexicalBlockFile(scope: !1013, file: !899, discriminator: 3)
!1659 = !DILocation(line: 275, column: 9, scope: !1627)
!1660 = !DILocation(line: 277, column: 9, scope: !1661)
