; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--tak.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--tak.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TAKStreamInfo = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%union.unaligned_32 = type { i32 }

!926 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !927, line: 221, size: 32, align: 8, elements: !928)
!927 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !926, file: !927, line: 221, baseType: !930, size: 32, align: 32)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !922, line: 51, baseType: !918)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !922, line: 55, baseType: !932)
!932 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!933 = !{!934, !942}
!934 = distinct !DIGlobalVariable(name: "tak_channel_layouts", scope: !0, file: !935, line: 28, type: !936, isLocal: true, isDefinition: true, variable: [19 x i64]* @tak_channel_layouts)
!935 = !DIFile(filename: "libavcodec/tak.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 1216, align: 64, elements: !940)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !922, line: 40, baseType: !939)
!939 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!940 = !{!941}
!941 = !DISubrange(count: 19)
!942 = distinct !DIGlobalVariable(name: "frame_duration_type_quants", scope: !0, file: !935, line: 50, type: !943, isLocal: true, isDefinition: true, variable: [10 x i16]* @frame_duration_type_quants)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 160, align: 16, elements: !947)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !922, line: 49, baseType: !946)
!946 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!947 = !{!948}
!948 = !DISubrange(count: 10)
!949 = !{i32 2, !"Dwarf Version", i32 4}
!950 = !{i32 2, !"Debug Info Version", i32 3}
!951 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!952 = distinct !DISubprogram(name: "ff_tak_check_crc", scope: !935, file: !935, line: 77, type: !953, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!917, !919, !918}
!955 = !{}
!956 = !DILocalVariable(name: "buf", arg: 1, scope: !952, file: !935, line: 77, type: !919)
!957 = !DIExpression()
!958 = !DILocation(line: 77, column: 37, scope: !952)
!959 = !DILocalVariable(name: "buf_size", arg: 2, scope: !952, file: !935, line: 77, type: !918)
!960 = !DILocation(line: 77, column: 55, scope: !952)
!961 = !DILocalVariable(name: "crc", scope: !952, file: !935, line: 79, type: !930)
!962 = !DILocation(line: 79, column: 14, scope: !952)
!963 = !DILocalVariable(name: "CRC", scope: !952, file: !935, line: 79, type: !930)
!964 = !DILocation(line: 79, column: 19, scope: !952)
!965 = !DILocation(line: 81, column: 9, scope: !966)
!966 = distinct !DILexicalBlock(scope: !952, file: !935, line: 81, column: 9)
!967 = !DILocation(line: 81, column: 18, scope: !966)
!968 = !DILocation(line: 81, column: 9, scope: !952)
!969 = !DILocation(line: 82, column: 9, scope: !966)
!970 = !DILocation(line: 83, column: 14, scope: !952)
!971 = !DILocation(line: 85, column: 31, scope: !952)
!972 = !DILocation(line: 85, column: 37, scope: !952)
!973 = !DILocation(line: 85, column: 35, scope: !952)
!974 = !DILocation(line: 85, column: 13, scope: !952)
!975 = !DILocation(line: 85, column: 51, scope: !952)
!976 = !DILocation(line: 85, column: 79, scope: !952)
!977 = !DILocation(line: 85, column: 85, scope: !952)
!978 = !DILocation(line: 85, column: 83, scope: !952)
!979 = !DILocation(line: 85, column: 61, scope: !952)
!980 = !DILocation(line: 85, column: 99, scope: !952)
!981 = !DILocation(line: 85, column: 58, scope: !952)
!982 = !DILocation(line: 85, column: 125, scope: !952)
!983 = !DILocation(line: 85, column: 131, scope: !952)
!984 = !DILocation(line: 85, column: 129, scope: !952)
!985 = !DILocation(line: 85, column: 107, scope: !952)
!986 = !DILocation(line: 85, column: 105, scope: !952)
!987 = !DILocation(line: 85, column: 9, scope: !952)
!988 = !DILocation(line: 86, column: 18, scope: !952)
!989 = !DILocation(line: 86, column: 63, scope: !952)
!990 = !DILocation(line: 86, column: 68, scope: !952)
!991 = !DILocation(line: 86, column: 11, scope: !992)
!992 = !DILexicalBlockFile(scope: !952, file: !935, discriminator: 1)
!993 = !DILocation(line: 86, column: 9, scope: !952)
!994 = !DILocation(line: 87, column: 9, scope: !995)
!995 = distinct !DILexicalBlock(scope: !952, file: !935, line: 87, column: 9)
!996 = !DILocation(line: 87, column: 16, scope: !995)
!997 = !DILocation(line: 87, column: 13, scope: !995)
!998 = !DILocation(line: 87, column: 9, scope: !952)
!999 = !DILocation(line: 88, column: 9, scope: !995)
!1000 = !DILocation(line: 90, column: 5, scope: !952)
!1001 = !DILocation(line: 91, column: 1, scope: !952)
!1002 = distinct !DISubprogram(name: "ff_tak_parse_streaminfo", scope: !935, file: !935, line: 93, type: !1003, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !1005, !1020}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAKStreamInfo", file: !16, line: 140, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAKStreamInfo", file: !16, line: 128, size: 448, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1007, file: !16, line: 129, baseType: !917, size: 32, align: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1007, file: !16, line: 130, baseType: !15, size: 32, align: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !1007, file: !16, line: 131, baseType: !917, size: 32, align: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1007, file: !16, line: 132, baseType: !917, size: 32, align: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1007, file: !16, line: 133, baseType: !917, size: 32, align: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !1007, file: !16, line: 134, baseType: !917, size: 32, align: 32, offset: 160)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !1007, file: !16, line: 135, baseType: !917, size: 32, align: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "frame_samples", scope: !1007, file: !16, line: 136, baseType: !917, size: 32, align: 32, offset: 224)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "last_frame_samples", scope: !1007, file: !16, line: 137, baseType: !917, size: 32, align: 32, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ch_layout", scope: !1007, file: !16, line: 138, baseType: !931, size: 64, align: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1007, file: !16, line: 139, baseType: !938, size: 64, align: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1022, line: 70, baseType: !1023)
!1022 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1022, line: 61, size: 256, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1023, file: !1022, line: 62, baseType: !919, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1023, file: !1022, line: 62, baseType: !919, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1023, file: !1022, line: 67, baseType: !917, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1023, file: !1022, line: 68, baseType: !917, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1023, file: !1022, line: 69, baseType: !917, size: 32, align: 32, offset: 192)
!1030 = !DILocalVariable(name: "s", arg: 1, scope: !1002, file: !935, line: 93, type: !1005)
!1031 = !DILocation(line: 93, column: 45, scope: !1002)
!1032 = !DILocalVariable(name: "gb", arg: 2, scope: !1002, file: !935, line: 93, type: !1020)
!1033 = !DILocation(line: 93, column: 63, scope: !1002)
!1034 = !DILocalVariable(name: "channel_mask", scope: !1002, file: !935, line: 95, type: !931)
!1035 = !DILocation(line: 95, column: 14, scope: !1002)
!1036 = !DILocalVariable(name: "frame_type", scope: !1002, file: !935, line: 96, type: !917)
!1037 = !DILocation(line: 96, column: 9, scope: !1002)
!1038 = !DILocalVariable(name: "i", scope: !1002, file: !935, line: 96, type: !917)
!1039 = !DILocation(line: 96, column: 21, scope: !1002)
!1040 = !DILocation(line: 98, column: 25, scope: !1002)
!1041 = !DILocation(line: 98, column: 16, scope: !1002)
!1042 = !DILocation(line: 98, column: 5, scope: !1002)
!1043 = !DILocation(line: 98, column: 8, scope: !1002)
!1044 = !DILocation(line: 98, column: 14, scope: !1002)
!1045 = !DILocation(line: 99, column: 15, scope: !1002)
!1046 = !DILocation(line: 99, column: 5, scope: !1002)
!1047 = !DILocation(line: 101, column: 27, scope: !1002)
!1048 = !DILocation(line: 101, column: 18, scope: !1002)
!1049 = !DILocation(line: 101, column: 16, scope: !1002)
!1050 = !DILocation(line: 102, column: 29, scope: !1002)
!1051 = !DILocation(line: 102, column: 18, scope: !1002)
!1052 = !DILocation(line: 102, column: 5, scope: !1002)
!1053 = !DILocation(line: 102, column: 8, scope: !1002)
!1054 = !DILocation(line: 102, column: 16, scope: !1002)
!1055 = !DILocation(line: 104, column: 29, scope: !1002)
!1056 = !DILocation(line: 104, column: 20, scope: !1002)
!1057 = !DILocation(line: 104, column: 5, scope: !1002)
!1058 = !DILocation(line: 104, column: 8, scope: !1002)
!1059 = !DILocation(line: 104, column: 18, scope: !1002)
!1060 = !DILocation(line: 105, column: 31, scope: !1002)
!1061 = !DILocation(line: 105, column: 22, scope: !1002)
!1062 = !DILocation(line: 105, column: 39, scope: !1002)
!1063 = !DILocation(line: 105, column: 5, scope: !1002)
!1064 = !DILocation(line: 105, column: 8, scope: !1002)
!1065 = !DILocation(line: 105, column: 20, scope: !1002)
!1066 = !DILocation(line: 107, column: 23, scope: !1002)
!1067 = !DILocation(line: 107, column: 14, scope: !1002)
!1068 = !DILocation(line: 107, column: 30, scope: !1002)
!1069 = !DILocation(line: 107, column: 5, scope: !1002)
!1070 = !DILocation(line: 107, column: 8, scope: !1002)
!1071 = !DILocation(line: 107, column: 12, scope: !1002)
!1072 = !DILocation(line: 109, column: 28, scope: !1002)
!1073 = !DILocation(line: 109, column: 19, scope: !1002)
!1074 = !DILocation(line: 109, column: 35, scope: !1002)
!1075 = !DILocation(line: 109, column: 5, scope: !1002)
!1076 = !DILocation(line: 109, column: 8, scope: !1002)
!1077 = !DILocation(line: 109, column: 17, scope: !1002)
!1078 = !DILocation(line: 112, column: 19, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1002, file: !935, line: 112, column: 9)
!1080 = !DILocation(line: 112, column: 9, scope: !1079)
!1081 = !DILocation(line: 112, column: 9, scope: !1002)
!1082 = !DILocation(line: 113, column: 19, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !935, line: 112, column: 24)
!1084 = !DILocation(line: 113, column: 9, scope: !1083)
!1085 = !DILocation(line: 114, column: 23, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1083, file: !935, line: 114, column: 13)
!1087 = !DILocation(line: 114, column: 13, scope: !1086)
!1088 = !DILocation(line: 114, column: 13, scope: !1083)
!1089 = !DILocation(line: 115, column: 20, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !935, line: 115, column: 13)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !935, line: 114, column: 28)
!1092 = !DILocation(line: 115, column: 18, scope: !1090)
!1093 = !DILocation(line: 115, column: 25, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1095, file: !935, discriminator: 1)
!1095 = distinct !DILexicalBlock(scope: !1090, file: !935, line: 115, column: 13)
!1096 = !DILocation(line: 115, column: 29, scope: !1094)
!1097 = !DILocation(line: 115, column: 32, scope: !1094)
!1098 = !DILocation(line: 115, column: 27, scope: !1094)
!1099 = !DILocation(line: 115, column: 13, scope: !1094)
!1100 = !DILocalVariable(name: "value", scope: !1101, file: !935, line: 116, type: !917)
!1101 = distinct !DILexicalBlock(scope: !1095, file: !935, line: 115, column: 47)
!1102 = !DILocation(line: 116, column: 21, scope: !1101)
!1103 = !DILocation(line: 116, column: 38, scope: !1101)
!1104 = !DILocation(line: 116, column: 29, scope: !1101)
!1105 = !DILocation(line: 118, column: 21, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1101, file: !935, line: 118, column: 21)
!1107 = !DILocation(line: 118, column: 27, scope: !1106)
!1108 = !DILocation(line: 118, column: 21, scope: !1101)
!1109 = !DILocation(line: 119, column: 57, scope: !1106)
!1110 = !DILocation(line: 119, column: 37, scope: !1106)
!1111 = !DILocation(line: 119, column: 34, scope: !1106)
!1112 = !DILocation(line: 119, column: 21, scope: !1106)
!1113 = !DILocation(line: 120, column: 13, scope: !1101)
!1114 = !DILocation(line: 115, column: 43, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1095, file: !935, discriminator: 2)
!1116 = !DILocation(line: 115, column: 13, scope: !1115)
!1117 = distinct !{!1117, !1118}
!1118 = !DILocation(line: 115, column: 13, scope: !1091)
!1119 = !DILocation(line: 121, column: 9, scope: !1091)
!1120 = !DILocation(line: 122, column: 5, scope: !1083)
!1121 = !DILocation(line: 124, column: 20, scope: !1002)
!1122 = !DILocation(line: 124, column: 5, scope: !1002)
!1123 = !DILocation(line: 124, column: 8, scope: !1002)
!1124 = !DILocation(line: 124, column: 18, scope: !1002)
!1125 = !DILocation(line: 125, column: 43, scope: !1002)
!1126 = !DILocation(line: 125, column: 46, scope: !1002)
!1127 = !DILocation(line: 125, column: 59, scope: !1002)
!1128 = !DILocation(line: 125, column: 24, scope: !1002)
!1129 = !DILocation(line: 125, column: 5, scope: !1002)
!1130 = !DILocation(line: 125, column: 8, scope: !1002)
!1131 = !DILocation(line: 125, column: 22, scope: !1002)
!1132 = !DILocation(line: 126, column: 1, scope: !1002)
!1133 = distinct !DISubprogram(name: "get_bits", scope: !1022, file: !1022, line: 381, type: !1134, isLocal: true, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!918, !1020, !917}
!1136 = !DILocalVariable(name: "s", arg: 1, scope: !1133, file: !1022, line: 381, type: !1020)
!1137 = !DILocation(line: 381, column: 52, scope: !1133)
!1138 = !DILocalVariable(name: "n", arg: 2, scope: !1133, file: !1022, line: 381, type: !917)
!1139 = !DILocation(line: 381, column: 59, scope: !1133)
!1140 = !DILocalVariable(name: "tmp", scope: !1133, file: !1022, line: 383, type: !917)
!1141 = !DILocation(line: 383, column: 18, scope: !1133)
!1142 = !DILocalVariable(name: "re_index", scope: !1133, file: !1022, line: 399, type: !918)
!1143 = !DILocation(line: 399, column: 18, scope: !1133)
!1144 = !DILocation(line: 399, column: 30, scope: !1133)
!1145 = !DILocation(line: 399, column: 34, scope: !1133)
!1146 = !DILocalVariable(name: "re_cache", scope: !1133, file: !1022, line: 399, type: !918)
!1147 = !DILocation(line: 399, column: 78, scope: !1133)
!1148 = !DILocalVariable(name: "re_size_plus8", scope: !1133, file: !1022, line: 399, type: !918)
!1149 = !DILocation(line: 399, column: 101, scope: !1133)
!1150 = !DILocation(line: 399, column: 118, scope: !1133)
!1151 = !DILocation(line: 399, column: 122, scope: !1133)
!1152 = !DILocation(line: 401, column: 49, scope: !1133)
!1153 = !DILocation(line: 401, column: 53, scope: !1133)
!1154 = !DILocation(line: 401, column: 63, scope: !1133)
!1155 = !DILocation(line: 401, column: 72, scope: !1133)
!1156 = !DILocation(line: 401, column: 60, scope: !1133)
!1157 = !DILocation(line: 401, column: 81, scope: !1133)
!1158 = !DILocation(line: 401, column: 88, scope: !1133)
!1159 = !DILocation(line: 401, column: 97, scope: !1133)
!1160 = !DILocation(line: 401, column: 84, scope: !1133)
!1161 = !DILocation(line: 401, column: 14, scope: !1133)
!1162 = !DILocation(line: 402, column: 23, scope: !1133)
!1163 = !DILocation(line: 402, column: 33, scope: !1133)
!1164 = !DILocation(line: 402, column: 11, scope: !1133)
!1165 = !DILocation(line: 402, column: 9, scope: !1133)
!1166 = !DILocation(line: 403, column: 18, scope: !1133)
!1167 = !DILocation(line: 403, column: 36, scope: !1133)
!1168 = !DILocation(line: 403, column: 48, scope: !1133)
!1169 = !DILocation(line: 403, column: 45, scope: !1133)
!1170 = !DILocation(line: 403, column: 33, scope: !1133)
!1171 = !DILocation(line: 403, column: 17, scope: !1133)
!1172 = !DILocation(line: 403, column: 55, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1133, file: !1022, discriminator: 1)
!1174 = !DILocation(line: 403, column: 67, scope: !1173)
!1175 = !DILocation(line: 403, column: 64, scope: !1173)
!1176 = !DILocation(line: 403, column: 17, scope: !1173)
!1177 = !DILocation(line: 403, column: 74, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1133, file: !1022, discriminator: 2)
!1179 = !DILocation(line: 403, column: 17, scope: !1178)
!1180 = !DILocation(line: 403, column: 17, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1133, file: !1022, discriminator: 3)
!1182 = !DILocation(line: 403, column: 14, scope: !1181)
!1183 = !DILocation(line: 404, column: 18, scope: !1133)
!1184 = !DILocation(line: 404, column: 6, scope: !1133)
!1185 = !DILocation(line: 404, column: 10, scope: !1133)
!1186 = !DILocation(line: 404, column: 16, scope: !1133)
!1187 = !DILocation(line: 406, column: 12, scope: !1133)
!1188 = !DILocation(line: 406, column: 5, scope: !1133)
!1189 = distinct !DISubprogram(name: "skip_bits", scope: !1022, file: !1022, line: 460, type: !1190, isLocal: true, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{null, !1020, !917}
!1192 = !DILocalVariable(name: "s", arg: 1, scope: !1189, file: !1022, line: 460, type: !1020)
!1193 = !DILocation(line: 460, column: 45, scope: !1189)
!1194 = !DILocalVariable(name: "n", arg: 2, scope: !1189, file: !1022, line: 460, type: !917)
!1195 = !DILocation(line: 460, column: 52, scope: !1189)
!1196 = !DILocalVariable(name: "re_index", scope: !1189, file: !1022, line: 481, type: !918)
!1197 = !DILocation(line: 481, column: 18, scope: !1189)
!1198 = !DILocation(line: 481, column: 30, scope: !1189)
!1199 = !DILocation(line: 481, column: 34, scope: !1189)
!1200 = !DILocalVariable(name: "re_cache", scope: !1189, file: !1022, line: 481, type: !918)
!1201 = !DILocation(line: 481, column: 78, scope: !1189)
!1202 = !DILocalVariable(name: "re_size_plus8", scope: !1189, file: !1022, line: 481, type: !918)
!1203 = !DILocation(line: 481, column: 101, scope: !1189)
!1204 = !DILocation(line: 481, column: 118, scope: !1189)
!1205 = !DILocation(line: 481, column: 122, scope: !1189)
!1206 = !DILocation(line: 482, column: 18, scope: !1189)
!1207 = !DILocation(line: 482, column: 36, scope: !1189)
!1208 = !DILocation(line: 482, column: 48, scope: !1189)
!1209 = !DILocation(line: 482, column: 45, scope: !1189)
!1210 = !DILocation(line: 482, column: 33, scope: !1189)
!1211 = !DILocation(line: 482, column: 17, scope: !1189)
!1212 = !DILocation(line: 482, column: 55, scope: !1213)
!1213 = !DILexicalBlockFile(scope: !1189, file: !1022, discriminator: 1)
!1214 = !DILocation(line: 482, column: 67, scope: !1213)
!1215 = !DILocation(line: 482, column: 64, scope: !1213)
!1216 = !DILocation(line: 482, column: 17, scope: !1213)
!1217 = !DILocation(line: 482, column: 74, scope: !1218)
!1218 = !DILexicalBlockFile(scope: !1189, file: !1022, discriminator: 2)
!1219 = !DILocation(line: 482, column: 17, scope: !1218)
!1220 = !DILocation(line: 482, column: 17, scope: !1221)
!1221 = !DILexicalBlockFile(scope: !1189, file: !1022, discriminator: 3)
!1222 = !DILocation(line: 482, column: 14, scope: !1221)
!1223 = !DILocation(line: 483, column: 18, scope: !1189)
!1224 = !DILocation(line: 483, column: 6, scope: !1189)
!1225 = !DILocation(line: 483, column: 10, scope: !1189)
!1226 = !DILocation(line: 483, column: 16, scope: !1189)
!1227 = !DILocation(line: 485, column: 1, scope: !1189)
!1228 = distinct !DISubprogram(name: "get_bits64", scope: !1022, file: !1022, line: 557, type: !1229, isLocal: true, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!931, !1020, !917}
!1231 = !DILocalVariable(name: "s", arg: 1, scope: !1228, file: !1022, line: 557, type: !1020)
!1232 = !DILocation(line: 557, column: 50, scope: !1228)
!1233 = !DILocalVariable(name: "n", arg: 2, scope: !1228, file: !1022, line: 557, type: !917)
!1234 = !DILocation(line: 557, column: 57, scope: !1228)
!1235 = !DILocation(line: 559, column: 9, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1228, file: !1022, line: 559, column: 9)
!1237 = !DILocation(line: 559, column: 11, scope: !1236)
!1238 = !DILocation(line: 559, column: 9, scope: !1228)
!1239 = !DILocation(line: 560, column: 30, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1236, file: !1022, line: 559, column: 18)
!1241 = !DILocation(line: 560, column: 33, scope: !1240)
!1242 = !DILocation(line: 560, column: 16, scope: !1240)
!1243 = !DILocation(line: 560, column: 9, scope: !1240)
!1244 = !DILocalVariable(name: "ret", scope: !1245, file: !1022, line: 563, type: !931)
!1245 = distinct !DILexicalBlock(scope: !1236, file: !1022, line: 561, column: 12)
!1246 = !DILocation(line: 563, column: 18, scope: !1245)
!1247 = !DILocation(line: 563, column: 38, scope: !1245)
!1248 = !DILocation(line: 563, column: 24, scope: !1245)
!1249 = !DILocation(line: 564, column: 16, scope: !1245)
!1250 = !DILocation(line: 564, column: 47, scope: !1245)
!1251 = !DILocation(line: 564, column: 50, scope: !1245)
!1252 = !DILocation(line: 564, column: 52, scope: !1245)
!1253 = !DILocation(line: 564, column: 33, scope: !1245)
!1254 = !DILocation(line: 564, column: 22, scope: !1245)
!1255 = !DILocation(line: 564, column: 58, scope: !1245)
!1256 = !DILocation(line: 564, column: 20, scope: !1245)
!1257 = !DILocation(line: 564, column: 9, scope: !1245)
!1258 = !DILocation(line: 570, column: 1, scope: !1228)
!1259 = distinct !DISubprogram(name: "get_bits1", scope: !1022, file: !1022, line: 487, type: !1260, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!918, !1020}
!1262 = !DILocalVariable(name: "s", arg: 1, scope: !1259, file: !1022, line: 487, type: !1020)
!1263 = !DILocation(line: 487, column: 53, scope: !1259)
!1264 = !DILocalVariable(name: "index", scope: !1259, file: !1022, line: 499, type: !918)
!1265 = !DILocation(line: 499, column: 18, scope: !1259)
!1266 = !DILocation(line: 499, column: 26, scope: !1259)
!1267 = !DILocation(line: 499, column: 29, scope: !1259)
!1268 = !DILocalVariable(name: "result", scope: !1259, file: !1022, line: 500, type: !921)
!1269 = !DILocation(line: 500, column: 13, scope: !1259)
!1270 = !DILocation(line: 500, column: 32, scope: !1259)
!1271 = !DILocation(line: 500, column: 38, scope: !1259)
!1272 = !DILocation(line: 500, column: 22, scope: !1259)
!1273 = !DILocation(line: 500, column: 25, scope: !1259)
!1274 = !DILocation(line: 502, column: 16, scope: !1259)
!1275 = !DILocation(line: 502, column: 22, scope: !1259)
!1276 = !DILocation(line: 502, column: 12, scope: !1259)
!1277 = !DILocation(line: 503, column: 12, scope: !1259)
!1278 = !DILocation(line: 509, column: 9, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1259, file: !1022, line: 509, column: 9)
!1280 = !DILocation(line: 509, column: 12, scope: !1279)
!1281 = !DILocation(line: 509, column: 20, scope: !1279)
!1282 = !DILocation(line: 509, column: 23, scope: !1279)
!1283 = !DILocation(line: 509, column: 18, scope: !1279)
!1284 = !DILocation(line: 509, column: 9, scope: !1259)
!1285 = !DILocation(line: 511, column: 14, scope: !1279)
!1286 = !DILocation(line: 511, column: 9, scope: !1279)
!1287 = !DILocation(line: 512, column: 16, scope: !1259)
!1288 = !DILocation(line: 512, column: 5, scope: !1259)
!1289 = !DILocation(line: 512, column: 8, scope: !1259)
!1290 = !DILocation(line: 512, column: 14, scope: !1259)
!1291 = !DILocation(line: 514, column: 12, scope: !1259)
!1292 = !DILocation(line: 514, column: 5, scope: !1259)
!1293 = distinct !DISubprogram(name: "tak_get_nb_samples", scope: !935, file: !935, line: 54, type: !1294, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!917, !917, !904}
!1296 = !DILocalVariable(name: "sample_rate", arg: 1, scope: !1293, file: !935, line: 54, type: !917)
!1297 = !DILocation(line: 54, column: 35, scope: !1293)
!1298 = !DILocalVariable(name: "type", arg: 2, scope: !1293, file: !935, line: 54, type: !904)
!1299 = !DILocation(line: 54, column: 70, scope: !1293)
!1300 = !DILocalVariable(name: "nb_samples", scope: !1293, file: !935, line: 56, type: !917)
!1301 = !DILocation(line: 56, column: 9, scope: !1293)
!1302 = !DILocalVariable(name: "max_nb_samples", scope: !1293, file: !935, line: 56, type: !917)
!1303 = !DILocation(line: 56, column: 21, scope: !1293)
!1304 = !DILocation(line: 58, column: 9, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1293, file: !935, line: 58, column: 9)
!1306 = !DILocation(line: 58, column: 14, scope: !1305)
!1307 = !DILocation(line: 58, column: 9, scope: !1293)
!1308 = !DILocation(line: 59, column: 22, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1305, file: !935, line: 58, column: 32)
!1310 = !DILocation(line: 59, column: 63, scope: !1309)
!1311 = !DILocation(line: 59, column: 36, scope: !1309)
!1312 = !DILocation(line: 59, column: 34, scope: !1309)
!1313 = !DILocation(line: 59, column: 69, scope: !1309)
!1314 = !DILocation(line: 59, column: 20, scope: !1309)
!1315 = !DILocation(line: 61, column: 24, scope: !1309)
!1316 = !DILocation(line: 62, column: 5, scope: !1309)
!1317 = !DILocation(line: 62, column: 16, scope: !1318)
!1318 = !DILexicalBlockFile(scope: !1319, file: !935, discriminator: 1)
!1319 = distinct !DILexicalBlock(scope: !1305, file: !935, line: 62, column: 16)
!1320 = !DILocation(line: 62, column: 21, scope: !1318)
!1321 = !DILocation(line: 63, column: 49, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1319, file: !935, line: 62, column: 103)
!1323 = !DILocation(line: 63, column: 22, scope: !1322)
!1324 = !DILocation(line: 63, column: 20, scope: !1322)
!1325 = !DILocation(line: 64, column: 26, scope: !1322)
!1326 = !DILocation(line: 65, column: 26, scope: !1322)
!1327 = !DILocation(line: 64, column: 38, scope: !1322)
!1328 = !DILocation(line: 65, column: 68, scope: !1322)
!1329 = !DILocation(line: 64, column: 24, scope: !1322)
!1330 = !DILocation(line: 67, column: 5, scope: !1322)
!1331 = !DILocation(line: 68, column: 9, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1319, file: !935, line: 67, column: 12)
!1333 = !DILocation(line: 71, column: 9, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1293, file: !935, line: 71, column: 9)
!1335 = !DILocation(line: 71, column: 20, scope: !1334)
!1336 = !DILocation(line: 71, column: 25, scope: !1334)
!1337 = !DILocation(line: 71, column: 28, scope: !1338)
!1338 = !DILexicalBlockFile(scope: !1334, file: !935, discriminator: 1)
!1339 = !DILocation(line: 71, column: 41, scope: !1338)
!1340 = !DILocation(line: 71, column: 39, scope: !1338)
!1341 = !DILocation(line: 71, column: 9, scope: !1338)
!1342 = !DILocation(line: 72, column: 9, scope: !1334)
!1343 = !DILocation(line: 74, column: 12, scope: !1293)
!1344 = !DILocation(line: 74, column: 5, scope: !1293)
!1345 = !DILocation(line: 75, column: 1, scope: !1293)
!1346 = distinct !DISubprogram(name: "avpriv_tak_parse_streaminfo", scope: !935, file: !935, line: 128, type: !1347, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!917, !1005, !919, !917}
!1349 = !DILocalVariable(name: "s", arg: 1, scope: !1346, file: !935, line: 128, type: !1005)
!1350 = !DILocation(line: 128, column: 48, scope: !1346)
!1351 = !DILocalVariable(name: "buf", arg: 2, scope: !1346, file: !935, line: 128, type: !919)
!1352 = !DILocation(line: 128, column: 66, scope: !1346)
!1353 = !DILocalVariable(name: "size", arg: 3, scope: !1346, file: !935, line: 128, type: !917)
!1354 = !DILocation(line: 128, column: 75, scope: !1346)
!1355 = !DILocalVariable(name: "gb", scope: !1346, file: !935, line: 130, type: !1021)
!1356 = !DILocation(line: 130, column: 19, scope: !1346)
!1357 = !DILocalVariable(name: "ret", scope: !1346, file: !935, line: 131, type: !917)
!1358 = !DILocation(line: 131, column: 9, scope: !1346)
!1359 = !DILocation(line: 131, column: 35, scope: !1346)
!1360 = !DILocation(line: 131, column: 40, scope: !1346)
!1361 = !DILocation(line: 131, column: 15, scope: !1346)
!1362 = !DILocation(line: 133, column: 9, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1346, file: !935, line: 133, column: 9)
!1364 = !DILocation(line: 133, column: 13, scope: !1363)
!1365 = !DILocation(line: 133, column: 9, scope: !1346)
!1366 = !DILocation(line: 134, column: 9, scope: !1363)
!1367 = !DILocation(line: 136, column: 29, scope: !1346)
!1368 = !DILocation(line: 136, column: 5, scope: !1346)
!1369 = !DILocation(line: 138, column: 5, scope: !1346)
!1370 = !DILocation(line: 139, column: 1, scope: !1346)
!1371 = distinct !DISubprogram(name: "init_get_bits8", scope: !1022, file: !1022, line: 650, type: !1372, isLocal: true, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!917, !1020, !919, !917}
!1374 = !DILocalVariable(name: "s", arg: 1, scope: !1371, file: !1022, line: 650, type: !1020)
!1375 = !DILocation(line: 650, column: 49, scope: !1371)
!1376 = !DILocalVariable(name: "buffer", arg: 2, scope: !1371, file: !1022, line: 650, type: !919)
!1377 = !DILocation(line: 650, column: 67, scope: !1371)
!1378 = !DILocalVariable(name: "byte_size", arg: 3, scope: !1371, file: !1022, line: 651, type: !917)
!1379 = !DILocation(line: 651, column: 38, scope: !1371)
!1380 = !DILocation(line: 653, column: 9, scope: !1381)
!1381 = distinct !DILexicalBlock(scope: !1371, file: !1022, line: 653, column: 9)
!1382 = !DILocation(line: 653, column: 19, scope: !1381)
!1383 = !DILocation(line: 653, column: 36, scope: !1381)
!1384 = !DILocation(line: 653, column: 39, scope: !1385)
!1385 = !DILexicalBlockFile(scope: !1381, file: !1022, discriminator: 1)
!1386 = !DILocation(line: 653, column: 49, scope: !1385)
!1387 = !DILocation(line: 653, column: 9, scope: !1385)
!1388 = !DILocation(line: 654, column: 19, scope: !1381)
!1389 = !DILocation(line: 654, column: 9, scope: !1381)
!1390 = !DILocation(line: 655, column: 26, scope: !1371)
!1391 = !DILocation(line: 655, column: 29, scope: !1371)
!1392 = !DILocation(line: 655, column: 37, scope: !1371)
!1393 = !DILocation(line: 655, column: 47, scope: !1371)
!1394 = !DILocation(line: 655, column: 12, scope: !1371)
!1395 = !DILocation(line: 655, column: 5, scope: !1371)
!1396 = distinct !DISubprogram(name: "ff_tak_decode_frame_header", scope: !935, file: !935, line: 141, type: !1397, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !955)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!917, !1399, !1020, !1005, !917}
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !52, line: 3360, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !52, line: 1556, size: 8448, align: 64, elements: !1402)
!1402 = !{!1403, !1448, !1449, !1450, !1711, !1712, !1713, !1714, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1740, !1744, !1745, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1924, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1401, file: !52, line: 1561, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !21, line: 143, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !21, line: 67, size: 640, align: 64, elements: !1408)
!1408 = !{!1409, !1413, !1418, !1422, !1423, !1424, !1425, !1429, !1435, !1437, !1441}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1407, file: !21, line: 72, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1412 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1407, file: !21, line: 78, baseType: !1414, size: 64, align: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!1410, !1417}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1407, file: !21, line: 85, baseType: !1419, size: 64, align: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !21, line: 85, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1407, file: !21, line: 93, baseType: !917, size: 32, align: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1407, file: !21, line: 99, baseType: !917, size: 32, align: 32, offset: 224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1407, file: !21, line: 108, baseType: !917, size: 32, align: 32, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1407, file: !21, line: 113, baseType: !1426, size: 64, align: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!1417, !1417, !1417}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1407, file: !21, line: 123, baseType: !1430, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!1433, !1433}
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1407, file: !21, line: 130, baseType: !1436, size: 32, align: 32, offset: 448)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !21, line: 48, baseType: !20)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1407, file: !21, line: 136, baseType: !1438, size: 64, align: 64, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!1436, !1417}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1407, file: !21, line: 142, baseType: !1442, size: 64, align: 64, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!917, !1445, !1417, !1410, !917}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !21, line: 60, flags: DIFlagFwdDecl)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1401, file: !52, line: 1562, baseType: !917, size: 32, align: 32, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1401, file: !52, line: 1564, baseType: !41, size: 32, align: 32, offset: 96)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1401, file: !52, line: 1565, baseType: !1451, size: 64, align: 64, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !52, line: 3468, size: 1984, align: 64, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1469, !1472, !1475, !1478, !1481, !1482, !1483, !1491, !1492, !1493, !1495, !1499, !1505, !1510, !1514, !1515, !1561, !1682, !1686, !1687, !1691, !1695, !1700, !1704, !1705, !1706}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1453, file: !52, line: 3475, baseType: !1410, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1453, file: !52, line: 3480, baseType: !1410, size: 64, align: 64, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1453, file: !52, line: 3481, baseType: !41, size: 32, align: 32, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1453, file: !52, line: 3482, baseType: !51, size: 32, align: 32, offset: 160)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1453, file: !52, line: 3487, baseType: !917, size: 32, align: 32, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1453, file: !52, line: 3488, baseType: !1461, size: 64, align: 64, offset: 256)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1463)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1464, line: 61, baseType: !1465)
!1464 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1464, line: 58, size: 64, align: 32, elements: !1466)
!1466 = !{!1467, !1468}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1465, file: !1464, line: 59, baseType: !917, size: 32, align: 32)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1465, file: !1464, line: 60, baseType: !917, size: 32, align: 32, offset: 32)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1453, file: !52, line: 3489, baseType: !1470, size: 64, align: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1453, file: !52, line: 3490, baseType: !1473, size: 64, align: 64, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1453, file: !52, line: 3491, baseType: !1476, size: 64, align: 64, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1453, file: !52, line: 3492, baseType: !1479, size: 64, align: 64, offset: 512)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1453, file: !52, line: 3493, baseType: !921, size: 8, align: 8, offset: 576)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1453, file: !52, line: 3494, baseType: !1404, size: 64, align: 64, offset: 640)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1453, file: !52, line: 3495, baseType: !1484, size: 64, align: 64, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !52, line: 3404, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !52, line: 3401, size: 128, align: 64, elements: !1488)
!1488 = !{!1489, !1490}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1487, file: !52, line: 3402, baseType: !917, size: 32, align: 32)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1487, file: !52, line: 3403, baseType: !1410, size: 64, align: 64, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1453, file: !52, line: 3507, baseType: !1410, size: 64, align: 64, offset: 768)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1453, file: !52, line: 3516, baseType: !917, size: 32, align: 32, offset: 832)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1453, file: !52, line: 3517, baseType: !1494, size: 64, align: 64, offset: 896)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1453, file: !52, line: 3527, baseType: !1496, size: 64, align: 64, offset: 960)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!917, !1399}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1453, file: !52, line: 3535, baseType: !1500, size: 64, align: 64, offset: 1024)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!917, !1399, !1503}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1400)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1453, file: !52, line: 3541, baseType: !1506, size: 64, align: 64, offset: 1088)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1508)
!1508 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !52, line: 3461, baseType: !1509)
!1509 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !52, line: 3461, flags: DIFlagFwdDecl)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1453, file: !52, line: 3549, baseType: !1511, size: 64, align: 64, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{null, !1494}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1453, file: !52, line: 3551, baseType: !1496, size: 64, align: 64, offset: 1216)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1453, file: !52, line: 3552, baseType: !1516, size: 64, align: 64, offset: 1280)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!917, !1399, !1519, !917, !1520}
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !52, line: 3920, size: 256, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1560}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1522, file: !52, line: 3921, baseType: !945, size: 16, align: 16)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1522, file: !52, line: 3922, baseType: !930, size: 32, align: 32, offset: 32)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1522, file: !52, line: 3923, baseType: !930, size: 32, align: 32, offset: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1522, file: !52, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1522, file: !52, line: 3925, baseType: !1529, size: 64, align: 64, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !52, line: 3918, baseType: !1532)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !52, line: 3885, size: 1600, align: 64, elements: !1533)
!1533 = !{!1534, !1535, !1536, !1537, !1538, !1539, !1549, !1553, !1555, !1556, !1558, !1559}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1532, file: !52, line: 3886, baseType: !917, size: 32, align: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1532, file: !52, line: 3887, baseType: !917, size: 32, align: 32, offset: 32)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1532, file: !52, line: 3888, baseType: !917, size: 32, align: 32, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1532, file: !52, line: 3889, baseType: !917, size: 32, align: 32, offset: 96)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1532, file: !52, line: 3890, baseType: !917, size: 32, align: 32, offset: 128)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1532, file: !52, line: 3897, baseType: !1540, size: 768, align: 64, offset: 192)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !52, line: 3858, baseType: !1541)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !52, line: 3853, size: 768, align: 64, elements: !1542)
!1542 = !{!1543, !1547}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1541, file: !52, line: 3855, baseType: !1544, size: 512, align: 64)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1519, size: 512, align: 64, elements: !1545)
!1545 = !{!1546}
!1546 = !DISubrange(count: 8)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1541, file: !52, line: 3857, baseType: !1548, size: 256, align: 32, offset: 512)
!1548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 32, elements: !1545)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1532, file: !52, line: 3903, baseType: !1550, size: 256, align: 64, offset: 960)
!1550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1519, size: 256, align: 64, elements: !1551)
!1551 = !{!1552}
!1552 = !DISubrange(count: 4)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1532, file: !52, line: 3904, baseType: !1554, size: 128, align: 32, offset: 1216)
!1554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, align: 32, elements: !1551)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1532, file: !52, line: 3906, baseType: !728, size: 32, align: 32, offset: 1344)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1532, file: !52, line: 3908, baseType: !1557, size: 64, align: 64, offset: 1408)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1532, file: !52, line: 3915, baseType: !1557, size: 64, align: 64, offset: 1472)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1532, file: !52, line: 3917, baseType: !917, size: 32, align: 32, offset: 1536)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1522, file: !52, line: 3926, baseType: !938, size: 64, align: 64, offset: 192)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1453, file: !52, line: 3564, baseType: !1562, size: 64, align: 64, offset: 1344)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!917, !1399, !1565, !1599, !1681}
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !52, line: 1499, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !52, line: 1445, size: 704, align: 64, elements: !1568)
!1568 = !{!1569, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1595, !1596, !1597, !1598}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1567, file: !52, line: 1451, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1572, line: 94, baseType: !1573)
!1572 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1572, line: 81, size: 192, align: 64, elements: !1574)
!1574 = !{!1575, !1579, !1580}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1573, file: !1572, line: 82, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1572, line: 73, baseType: !1578)
!1578 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1572, line: 73, flags: DIFlagFwdDecl)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1573, file: !1572, line: 89, baseType: !1519, size: 64, align: 64, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1573, file: !1572, line: 93, baseType: !917, size: 32, align: 32, offset: 128)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1567, file: !52, line: 1461, baseType: !938, size: 64, align: 64, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1567, file: !52, line: 1467, baseType: !938, size: 64, align: 64, offset: 128)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1567, file: !52, line: 1468, baseType: !1519, size: 64, align: 64, offset: 192)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1567, file: !52, line: 1469, baseType: !917, size: 32, align: 32, offset: 256)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1567, file: !52, line: 1470, baseType: !917, size: 32, align: 32, offset: 288)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1567, file: !52, line: 1474, baseType: !917, size: 32, align: 32, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1567, file: !52, line: 1479, baseType: !1588, size: 64, align: 64, offset: 384)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !52, line: 1415, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !52, line: 1411, size: 128, align: 64, elements: !1591)
!1591 = !{!1592, !1593, !1594}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1590, file: !52, line: 1412, baseType: !1519, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1590, file: !52, line: 1413, baseType: !917, size: 32, align: 32, offset: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1590, file: !52, line: 1414, baseType: !734, size: 32, align: 32, offset: 96)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1567, file: !52, line: 1480, baseType: !917, size: 32, align: 32, offset: 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1567, file: !52, line: 1486, baseType: !938, size: 64, align: 64, offset: 512)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1567, file: !52, line: 1488, baseType: !938, size: 64, align: 64, offset: 576)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1567, file: !52, line: 1497, baseType: !938, size: 64, align: 64, offset: 640)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1601)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !775, line: 646, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !775, line: 268, size: 4288, align: 64, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1633, !1635, !1636, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1669, !1670, !1671, !1672, !1673, !1674, !1677, !1678, !1679, !1680}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1602, file: !775, line: 282, baseType: !1544, size: 512, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1602, file: !775, line: 299, baseType: !1548, size: 256, align: 32, offset: 512)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1602, file: !775, line: 315, baseType: !1607, size: 64, align: 64, offset: 768)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1602, file: !775, line: 326, baseType: !917, size: 32, align: 32, offset: 832)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1602, file: !775, line: 326, baseType: !917, size: 32, align: 32, offset: 864)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1602, file: !775, line: 334, baseType: !917, size: 32, align: 32, offset: 896)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1602, file: !775, line: 341, baseType: !917, size: 32, align: 32, offset: 928)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1602, file: !775, line: 346, baseType: !917, size: 32, align: 32, offset: 960)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1602, file: !775, line: 351, baseType: !764, size: 32, align: 32, offset: 992)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1602, file: !775, line: 356, baseType: !1463, size: 64, align: 32, offset: 1024)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1602, file: !775, line: 361, baseType: !938, size: 64, align: 64, offset: 1088)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1602, file: !775, line: 369, baseType: !938, size: 64, align: 64, offset: 1152)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1602, file: !775, line: 377, baseType: !938, size: 64, align: 64, offset: 1216)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1602, file: !775, line: 382, baseType: !917, size: 32, align: 32, offset: 1280)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1602, file: !775, line: 386, baseType: !917, size: 32, align: 32, offset: 1312)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1602, file: !775, line: 391, baseType: !917, size: 32, align: 32, offset: 1344)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1602, file: !775, line: 396, baseType: !1417, size: 64, align: 64, offset: 1408)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1602, file: !775, line: 403, baseType: !1623, size: 512, align: 64, offset: 1472)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 512, align: 64, elements: !1545)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1602, file: !775, line: 410, baseType: !917, size: 32, align: 32, offset: 1984)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1602, file: !775, line: 415, baseType: !917, size: 32, align: 32, offset: 2016)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1602, file: !775, line: 420, baseType: !917, size: 32, align: 32, offset: 2048)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1602, file: !775, line: 425, baseType: !917, size: 32, align: 32, offset: 2080)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1602, file: !775, line: 435, baseType: !938, size: 64, align: 64, offset: 2112)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1602, file: !775, line: 440, baseType: !917, size: 32, align: 32, offset: 2176)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1602, file: !775, line: 445, baseType: !931, size: 64, align: 64, offset: 2240)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1602, file: !775, line: 459, baseType: !1632, size: 512, align: 64, offset: 2304)
!1632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1570, size: 512, align: 64, elements: !1545)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1602, file: !775, line: 473, baseType: !1634, size: 64, align: 64, offset: 2816)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1602, file: !775, line: 477, baseType: !917, size: 32, align: 32, offset: 2880)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1602, file: !775, line: 479, baseType: !1637, size: 64, align: 64, offset: 2944)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !775, line: 207, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !775, line: 201, size: 320, align: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1650}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1640, file: !775, line: 202, baseType: !774, size: 32, align: 32)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1640, file: !775, line: 203, baseType: !1519, size: 64, align: 64, offset: 64)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1640, file: !775, line: 204, baseType: !917, size: 32, align: 32, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1640, file: !775, line: 205, baseType: !1646, size: 64, align: 64, offset: 192)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1648, line: 86, baseType: !1649)
!1648 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1649 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1648, line: 86, flags: DIFlagFwdDecl)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1640, file: !775, line: 206, baseType: !1570, size: 64, align: 64, offset: 256)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1602, file: !775, line: 480, baseType: !917, size: 32, align: 32, offset: 3008)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1602, file: !775, line: 505, baseType: !917, size: 32, align: 32, offset: 3040)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1602, file: !775, line: 512, baseType: !798, size: 32, align: 32, offset: 3072)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1602, file: !775, line: 514, baseType: !804, size: 32, align: 32, offset: 3104)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1602, file: !775, line: 516, baseType: !822, size: 32, align: 32, offset: 3136)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1602, file: !775, line: 523, baseType: !846, size: 32, align: 32, offset: 3168)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1602, file: !775, line: 525, baseType: !865, size: 32, align: 32, offset: 3200)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1602, file: !775, line: 532, baseType: !938, size: 64, align: 64, offset: 3264)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1602, file: !775, line: 539, baseType: !938, size: 64, align: 64, offset: 3328)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1602, file: !775, line: 547, baseType: !938, size: 64, align: 64, offset: 3392)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1602, file: !775, line: 554, baseType: !1646, size: 64, align: 64, offset: 3456)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1602, file: !775, line: 563, baseType: !917, size: 32, align: 32, offset: 3520)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1602, file: !775, line: 572, baseType: !917, size: 32, align: 32, offset: 3552)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1602, file: !775, line: 581, baseType: !917, size: 32, align: 32, offset: 3584)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1602, file: !775, line: 588, baseType: !1666, size: 64, align: 64, offset: 3648)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !922, line: 36, baseType: !1668)
!1668 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1602, file: !775, line: 593, baseType: !917, size: 32, align: 32, offset: 3712)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1602, file: !775, line: 596, baseType: !917, size: 32, align: 32, offset: 3744)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1602, file: !775, line: 599, baseType: !1570, size: 64, align: 64, offset: 3776)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1602, file: !775, line: 605, baseType: !1570, size: 64, align: 64, offset: 3840)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1602, file: !775, line: 616, baseType: !1570, size: 64, align: 64, offset: 3904)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1602, file: !775, line: 626, baseType: !1675, size: 64, align: 64, offset: 3968)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1676, line: 216, baseType: !932)
!1676 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1602, file: !775, line: 627, baseType: !1675, size: 64, align: 64, offset: 4032)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1602, file: !775, line: 628, baseType: !1675, size: 64, align: 64, offset: 4096)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1602, file: !775, line: 629, baseType: !1675, size: 64, align: 64, offset: 4160)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1602, file: !775, line: 645, baseType: !1570, size: 64, align: 64, offset: 4224)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1453, file: !52, line: 3566, baseType: !1683, size: 64, align: 64, offset: 1408)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!917, !1399, !1417, !1681, !1565}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1453, file: !52, line: 3567, baseType: !1496, size: 64, align: 64, offset: 1472)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1453, file: !52, line: 3576, baseType: !1688, size: 64, align: 64, offset: 1536)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!917, !1399, !1599}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1453, file: !52, line: 3577, baseType: !1692, size: 64, align: 64, offset: 1600)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!917, !1399, !1565}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1453, file: !52, line: 3584, baseType: !1696, size: 64, align: 64, offset: 1664)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!917, !1399, !1699}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1453, file: !52, line: 3589, baseType: !1701, size: 64, align: 64, offset: 1728)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{null, !1399}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1453, file: !52, line: 3594, baseType: !917, size: 32, align: 32, offset: 1792)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1453, file: !52, line: 3600, baseType: !1410, size: 64, align: 64, offset: 1856)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1453, file: !52, line: 3609, baseType: !1707, size: 64, align: 64, offset: 1920)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1710)
!1710 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !52, line: 3609, flags: DIFlagFwdDecl)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1401, file: !52, line: 1566, baseType: !51, size: 32, align: 32, offset: 192)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1401, file: !52, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1401, file: !52, line: 1583, baseType: !1417, size: 64, align: 64, offset: 256)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1401, file: !52, line: 1591, baseType: !1715, size: 64, align: 64, offset: 320)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !52, line: 1532, flags: DIFlagFwdDecl)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1401, file: !52, line: 1598, baseType: !1417, size: 64, align: 64, offset: 384)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1401, file: !52, line: 1606, baseType: !938, size: 64, align: 64, offset: 448)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1401, file: !52, line: 1614, baseType: !917, size: 32, align: 32, offset: 512)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1401, file: !52, line: 1622, baseType: !917, size: 32, align: 32, offset: 544)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1401, file: !52, line: 1628, baseType: !917, size: 32, align: 32, offset: 576)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1401, file: !52, line: 1636, baseType: !917, size: 32, align: 32, offset: 608)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1401, file: !52, line: 1643, baseType: !917, size: 32, align: 32, offset: 640)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1401, file: !52, line: 1657, baseType: !1519, size: 64, align: 64, offset: 704)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1401, file: !52, line: 1658, baseType: !917, size: 32, align: 32, offset: 768)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1401, file: !52, line: 1679, baseType: !1463, size: 64, align: 32, offset: 800)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1401, file: !52, line: 1688, baseType: !917, size: 32, align: 32, offset: 864)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1401, file: !52, line: 1712, baseType: !917, size: 32, align: 32, offset: 896)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1401, file: !52, line: 1729, baseType: !917, size: 32, align: 32, offset: 928)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1401, file: !52, line: 1729, baseType: !917, size: 32, align: 32, offset: 960)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1401, file: !52, line: 1744, baseType: !917, size: 32, align: 32, offset: 992)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1401, file: !52, line: 1744, baseType: !917, size: 32, align: 32, offset: 1024)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1401, file: !52, line: 1751, baseType: !917, size: 32, align: 32, offset: 1056)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1401, file: !52, line: 1766, baseType: !511, size: 32, align: 32, offset: 1088)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1401, file: !52, line: 1791, baseType: !1736, size: 64, align: 64, offset: 1152)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64, align: 64)
!1737 = !DISubroutineType(types: !1738)
!1738 = !{null, !1739, !1599, !1681, !917, !917, !917}
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1401, file: !52, line: 1808, baseType: !1741, size: 64, align: 64, offset: 1216)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DISubroutineType(types: !1743)
!1743 = !{!511, !1739, !1470}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1401, file: !52, line: 1816, baseType: !917, size: 32, align: 32, offset: 1280)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1401, file: !52, line: 1825, baseType: !1746, size: 32, align: 32, offset: 1312)
!1746 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1401, file: !52, line: 1830, baseType: !917, size: 32, align: 32, offset: 1344)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1401, file: !52, line: 1838, baseType: !1746, size: 32, align: 32, offset: 1376)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1401, file: !52, line: 1846, baseType: !917, size: 32, align: 32, offset: 1408)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1401, file: !52, line: 1851, baseType: !917, size: 32, align: 32, offset: 1440)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1401, file: !52, line: 1861, baseType: !1746, size: 32, align: 32, offset: 1472)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1401, file: !52, line: 1868, baseType: !1746, size: 32, align: 32, offset: 1504)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1401, file: !52, line: 1875, baseType: !1746, size: 32, align: 32, offset: 1536)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1401, file: !52, line: 1882, baseType: !1746, size: 32, align: 32, offset: 1568)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1401, file: !52, line: 1889, baseType: !1746, size: 32, align: 32, offset: 1600)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1401, file: !52, line: 1896, baseType: !1746, size: 32, align: 32, offset: 1632)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1401, file: !52, line: 1903, baseType: !1746, size: 32, align: 32, offset: 1664)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1401, file: !52, line: 1910, baseType: !917, size: 32, align: 32, offset: 1696)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1401, file: !52, line: 1915, baseType: !917, size: 32, align: 32, offset: 1728)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1401, file: !52, line: 1926, baseType: !1681, size: 64, align: 64, offset: 1792)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1401, file: !52, line: 1935, baseType: !1463, size: 64, align: 32, offset: 1856)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1401, file: !52, line: 1942, baseType: !917, size: 32, align: 32, offset: 1920)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1401, file: !52, line: 1948, baseType: !917, size: 32, align: 32, offset: 1952)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1401, file: !52, line: 1954, baseType: !917, size: 32, align: 32, offset: 1984)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1401, file: !52, line: 1960, baseType: !917, size: 32, align: 32, offset: 2016)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1401, file: !52, line: 1984, baseType: !917, size: 32, align: 32, offset: 2048)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1401, file: !52, line: 1991, baseType: !917, size: 32, align: 32, offset: 2080)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1401, file: !52, line: 1996, baseType: !917, size: 32, align: 32, offset: 2112)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1401, file: !52, line: 2004, baseType: !917, size: 32, align: 32, offset: 2144)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1401, file: !52, line: 2011, baseType: !917, size: 32, align: 32, offset: 2176)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1401, file: !52, line: 2018, baseType: !917, size: 32, align: 32, offset: 2208)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1401, file: !52, line: 2027, baseType: !917, size: 32, align: 32, offset: 2240)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1401, file: !52, line: 2034, baseType: !917, size: 32, align: 32, offset: 2272)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1401, file: !52, line: 2044, baseType: !917, size: 32, align: 32, offset: 2304)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1401, file: !52, line: 2054, baseType: !1776, size: 64, align: 64, offset: 2368)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1401, file: !52, line: 2061, baseType: !1776, size: 64, align: 64, offset: 2432)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1401, file: !52, line: 2066, baseType: !917, size: 32, align: 32, offset: 2496)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1401, file: !52, line: 2070, baseType: !917, size: 32, align: 32, offset: 2528)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1401, file: !52, line: 2078, baseType: !917, size: 32, align: 32, offset: 2560)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1401, file: !52, line: 2085, baseType: !917, size: 32, align: 32, offset: 2592)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1401, file: !52, line: 2092, baseType: !917, size: 32, align: 32, offset: 2624)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1401, file: !52, line: 2099, baseType: !917, size: 32, align: 32, offset: 2656)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1401, file: !52, line: 2106, baseType: !917, size: 32, align: 32, offset: 2688)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1401, file: !52, line: 2113, baseType: !917, size: 32, align: 32, offset: 2720)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1401, file: !52, line: 2120, baseType: !917, size: 32, align: 32, offset: 2752)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1401, file: !52, line: 2125, baseType: !917, size: 32, align: 32, offset: 2784)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1401, file: !52, line: 2133, baseType: !917, size: 32, align: 32, offset: 2816)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1401, file: !52, line: 2140, baseType: !917, size: 32, align: 32, offset: 2848)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1401, file: !52, line: 2145, baseType: !917, size: 32, align: 32, offset: 2880)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1401, file: !52, line: 2153, baseType: !917, size: 32, align: 32, offset: 2912)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1401, file: !52, line: 2158, baseType: !917, size: 32, align: 32, offset: 2944)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1401, file: !52, line: 2166, baseType: !804, size: 32, align: 32, offset: 2976)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1401, file: !52, line: 2173, baseType: !822, size: 32, align: 32, offset: 3008)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1401, file: !52, line: 2180, baseType: !846, size: 32, align: 32, offset: 3040)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1401, file: !52, line: 2187, baseType: !798, size: 32, align: 32, offset: 3072)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1401, file: !52, line: 2194, baseType: !865, size: 32, align: 32, offset: 3104)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1401, file: !52, line: 2203, baseType: !917, size: 32, align: 32, offset: 3136)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1401, file: !52, line: 2209, baseType: !875, size: 32, align: 32, offset: 3168)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1401, file: !52, line: 2212, baseType: !917, size: 32, align: 32, offset: 3200)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1401, file: !52, line: 2213, baseType: !917, size: 32, align: 32, offset: 3232)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1401, file: !52, line: 2220, baseType: !711, size: 32, align: 32, offset: 3264)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1401, file: !52, line: 2232, baseType: !917, size: 32, align: 32, offset: 3296)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1401, file: !52, line: 2243, baseType: !917, size: 32, align: 32, offset: 3328)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1401, file: !52, line: 2249, baseType: !917, size: 32, align: 32, offset: 3360)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1401, file: !52, line: 2256, baseType: !917, size: 32, align: 32, offset: 3392)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1401, file: !52, line: 2263, baseType: !931, size: 64, align: 64, offset: 3456)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1401, file: !52, line: 2270, baseType: !931, size: 64, align: 64, offset: 3520)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1401, file: !52, line: 2277, baseType: !883, size: 32, align: 32, offset: 3584)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1401, file: !52, line: 2285, baseType: !711, size: 32, align: 32, offset: 3616)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1401, file: !52, line: 2367, baseType: !1812, size: 64, align: 64, offset: 3648)
!1812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1813, size: 64, align: 64)
!1813 = !DISubroutineType(types: !1814)
!1814 = !{!917, !1739, !1699, !917}
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1401, file: !52, line: 2383, baseType: !917, size: 32, align: 32, offset: 3712)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1401, file: !52, line: 2386, baseType: !1746, size: 32, align: 32, offset: 3744)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1401, file: !52, line: 2387, baseType: !1746, size: 32, align: 32, offset: 3776)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1401, file: !52, line: 2394, baseType: !917, size: 32, align: 32, offset: 3808)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1401, file: !52, line: 2401, baseType: !917, size: 32, align: 32, offset: 3840)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1401, file: !52, line: 2408, baseType: !917, size: 32, align: 32, offset: 3872)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1401, file: !52, line: 2415, baseType: !917, size: 32, align: 32, offset: 3904)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1401, file: !52, line: 2422, baseType: !917, size: 32, align: 32, offset: 3936)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1401, file: !52, line: 2423, baseType: !1824, size: 64, align: 64, offset: 3968)
!1824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1825, size: 64, align: 64)
!1825 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !52, line: 831, baseType: !1826)
!1826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !52, line: 826, size: 128, align: 32, elements: !1827)
!1827 = !{!1828, !1829, !1830, !1831}
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1826, file: !52, line: 827, baseType: !917, size: 32, align: 32)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1826, file: !52, line: 828, baseType: !917, size: 32, align: 32, offset: 32)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1826, file: !52, line: 829, baseType: !917, size: 32, align: 32, offset: 64)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1826, file: !52, line: 830, baseType: !1746, size: 32, align: 32, offset: 96)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1401, file: !52, line: 2430, baseType: !938, size: 64, align: 64, offset: 4032)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1401, file: !52, line: 2437, baseType: !938, size: 64, align: 64, offset: 4096)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1401, file: !52, line: 2444, baseType: !1746, size: 32, align: 32, offset: 4160)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1401, file: !52, line: 2451, baseType: !1746, size: 32, align: 32, offset: 4192)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1401, file: !52, line: 2458, baseType: !917, size: 32, align: 32, offset: 4224)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1401, file: !52, line: 2469, baseType: !917, size: 32, align: 32, offset: 4256)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1401, file: !52, line: 2475, baseType: !917, size: 32, align: 32, offset: 4288)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1401, file: !52, line: 2481, baseType: !917, size: 32, align: 32, offset: 4320)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1401, file: !52, line: 2485, baseType: !917, size: 32, align: 32, offset: 4352)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1401, file: !52, line: 2489, baseType: !917, size: 32, align: 32, offset: 4384)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1401, file: !52, line: 2493, baseType: !917, size: 32, align: 32, offset: 4416)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1401, file: !52, line: 2501, baseType: !917, size: 32, align: 32, offset: 4448)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1401, file: !52, line: 2506, baseType: !917, size: 32, align: 32, offset: 4480)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1401, file: !52, line: 2510, baseType: !917, size: 32, align: 32, offset: 4512)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1401, file: !52, line: 2514, baseType: !938, size: 64, align: 64, offset: 4544)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1401, file: !52, line: 2528, baseType: !1848, size: 64, align: 64, offset: 4608)
!1848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1849, size: 64, align: 64)
!1849 = !DISubroutineType(types: !1850)
!1850 = !{null, !1739, !1417, !917, !917}
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1401, file: !52, line: 2534, baseType: !917, size: 32, align: 32, offset: 4672)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1401, file: !52, line: 2545, baseType: !917, size: 32, align: 32, offset: 4704)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1401, file: !52, line: 2547, baseType: !917, size: 32, align: 32, offset: 4736)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1401, file: !52, line: 2549, baseType: !917, size: 32, align: 32, offset: 4768)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1401, file: !52, line: 2551, baseType: !917, size: 32, align: 32, offset: 4800)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1401, file: !52, line: 2553, baseType: !917, size: 32, align: 32, offset: 4832)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1401, file: !52, line: 2555, baseType: !917, size: 32, align: 32, offset: 4864)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1401, file: !52, line: 2557, baseType: !917, size: 32, align: 32, offset: 4896)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1401, file: !52, line: 2559, baseType: !917, size: 32, align: 32, offset: 4928)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1401, file: !52, line: 2563, baseType: !917, size: 32, align: 32, offset: 4960)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1401, file: !52, line: 2571, baseType: !1557, size: 64, align: 64, offset: 4992)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1401, file: !52, line: 2579, baseType: !1557, size: 64, align: 64, offset: 5056)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1401, file: !52, line: 2586, baseType: !917, size: 32, align: 32, offset: 5120)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1401, file: !52, line: 2615, baseType: !917, size: 32, align: 32, offset: 5152)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1401, file: !52, line: 2627, baseType: !917, size: 32, align: 32, offset: 5184)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1401, file: !52, line: 2637, baseType: !917, size: 32, align: 32, offset: 5216)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1401, file: !52, line: 2681, baseType: !917, size: 32, align: 32, offset: 5248)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1401, file: !52, line: 2709, baseType: !938, size: 64, align: 64, offset: 5312)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1401, file: !52, line: 2716, baseType: !1870, size: 64, align: 64, offset: 5376)
!1870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1871, size: 64, align: 64)
!1871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1872)
!1872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !52, line: 3636, size: 896, align: 64, elements: !1873)
!1873 = !{!1874, !1875, !1876, !1877, !1878, !1879, !1880, !1884, !1888, !1889, !1890, !1891, !1897, !1898, !1899, !1900, !1901}
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1872, file: !52, line: 3642, baseType: !1410, size: 64, align: 64)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1872, file: !52, line: 3649, baseType: !41, size: 32, align: 32, offset: 64)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1872, file: !52, line: 3656, baseType: !51, size: 32, align: 32, offset: 96)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1872, file: !52, line: 3663, baseType: !511, size: 32, align: 32, offset: 128)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1872, file: !52, line: 3669, baseType: !917, size: 32, align: 32, offset: 160)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1872, file: !52, line: 3682, baseType: !1696, size: 64, align: 64, offset: 192)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1872, file: !52, line: 3698, baseType: !1881, size: 64, align: 64, offset: 256)
!1881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1882, size: 64, align: 64)
!1882 = !DISubroutineType(types: !1883)
!1883 = !{!917, !1399, !919, !930}
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1872, file: !52, line: 3712, baseType: !1885, size: 64, align: 64, offset: 320)
!1885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1886, size: 64, align: 64)
!1886 = !DISubroutineType(types: !1887)
!1887 = !{!917, !1399, !917, !919, !930}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1872, file: !52, line: 3726, baseType: !1881, size: 64, align: 64, offset: 384)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1872, file: !52, line: 3737, baseType: !1496, size: 64, align: 64, offset: 448)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1872, file: !52, line: 3746, baseType: !917, size: 32, align: 32, offset: 512)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1872, file: !52, line: 3757, baseType: !1892, size: 64, align: 64, offset: 576)
!1892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1893, size: 64, align: 64)
!1893 = !DISubroutineType(types: !1894)
!1894 = !{null, !1895}
!1895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1896, size: 64, align: 64)
!1896 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !52, line: 3617, flags: DIFlagFwdDecl)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1872, file: !52, line: 3766, baseType: !1496, size: 64, align: 64, offset: 640)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1872, file: !52, line: 3774, baseType: !1496, size: 64, align: 64, offset: 704)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1872, file: !52, line: 3780, baseType: !917, size: 32, align: 32, offset: 768)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1872, file: !52, line: 3785, baseType: !917, size: 32, align: 32, offset: 800)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1872, file: !52, line: 3795, baseType: !1902, size: 64, align: 64, offset: 832)
!1902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1903, size: 64, align: 64)
!1903 = !DISubroutineType(types: !1904)
!1904 = !{!917, !1399, !1570}
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1401, file: !52, line: 2728, baseType: !1417, size: 64, align: 64, offset: 5440)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1401, file: !52, line: 2735, baseType: !1623, size: 512, align: 64, offset: 5504)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1401, file: !52, line: 2742, baseType: !917, size: 32, align: 32, offset: 6016)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1401, file: !52, line: 2755, baseType: !917, size: 32, align: 32, offset: 6048)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1401, file: !52, line: 2776, baseType: !917, size: 32, align: 32, offset: 6080)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1401, file: !52, line: 2783, baseType: !917, size: 32, align: 32, offset: 6112)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1401, file: !52, line: 2791, baseType: !917, size: 32, align: 32, offset: 6144)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1401, file: !52, line: 2802, baseType: !1699, size: 64, align: 64, offset: 6208)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1401, file: !52, line: 2811, baseType: !917, size: 32, align: 32, offset: 6272)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1401, file: !52, line: 2821, baseType: !917, size: 32, align: 32, offset: 6304)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1401, file: !52, line: 2830, baseType: !917, size: 32, align: 32, offset: 6336)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1401, file: !52, line: 2840, baseType: !917, size: 32, align: 32, offset: 6368)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1401, file: !52, line: 2851, baseType: !1918, size: 64, align: 64, offset: 6400)
!1918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1919, size: 64, align: 64)
!1919 = !DISubroutineType(types: !1920)
!1920 = !{!917, !1739, !1921, !1417, !1681, !917, !917}
!1921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1922, size: 64, align: 64)
!1922 = !DISubroutineType(types: !1923)
!1923 = !{!917, !1739, !1417}
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1401, file: !52, line: 2871, baseType: !1925, size: 64, align: 64, offset: 6464)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1926, size: 64, align: 64)
!1926 = !DISubroutineType(types: !1927)
!1927 = !{!917, !1739, !1928, !1417, !1681, !917}
!1928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1929, size: 64, align: 64)
!1929 = !DISubroutineType(types: !1930)
!1930 = !{!917, !1739, !1417, !917, !917}
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1401, file: !52, line: 2878, baseType: !917, size: 32, align: 32, offset: 6528)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1401, file: !52, line: 2885, baseType: !917, size: 32, align: 32, offset: 6560)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1401, file: !52, line: 3005, baseType: !917, size: 32, align: 32, offset: 6592)
