; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--tiff.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--tiff.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!1008 = !DIEnumerator(name: "TIFF_XPOS", value: 286)
!1009 = !DIEnumerator(name: "TIFF_YPOS", value: 287)
!1010 = !DIEnumerator(name: "TIFF_T4OPTIONS", value: 292)
!1011 = !DIEnumerator(name: "TIFF_T6OPTIONS", value: 293)
!1012 = !DIEnumerator(name: "TIFF_RES_UNIT", value: 296)
!1013 = !DIEnumerator(name: "TIFF_PAGE_NUMBER", value: 297)
!1014 = !DIEnumerator(name: "TIFF_SOFTWARE_NAME", value: 305)
!1015 = !DIEnumerator(name: "TIFF_DATE", value: 306)
!1016 = !DIEnumerator(name: "TIFF_ARTIST", value: 315)
!1017 = !DIEnumerator(name: "TIFF_HOST_COMPUTER", value: 316)
!1018 = !DIEnumerator(name: "TIFF_PREDICTOR", value: 317)
!1019 = !DIEnumerator(name: "TIFF_PAL", value: 320)
!1020 = !DIEnumerator(name: "TIFF_TILE_WIDTH", value: 322)
!1021 = !DIEnumerator(name: "TIFF_TILE_LENGTH", value: 323)
!1022 = !DIEnumerator(name: "TIFF_TILE_OFFSETS", value: 324)
!1023 = !DIEnumerator(name: "TIFF_TILE_BYTE_COUNTS", value: 325)
!1024 = !DIEnumerator(name: "TIFF_SUB_IFDS", value: 330)
!1025 = !DIEnumerator(name: "TIFF_EXTRASAMPLES", value: 338)
!1026 = !DIEnumerator(name: "TIFF_YCBCR_COEFFICIENTS", value: 529)
!1027 = !DIEnumerator(name: "TIFF_YCBCR_SUBSAMPLING", value: 530)
!1028 = !DIEnumerator(name: "TIFF_YCBCR_POSITIONING", value: 531)
!1029 = !DIEnumerator(name: "TIFF_REFERENCE_BW", value: 532)
!1030 = !DIEnumerator(name: "TIFF_CFA_PATTERN_DIM", value: 33421)
!1031 = !DIEnumerator(name: "TIFF_CFA_PATTERN", value: 33422)
!1032 = !DIEnumerator(name: "TIFF_COPYRIGHT", value: 33432)
!1033 = !DIEnumerator(name: "TIFF_MODEL_TIEPOINT", value: 33922)
!1034 = !DIEnumerator(name: "TIFF_MODEL_PIXEL_SCALE", value: 33550)
!1035 = !DIEnumerator(name: "TIFF_MODEL_TRANSFORMATION", value: 33920)
!1036 = !DIEnumerator(name: "TIFF_GEO_KEY_DIRECTORY", value: 34735)
!1037 = !DIEnumerator(name: "TIFF_GEO_DOUBLE_PARAMS", value: 34736)
!1038 = !DIEnumerator(name: "TIFF_GEO_ASCII_PARAMS", value: 34737)
!1039 = !DIEnumerator(name: "TIFF_WHITE_LEVEL", value: 50717)
!1040 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TiffTypes", file: !1041, line: 37, size: 32, align: 32, elements: !1042)
!1041 = !DIFile(filename: "libavcodec/tiff_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1043 = !DIEnumerator(name: "TIFF_BYTE", value: 1)
!1044 = !DIEnumerator(name: "TIFF_STRING", value: 2)
!1045 = !DIEnumerator(name: "TIFF_SHORT", value: 3)
!1046 = !DIEnumerator(name: "TIFF_LONG", value: 4)
!1047 = !DIEnumerator(name: "TIFF_RATIONAL", value: 5)
!1048 = !DIEnumerator(name: "TIFF_SBYTE", value: 6)
!1049 = !DIEnumerator(name: "TIFF_UNDEFINED", value: 7)
!1050 = !DIEnumerator(name: "TIFF_SSHORT", value: 8)
!1051 = !DIEnumerator(name: "TIFF_SLONG", value: 9)
!1052 = !DIEnumerator(name: "TIFF_SRATIONAL", value: 10)
!1053 = !DIEnumerator(name: "TIFF_FLOAT", value: 11)
!1054 = !DIEnumerator(name: "TIFF_DOUBLE", value: 12)
!1055 = !DIEnumerator(name: "TIFF_IFD", value: 13)
!1056 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FF_LZW_MODES", file: !1057, line: 37, size: 32, align: 32, elements: !1058)
!1057 = !DIFile(filename: "libavcodec/lzw.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1058 = !{!1059, !1060}
!1059 = !DIEnumerator(name: "FF_LZW_GIF", value: 0)
!1060 = !DIEnumerator(name: "FF_LZW_TIFF", value: 1)
!1061 = !{!1062, !1063, !1064, !1073, !1074, !1075, !1076, !1077, !1079, !1081, !1093, !1099, !1100, !1078, !1103, !1104}
!1062 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1063 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1067, line: 222, size: 16, align: 8, elements: !1068)
!1067 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1068 = !{!1069}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1066, file: !1067, line: 222, baseType: !1070, size: 16, align: 16)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1071, line: 49, baseType: !1072)
!1071 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1072 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1075 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1071, line: 55, baseType: !1078)
!1078 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "TiffGeoTagKeyName", file: !910, line: 189, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TiffGeoTagKeyName", file: !910, line: 186, size: 128, align: 64, elements: !1085)
!1085 = !{!1086, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1084, file: !910, line: 187, baseType: !1087, size: 32, align: 32)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1084, file: !910, line: 188, baseType: !1089, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1067, line: 221, size: 32, align: 8, elements: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1095, file: !1067, line: 221, baseType: !1098, size: 32, align: 32)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1071, line: 51, baseType: !1063)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1101, line: 194, baseType: !1102)
!1101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1102 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1071, line: 48, baseType: !1105)
!1105 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1106 = !{!1107, !1852, !1853, !1859}
!1107 = distinct !DIGlobalVariable(name: "ff_tiff_decoder", scope: !0, file: !1108, line: 1620, type: !1109, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_tiff_decoder)
!1108 = !DIFile(filename: "libavcodec/tiff.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1126, !1129, !1130, !1133, !1136, !1137, !1212, !1220, !1221, !1222, !1224, !1767, !1773, !1781, !1785, !1786, !1823, !1827, !1831, !1832, !1836, !1840, !1841, !1845, !1846, !1847}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1110, file: !14, line: 3475, baseType: !1090, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1110, file: !14, line: 3480, baseType: !1090, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1110, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1110, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1110, file: !14, line: 3487, baseType: !1062, size: 32, align: 32, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1110, file: !14, line: 3488, baseType: !1118, size: 64, align: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1121, line: 61, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1121, line: 58, size: 64, align: 32, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1122, file: !1121, line: 59, baseType: !1062, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1122, file: !1121, line: 60, baseType: !1062, size: 32, align: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1110, file: !14, line: 3489, baseType: !1127, size: 64, align: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1110, file: !14, line: 3490, baseType: !1079, size: 64, align: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1110, file: !14, line: 3491, baseType: !1131, size: 64, align: 64, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1110, file: !14, line: 3492, baseType: !1134, size: 64, align: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1110, file: !14, line: 3493, baseType: !1104, size: 8, align: 8, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1110, file: !14, line: 3494, baseType: !1138, size: 64, align: 64, offset: 640)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1148, !1171, !1172, !1173, !1174, !1178, !1184, !1186, !1190}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1141, file: !713, line: 72, baseType: !1090, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1141, file: !713, line: 78, baseType: !1145, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!1090, !1076}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1141, file: !713, line: 85, baseType: !1149, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1167, !1168, !1169, !1170}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1151, file: !691, line: 247, baseType: !1090, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1151, file: !691, line: 253, baseType: !1090, size: 64, align: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1151, file: !691, line: 259, baseType: !1062, size: 32, align: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1151, file: !691, line: 271, baseType: !1158, size: 64, align: 64, offset: 192)
!1158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1151, file: !691, line: 265, size: 64, align: 64, elements: !1159)
!1159 = !{!1160, !1163, !1165, !1166}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1158, file: !691, line: 266, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1101, line: 197, baseType: !1162)
!1162 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1158, file: !691, line: 267, baseType: !1164, size: 64, align: 64)
!1164 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1158, file: !691, line: 268, baseType: !1090, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1158, file: !691, line: 270, baseType: !1120, size: 64, align: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1151, file: !691, line: 272, baseType: !1164, size: 64, align: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1151, file: !691, line: 273, baseType: !1164, size: 64, align: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1151, file: !691, line: 275, baseType: !1062, size: 32, align: 32, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1151, file: !691, line: 300, baseType: !1090, size: 64, align: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1141, file: !713, line: 93, baseType: !1062, size: 32, align: 32, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1141, file: !713, line: 99, baseType: !1062, size: 32, align: 32, offset: 224)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1141, file: !713, line: 108, baseType: !1062, size: 32, align: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1141, file: !713, line: 113, baseType: !1175, size: 64, align: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!1076, !1076, !1076}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1141, file: !713, line: 123, baseType: !1179, size: 64, align: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!1182, !1182}
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1141, file: !713, line: 130, baseType: !1185, size: 32, align: 32, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1141, file: !713, line: 136, baseType: !1187, size: 64, align: 64, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!1185, !1076}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1141, file: !713, line: 142, baseType: !1191, size: 64, align: 64, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!1062, !1194, !1076, !1090, !1062}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1197)
!1197 = !{!1198, !1210, !1211}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1196, file: !691, line: 360, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1208, !1209}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1202, file: !691, line: 307, baseType: !1090, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1202, file: !691, line: 313, baseType: !1164, size: 64, align: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1202, file: !691, line: 313, baseType: !1164, size: 64, align: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1202, file: !691, line: 318, baseType: !1164, size: 64, align: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1202, file: !691, line: 318, baseType: !1164, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1202, file: !691, line: 323, baseType: !1062, size: 32, align: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1196, file: !691, line: 364, baseType: !1062, size: 32, align: 32, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1196, file: !691, line: 368, baseType: !1062, size: 32, align: 32, offset: 96)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1110, file: !14, line: 3495, baseType: !1213, size: 64, align: 64, offset: 704)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1217)
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1216, file: !14, line: 3402, baseType: !1062, size: 32, align: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1216, file: !14, line: 3403, baseType: !1090, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1110, file: !14, line: 3507, baseType: !1090, size: 64, align: 64, offset: 768)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1110, file: !14, line: 3516, baseType: !1062, size: 32, align: 32, offset: 832)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1110, file: !14, line: 3517, baseType: !1223, size: 64, align: 64, offset: 896)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1110, file: !14, line: 3527, baseType: !1225, size: 64, align: 64, offset: 960)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!1062, !1228}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1238, !1239, !1240, !1241, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1518, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1706, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1230, file: !14, line: 1561, baseType: !1138, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1230, file: !14, line: 1562, baseType: !1062, size: 32, align: 32, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1230, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1230, file: !14, line: 1565, baseType: !1236, size: 64, align: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1230, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1230, file: !14, line: 1581, baseType: !1063, size: 32, align: 32, offset: 224)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1230, file: !14, line: 1583, baseType: !1076, size: 64, align: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1230, file: !14, line: 1591, baseType: !1242, size: 64, align: 64, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1244, line: 129, size: 1664, align: 64, elements: !1245)
!1244 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1245 = !{!1246, !1247, !1248, !1249, !1344, !1365, !1366, !1395, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1243, file: !1244, line: 136, baseType: !1062, size: 32, align: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1243, file: !1244, line: 151, baseType: !1062, size: 32, align: 32, offset: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1243, file: !1244, line: 157, baseType: !1062, size: 32, align: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1243, file: !1244, line: 159, baseType: !1250, size: 64, align: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1253)
!1253 = !{!1254, !1258, !1260, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1298, !1300, !1301, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1332, !1333, !1334, !1335, !1336, !1337, !1340, !1341, !1342, !1343}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !744, line: 282, baseType: !1255, size: 512, align: 64)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 512, align: 64, elements: !1256)
!1256 = !{!1257}
!1257 = !DISubrange(count: 8)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1252, file: !744, line: 299, baseType: !1259, size: 256, align: 32, offset: 512)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 256, align: 32, elements: !1256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1252, file: !744, line: 315, baseType: !1261, size: 64, align: 64, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1252, file: !744, line: 326, baseType: !1062, size: 32, align: 32, offset: 832)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1252, file: !744, line: 326, baseType: !1062, size: 32, align: 32, offset: 864)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1252, file: !744, line: 334, baseType: !1062, size: 32, align: 32, offset: 896)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1252, file: !744, line: 341, baseType: !1062, size: 32, align: 32, offset: 928)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1252, file: !744, line: 346, baseType: !1062, size: 32, align: 32, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1252, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1252, file: !744, line: 356, baseType: !1120, size: 64, align: 32, offset: 1024)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1252, file: !744, line: 361, baseType: !1161, size: 64, align: 64, offset: 1088)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1252, file: !744, line: 369, baseType: !1161, size: 64, align: 64, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1252, file: !744, line: 377, baseType: !1161, size: 64, align: 64, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1252, file: !744, line: 382, baseType: !1062, size: 32, align: 32, offset: 1280)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1252, file: !744, line: 386, baseType: !1062, size: 32, align: 32, offset: 1312)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1252, file: !744, line: 391, baseType: !1062, size: 32, align: 32, offset: 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1252, file: !744, line: 396, baseType: !1076, size: 64, align: 64, offset: 1408)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1252, file: !744, line: 403, baseType: !1277, size: 512, align: 64, offset: 1472)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 512, align: 64, elements: !1256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1252, file: !744, line: 410, baseType: !1062, size: 32, align: 32, offset: 1984)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1252, file: !744, line: 415, baseType: !1062, size: 32, align: 32, offset: 2016)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1252, file: !744, line: 420, baseType: !1062, size: 32, align: 32, offset: 2048)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1252, file: !744, line: 425, baseType: !1062, size: 32, align: 32, offset: 2080)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1252, file: !744, line: 435, baseType: !1161, size: 64, align: 64, offset: 2112)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1252, file: !744, line: 440, baseType: !1062, size: 32, align: 32, offset: 2176)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1252, file: !744, line: 445, baseType: !1077, size: 64, align: 64, offset: 2240)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1252, file: !744, line: 459, baseType: !1286, size: 512, align: 64, offset: 2304)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1287, size: 512, align: 64, elements: !1256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1289, line: 94, baseType: !1290)
!1289 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1289, line: 81, size: 192, align: 64, elements: !1291)
!1291 = !{!1292, !1296, !1297}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1290, file: !1289, line: 82, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1289, line: 73, baseType: !1295)
!1295 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1289, line: 73, flags: DIFlagFwdDecl)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1290, file: !1289, line: 89, baseType: !1103, size: 64, align: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1290, file: !1289, line: 93, baseType: !1062, size: 32, align: 32, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1252, file: !744, line: 473, baseType: !1299, size: 64, align: 64, offset: 2816)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1252, file: !744, line: 477, baseType: !1062, size: 32, align: 32, offset: 2880)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1252, file: !744, line: 479, baseType: !1302, size: 64, align: 64, offset: 2944)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1315}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1305, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1305, file: !744, line: 203, baseType: !1103, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1305, file: !744, line: 204, baseType: !1062, size: 32, align: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1305, file: !744, line: 205, baseType: !1311, size: 64, align: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1313, line: 86, baseType: !1314)
!1313 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1313, line: 86, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1305, file: !744, line: 206, baseType: !1287, size: 64, align: 64, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1252, file: !744, line: 480, baseType: !1062, size: 32, align: 32, offset: 3008)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1252, file: !744, line: 505, baseType: !1062, size: 32, align: 32, offset: 3040)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1252, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1252, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1252, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1252, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1252, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1252, file: !744, line: 532, baseType: !1161, size: 64, align: 64, offset: 3264)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1252, file: !744, line: 539, baseType: !1161, size: 64, align: 64, offset: 3328)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1252, file: !744, line: 547, baseType: !1161, size: 64, align: 64, offset: 3392)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1252, file: !744, line: 554, baseType: !1311, size: 64, align: 64, offset: 3456)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1252, file: !744, line: 563, baseType: !1062, size: 32, align: 32, offset: 3520)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1252, file: !744, line: 572, baseType: !1062, size: 32, align: 32, offset: 3552)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1252, file: !744, line: 581, baseType: !1062, size: 32, align: 32, offset: 3584)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1252, file: !744, line: 588, baseType: !1331, size: 64, align: 64, offset: 3648)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1252, file: !744, line: 593, baseType: !1062, size: 32, align: 32, offset: 3712)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1252, file: !744, line: 596, baseType: !1062, size: 32, align: 32, offset: 3744)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1252, file: !744, line: 599, baseType: !1287, size: 64, align: 64, offset: 3776)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1252, file: !744, line: 605, baseType: !1287, size: 64, align: 64, offset: 3840)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1252, file: !744, line: 616, baseType: !1287, size: 64, align: 64, offset: 3904)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1252, file: !744, line: 626, baseType: !1338, size: 64, align: 64, offset: 3968)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1339, line: 216, baseType: !1078)
!1339 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1252, file: !744, line: 627, baseType: !1338, size: 64, align: 64, offset: 4032)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1252, file: !744, line: 628, baseType: !1338, size: 64, align: 64, offset: 4096)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1252, file: !744, line: 629, baseType: !1338, size: 64, align: 64, offset: 4160)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1252, file: !744, line: 645, baseType: !1287, size: 64, align: 64, offset: 4224)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1243, file: !1244, line: 161, baseType: !1345, size: 64, align: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1244, line: 117, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1244, line: 100, size: 832, align: 64, elements: !1348)
!1348 = !{!1349, !1356, !1357, !1358, !1359, !1360, !1362, !1363, !1364}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1347, file: !1244, line: 105, baseType: !1350, size: 256, align: 64)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1351, size: 256, align: 64, elements: !1354)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1289, line: 238, baseType: !1353)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1289, line: 238, flags: DIFlagFwdDecl)
!1354 = !{!1355}
!1355 = !DISubrange(count: 4)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1347, file: !1244, line: 110, baseType: !1062, size: 32, align: 32, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1347, file: !1244, line: 111, baseType: !1062, size: 32, align: 32, offset: 288)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1347, file: !1244, line: 111, baseType: !1062, size: 32, align: 32, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1347, file: !1244, line: 112, baseType: !1259, size: 256, align: 32, offset: 352)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1347, file: !1244, line: 113, baseType: !1361, size: 128, align: 32, offset: 608)
!1361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 128, align: 32, elements: !1354)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1347, file: !1244, line: 114, baseType: !1062, size: 32, align: 32, offset: 736)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1347, file: !1244, line: 115, baseType: !1062, size: 32, align: 32, offset: 768)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1347, file: !1244, line: 116, baseType: !1062, size: 32, align: 32, offset: 800)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1243, file: !1244, line: 163, baseType: !1076, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1243, file: !1244, line: 165, baseType: !1367, size: 128, align: 64, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1244, line: 122, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1244, line: 119, size: 128, align: 64, elements: !1369)
!1369 = !{!1370, !1394}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1368, file: !1244, line: 120, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1390, !1391, !1392, !1393}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1373, file: !14, line: 1451, baseType: !1287, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1373, file: !14, line: 1461, baseType: !1161, size: 64, align: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1373, file: !14, line: 1467, baseType: !1161, size: 64, align: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1373, file: !14, line: 1468, baseType: !1103, size: 64, align: 64, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1373, file: !14, line: 1469, baseType: !1062, size: 32, align: 32, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1373, file: !14, line: 1470, baseType: !1062, size: 32, align: 32, offset: 288)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1373, file: !14, line: 1474, baseType: !1062, size: 32, align: 32, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1373, file: !14, line: 1479, baseType: !1383, size: 64, align: 64, offset: 384)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1385, file: !14, line: 1412, baseType: !1103, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1385, file: !14, line: 1413, baseType: !1062, size: 32, align: 32, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1385, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1373, file: !14, line: 1480, baseType: !1062, size: 32, align: 32, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1373, file: !14, line: 1486, baseType: !1161, size: 64, align: 64, offset: 512)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1373, file: !14, line: 1488, baseType: !1161, size: 64, align: 64, offset: 576)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1373, file: !14, line: 1497, baseType: !1161, size: 64, align: 64, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1368, file: !1244, line: 121, baseType: !1250, size: 64, align: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1243, file: !1244, line: 166, baseType: !1396, size: 128, align: 64, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1244, line: 127, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1244, line: 124, size: 128, align: 64, elements: !1398)
!1398 = !{!1399, !1472}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1397, file: !1244, line: 125, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1404)
!1404 = !{!1405, !1406, !1430, !1434, !1435, !1469, !1470, !1471}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1403, file: !14, line: 5751, baseType: !1138, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1403, file: !14, line: 5756, baseType: !1407, size: 64, align: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1410)
!1410 = !{!1411, !1412, !1415, !1416, !1417, !1421, !1425, !1429}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1409, file: !14, line: 5797, baseType: !1090, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1409, file: !14, line: 5804, baseType: !1413, size: 64, align: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1409, file: !14, line: 5815, baseType: !1138, size: 64, align: 64, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1409, file: !14, line: 5825, baseType: !1062, size: 32, align: 32, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1409, file: !14, line: 5826, baseType: !1418, size: 64, align: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!1062, !1401}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1409, file: !14, line: 5827, baseType: !1422, size: 64, align: 64, offset: 320)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!1062, !1401, !1371}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1409, file: !14, line: 5828, baseType: !1426, size: 64, align: 64, offset: 384)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{null, !1401}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1409, file: !14, line: 5829, baseType: !1426, size: 64, align: 64, offset: 448)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1403, file: !14, line: 5762, baseType: !1431, size: 64, align: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1433)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1403, file: !14, line: 5768, baseType: !1076, size: 64, align: 64, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1403, file: !14, line: 5775, baseType: !1436, size: 64, align: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1438, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1438, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1438, file: !14, line: 3948, baseType: !1098, size: 32, align: 32, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1438, file: !14, line: 3958, baseType: !1103, size: 64, align: 64, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1438, file: !14, line: 3962, baseType: !1062, size: 32, align: 32, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1438, file: !14, line: 3968, baseType: !1062, size: 32, align: 32, offset: 224)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1438, file: !14, line: 3973, baseType: !1161, size: 64, align: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1438, file: !14, line: 3986, baseType: !1062, size: 32, align: 32, offset: 320)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1438, file: !14, line: 3999, baseType: !1062, size: 32, align: 32, offset: 352)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1438, file: !14, line: 4004, baseType: !1062, size: 32, align: 32, offset: 384)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1438, file: !14, line: 4005, baseType: !1062, size: 32, align: 32, offset: 416)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1438, file: !14, line: 4010, baseType: !1062, size: 32, align: 32, offset: 448)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1438, file: !14, line: 4011, baseType: !1062, size: 32, align: 32, offset: 480)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1438, file: !14, line: 4020, baseType: !1120, size: 64, align: 32, offset: 512)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1438, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1438, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1438, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1438, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1438, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1438, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1438, file: !14, line: 4039, baseType: !1062, size: 32, align: 32, offset: 768)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1438, file: !14, line: 4046, baseType: !1077, size: 64, align: 64, offset: 832)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1438, file: !14, line: 4050, baseType: !1062, size: 32, align: 32, offset: 896)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1438, file: !14, line: 4054, baseType: !1062, size: 32, align: 32, offset: 928)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1438, file: !14, line: 4061, baseType: !1062, size: 32, align: 32, offset: 960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1438, file: !14, line: 4065, baseType: !1062, size: 32, align: 32, offset: 992)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1438, file: !14, line: 4073, baseType: !1062, size: 32, align: 32, offset: 1024)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1438, file: !14, line: 4080, baseType: !1062, size: 32, align: 32, offset: 1056)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1438, file: !14, line: 4084, baseType: !1062, size: 32, align: 32, offset: 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1403, file: !14, line: 5781, baseType: !1436, size: 64, align: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1403, file: !14, line: 5787, baseType: !1120, size: 64, align: 32, offset: 384)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1403, file: !14, line: 5793, baseType: !1120, size: 64, align: 32, offset: 448)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1397, file: !1244, line: 126, baseType: !1062, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1243, file: !1244, line: 172, baseType: !1371, size: 64, align: 64, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1243, file: !1244, line: 177, baseType: !1103, size: 64, align: 64, offset: 640)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1243, file: !1244, line: 178, baseType: !1063, size: 32, align: 32, offset: 704)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1243, file: !1244, line: 180, baseType: !1076, size: 64, align: 64, offset: 768)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1243, file: !1244, line: 185, baseType: !1062, size: 32, align: 32, offset: 832)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1243, file: !1244, line: 190, baseType: !1076, size: 64, align: 64, offset: 896)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1243, file: !1244, line: 195, baseType: !1062, size: 32, align: 32, offset: 960)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1243, file: !1244, line: 200, baseType: !1371, size: 64, align: 64, offset: 1024)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1243, file: !1244, line: 201, baseType: !1062, size: 32, align: 32, offset: 1088)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1243, file: !1244, line: 202, baseType: !1250, size: 64, align: 64, offset: 1152)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1243, file: !1244, line: 203, baseType: !1062, size: 32, align: 32, offset: 1216)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1243, file: !1244, line: 205, baseType: !1062, size: 32, align: 32, offset: 1248)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1243, file: !1244, line: 206, baseType: !1062, size: 32, align: 32, offset: 1280)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1243, file: !1244, line: 209, baseType: !1338, size: 64, align: 64, offset: 1344)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1243, file: !1244, line: 212, baseType: !1338, size: 64, align: 64, offset: 1408)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1243, file: !1244, line: 213, baseType: !1250, size: 64, align: 64, offset: 1472)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1243, file: !1244, line: 215, baseType: !1062, size: 32, align: 32, offset: 1536)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1243, file: !1244, line: 217, baseType: !1062, size: 32, align: 32, offset: 1568)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1243, file: !1244, line: 220, baseType: !1062, size: 32, align: 32, offset: 1600)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1230, file: !14, line: 1598, baseType: !1076, size: 64, align: 64, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1230, file: !14, line: 1606, baseType: !1161, size: 64, align: 64, offset: 448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1230, file: !14, line: 1614, baseType: !1062, size: 32, align: 32, offset: 512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1230, file: !14, line: 1622, baseType: !1062, size: 32, align: 32, offset: 544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1230, file: !14, line: 1628, baseType: !1062, size: 32, align: 32, offset: 576)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1230, file: !14, line: 1636, baseType: !1062, size: 32, align: 32, offset: 608)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1230, file: !14, line: 1643, baseType: !1062, size: 32, align: 32, offset: 640)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1230, file: !14, line: 1657, baseType: !1103, size: 64, align: 64, offset: 704)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1230, file: !14, line: 1658, baseType: !1062, size: 32, align: 32, offset: 768)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1230, file: !14, line: 1679, baseType: !1120, size: 64, align: 32, offset: 800)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1230, file: !14, line: 1688, baseType: !1062, size: 32, align: 32, offset: 864)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1230, file: !14, line: 1712, baseType: !1062, size: 32, align: 32, offset: 896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1230, file: !14, line: 1729, baseType: !1062, size: 32, align: 32, offset: 928)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1230, file: !14, line: 1729, baseType: !1062, size: 32, align: 32, offset: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1230, file: !14, line: 1744, baseType: !1062, size: 32, align: 32, offset: 992)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1230, file: !14, line: 1744, baseType: !1062, size: 32, align: 32, offset: 1024)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1230, file: !14, line: 1751, baseType: !1062, size: 32, align: 32, offset: 1056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1230, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1230, file: !14, line: 1791, baseType: !1511, size: 64, align: 64, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{null, !1514, !1515, !1517, !1062, !1062, !1062}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1230, file: !14, line: 1808, baseType: !1519, size: 64, align: 64, offset: 1216)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!473, !1514, !1127}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1230, file: !14, line: 1816, baseType: !1062, size: 32, align: 32, offset: 1280)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1230, file: !14, line: 1825, baseType: !1075, size: 32, align: 32, offset: 1312)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1230, file: !14, line: 1830, baseType: !1062, size: 32, align: 32, offset: 1344)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1230, file: !14, line: 1838, baseType: !1075, size: 32, align: 32, offset: 1376)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1230, file: !14, line: 1846, baseType: !1062, size: 32, align: 32, offset: 1408)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1230, file: !14, line: 1851, baseType: !1062, size: 32, align: 32, offset: 1440)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1230, file: !14, line: 1861, baseType: !1075, size: 32, align: 32, offset: 1472)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1230, file: !14, line: 1868, baseType: !1075, size: 32, align: 32, offset: 1504)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1230, file: !14, line: 1875, baseType: !1075, size: 32, align: 32, offset: 1536)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1230, file: !14, line: 1882, baseType: !1075, size: 32, align: 32, offset: 1568)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1230, file: !14, line: 1889, baseType: !1075, size: 32, align: 32, offset: 1600)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1230, file: !14, line: 1896, baseType: !1075, size: 32, align: 32, offset: 1632)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1230, file: !14, line: 1903, baseType: !1075, size: 32, align: 32, offset: 1664)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1230, file: !14, line: 1910, baseType: !1062, size: 32, align: 32, offset: 1696)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1230, file: !14, line: 1915, baseType: !1062, size: 32, align: 32, offset: 1728)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1230, file: !14, line: 1926, baseType: !1517, size: 64, align: 64, offset: 1792)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1230, file: !14, line: 1935, baseType: !1120, size: 64, align: 32, offset: 1856)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1230, file: !14, line: 1942, baseType: !1062, size: 32, align: 32, offset: 1920)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1230, file: !14, line: 1948, baseType: !1062, size: 32, align: 32, offset: 1952)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1230, file: !14, line: 1954, baseType: !1062, size: 32, align: 32, offset: 1984)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1230, file: !14, line: 1960, baseType: !1062, size: 32, align: 32, offset: 2016)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1230, file: !14, line: 1984, baseType: !1062, size: 32, align: 32, offset: 2048)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1230, file: !14, line: 1991, baseType: !1062, size: 32, align: 32, offset: 2080)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1230, file: !14, line: 1996, baseType: !1062, size: 32, align: 32, offset: 2112)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1230, file: !14, line: 2004, baseType: !1062, size: 32, align: 32, offset: 2144)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1230, file: !14, line: 2011, baseType: !1062, size: 32, align: 32, offset: 2176)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1230, file: !14, line: 2018, baseType: !1062, size: 32, align: 32, offset: 2208)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1230, file: !14, line: 2027, baseType: !1062, size: 32, align: 32, offset: 2240)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1230, file: !14, line: 2034, baseType: !1062, size: 32, align: 32, offset: 2272)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1230, file: !14, line: 2044, baseType: !1062, size: 32, align: 32, offset: 2304)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1230, file: !14, line: 2054, baseType: !1074, size: 64, align: 64, offset: 2368)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1230, file: !14, line: 2061, baseType: !1074, size: 64, align: 64, offset: 2432)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1230, file: !14, line: 2066, baseType: !1062, size: 32, align: 32, offset: 2496)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1230, file: !14, line: 2070, baseType: !1062, size: 32, align: 32, offset: 2528)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1230, file: !14, line: 2078, baseType: !1062, size: 32, align: 32, offset: 2560)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1230, file: !14, line: 2085, baseType: !1062, size: 32, align: 32, offset: 2592)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1230, file: !14, line: 2092, baseType: !1062, size: 32, align: 32, offset: 2624)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1230, file: !14, line: 2099, baseType: !1062, size: 32, align: 32, offset: 2656)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1230, file: !14, line: 2106, baseType: !1062, size: 32, align: 32, offset: 2688)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1230, file: !14, line: 2113, baseType: !1062, size: 32, align: 32, offset: 2720)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1230, file: !14, line: 2120, baseType: !1062, size: 32, align: 32, offset: 2752)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1230, file: !14, line: 2125, baseType: !1062, size: 32, align: 32, offset: 2784)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1230, file: !14, line: 2133, baseType: !1062, size: 32, align: 32, offset: 2816)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1230, file: !14, line: 2140, baseType: !1062, size: 32, align: 32, offset: 2848)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1230, file: !14, line: 2145, baseType: !1062, size: 32, align: 32, offset: 2880)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1230, file: !14, line: 2153, baseType: !1062, size: 32, align: 32, offset: 2912)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1230, file: !14, line: 2158, baseType: !1062, size: 32, align: 32, offset: 2944)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1230, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1230, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1230, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1230, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1230, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1230, file: !14, line: 2203, baseType: !1062, size: 32, align: 32, offset: 3136)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1230, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1230, file: !14, line: 2212, baseType: !1062, size: 32, align: 32, offset: 3200)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1230, file: !14, line: 2213, baseType: !1062, size: 32, align: 32, offset: 3232)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1230, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1230, file: !14, line: 2232, baseType: !1062, size: 32, align: 32, offset: 3296)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1230, file: !14, line: 2243, baseType: !1062, size: 32, align: 32, offset: 3328)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1230, file: !14, line: 2249, baseType: !1062, size: 32, align: 32, offset: 3360)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1230, file: !14, line: 2256, baseType: !1062, size: 32, align: 32, offset: 3392)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1230, file: !14, line: 2263, baseType: !1077, size: 64, align: 64, offset: 3456)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1230, file: !14, line: 2270, baseType: !1077, size: 64, align: 64, offset: 3520)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1230, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1230, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1230, file: !14, line: 2367, baseType: !1588, size: 64, align: 64, offset: 3648)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!1062, !1514, !1250, !1062}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1230, file: !14, line: 2383, baseType: !1062, size: 32, align: 32, offset: 3712)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1230, file: !14, line: 2386, baseType: !1075, size: 32, align: 32, offset: 3744)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1230, file: !14, line: 2387, baseType: !1075, size: 32, align: 32, offset: 3776)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1230, file: !14, line: 2394, baseType: !1062, size: 32, align: 32, offset: 3808)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1230, file: !14, line: 2401, baseType: !1062, size: 32, align: 32, offset: 3840)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1230, file: !14, line: 2408, baseType: !1062, size: 32, align: 32, offset: 3872)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1230, file: !14, line: 2415, baseType: !1062, size: 32, align: 32, offset: 3904)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1230, file: !14, line: 2422, baseType: !1062, size: 32, align: 32, offset: 3936)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1230, file: !14, line: 2423, baseType: !1600, size: 64, align: 64, offset: 3968)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1607}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1602, file: !14, line: 827, baseType: !1062, size: 32, align: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1602, file: !14, line: 828, baseType: !1062, size: 32, align: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1602, file: !14, line: 829, baseType: !1062, size: 32, align: 32, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1602, file: !14, line: 830, baseType: !1075, size: 32, align: 32, offset: 96)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1230, file: !14, line: 2430, baseType: !1161, size: 64, align: 64, offset: 4032)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1230, file: !14, line: 2437, baseType: !1161, size: 64, align: 64, offset: 4096)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1230, file: !14, line: 2444, baseType: !1075, size: 32, align: 32, offset: 4160)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1230, file: !14, line: 2451, baseType: !1075, size: 32, align: 32, offset: 4192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1230, file: !14, line: 2458, baseType: !1062, size: 32, align: 32, offset: 4224)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1230, file: !14, line: 2469, baseType: !1062, size: 32, align: 32, offset: 4256)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1230, file: !14, line: 2475, baseType: !1062, size: 32, align: 32, offset: 4288)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1230, file: !14, line: 2481, baseType: !1062, size: 32, align: 32, offset: 4320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1230, file: !14, line: 2485, baseType: !1062, size: 32, align: 32, offset: 4352)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1230, file: !14, line: 2489, baseType: !1062, size: 32, align: 32, offset: 4384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1230, file: !14, line: 2493, baseType: !1062, size: 32, align: 32, offset: 4416)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1230, file: !14, line: 2501, baseType: !1062, size: 32, align: 32, offset: 4448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1230, file: !14, line: 2506, baseType: !1062, size: 32, align: 32, offset: 4480)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1230, file: !14, line: 2510, baseType: !1062, size: 32, align: 32, offset: 4512)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1230, file: !14, line: 2514, baseType: !1161, size: 64, align: 64, offset: 4544)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1230, file: !14, line: 2528, baseType: !1624, size: 64, align: 64, offset: 4608)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{null, !1514, !1076, !1062, !1062}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1230, file: !14, line: 2534, baseType: !1062, size: 32, align: 32, offset: 4672)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1230, file: !14, line: 2545, baseType: !1062, size: 32, align: 32, offset: 4704)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1230, file: !14, line: 2547, baseType: !1062, size: 32, align: 32, offset: 4736)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1230, file: !14, line: 2549, baseType: !1062, size: 32, align: 32, offset: 4768)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1230, file: !14, line: 2551, baseType: !1062, size: 32, align: 32, offset: 4800)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1230, file: !14, line: 2553, baseType: !1062, size: 32, align: 32, offset: 4832)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1230, file: !14, line: 2555, baseType: !1062, size: 32, align: 32, offset: 4864)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1230, file: !14, line: 2557, baseType: !1062, size: 32, align: 32, offset: 4896)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1230, file: !14, line: 2559, baseType: !1062, size: 32, align: 32, offset: 4928)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1230, file: !14, line: 2563, baseType: !1062, size: 32, align: 32, offset: 4960)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1230, file: !14, line: 2571, baseType: !1638, size: 64, align: 64, offset: 4992)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1230, file: !14, line: 2579, baseType: !1638, size: 64, align: 64, offset: 5056)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1230, file: !14, line: 2586, baseType: !1062, size: 32, align: 32, offset: 5120)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1230, file: !14, line: 2615, baseType: !1062, size: 32, align: 32, offset: 5152)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1230, file: !14, line: 2627, baseType: !1062, size: 32, align: 32, offset: 5184)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1230, file: !14, line: 2637, baseType: !1062, size: 32, align: 32, offset: 5216)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1230, file: !14, line: 2681, baseType: !1062, size: 32, align: 32, offset: 5248)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1230, file: !14, line: 2709, baseType: !1161, size: 64, align: 64, offset: 5312)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1230, file: !14, line: 2716, baseType: !1647, size: 64, align: 64, offset: 5376)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1650)
!1650 = !{!1651, !1652, !1653, !1654, !1655, !1656, !1660, !1666, !1670, !1671, !1672, !1673, !1679, !1680, !1681, !1682, !1683}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1649, file: !14, line: 3642, baseType: !1090, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1649, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1649, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1649, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1649, file: !14, line: 3669, baseType: !1062, size: 32, align: 32, offset: 160)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1649, file: !14, line: 3682, baseType: !1657, size: 64, align: 64, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!1062, !1228, !1250}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1649, file: !14, line: 3698, baseType: !1661, size: 64, align: 64, offset: 256)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!1062, !1228, !1664, !1098}
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1104)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1649, file: !14, line: 3712, baseType: !1667, size: 64, align: 64, offset: 320)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!1062, !1228, !1062, !1664, !1098}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1649, file: !14, line: 3726, baseType: !1661, size: 64, align: 64, offset: 384)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1649, file: !14, line: 3737, baseType: !1225, size: 64, align: 64, offset: 448)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1649, file: !14, line: 3746, baseType: !1062, size: 32, align: 32, offset: 512)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1649, file: !14, line: 3757, baseType: !1674, size: 64, align: 64, offset: 576)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{null, !1677}
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1649, file: !14, line: 3766, baseType: !1225, size: 64, align: 64, offset: 640)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1649, file: !14, line: 3774, baseType: !1225, size: 64, align: 64, offset: 704)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1649, file: !14, line: 3780, baseType: !1062, size: 32, align: 32, offset: 768)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1649, file: !14, line: 3785, baseType: !1062, size: 32, align: 32, offset: 800)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1649, file: !14, line: 3795, baseType: !1684, size: 64, align: 64, offset: 832)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!1062, !1228, !1287}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1230, file: !14, line: 2728, baseType: !1076, size: 64, align: 64, offset: 5440)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1230, file: !14, line: 2735, baseType: !1277, size: 512, align: 64, offset: 5504)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1230, file: !14, line: 2742, baseType: !1062, size: 32, align: 32, offset: 6016)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1230, file: !14, line: 2755, baseType: !1062, size: 32, align: 32, offset: 6048)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1230, file: !14, line: 2776, baseType: !1062, size: 32, align: 32, offset: 6080)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1230, file: !14, line: 2783, baseType: !1062, size: 32, align: 32, offset: 6112)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1230, file: !14, line: 2791, baseType: !1062, size: 32, align: 32, offset: 6144)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1230, file: !14, line: 2802, baseType: !1250, size: 64, align: 64, offset: 6208)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1230, file: !14, line: 2811, baseType: !1062, size: 32, align: 32, offset: 6272)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1230, file: !14, line: 2821, baseType: !1062, size: 32, align: 32, offset: 6304)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1230, file: !14, line: 2830, baseType: !1062, size: 32, align: 32, offset: 6336)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1230, file: !14, line: 2840, baseType: !1062, size: 32, align: 32, offset: 6368)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1230, file: !14, line: 2851, baseType: !1700, size: 64, align: 64, offset: 6400)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!1062, !1514, !1703, !1076, !1517, !1062, !1062}
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!1062, !1514, !1076}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1230, file: !14, line: 2871, baseType: !1707, size: 64, align: 64, offset: 6464)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!1062, !1514, !1710, !1076, !1517, !1062}
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{!1062, !1514, !1076, !1062, !1062}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1230, file: !14, line: 2878, baseType: !1062, size: 32, align: 32, offset: 6528)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1230, file: !14, line: 2885, baseType: !1062, size: 32, align: 32, offset: 6560)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1230, file: !14, line: 3005, baseType: !1062, size: 32, align: 32, offset: 6592)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1230, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1230, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1230, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1230, file: !14, line: 3037, baseType: !1103, size: 64, align: 64, offset: 6720)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1230, file: !14, line: 3038, baseType: !1062, size: 32, align: 32, offset: 6784)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1230, file: !14, line: 3050, baseType: !1077, size: 64, align: 64, offset: 6848)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1230, file: !14, line: 3065, baseType: !1062, size: 32, align: 32, offset: 6912)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1230, file: !14, line: 3083, baseType: !1062, size: 32, align: 32, offset: 6944)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1230, file: !14, line: 3092, baseType: !1120, size: 64, align: 32, offset: 6976)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1230, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1230, file: !14, line: 3106, baseType: !1120, size: 64, align: 32, offset: 7072)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1230, file: !14, line: 3113, baseType: !1728, size: 64, align: 64, offset: 7168)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1730)
!1730 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1731)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1732)
!1732 = !{!1733, !1734, !1735, !1736, !1737, !1738, !1740}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1731, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1731, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1731, file: !14, line: 720, baseType: !1090, size: 64, align: 64, offset: 64)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1731, file: !14, line: 724, baseType: !1090, size: 64, align: 64, offset: 128)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1731, file: !14, line: 728, baseType: !1062, size: 32, align: 32, offset: 192)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1731, file: !14, line: 734, baseType: !1739, size: 64, align: 64, offset: 256)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1731, file: !14, line: 739, baseType: !1741, size: 64, align: 64, offset: 320)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1216)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1230, file: !14, line: 3129, baseType: !1161, size: 64, align: 64, offset: 7232)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1230, file: !14, line: 3130, baseType: !1161, size: 64, align: 64, offset: 7296)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1230, file: !14, line: 3131, baseType: !1161, size: 64, align: 64, offset: 7360)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1230, file: !14, line: 3132, baseType: !1161, size: 64, align: 64, offset: 7424)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1230, file: !14, line: 3139, baseType: !1638, size: 64, align: 64, offset: 7488)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1230, file: !14, line: 3147, baseType: !1062, size: 32, align: 32, offset: 7552)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1230, file: !14, line: 3165, baseType: !1062, size: 32, align: 32, offset: 7584)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1230, file: !14, line: 3172, baseType: !1062, size: 32, align: 32, offset: 7616)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1230, file: !14, line: 3180, baseType: !1062, size: 32, align: 32, offset: 7648)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1230, file: !14, line: 3191, baseType: !1074, size: 64, align: 64, offset: 7680)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1230, file: !14, line: 3199, baseType: !1103, size: 64, align: 64, offset: 7744)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1230, file: !14, line: 3207, baseType: !1638, size: 64, align: 64, offset: 7808)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1230, file: !14, line: 3214, baseType: !1063, size: 32, align: 32, offset: 7872)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1230, file: !14, line: 3224, baseType: !1383, size: 64, align: 64, offset: 7936)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1230, file: !14, line: 3225, baseType: !1062, size: 32, align: 32, offset: 8000)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1230, file: !14, line: 3249, baseType: !1287, size: 64, align: 64, offset: 8064)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1230, file: !14, line: 3256, baseType: !1062, size: 32, align: 32, offset: 8128)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1230, file: !14, line: 3271, baseType: !1062, size: 32, align: 32, offset: 8160)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1230, file: !14, line: 3279, baseType: !1161, size: 64, align: 64, offset: 8192)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1230, file: !14, line: 3301, baseType: !1287, size: 64, align: 64, offset: 8256)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1230, file: !14, line: 3310, baseType: !1062, size: 32, align: 32, offset: 8320)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1230, file: !14, line: 3337, baseType: !1062, size: 32, align: 32, offset: 8352)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1230, file: !14, line: 3351, baseType: !1062, size: 32, align: 32, offset: 8384)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1230, file: !14, line: 3359, baseType: !1062, size: 32, align: 32, offset: 8416)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1110, file: !14, line: 3535, baseType: !1768, size: 64, align: 64, offset: 1024)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64, align: 64)
!1769 = !DISubroutineType(types: !1770)
!1770 = !{!1062, !1228, !1771}
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64, align: 64)
!1772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1110, file: !14, line: 3541, baseType: !1774, size: 64, align: 64, offset: 1088)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64, align: 64)
!1775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1776)
!1776 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1777)
!1777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1244, line: 223, size: 128, align: 64, elements: !1778)
!1778 = !{!1779, !1780}
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1777, file: !1244, line: 224, baseType: !1664, size: 64, align: 64)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1777, file: !1244, line: 225, baseType: !1664, size: 64, align: 64, offset: 64)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1110, file: !14, line: 3549, baseType: !1782, size: 64, align: 64, offset: 1152)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64, align: 64)
!1783 = !DISubroutineType(types: !1784)
!1784 = !{null, !1223}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1110, file: !14, line: 3551, baseType: !1225, size: 64, align: 64, offset: 1216)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1110, file: !14, line: 3552, baseType: !1787, size: 64, align: 64, offset: 1280)
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1788, size: 64, align: 64)
!1788 = !DISubroutineType(types: !1789)
!1789 = !{!1062, !1228, !1103, !1062, !1790}
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64, align: 64)
!1791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1792)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1793)
!1793 = !{!1794, !1795, !1796, !1797, !1798, !1822}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1792, file: !14, line: 3921, baseType: !1070, size: 16, align: 16)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1792, file: !14, line: 3922, baseType: !1098, size: 32, align: 32, offset: 32)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1792, file: !14, line: 3923, baseType: !1098, size: 32, align: 32, offset: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1792, file: !14, line: 3924, baseType: !1063, size: 32, align: 32, offset: 96)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1792, file: !14, line: 3925, baseType: !1799, size: 64, align: 64, offset: 128)
!1799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1800, size: 64, align: 64)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64, align: 64)
!1801 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1802)
!1802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1803)
!1803 = !{!1804, !1805, !1806, !1807, !1808, !1809, !1815, !1817, !1818, !1819, !1820, !1821}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1802, file: !14, line: 3886, baseType: !1062, size: 32, align: 32)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1802, file: !14, line: 3887, baseType: !1062, size: 32, align: 32, offset: 32)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1802, file: !14, line: 3888, baseType: !1062, size: 32, align: 32, offset: 64)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1802, file: !14, line: 3889, baseType: !1062, size: 32, align: 32, offset: 96)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1802, file: !14, line: 3890, baseType: !1062, size: 32, align: 32, offset: 128)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1802, file: !14, line: 3897, baseType: !1810, size: 768, align: 64, offset: 192)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1811)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1812)
!1812 = !{!1813, !1814}
