; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--pngdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--pngdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!898 = !{!899, !900, !901, !902, !903, !904, !905, !906}
!899 = !DIEnumerator(name: "AV_STEREO3D_2D", value: 0)
!900 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE", value: 1)
!901 = !DIEnumerator(name: "AV_STEREO3D_TOPBOTTOM", value: 2)
!902 = !DIEnumerator(name: "AV_STEREO3D_FRAMESEQUENCE", value: 3)
!903 = !DIEnumerator(name: "AV_STEREO3D_CHECKERBOARD", value: 4)
!904 = !DIEnumerator(name: "AV_STEREO3D_SIDEBYSIDE_QUINCUNX", value: 5)
!905 = !DIEnumerator(name: "AV_STEREO3D_LINES", value: 6)
!906 = !DIEnumerator(name: "AV_STEREO3D_COLUMNS", value: 7)
!907 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStereo3DView", file: !897, line: 147, size: 32, align: 32, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIEnumerator(name: "AV_STEREO3D_VIEW_PACKED", value: 0)
!910 = !DIEnumerator(name: "AV_STEREO3D_VIEW_LEFT", value: 1)
!911 = !DIEnumerator(name: "AV_STEREO3D_VIEW_RIGHT", value: 2)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !913, line: 36, size: 32, align: 32, elements: !914)
!913 = !DIFile(filename: "libavcodec/apng.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = !{!915, !916}
!915 = !DIEnumerator(name: "APNG_BLEND_OP_SOURCE", value: 0)
!916 = !DIEnumerator(name: "APNG_BLEND_OP_OVER", value: 1)
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !913, line: 30, size: 32, align: 32, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIEnumerator(name: "APNG_DISPOSE_OP_NONE", value: 0)
!920 = !DIEnumerator(name: "APNG_DISPOSE_OP_BACKGROUND", value: 1)
!921 = !DIEnumerator(name: "APNG_DISPOSE_OP_PREVIOUS", value: 2)
!922 = !{!923, !924, !925, !926, !934, !936, !939, !940, !944, !946, !949, !951, !953, !958}
!923 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !929, line: 221, size: 32, align: 8, elements: !930)
!929 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !928, file: !929, line: 221, baseType: !932, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !933, line: 51, baseType: !924)
!933 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !933, line: 49, baseType: !938)
!938 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !929, line: 222, size: 16, align: 8, elements: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !929, line: 222, baseType: !937, size: 16, align: 16)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !933, line: 48, baseType: !935)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !929, line: 220, size: 64, align: 8, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !955, file: !929, line: 220, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !933, line: 55, baseType: !959)
!959 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!960 = !{!961, !1678, !1679, !1683, !1684}
!961 = distinct !DIGlobalVariable(name: "ff_apng_decoder", scope: !0, file: !888, line: 1624, type: !962, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_apng_decoder)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !964)
!964 = !{!965, !968, !969, !970, !971, !972, !981, !984, !987, !990, !993, !994, !1035, !1043, !1044, !1045, !1047, !1593, !1599, !1607, !1611, !1612, !1649, !1653, !1657, !1658, !1662, !1666, !1667, !1671, !1672, !1673}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !14, line: 3475, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !963, file: !14, line: 3480, baseType: !966, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !963, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !963, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !963, file: !14, line: 3487, baseType: !923, size: 32, align: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !963, file: !14, line: 3488, baseType: !973, size: 64, align: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !976, line: 61, baseType: !977)
!976 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !976, line: 58, size: 64, align: 32, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !977, file: !976, line: 59, baseType: !923, size: 32, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !977, file: !976, line: 60, baseType: !923, size: 32, align: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !963, file: !14, line: 3489, baseType: !982, size: 64, align: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !963, file: !14, line: 3490, baseType: !985, size: 64, align: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !963, file: !14, line: 3491, baseType: !988, size: 64, align: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !963, file: !14, line: 3492, baseType: !991, size: 64, align: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !963, file: !14, line: 3493, baseType: !950, size: 8, align: 8, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !963, file: !14, line: 3494, baseType: !995, size: 64, align: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !999)
!999 = !{!1000, !1001, !1005, !1009, !1010, !1011, !1012, !1016, !1022, !1024, !1028}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !998, file: !691, line: 72, baseType: !966, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !998, file: !691, line: 78, baseType: !1002, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!966, !925}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !998, file: !691, line: 85, baseType: !1006, size: 64, align: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !998, file: !691, line: 93, baseType: !923, size: 32, align: 32, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !998, file: !691, line: 99, baseType: !923, size: 32, align: 32, offset: 224)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !998, file: !691, line: 108, baseType: !923, size: 32, align: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !998, file: !691, line: 113, baseType: !1013, size: 64, align: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!925, !925, !925}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !998, file: !691, line: 123, baseType: !1017, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1020, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !998, file: !691, line: 130, baseType: !1023, size: 32, align: 32, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !998, file: !691, line: 136, baseType: !1025, size: 64, align: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1023, !925}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !998, file: !691, line: 142, baseType: !1029, size: 64, align: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!923, !1032, !925, !966, !923}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !963, file: !14, line: 3495, baseType: !1036, size: 64, align: 64, offset: 704)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1039, file: !14, line: 3402, baseType: !923, size: 32, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !14, line: 3403, baseType: !966, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !963, file: !14, line: 3507, baseType: !966, size: 64, align: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !963, file: !14, line: 3516, baseType: !923, size: 32, align: 32, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !14, line: 3517, baseType: !1046, size: 64, align: 64, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !963, file: !14, line: 3527, baseType: !1048, size: 64, align: 64, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!923, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1061, !1062, !1063, !1064, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1345, !1349, !1350, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1531, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1053, file: !14, line: 1561, baseType: !995, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1053, file: !14, line: 1562, baseType: !923, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1053, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1053, file: !14, line: 1565, baseType: !1059, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1053, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1053, file: !14, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1053, file: !14, line: 1583, baseType: !925, size: 64, align: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1053, file: !14, line: 1591, baseType: !1065, size: 64, align: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1067, line: 129, size: 1664, align: 64, elements: !1068)
!1067 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1068 = !{!1069, !1070, !1071, !1072, !1172, !1193, !1194, !1223, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1066, file: !1067, line: 136, baseType: !923, size: 32, align: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1066, file: !1067, line: 151, baseType: !923, size: 32, align: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1066, file: !1067, line: 157, baseType: !923, size: 32, align: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1066, file: !1067, line: 159, baseType: !1073, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1076)
!1076 = !{!1077, !1081, !1083, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1124, !1126, !1127, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1160, !1161, !1162, !1163, !1164, !1165, !1168, !1169, !1170, !1171}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !722, line: 282, baseType: !1078, size: 512, align: 64)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 512, align: 64, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 8)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1075, file: !722, line: 299, baseType: !1082, size: 256, align: 32, offset: 512)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, align: 32, elements: !1079)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1075, file: !722, line: 315, baseType: !1084, size: 64, align: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1075, file: !722, line: 326, baseType: !923, size: 32, align: 32, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1075, file: !722, line: 326, baseType: !923, size: 32, align: 32, offset: 864)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1075, file: !722, line: 334, baseType: !923, size: 32, align: 32, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1075, file: !722, line: 341, baseType: !923, size: 32, align: 32, offset: 928)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1075, file: !722, line: 346, baseType: !923, size: 32, align: 32, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1075, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1075, file: !722, line: 356, baseType: !975, size: 64, align: 32, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1075, file: !722, line: 361, baseType: !1093, size: 64, align: 64, offset: 1088)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1094, line: 197, baseType: !1095)
!1094 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1095 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1075, file: !722, line: 369, baseType: !1093, size: 64, align: 64, offset: 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1075, file: !722, line: 377, baseType: !1093, size: 64, align: 64, offset: 1216)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1075, file: !722, line: 382, baseType: !923, size: 32, align: 32, offset: 1280)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1075, file: !722, line: 386, baseType: !923, size: 32, align: 32, offset: 1312)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1075, file: !722, line: 391, baseType: !923, size: 32, align: 32, offset: 1344)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1075, file: !722, line: 396, baseType: !925, size: 64, align: 64, offset: 1408)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1075, file: !722, line: 403, baseType: !1103, size: 512, align: 64, offset: 1472)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 512, align: 64, elements: !1079)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1075, file: !722, line: 410, baseType: !923, size: 32, align: 32, offset: 1984)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1075, file: !722, line: 415, baseType: !923, size: 32, align: 32, offset: 2016)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1075, file: !722, line: 420, baseType: !923, size: 32, align: 32, offset: 2048)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1075, file: !722, line: 425, baseType: !923, size: 32, align: 32, offset: 2080)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1075, file: !722, line: 435, baseType: !1093, size: 64, align: 64, offset: 2112)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1075, file: !722, line: 440, baseType: !923, size: 32, align: 32, offset: 2176)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1075, file: !722, line: 445, baseType: !958, size: 64, align: 64, offset: 2240)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1075, file: !722, line: 459, baseType: !1112, size: 512, align: 64, offset: 2304)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 512, align: 64, elements: !1079)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1115, line: 94, baseType: !1116)
!1115 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1115, line: 81, size: 192, align: 64, elements: !1117)
!1117 = !{!1118, !1122, !1123}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1116, file: !1115, line: 82, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1115, line: 73, baseType: !1121)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1115, line: 73, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !1115, line: 89, baseType: !949, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !1115, line: 93, baseType: !923, size: 32, align: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1075, file: !722, line: 473, baseType: !1125, size: 64, align: 64, offset: 2816)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1075, file: !722, line: 477, baseType: !923, size: 32, align: 32, offset: 2880)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1075, file: !722, line: 479, baseType: !1128, size: 64, align: 64, offset: 2944)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136, !1141}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !722, line: 203, baseType: !949, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !722, line: 204, baseType: !923, size: 32, align: 32, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1131, file: !722, line: 205, baseType: !1137, size: 64, align: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1139, line: 86, baseType: !1140)
!1139 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1139, line: 86, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1131, file: !722, line: 206, baseType: !1113, size: 64, align: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1075, file: !722, line: 480, baseType: !923, size: 32, align: 32, offset: 3008)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !722, line: 505, baseType: !923, size: 32, align: 32, offset: 3040)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1075, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1075, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1075, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1075, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1075, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1075, file: !722, line: 532, baseType: !1093, size: 64, align: 64, offset: 3264)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1075, file: !722, line: 539, baseType: !1093, size: 64, align: 64, offset: 3328)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1075, file: !722, line: 547, baseType: !1093, size: 64, align: 64, offset: 3392)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1075, file: !722, line: 554, baseType: !1137, size: 64, align: 64, offset: 3456)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1075, file: !722, line: 563, baseType: !923, size: 32, align: 32, offset: 3520)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1075, file: !722, line: 572, baseType: !923, size: 32, align: 32, offset: 3552)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1075, file: !722, line: 581, baseType: !923, size: 32, align: 32, offset: 3584)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1075, file: !722, line: 588, baseType: !1157, size: 64, align: 64, offset: 3648)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1094, line: 194, baseType: !1159)
!1159 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1075, file: !722, line: 593, baseType: !923, size: 32, align: 32, offset: 3712)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1075, file: !722, line: 596, baseType: !923, size: 32, align: 32, offset: 3744)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1075, file: !722, line: 599, baseType: !1113, size: 64, align: 64, offset: 3776)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1075, file: !722, line: 605, baseType: !1113, size: 64, align: 64, offset: 3840)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1075, file: !722, line: 616, baseType: !1113, size: 64, align: 64, offset: 3904)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1075, file: !722, line: 626, baseType: !1166, size: 64, align: 64, offset: 3968)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1167, line: 216, baseType: !959)
!1167 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1075, file: !722, line: 627, baseType: !1166, size: 64, align: 64, offset: 4032)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1075, file: !722, line: 628, baseType: !1166, size: 64, align: 64, offset: 4096)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1075, file: !722, line: 629, baseType: !1166, size: 64, align: 64, offset: 4160)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1075, file: !722, line: 645, baseType: !1113, size: 64, align: 64, offset: 4224)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1066, file: !1067, line: 161, baseType: !1173, size: 64, align: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1067, line: 117, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1067, line: 100, size: 832, align: 64, elements: !1176)
!1176 = !{!1177, !1184, !1185, !1186, !1187, !1188, !1190, !1191, !1192}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1175, file: !1067, line: 105, baseType: !1178, size: 256, align: 64)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 256, align: 64, elements: !1182)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1115, line: 238, baseType: !1181)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1115, line: 238, flags: DIFlagFwdDecl)
!1182 = !{!1183}
!1183 = !DISubrange(count: 4)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1175, file: !1067, line: 110, baseType: !923, size: 32, align: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1175, file: !1067, line: 111, baseType: !923, size: 32, align: 32, offset: 288)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1175, file: !1067, line: 111, baseType: !923, size: 32, align: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1175, file: !1067, line: 112, baseType: !1082, size: 256, align: 32, offset: 352)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1175, file: !1067, line: 113, baseType: !1189, size: 128, align: 32, offset: 608)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, align: 32, elements: !1182)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1175, file: !1067, line: 114, baseType: !923, size: 32, align: 32, offset: 736)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !1067, line: 115, baseType: !923, size: 32, align: 32, offset: 768)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1175, file: !1067, line: 116, baseType: !923, size: 32, align: 32, offset: 800)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1066, file: !1067, line: 163, baseType: !925, size: 64, align: 64, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1066, file: !1067, line: 165, baseType: !1195, size: 128, align: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1067, line: 122, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1067, line: 119, size: 128, align: 64, elements: !1197)
!1197 = !{!1198, !1222}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1196, file: !1067, line: 120, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1218, !1219, !1220, !1221}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1201, file: !14, line: 1451, baseType: !1113, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1201, file: !14, line: 1461, baseType: !1093, size: 64, align: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1201, file: !14, line: 1467, baseType: !1093, size: 64, align: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !14, line: 1468, baseType: !949, size: 64, align: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1201, file: !14, line: 1469, baseType: !923, size: 32, align: 32, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1201, file: !14, line: 1470, baseType: !923, size: 32, align: 32, offset: 288)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1201, file: !14, line: 1474, baseType: !923, size: 32, align: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1201, file: !14, line: 1479, baseType: !1211, size: 64, align: 64, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !14, line: 1412, baseType: !949, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !14, line: 1413, baseType: !923, size: 32, align: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1201, file: !14, line: 1480, baseType: !923, size: 32, align: 32, offset: 448)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1201, file: !14, line: 1486, baseType: !1093, size: 64, align: 64, offset: 512)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1201, file: !14, line: 1488, baseType: !1093, size: 64, align: 64, offset: 576)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1201, file: !14, line: 1497, baseType: !1093, size: 64, align: 64, offset: 640)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1196, file: !1067, line: 121, baseType: !1073, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1066, file: !1067, line: 166, baseType: !1224, size: 128, align: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1067, line: 127, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1067, line: 124, size: 128, align: 64, elements: !1226)
!1226 = !{!1227, !1300}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1225, file: !1067, line: 125, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1258, !1262, !1263, !1297, !1298, !1299}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1231, file: !14, line: 5751, baseType: !995, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1231, file: !14, line: 5756, baseType: !1235, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1243, !1244, !1245, !1249, !1253, !1257}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1237, file: !14, line: 5797, baseType: !966, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1237, file: !14, line: 5804, baseType: !1241, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1237, file: !14, line: 5815, baseType: !995, size: 64, align: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1237, file: !14, line: 5825, baseType: !923, size: 32, align: 32, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1237, file: !14, line: 5826, baseType: !1246, size: 64, align: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!923, !1229}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1237, file: !14, line: 5827, baseType: !1250, size: 64, align: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!923, !1229, !1199}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1237, file: !14, line: 5828, baseType: !1254, size: 64, align: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !1229}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1237, file: !14, line: 5829, baseType: !1254, size: 64, align: 64, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1231, file: !14, line: 5762, baseType: !1259, size: 64, align: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1261)
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1231, file: !14, line: 5768, baseType: !925, size: 64, align: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1231, file: !14, line: 5775, baseType: !1264, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1266, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1266, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1266, file: !14, line: 3948, baseType: !932, size: 32, align: 32, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1266, file: !14, line: 3958, baseType: !949, size: 64, align: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1266, file: !14, line: 3962, baseType: !923, size: 32, align: 32, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1266, file: !14, line: 3968, baseType: !923, size: 32, align: 32, offset: 224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1266, file: !14, line: 3973, baseType: !1093, size: 64, align: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1266, file: !14, line: 3986, baseType: !923, size: 32, align: 32, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1266, file: !14, line: 3999, baseType: !923, size: 32, align: 32, offset: 352)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1266, file: !14, line: 4004, baseType: !923, size: 32, align: 32, offset: 384)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1266, file: !14, line: 4005, baseType: !923, size: 32, align: 32, offset: 416)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1266, file: !14, line: 4010, baseType: !923, size: 32, align: 32, offset: 448)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1266, file: !14, line: 4011, baseType: !923, size: 32, align: 32, offset: 480)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1266, file: !14, line: 4020, baseType: !975, size: 64, align: 32, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1266, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1266, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1266, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1266, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1266, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1266, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1266, file: !14, line: 4039, baseType: !923, size: 32, align: 32, offset: 768)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1266, file: !14, line: 4046, baseType: !958, size: 64, align: 64, offset: 832)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1266, file: !14, line: 4050, baseType: !923, size: 32, align: 32, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1266, file: !14, line: 4054, baseType: !923, size: 32, align: 32, offset: 928)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1266, file: !14, line: 4061, baseType: !923, size: 32, align: 32, offset: 960)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1266, file: !14, line: 4065, baseType: !923, size: 32, align: 32, offset: 992)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1266, file: !14, line: 4073, baseType: !923, size: 32, align: 32, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1266, file: !14, line: 4080, baseType: !923, size: 32, align: 32, offset: 1056)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1266, file: !14, line: 4084, baseType: !923, size: 32, align: 32, offset: 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1231, file: !14, line: 5781, baseType: !1264, size: 64, align: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1231, file: !14, line: 5787, baseType: !975, size: 64, align: 32, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1231, file: !14, line: 5793, baseType: !975, size: 64, align: 32, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1225, file: !1067, line: 126, baseType: !923, size: 32, align: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1066, file: !1067, line: 172, baseType: !1199, size: 64, align: 64, offset: 576)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1066, file: !1067, line: 177, baseType: !949, size: 64, align: 64, offset: 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1066, file: !1067, line: 178, baseType: !924, size: 32, align: 32, offset: 704)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1066, file: !1067, line: 180, baseType: !925, size: 64, align: 64, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1066, file: !1067, line: 185, baseType: !923, size: 32, align: 32, offset: 832)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1066, file: !1067, line: 190, baseType: !925, size: 64, align: 64, offset: 896)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1066, file: !1067, line: 195, baseType: !923, size: 32, align: 32, offset: 960)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1066, file: !1067, line: 200, baseType: !1199, size: 64, align: 64, offset: 1024)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1066, file: !1067, line: 201, baseType: !923, size: 32, align: 32, offset: 1088)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1066, file: !1067, line: 202, baseType: !1073, size: 64, align: 64, offset: 1152)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1066, file: !1067, line: 203, baseType: !923, size: 32, align: 32, offset: 1216)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1066, file: !1067, line: 205, baseType: !923, size: 32, align: 32, offset: 1248)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1066, file: !1067, line: 206, baseType: !923, size: 32, align: 32, offset: 1280)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1066, file: !1067, line: 209, baseType: !1166, size: 64, align: 64, offset: 1344)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1066, file: !1067, line: 212, baseType: !1166, size: 64, align: 64, offset: 1408)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1066, file: !1067, line: 213, baseType: !1073, size: 64, align: 64, offset: 1472)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1066, file: !1067, line: 215, baseType: !923, size: 32, align: 32, offset: 1536)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1066, file: !1067, line: 217, baseType: !923, size: 32, align: 32, offset: 1568)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1066, file: !1067, line: 220, baseType: !923, size: 32, align: 32, offset: 1600)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1053, file: !14, line: 1598, baseType: !925, size: 64, align: 64, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1053, file: !14, line: 1606, baseType: !1093, size: 64, align: 64, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1053, file: !14, line: 1614, baseType: !923, size: 32, align: 32, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1053, file: !14, line: 1622, baseType: !923, size: 32, align: 32, offset: 544)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1053, file: !14, line: 1628, baseType: !923, size: 32, align: 32, offset: 576)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !14, line: 1636, baseType: !923, size: 32, align: 32, offset: 608)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1053, file: !14, line: 1643, baseType: !923, size: 32, align: 32, offset: 640)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1053, file: !14, line: 1657, baseType: !949, size: 64, align: 64, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1053, file: !14, line: 1658, baseType: !923, size: 32, align: 32, offset: 768)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1053, file: !14, line: 1679, baseType: !975, size: 64, align: 32, offset: 800)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1053, file: !14, line: 1688, baseType: !923, size: 32, align: 32, offset: 864)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1053, file: !14, line: 1712, baseType: !923, size: 32, align: 32, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1053, file: !14, line: 1729, baseType: !923, size: 32, align: 32, offset: 928)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1053, file: !14, line: 1729, baseType: !923, size: 32, align: 32, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1053, file: !14, line: 1744, baseType: !923, size: 32, align: 32, offset: 992)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1053, file: !14, line: 1744, baseType: !923, size: 32, align: 32, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1053, file: !14, line: 1751, baseType: !923, size: 32, align: 32, offset: 1056)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1053, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1053, file: !14, line: 1791, baseType: !1339, size: 64, align: 64, offset: 1152)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{null, !1342, !1343, !939, !923, !923, !923}
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1053, file: !14, line: 1808, baseType: !1346, size: 64, align: 64, offset: 1216)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!473, !1342, !982}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1053, file: !14, line: 1816, baseType: !923, size: 32, align: 32, offset: 1280)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1053, file: !14, line: 1825, baseType: !1351, size: 32, align: 32, offset: 1312)
!1351 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1053, file: !14, line: 1830, baseType: !923, size: 32, align: 32, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1053, file: !14, line: 1838, baseType: !1351, size: 32, align: 32, offset: 1376)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1053, file: !14, line: 1846, baseType: !923, size: 32, align: 32, offset: 1408)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1053, file: !14, line: 1851, baseType: !923, size: 32, align: 32, offset: 1440)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1053, file: !14, line: 1861, baseType: !1351, size: 32, align: 32, offset: 1472)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1053, file: !14, line: 1868, baseType: !1351, size: 32, align: 32, offset: 1504)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1053, file: !14, line: 1875, baseType: !1351, size: 32, align: 32, offset: 1536)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1053, file: !14, line: 1882, baseType: !1351, size: 32, align: 32, offset: 1568)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1053, file: !14, line: 1889, baseType: !1351, size: 32, align: 32, offset: 1600)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1053, file: !14, line: 1896, baseType: !1351, size: 32, align: 32, offset: 1632)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1053, file: !14, line: 1903, baseType: !1351, size: 32, align: 32, offset: 1664)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1053, file: !14, line: 1910, baseType: !923, size: 32, align: 32, offset: 1696)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1053, file: !14, line: 1915, baseType: !923, size: 32, align: 32, offset: 1728)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1053, file: !14, line: 1926, baseType: !939, size: 64, align: 64, offset: 1792)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1053, file: !14, line: 1935, baseType: !975, size: 64, align: 32, offset: 1856)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1053, file: !14, line: 1942, baseType: !923, size: 32, align: 32, offset: 1920)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1053, file: !14, line: 1948, baseType: !923, size: 32, align: 32, offset: 1952)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1053, file: !14, line: 1954, baseType: !923, size: 32, align: 32, offset: 1984)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1053, file: !14, line: 1960, baseType: !923, size: 32, align: 32, offset: 2016)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1053, file: !14, line: 1984, baseType: !923, size: 32, align: 32, offset: 2048)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1053, file: !14, line: 1991, baseType: !923, size: 32, align: 32, offset: 2080)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1053, file: !14, line: 1996, baseType: !923, size: 32, align: 32, offset: 2112)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1053, file: !14, line: 2004, baseType: !923, size: 32, align: 32, offset: 2144)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1053, file: !14, line: 2011, baseType: !923, size: 32, align: 32, offset: 2176)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1053, file: !14, line: 2018, baseType: !923, size: 32, align: 32, offset: 2208)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1053, file: !14, line: 2027, baseType: !923, size: 32, align: 32, offset: 2240)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1053, file: !14, line: 2034, baseType: !923, size: 32, align: 32, offset: 2272)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1053, file: !14, line: 2044, baseType: !923, size: 32, align: 32, offset: 2304)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1053, file: !14, line: 2054, baseType: !936, size: 64, align: 64, offset: 2368)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1053, file: !14, line: 2061, baseType: !936, size: 64, align: 64, offset: 2432)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1053, file: !14, line: 2066, baseType: !923, size: 32, align: 32, offset: 2496)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1053, file: !14, line: 2070, baseType: !923, size: 32, align: 32, offset: 2528)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1053, file: !14, line: 2078, baseType: !923, size: 32, align: 32, offset: 2560)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1053, file: !14, line: 2085, baseType: !923, size: 32, align: 32, offset: 2592)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1053, file: !14, line: 2092, baseType: !923, size: 32, align: 32, offset: 2624)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1053, file: !14, line: 2099, baseType: !923, size: 32, align: 32, offset: 2656)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1053, file: !14, line: 2106, baseType: !923, size: 32, align: 32, offset: 2688)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1053, file: !14, line: 2113, baseType: !923, size: 32, align: 32, offset: 2720)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1053, file: !14, line: 2120, baseType: !923, size: 32, align: 32, offset: 2752)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1053, file: !14, line: 2125, baseType: !923, size: 32, align: 32, offset: 2784)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1053, file: !14, line: 2133, baseType: !923, size: 32, align: 32, offset: 2816)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1053, file: !14, line: 2140, baseType: !923, size: 32, align: 32, offset: 2848)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1053, file: !14, line: 2145, baseType: !923, size: 32, align: 32, offset: 2880)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1053, file: !14, line: 2153, baseType: !923, size: 32, align: 32, offset: 2912)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1053, file: !14, line: 2158, baseType: !923, size: 32, align: 32, offset: 2944)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1053, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1053, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1053, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1053, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1053, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1053, file: !14, line: 2203, baseType: !923, size: 32, align: 32, offset: 3136)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1053, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1053, file: !14, line: 2212, baseType: !923, size: 32, align: 32, offset: 3200)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1053, file: !14, line: 2213, baseType: !923, size: 32, align: 32, offset: 3232)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1053, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1053, file: !14, line: 2232, baseType: !923, size: 32, align: 32, offset: 3296)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1053, file: !14, line: 2243, baseType: !923, size: 32, align: 32, offset: 3328)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1053, file: !14, line: 2249, baseType: !923, size: 32, align: 32, offset: 3360)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1053, file: !14, line: 2256, baseType: !923, size: 32, align: 32, offset: 3392)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1053, file: !14, line: 2263, baseType: !958, size: 64, align: 64, offset: 3456)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1053, file: !14, line: 2270, baseType: !958, size: 64, align: 64, offset: 3520)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1053, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1053, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1053, file: !14, line: 2367, baseType: !1416, size: 64, align: 64, offset: 3648)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!923, !1342, !1073, !923}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1053, file: !14, line: 2383, baseType: !923, size: 32, align: 32, offset: 3712)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1053, file: !14, line: 2386, baseType: !1351, size: 32, align: 32, offset: 3744)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1053, file: !14, line: 2387, baseType: !1351, size: 32, align: 32, offset: 3776)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1053, file: !14, line: 2394, baseType: !923, size: 32, align: 32, offset: 3808)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1053, file: !14, line: 2401, baseType: !923, size: 32, align: 32, offset: 3840)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1053, file: !14, line: 2408, baseType: !923, size: 32, align: 32, offset: 3872)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1053, file: !14, line: 2415, baseType: !923, size: 32, align: 32, offset: 3904)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1053, file: !14, line: 2422, baseType: !923, size: 32, align: 32, offset: 3936)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1053, file: !14, line: 2423, baseType: !1428, size: 64, align: 64, offset: 3968)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1430, file: !14, line: 827, baseType: !923, size: 32, align: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1430, file: !14, line: 828, baseType: !923, size: 32, align: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1430, file: !14, line: 829, baseType: !923, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1430, file: !14, line: 830, baseType: !1351, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1053, file: !14, line: 2430, baseType: !1093, size: 64, align: 64, offset: 4032)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1053, file: !14, line: 2437, baseType: !1093, size: 64, align: 64, offset: 4096)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1053, file: !14, line: 2444, baseType: !1351, size: 32, align: 32, offset: 4160)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1053, file: !14, line: 2451, baseType: !1351, size: 32, align: 32, offset: 4192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1053, file: !14, line: 2458, baseType: !923, size: 32, align: 32, offset: 4224)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1053, file: !14, line: 2469, baseType: !923, size: 32, align: 32, offset: 4256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1053, file: !14, line: 2475, baseType: !923, size: 32, align: 32, offset: 4288)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1053, file: !14, line: 2481, baseType: !923, size: 32, align: 32, offset: 4320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1053, file: !14, line: 2485, baseType: !923, size: 32, align: 32, offset: 4352)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1053, file: !14, line: 2489, baseType: !923, size: 32, align: 32, offset: 4384)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1053, file: !14, line: 2493, baseType: !923, size: 32, align: 32, offset: 4416)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1053, file: !14, line: 2501, baseType: !923, size: 32, align: 32, offset: 4448)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1053, file: !14, line: 2506, baseType: !923, size: 32, align: 32, offset: 4480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1053, file: !14, line: 2510, baseType: !923, size: 32, align: 32, offset: 4512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1053, file: !14, line: 2514, baseType: !1093, size: 64, align: 64, offset: 4544)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1053, file: !14, line: 2528, baseType: !1452, size: 64, align: 64, offset: 4608)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !1342, !925, !923, !923}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1053, file: !14, line: 2534, baseType: !923, size: 32, align: 32, offset: 4672)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1053, file: !14, line: 2545, baseType: !923, size: 32, align: 32, offset: 4704)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1053, file: !14, line: 2547, baseType: !923, size: 32, align: 32, offset: 4736)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1053, file: !14, line: 2549, baseType: !923, size: 32, align: 32, offset: 4768)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1053, file: !14, line: 2551, baseType: !923, size: 32, align: 32, offset: 4800)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1053, file: !14, line: 2553, baseType: !923, size: 32, align: 32, offset: 4832)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1053, file: !14, line: 2555, baseType: !923, size: 32, align: 32, offset: 4864)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1053, file: !14, line: 2557, baseType: !923, size: 32, align: 32, offset: 4896)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1053, file: !14, line: 2559, baseType: !923, size: 32, align: 32, offset: 4928)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1053, file: !14, line: 2563, baseType: !923, size: 32, align: 32, offset: 4960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1053, file: !14, line: 2571, baseType: !947, size: 64, align: 64, offset: 4992)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1053, file: !14, line: 2579, baseType: !947, size: 64, align: 64, offset: 5056)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1053, file: !14, line: 2586, baseType: !923, size: 32, align: 32, offset: 5120)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1053, file: !14, line: 2615, baseType: !923, size: 32, align: 32, offset: 5152)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1053, file: !14, line: 2627, baseType: !923, size: 32, align: 32, offset: 5184)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1053, file: !14, line: 2637, baseType: !923, size: 32, align: 32, offset: 5216)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1053, file: !14, line: 2681, baseType: !923, size: 32, align: 32, offset: 5248)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1053, file: !14, line: 2709, baseType: !1093, size: 64, align: 64, offset: 5312)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1053, file: !14, line: 2716, baseType: !1474, size: 64, align: 64, offset: 5376)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1476)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1477)
!1477 = !{!1478, !1479, !1480, !1481, !1482, !1483, !1487, !1491, !1495, !1496, !1497, !1498, !1504, !1505, !1506, !1507, !1508}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1476, file: !14, line: 3642, baseType: !966, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1476, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1476, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1476, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1476, file: !14, line: 3669, baseType: !923, size: 32, align: 32, offset: 160)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1476, file: !14, line: 3682, baseType: !1484, size: 64, align: 64, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!923, !1051, !1073}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1476, file: !14, line: 3698, baseType: !1488, size: 64, align: 64, offset: 256)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!923, !1051, !951, !932}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1476, file: !14, line: 3712, baseType: !1492, size: 64, align: 64, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!923, !1051, !923, !951, !932}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1476, file: !14, line: 3726, baseType: !1488, size: 64, align: 64, offset: 384)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1476, file: !14, line: 3737, baseType: !1048, size: 64, align: 64, offset: 448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1476, file: !14, line: 3746, baseType: !923, size: 32, align: 32, offset: 512)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1476, file: !14, line: 3757, baseType: !1499, size: 64, align: 64, offset: 576)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1502}
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1476, file: !14, line: 3766, baseType: !1048, size: 64, align: 64, offset: 640)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1476, file: !14, line: 3774, baseType: !1048, size: 64, align: 64, offset: 704)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1476, file: !14, line: 3780, baseType: !923, size: 32, align: 32, offset: 768)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1476, file: !14, line: 3785, baseType: !923, size: 32, align: 32, offset: 800)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1476, file: !14, line: 3795, baseType: !1509, size: 64, align: 64, offset: 832)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!923, !1051, !1113}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1053, file: !14, line: 2728, baseType: !925, size: 64, align: 64, offset: 5440)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1053, file: !14, line: 2735, baseType: !1103, size: 512, align: 64, offset: 5504)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1053, file: !14, line: 2742, baseType: !923, size: 32, align: 32, offset: 6016)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1053, file: !14, line: 2755, baseType: !923, size: 32, align: 32, offset: 6048)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1053, file: !14, line: 2776, baseType: !923, size: 32, align: 32, offset: 6080)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1053, file: !14, line: 2783, baseType: !923, size: 32, align: 32, offset: 6112)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1053, file: !14, line: 2791, baseType: !923, size: 32, align: 32, offset: 6144)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1053, file: !14, line: 2802, baseType: !1073, size: 64, align: 64, offset: 6208)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1053, file: !14, line: 2811, baseType: !923, size: 32, align: 32, offset: 6272)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1053, file: !14, line: 2821, baseType: !923, size: 32, align: 32, offset: 6304)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1053, file: !14, line: 2830, baseType: !923, size: 32, align: 32, offset: 6336)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1053, file: !14, line: 2840, baseType: !923, size: 32, align: 32, offset: 6368)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1053, file: !14, line: 2851, baseType: !1525, size: 64, align: 64, offset: 6400)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!923, !1342, !1528, !925, !939, !923, !923}
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!923, !1342, !925}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1053, file: !14, line: 2871, baseType: !1532, size: 64, align: 64, offset: 6464)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!923, !1342, !1535, !925, !939, !923}
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!923, !1342, !925, !923, !923}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1053, file: !14, line: 2878, baseType: !923, size: 32, align: 32, offset: 6528)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1053, file: !14, line: 2885, baseType: !923, size: 32, align: 32, offset: 6560)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1053, file: !14, line: 3005, baseType: !923, size: 32, align: 32, offset: 6592)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1053, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1053, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1053, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1053, file: !14, line: 3037, baseType: !949, size: 64, align: 64, offset: 6720)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1053, file: !14, line: 3038, baseType: !923, size: 32, align: 32, offset: 6784)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1053, file: !14, line: 3050, baseType: !958, size: 64, align: 64, offset: 6848)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1053, file: !14, line: 3065, baseType: !923, size: 32, align: 32, offset: 6912)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1053, file: !14, line: 3083, baseType: !923, size: 32, align: 32, offset: 6944)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1053, file: !14, line: 3092, baseType: !975, size: 64, align: 32, offset: 6976)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1053, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1053, file: !14, line: 3106, baseType: !975, size: 64, align: 32, offset: 7072)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1053, file: !14, line: 3113, baseType: !1553, size: 64, align: 64, offset: 7168)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1555)
!1555 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1556)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1557)
!1557 = !{!1558, !1559, !1560, !1561, !1562, !1563, !1566}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1556, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1556, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1556, file: !14, line: 720, baseType: !966, size: 64, align: 64, offset: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1556, file: !14, line: 724, baseType: !966, size: 64, align: 64, offset: 128)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1556, file: !14, line: 728, baseType: !923, size: 32, align: 32, offset: 192)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1556, file: !14, line: 734, baseType: !1564, size: 64, align: 64, offset: 256)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1556, file: !14, line: 739, baseType: !1567, size: 64, align: 64, offset: 320)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1053, file: !14, line: 3129, baseType: !1093, size: 64, align: 64, offset: 7232)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1053, file: !14, line: 3130, baseType: !1093, size: 64, align: 64, offset: 7296)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1053, file: !14, line: 3131, baseType: !1093, size: 64, align: 64, offset: 7360)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1053, file: !14, line: 3132, baseType: !1093, size: 64, align: 64, offset: 7424)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1053, file: !14, line: 3139, baseType: !947, size: 64, align: 64, offset: 7488)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1053, file: !14, line: 3147, baseType: !923, size: 32, align: 32, offset: 7552)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1053, file: !14, line: 3165, baseType: !923, size: 32, align: 32, offset: 7584)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1053, file: !14, line: 3172, baseType: !923, size: 32, align: 32, offset: 7616)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1053, file: !14, line: 3180, baseType: !923, size: 32, align: 32, offset: 7648)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1053, file: !14, line: 3191, baseType: !936, size: 64, align: 64, offset: 7680)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1053, file: !14, line: 3199, baseType: !949, size: 64, align: 64, offset: 7744)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1053, file: !14, line: 3207, baseType: !947, size: 64, align: 64, offset: 7808)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1053, file: !14, line: 3214, baseType: !924, size: 32, align: 32, offset: 7872)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1053, file: !14, line: 3224, baseType: !1211, size: 64, align: 64, offset: 7936)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1053, file: !14, line: 3225, baseType: !923, size: 32, align: 32, offset: 8000)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1053, file: !14, line: 3249, baseType: !1113, size: 64, align: 64, offset: 8064)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1053, file: !14, line: 3256, baseType: !923, size: 32, align: 32, offset: 8128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1053, file: !14, line: 3271, baseType: !923, size: 32, align: 32, offset: 8160)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1053, file: !14, line: 3279, baseType: !1093, size: 64, align: 64, offset: 8192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1053, file: !14, line: 3301, baseType: !1113, size: 64, align: 64, offset: 8256)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1053, file: !14, line: 3310, baseType: !923, size: 32, align: 32, offset: 8320)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1053, file: !14, line: 3337, baseType: !923, size: 32, align: 32, offset: 8352)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1053, file: !14, line: 3351, baseType: !923, size: 32, align: 32, offset: 8384)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1053, file: !14, line: 3359, baseType: !923, size: 32, align: 32, offset: 8416)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !963, file: !14, line: 3535, baseType: !1594, size: 64, align: 64, offset: 1024)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!923, !1051, !1597}
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !963, file: !14, line: 3541, baseType: !1600, size: 64, align: 64, offset: 1088)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1602)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1067, line: 223, size: 128, align: 64, elements: !1604)
!1604 = !{!1605, !1606}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1603, file: !1067, line: 224, baseType: !951, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1603, file: !1067, line: 225, baseType: !951, size: 64, align: 64, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !963, file: !14, line: 3549, baseType: !1608, size: 64, align: 64, offset: 1152)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{null, !1046}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !963, file: !14, line: 3551, baseType: !1048, size: 64, align: 64, offset: 1216)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !963, file: !14, line: 3552, baseType: !1613, size: 64, align: 64, offset: 1280)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!923, !1051, !949, !923, !1616}
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1619)
!1619 = !{!1620, !1621, !1622, !1623, !1624, !1648}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1618, file: !14, line: 3921, baseType: !937, size: 16, align: 16)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1618, file: !14, line: 3922, baseType: !932, size: 32, align: 32, offset: 32)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1618, file: !14, line: 3923, baseType: !932, size: 32, align: 32, offset: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1618, file: !14, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1618, file: !14, line: 3925, baseType: !1625, size: 64, align: 64, offset: 128)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1641, !1643, !1644, !1645, !1646, !1647}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1628, file: !14, line: 3886, baseType: !923, size: 32, align: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1628, file: !14, line: 3887, baseType: !923, size: 32, align: 32, offset: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1628, file: !14, line: 3888, baseType: !923, size: 32, align: 32, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1628, file: !14, line: 3889, baseType: !923, size: 32, align: 32, offset: 96)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1628, file: !14, line: 3890, baseType: !923, size: 32, align: 32, offset: 128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1628, file: !14, line: 3897, baseType: !1636, size: 768, align: 64, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1638)
!1638 = !{!1639, !1640}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1637, file: !14, line: 3855, baseType: !1078, size: 512, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1637, file: !14, line: 3857, baseType: !1082, size: 256, align: 32, offset: 512)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1628, file: !14, line: 3903, baseType: !1642, size: 256, align: 64, offset: 960)
!1642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 64, elements: !1182)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1628, file: !14, line: 3904, baseType: !1189, size: 128, align: 32, offset: 1216)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1628, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1628, file: !14, line: 3908, baseType: !947, size: 64, align: 64, offset: 1408)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1628, file: !14, line: 3915, baseType: !947, size: 64, align: 64, offset: 1472)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1628, file: !14, line: 3917, baseType: !923, size: 32, align: 32, offset: 1536)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1618, file: !14, line: 3926, baseType: !1093, size: 64, align: 64, offset: 192)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !963, file: !14, line: 3564, baseType: !1650, size: 64, align: 64, offset: 1344)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!923, !1051, !1199, !1343, !939}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !963, file: !14, line: 3566, baseType: !1654, size: 64, align: 64, offset: 1408)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!923, !1051, !925, !939, !1199}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !963, file: !14, line: 3567, baseType: !1048, size: 64, align: 64, offset: 1472)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !963, file: !14, line: 3576, baseType: !1659, size: 64, align: 64, offset: 1536)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!923, !1051, !1343}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !963, file: !14, line: 3577, baseType: !1663, size: 64, align: 64, offset: 1600)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!923, !1051, !1199}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !963, file: !14, line: 3584, baseType: !1484, size: 64, align: 64, offset: 1664)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !963, file: !14, line: 3589, baseType: !1668, size: 64, align: 64, offset: 1728)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{null, !1051}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !963, file: !14, line: 3594, baseType: !923, size: 32, align: 32, offset: 1792)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !963, file: !14, line: 3600, baseType: !966, size: 64, align: 64, offset: 1856)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !963, file: !14, line: 3609, baseType: !1674, size: 64, align: 64, offset: 1920)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1677)
!1677 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1678 = distinct !DIGlobalVariable(name: "ff_png_decoder", scope: !0, file: !888, line: 1641, type: !962, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_png_decoder)
!1679 = distinct !DIGlobalVariable(name: "png_pass_dsp_ymask", scope: !0, file: !888, line: 103, type: !1680, isLocal: true, isDefinition: true, variable: [7 x i8]* @png_pass_dsp_ymask)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 56, align: 8, elements: !1681)
!1681 = !{!1682}
!1682 = !DISubrange(count: 7)
!1683 = distinct !DIGlobalVariable(name: "png_pass_mask", scope: !0, file: !888, line: 98, type: !1680, isLocal: true, isDefinition: true, variable: [7 x i8]* @png_pass_mask)
!1684 = distinct !DIGlobalVariable(name: "png_pass_dsp_mask", scope: !0, file: !888, line: 108, type: !1680, isLocal: true, isDefinition: true, variable: [7 x i8]* @png_pass_dsp_mask)
!1685 = !{i32 2, !"Dwarf Version", i32 4}
!1686 = !{i32 2, !"Debug Info Version", i32 3}
!1687 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1688 = distinct !DISubprogram(name: "ff_add_png_paeth_prediction", scope: !888, file: !888, line: 185, type: !1689, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1691)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{null, !949, !949, !949, !923, !923}
!1691 = !{}
!1692 = !DILocalVariable(name: "dst", arg: 1, scope: !1688, file: !888, line: 185, type: !949)
!1693 = !DIExpression()
!1694 = !DILocation(line: 185, column: 43, scope: !1688)
!1695 = !DILocalVariable(name: "src", arg: 2, scope: !1688, file: !888, line: 185, type: !949)
!1696 = !DILocation(line: 185, column: 57, scope: !1688)
!1697 = !DILocalVariable(name: "top", arg: 3, scope: !1688, file: !888, line: 185, type: !949)
!1698 = !DILocation(line: 185, column: 71, scope: !1688)
!1699 = !DILocalVariable(name: "w", arg: 4, scope: !1688, file: !888, line: 186, type: !923)
!1700 = !DILocation(line: 186, column: 38, scope: !1688)
