; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--truehd_core_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--truehd_core_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }

!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !619, !620, !621, !627}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !613, line: 222, size: 16, align: 8, elements: !614)
!613 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !612, file: !613, line: 222, baseType: !616, size: 16, align: 16)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !617, line: 49, baseType: !618)
!617 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!618 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!619 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!620 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !613, line: 221, size: 32, align: 8, elements: !624)
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !623, file: !613, line: 221, baseType: !626, size: 32, align: 32)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !617, line: 51, baseType: !620)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !617, line: 48, baseType: !628)
!628 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!629 = !{!630, !794}
!630 = distinct !DIGlobalVariable(name: "ff_truehd_core_bsf", scope: !0, file: !631, line: 179, type: !632, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_truehd_core_bsf)
!631 = !DIFile(filename: "libavcodec/truehd_core_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !635)
!635 = !{!636, !640, !643, !685, !686, !751, !789, !793}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !634, file: !4, line: 5797, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !634, file: !4, line: 5804, baseType: !641, size: 64, align: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !634, file: !4, line: 5815, baseType: !644, size: 64, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !648)
!648 = !{!649, !650, !655, !659, !660, !661, !662, !666, !672, !674, !678}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !647, file: !464, line: 72, baseType: !637, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !647, file: !464, line: 78, baseType: !651, size: 64, align: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!637, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !647, file: !464, line: 85, baseType: !656, size: 64, align: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !647, file: !464, line: 93, baseType: !619, size: 32, align: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !647, file: !464, line: 99, baseType: !619, size: 32, align: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !647, file: !464, line: 108, baseType: !619, size: 32, align: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !647, file: !464, line: 113, baseType: !663, size: 64, align: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!654, !654, !654}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !647, file: !464, line: 123, baseType: !667, size: 64, align: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!670, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !647, file: !464, line: 130, baseType: !673, size: 32, align: 32, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !647, file: !464, line: 136, baseType: !675, size: 64, align: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!673, !654}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !647, file: !464, line: 142, baseType: !679, size: 64, align: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!619, !682, !654, !637, !619}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !634, file: !4, line: 5825, baseType: !619, size: 32, align: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !634, file: !4, line: 5826, baseType: !687, size: 64, align: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!619, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !693)
!693 = !{!694, !695, !698, !702, !703, !748, !749, !750}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !692, file: !4, line: 5751, baseType: !644, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !692, file: !4, line: 5756, baseType: !696, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !692, file: !4, line: 5762, baseType: !699, size: 64, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !701)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !692, file: !4, line: 5768, baseType: !654, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !692, file: !4, line: 5775, baseType: !704, size: 64, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !707)
!707 = !{!708, !709, !710, !711, !713, !714, !715, !718, !719, !720, !721, !722, !723, !724, !731, !732, !733, !734, !735, !736, !737, !738, !741, !742, !743, !744, !745, !746, !747}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !706, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !706, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !706, file: !4, line: 3948, baseType: !626, size: 32, align: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !706, file: !4, line: 3958, baseType: !712, size: 64, align: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !706, file: !4, line: 3962, baseType: !619, size: 32, align: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !706, file: !4, line: 3968, baseType: !619, size: 32, align: 32, offset: 224)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !706, file: !4, line: 3973, baseType: !716, size: 64, align: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !617, line: 40, baseType: !717)
!717 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !706, file: !4, line: 3986, baseType: !619, size: 32, align: 32, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !706, file: !4, line: 3999, baseType: !619, size: 32, align: 32, offset: 352)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !706, file: !4, line: 4004, baseType: !619, size: 32, align: 32, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !706, file: !4, line: 4005, baseType: !619, size: 32, align: 32, offset: 416)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !706, file: !4, line: 4010, baseType: !619, size: 32, align: 32, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !706, file: !4, line: 4011, baseType: !619, size: 32, align: 32, offset: 480)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !706, file: !4, line: 4020, baseType: !725, size: 64, align: 32, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !726, line: 61, baseType: !727)
!726 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !726, line: 58, size: 64, align: 32, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !727, file: !726, line: 59, baseType: !619, size: 32, align: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !727, file: !726, line: 60, baseType: !619, size: 32, align: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !706, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !706, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !706, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !706, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !706, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !706, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !706, file: !4, line: 4039, baseType: !619, size: 32, align: 32, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !706, file: !4, line: 4046, baseType: !739, size: 64, align: 64, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !617, line: 55, baseType: !740)
!740 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !706, file: !4, line: 4050, baseType: !619, size: 32, align: 32, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !706, file: !4, line: 4054, baseType: !619, size: 32, align: 32, offset: 928)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !706, file: !4, line: 4061, baseType: !619, size: 32, align: 32, offset: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !706, file: !4, line: 4065, baseType: !619, size: 32, align: 32, offset: 992)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !706, file: !4, line: 4073, baseType: !619, size: 32, align: 32, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !706, file: !4, line: 4080, baseType: !619, size: 32, align: 32, offset: 1056)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !706, file: !4, line: 4084, baseType: !619, size: 32, align: 32, offset: 1088)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !692, file: !4, line: 5781, baseType: !704, size: 64, align: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !692, file: !4, line: 5787, baseType: !725, size: 64, align: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !692, file: !4, line: 5793, baseType: !725, size: 64, align: 32, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !634, file: !4, line: 5827, baseType: !752, size: 64, align: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!619, !690, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !758)
!758 = !{!759, !771, !772, !773, !774, !775, !776, !777, !785, !786, !787, !788}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !757, file: !4, line: 1451, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !762, line: 94, baseType: !763)
!762 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !762, line: 81, size: 192, align: 64, elements: !764)
!764 = !{!765, !769, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !763, file: !762, line: 82, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !762, line: 73, baseType: !768)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !762, line: 73, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !763, file: !762, line: 89, baseType: !712, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !762, line: 93, baseType: !619, size: 32, align: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !757, file: !4, line: 1461, baseType: !716, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !757, file: !4, line: 1467, baseType: !716, size: 64, align: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !4, line: 1468, baseType: !712, size: 64, align: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !757, file: !4, line: 1469, baseType: !619, size: 32, align: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !757, file: !4, line: 1470, baseType: !619, size: 32, align: 32, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !757, file: !4, line: 1474, baseType: !619, size: 32, align: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !757, file: !4, line: 1479, baseType: !778, size: 64, align: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !780, file: !4, line: 1412, baseType: !712, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !4, line: 1413, baseType: !619, size: 32, align: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !780, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !757, file: !4, line: 1480, baseType: !619, size: 32, align: 32, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !757, file: !4, line: 1486, baseType: !716, size: 64, align: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !757, file: !4, line: 1488, baseType: !716, size: 64, align: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !757, file: !4, line: 1497, baseType: !716, size: 64, align: 64, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !634, file: !4, line: 5828, baseType: !790, size: 64, align: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !690}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !634, file: !4, line: 5829, baseType: !790, size: 64, align: 64, offset: 448)
!794 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !631, line: 175, type: !795, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 64, align: 32, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 2)
!798 = !{i32 2, !"Dwarf Version", i32 4}
!799 = !{i32 2, !"Debug Info Version", i32 3}
!800 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!801 = distinct !DISubprogram(name: "truehd_core_filter", scope: !631, file: !631, line: 39, type: !753, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !802)
!802 = !{}
!803 = !DILocalVariable(name: "x", arg: 1, scope: !804, file: !805, line: 58, type: !616)
!804 = distinct !DISubprogram(name: "av_bswap16", scope: !805, file: !805, line: 58, type: !806, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !802)
!805 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!806 = !DISubroutineType(types: !807)
!807 = !{!616, !616}
!808 = !DIExpression()
!809 = !DILocation(line: 58, column: 98, scope: !804, inlinedAt: !810)
!810 = distinct !DILocation(line: 138, column: 89, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !631, line: 129, column: 95)
!812 = distinct !DILexicalBlock(scope: !813, file: !631, line: 129, column: 9)
!813 = distinct !DILexicalBlock(scope: !814, file: !631, line: 129, column: 9)
!814 = distinct !DILexicalBlock(scope: !815, file: !631, line: 106, column: 29)
!815 = distinct !DILexicalBlock(scope: !801, file: !631, line: 106, column: 9)
!816 = !DILocation(line: 58, column: 98, scope: !804, inlinedAt: !817)
!817 = distinct !DILocation(line: 144, column: 93, scope: !818)
!818 = distinct !DILexicalBlock(scope: !819, file: !631, line: 143, column: 35)
!819 = distinct !DILexicalBlock(scope: !811, file: !631, line: 143, column: 17)
!820 = !DILocation(line: 58, column: 98, scope: !804, inlinedAt: !821)
!821 = distinct !DILocation(line: 160, column: 55, scope: !814)
!822 = !DILocation(line: 58, column: 98, scope: !804, inlinedAt: !823)
!823 = distinct !DILocation(line: 115, column: 59, scope: !814)
!824 = !DILocalVariable(name: "ctx", arg: 1, scope: !801, file: !631, line: 39, type: !690)
!825 = !DILocation(line: 39, column: 45, scope: !801)
!826 = !DILocalVariable(name: "out", arg: 2, scope: !801, file: !631, line: 39, type: !755)
!827 = !DILocation(line: 39, column: 60, scope: !801)
!828 = !DILocalVariable(name: "s", scope: !801, file: !631, line: 41, type: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrueHDCoreContext", file: !631, line: 37, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrueHDCoreContext", file: !631, line: 33, size: 896, align: 64, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !831, file: !631, line: 34, baseType: !644, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !831, file: !631, line: 36, baseType: !835, size: 832, align: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLPHeaderInfo", file: !836, line: 63, baseType: !837)
!836 = !DIFile(filename: "libavcodec/mlp_parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLPHeaderInfo", file: !836, line: 32, size: 832, align: 64, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stream_type", scope: !837, file: !836, line: 34, baseType: !619, size: 32, align: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !837, file: !836, line: 35, baseType: !619, size: 32, align: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "group1_bits", scope: !837, file: !836, line: 37, baseType: !619, size: 32, align: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "group2_bits", scope: !837, file: !836, line: 38, baseType: !619, size: 32, align: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "group1_samplerate", scope: !837, file: !836, line: 40, baseType: !619, size: 32, align: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "group2_samplerate", scope: !837, file: !836, line: 41, baseType: !619, size: 32, align: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "channel_arrangement", scope: !837, file: !836, line: 43, baseType: !619, size: 32, align: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "channel_modifier_thd_stream0", scope: !837, file: !836, line: 45, baseType: !619, size: 32, align: 32, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "channel_modifier_thd_stream1", scope: !837, file: !836, line: 46, baseType: !619, size: 32, align: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "channel_modifier_thd_stream2", scope: !837, file: !836, line: 47, baseType: !619, size: 32, align: 32, offset: 288)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "channels_mlp", scope: !837, file: !836, line: 49, baseType: !619, size: 32, align: 32, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "channels_thd_stream1", scope: !837, file: !836, line: 50, baseType: !619, size: 32, align: 32, offset: 352)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "channels_thd_stream2", scope: !837, file: !836, line: 51, baseType: !619, size: 32, align: 32, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout_mlp", scope: !837, file: !836, line: 52, baseType: !739, size: 64, align: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout_thd_stream1", scope: !837, file: !836, line: 53, baseType: !739, size: 64, align: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout_thd_stream2", scope: !837, file: !836, line: 54, baseType: !739, size: 64, align: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit_size", scope: !837, file: !836, line: 56, baseType: !619, size: 32, align: 32, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit_size_pow2", scope: !837, file: !836, line: 57, baseType: !619, size: 32, align: 32, offset: 672)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "is_vbr", scope: !837, file: !836, line: 59, baseType: !619, size: 32, align: 32, offset: 704)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "peak_bitrate", scope: !837, file: !836, line: 60, baseType: !619, size: 32, align: 32, offset: 736)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "num_substreams", scope: !837, file: !836, line: 62, baseType: !619, size: 32, align: 32, offset: 768)
!860 = !DILocation(line: 41, column: 24, scope: !801)
!861 = !DILocation(line: 41, column: 28, scope: !801)
!862 = !DILocation(line: 41, column: 33, scope: !801)
!863 = !DILocalVariable(name: "gbc", scope: !801, file: !631, line: 42, type: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !865, line: 70, baseType: !866)
!865 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !865, line: 61, size: 256, align: 64, elements: !867)
!867 = !{!868, !871, !872, !873, !874}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !866, file: !865, line: 62, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !866, file: !865, line: 62, baseType: !869, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !866, file: !865, line: 67, baseType: !619, size: 32, align: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !866, file: !865, line: 68, baseType: !619, size: 32, align: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !866, file: !865, line: 69, baseType: !619, size: 32, align: 32, offset: 192)
!875 = !DILocation(line: 42, column: 19, scope: !801)
!876 = !DILocalVariable(name: "units", scope: !801, file: !631, line: 43, type: !877)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 256, align: 16, elements: !883)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "AccessUnit", file: !631, line: 31, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AccessUnit", file: !631, line: 27, size: 64, align: 16, elements: !880)
!880 = !{!881, !885, !886}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !879, file: !631, line: 28, baseType: !882, size: 32, align: 8)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 32, align: 8, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 4)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !879, file: !631, line: 29, baseType: !616, size: 16, align: 16, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "optional", scope: !879, file: !631, line: 30, baseType: !616, size: 16, align: 16, offset: 48)
!887 = !DILocation(line: 43, column: 16, scope: !801)
!888 = !DILocalVariable(name: "in", scope: !801, file: !631, line: 44, type: !755)
!889 = !DILocation(line: 44, column: 15, scope: !801)
!890 = !DILocalVariable(name: "ret", scope: !801, file: !631, line: 45, type: !619)
!891 = !DILocation(line: 45, column: 9, scope: !801)
!892 = !DILocalVariable(name: "i", scope: !801, file: !631, line: 45, type: !619)
!893 = !DILocation(line: 45, column: 14, scope: !801)
!894 = !DILocalVariable(name: "size", scope: !801, file: !631, line: 45, type: !619)
!895 = !DILocation(line: 45, column: 17, scope: !801)
!896 = !DILocalVariable(name: "last_offset", scope: !801, file: !631, line: 45, type: !619)
!897 = !DILocation(line: 45, column: 23, scope: !801)
!898 = !DILocalVariable(name: "in_size", scope: !801, file: !631, line: 46, type: !619)
!899 = !DILocation(line: 46, column: 9, scope: !801)
!900 = !DILocalVariable(name: "out_size", scope: !801, file: !631, line: 46, type: !619)
!901 = !DILocation(line: 46, column: 18, scope: !801)
!902 = !DILocalVariable(name: "have_header", scope: !801, file: !631, line: 47, type: !619)
!903 = !DILocation(line: 47, column: 9, scope: !801)
!904 = !DILocalVariable(name: "substream_bits", scope: !801, file: !631, line: 48, type: !619)
!905 = !DILocation(line: 48, column: 9, scope: !801)
!906 = !DILocalVariable(name: "start", scope: !801, file: !631, line: 49, type: !619)
!907 = !DILocation(line: 49, column: 9, scope: !801)
!908 = !DILocalVariable(name: "end", scope: !801, file: !631, line: 49, type: !619)
!909 = !DILocation(line: 49, column: 16, scope: !801)
!910 = !DILocalVariable(name: "dts", scope: !801, file: !631, line: 50, type: !616)
!911 = !DILocation(line: 50, column: 14, scope: !801)
!912 = !DILocation(line: 52, column: 29, scope: !801)
!913 = !DILocation(line: 52, column: 11, scope: !801)
!914 = !DILocation(line: 52, column: 9, scope: !801)
!915 = !DILocation(line: 53, column: 9, scope: !916)
!916 = distinct !DILexicalBlock(scope: !801, file: !631, line: 53, column: 9)
!917 = !DILocation(line: 53, column: 13, scope: !916)
!918 = !DILocation(line: 53, column: 9, scope: !801)
!919 = !DILocation(line: 54, column: 16, scope: !916)
!920 = !DILocation(line: 54, column: 9, scope: !916)
!921 = !DILocation(line: 56, column: 9, scope: !922)
!922 = distinct !DILexicalBlock(scope: !801, file: !631, line: 56, column: 9)
!923 = !DILocation(line: 56, column: 13, scope: !922)
!924 = !DILocation(line: 56, column: 18, scope: !922)
!925 = !DILocation(line: 56, column: 9, scope: !801)
!926 = !DILocation(line: 57, column: 9, scope: !922)
!927 = !DILocation(line: 59, column: 31, scope: !801)
!928 = !DILocation(line: 59, column: 35, scope: !801)
!929 = !DILocation(line: 59, column: 11, scope: !801)
!930 = !DILocation(line: 59, column: 9, scope: !801)
!931 = !DILocation(line: 60, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !801, file: !631, line: 60, column: 9)
!933 = !DILocation(line: 60, column: 13, scope: !932)
!934 = !DILocation(line: 60, column: 9, scope: !801)
!935 = !DILocation(line: 61, column: 9, scope: !932)
!936 = !DILocation(line: 63, column: 5, scope: !801)
!937 = !DILocation(line: 64, column: 15, scope: !801)
!938 = !DILocation(line: 64, column: 34, scope: !801)
!939 = !DILocation(line: 64, column: 13, scope: !801)
!940 = !DILocation(line: 65, column: 9, scope: !941)
!941 = distinct !DILexicalBlock(scope: !801, file: !631, line: 65, column: 9)
!942 = !DILocation(line: 65, column: 17, scope: !941)
!943 = !DILocation(line: 65, column: 21, scope: !941)
!944 = !DILocation(line: 65, column: 24, scope: !945)
!945 = !DILexicalBlockFile(scope: !941, file: !631, discriminator: 1)
!946 = !DILocation(line: 65, column: 34, scope: !945)
!947 = !DILocation(line: 65, column: 38, scope: !945)
!948 = !DILocation(line: 65, column: 32, scope: !945)
