; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ass_split.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ass_split.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASSSection = type { i8*, i8*, i8*, i32, i32, i32, [24 x %struct.ASSFields] }
%struct.ASSFields = type { i8*, i32, i32 }
%struct.ASSSplitContext = type { %struct.ASS, i32, [4 x i32], [4 x i32*] }
%struct.ASS = type { %struct.ASSScriptInfo, %struct.ASSStyle*, i32, %struct.ASSDialog*, i32 }
%struct.ASSScriptInfo = type { i8*, i8*, i32, i32, float }
%struct.ASSStyle = type { i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32 }
%struct.ASSDialog = type { i32, i32, i32, i32, i8*, i8*, i32, i32, i32, i8*, i8* }
%struct.ASSCodesCallbacks = type { void (i8*, i8*, i32)*, void (i8*, i32)*, void (i8*, i8, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i8*)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i8*)*, void (i8*, i32, i32, i32, i32, i32, i32)*, void (i8*, i32, i32)*, void (i8*)* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12, globals: !27)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ass_split.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 25, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/ass_split.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "ASS_STR", value: 0)
!7 = !DIEnumerator(name: "ASS_INT", value: 1)
!8 = !DIEnumerator(name: "ASS_FLT", value: 2)
!9 = !DIEnumerator(name: "ASS_COLOR", value: 3)
!10 = !DIEnumerator(name: "ASS_TIMESTAMP", value: 4)
!11 = !DIEnumerator(name: "ASS_ALGN", value: 5)
!12 = !{!13, !17, !18, !19, !20, !22, !25}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 48, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!16 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !{!28, !117, !133}
!28 = distinct !DIGlobalVariable(name: "fields", scope: !29, file: !4, line: 445, type: !107, isLocal: true, isDefinition: true, variable: [9 x %struct.ASSFields]* @ff_ass_split_dialog2.fields)
!29 = distinct !DISubprogram(name: "ff_ass_split_dialog2", scope: !4, file: !4, line: 442, type: !30, isLocal: false, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !48, !104}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSDialog", file: !34, line: 85, baseType: !35)
!34 = !DIFile(filename: "libavcodec/ass_split.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 71, size: 512, align: 64, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !35, file: !34, line: 72, baseType: !17, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !35, file: !34, line: 73, baseType: !17, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !35, file: !34, line: 74, baseType: !17, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !35, file: !34, line: 75, baseType: !17, size: 32, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !35, file: !34, line: 76, baseType: !23, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !34, line: 77, baseType: !23, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "margin_l", scope: !35, file: !34, line: 78, baseType: !17, size: 32, align: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "margin_r", scope: !35, file: !34, line: 79, baseType: !17, size: 32, align: 32, offset: 288)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "margin_v", scope: !35, file: !34, line: 80, baseType: !17, size: 32, align: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !35, file: !34, line: 81, baseType: !23, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !35, file: !34, line: 82, baseType: !23, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSSplitContext", file: !34, line: 101, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASSSplitContext", file: !4, line: 197, size: 960, align: 64, elements: !51)
!51 = !{!52, !97, !98, !102}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !50, file: !4, line: 198, baseType: !53, size: 512, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASS", file: !34, line: 96, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 90, size: 512, align: 64, elements: !55)
!55 = !{!56, !65, !94, !95, !96}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "script_info", scope: !54, file: !34, line: 91, baseType: !57, size: 256, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSScriptInfo", file: !34, line: 34, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 28, size: 256, align: 64, elements: !59)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "script_type", scope: !58, file: !34, line: 29, baseType: !23, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !58, file: !34, line: 30, baseType: !23, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "play_res_x", scope: !58, file: !34, line: 31, baseType: !17, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "play_res_y", scope: !58, file: !34, line: 32, baseType: !17, size: 32, align: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !58, file: !34, line: 33, baseType: !26, size: 32, align: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "styles", scope: !54, file: !34, line: 92, baseType: !66, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSStyle", file: !34, line: 66, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 39, size: 832, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !34, line: 40, baseType: !23, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "font_name", scope: !68, file: !34, line: 41, baseType: !23, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "font_size", scope: !68, file: !34, line: 42, baseType: !17, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "primary_color", scope: !68, file: !34, line: 43, baseType: !17, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_color", scope: !68, file: !34, line: 44, baseType: !17, size: 32, align: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "outline_color", scope: !68, file: !34, line: 45, baseType: !17, size: 32, align: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "back_color", scope: !68, file: !34, line: 46, baseType: !17, size: 32, align: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bold", scope: !68, file: !34, line: 47, baseType: !17, size: 32, align: 32, offset: 288)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "italic", scope: !68, file: !34, line: 48, baseType: !17, size: 32, align: 32, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !68, file: !34, line: 49, baseType: !17, size: 32, align: 32, offset: 352)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "strikeout", scope: !68, file: !34, line: 50, baseType: !17, size: 32, align: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "scalex", scope: !68, file: !34, line: 51, baseType: !26, size: 32, align: 32, offset: 416)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "scaley", scope: !68, file: !34, line: 52, baseType: !26, size: 32, align: 32, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "spacing", scope: !68, file: !34, line: 53, baseType: !26, size: 32, align: 32, offset: 480)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !68, file: !34, line: 54, baseType: !26, size: 32, align: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "border_style", scope: !68, file: !34, line: 55, baseType: !17, size: 32, align: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !68, file: !34, line: 56, baseType: !26, size: 32, align: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !68, file: !34, line: 57, baseType: !26, size: 32, align: 32, offset: 608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !68, file: !34, line: 58, baseType: !17, size: 32, align: 32, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "margin_l", scope: !68, file: !34, line: 61, baseType: !17, size: 32, align: 32, offset: 672)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "margin_r", scope: !68, file: !34, line: 62, baseType: !17, size: 32, align: 32, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "margin_v", scope: !68, file: !34, line: 63, baseType: !17, size: 32, align: 32, offset: 736)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_level", scope: !68, file: !34, line: 64, baseType: !17, size: 32, align: 32, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !68, file: !34, line: 65, baseType: !17, size: 32, align: 32, offset: 800)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "styles_count", scope: !54, file: !34, line: 93, baseType: !17, size: 32, align: 32, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dialogs", scope: !54, file: !34, line: 94, baseType: !32, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dialogs_count", scope: !54, file: !34, line: 95, baseType: !17, size: 32, align: 32, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "current_section", scope: !50, file: !4, line: 199, baseType: !17, size: 32, align: 32, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "field_number", scope: !50, file: !4, line: 200, baseType: !99, size: 128, align: 32, offset: 544)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, align: 32, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !50, file: !4, line: 201, baseType: !103, size: 256, align: 64, offset: 704)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, align: 64, elements: !100)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!106 = !{}
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1152, align: 64, elements: !115)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSFields", file: !4, line: 38, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 34, size: 128, align: 64, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !4, line: 35, baseType: !104, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !4, line: 36, baseType: !17, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !110, file: !4, line: 37, baseType: !17, size: 32, align: 32, offset: 96)
!115 = !{!116}
!116 = !DISubrange(count: 9)
!117 = distinct !DIGlobalVariable(name: "ass_sections", scope: !0, file: !4, line: 50, type: !118, isLocal: true, isDefinition: true, variable: [4 x %struct.ASSSection]* @ass_sections)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 13568, align: 64, elements: !100)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSSection", file: !4, line: 48, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 40, size: 3392, align: 64, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !121, file: !4, line: 41, baseType: !104, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "format_header", scope: !121, file: !4, line: 42, baseType: !104, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fields_header", scope: !121, file: !4, line: 43, baseType: !104, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !4, line: 44, baseType: !17, size: 32, align: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !121, file: !4, line: 45, baseType: !17, size: 32, align: 32, offset: 224)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "offset_count", scope: !121, file: !4, line: 46, baseType: !17, size: 32, align: 32, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !121, file: !4, line: 47, baseType: !130, size: 3072, align: 64, offset: 320)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 3072, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 24)
!133 = distinct !DIGlobalVariable(name: "convert_func", scope: !0, file: !4, line: 187, type: !134, isLocal: true, isDefinition: true, variable: [6 x i32 (i8*, i8*, i32)*]* @convert_func)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 384, align: 64, elements: !140)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSConvertFunc", file: !4, line: 142, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!17, !21, !104, !17}
!140 = !{!141}
!141 = !DISubrange(count: 6)
!142 = !{i32 2, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!145 = distinct !DISubprogram(name: "ff_ass_split", scope: !4, file: !4, line: 374, type: !146, isLocal: false, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!146 = !DISubroutineType(types: !147)
!147 = !{!48, !104}
!148 = !DILocalVariable(name: "buf", arg: 1, scope: !145, file: !4, line: 374, type: !104)
!149 = !DIExpression()
!150 = !DILocation(line: 374, column: 43, scope: !145)
!151 = !DILocalVariable(name: "ctx", scope: !145, file: !4, line: 376, type: !48)
!152 = !DILocation(line: 376, column: 22, scope: !145)
!153 = !DILocation(line: 376, column: 28, scope: !145)
!154 = !DILocation(line: 377, column: 10, scope: !155)
!155 = distinct !DILexicalBlock(scope: !145, file: !4, line: 377, column: 9)
!156 = !DILocation(line: 377, column: 9, scope: !145)
!157 = !DILocation(line: 378, column: 9, scope: !155)
!158 = !DILocation(line: 379, column: 5, scope: !145)
!159 = !DILocation(line: 379, column: 10, scope: !145)
!160 = !DILocation(line: 379, column: 26, scope: !145)
!161 = !DILocation(line: 380, column: 19, scope: !162)
!162 = distinct !DILexicalBlock(scope: !145, file: !4, line: 380, column: 9)
!163 = !DILocation(line: 380, column: 24, scope: !162)
!164 = !DILocation(line: 380, column: 9, scope: !162)
!165 = !DILocation(line: 380, column: 29, scope: !162)
!166 = !DILocation(line: 380, column: 9, scope: !145)
!167 = !DILocation(line: 381, column: 27, scope: !168)
!168 = distinct !DILexicalBlock(scope: !162, file: !4, line: 380, column: 34)
!169 = !DILocation(line: 381, column: 9, scope: !168)
!170 = !DILocation(line: 382, column: 9, scope: !168)
!171 = !DILocation(line: 384, column: 12, scope: !145)
!172 = !DILocation(line: 384, column: 5, scope: !145)
!173 = !DILocation(line: 385, column: 1, scope: !145)
!174 = distinct !DISubprogram(name: "ass_split", scope: !4, file: !4, line: 349, type: !175, isLocal: true, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!175 = !DISubroutineType(types: !176)
!176 = !{!17, !48, !104}
!177 = !DILocalVariable(name: "ctx", arg: 1, scope: !174, file: !4, line: 349, type: !48)
!178 = !DILocation(line: 349, column: 39, scope: !174)
!179 = !DILocalVariable(name: "buf", arg: 2, scope: !174, file: !4, line: 349, type: !104)
!180 = !DILocation(line: 349, column: 56, scope: !174)
!181 = !DILocalVariable(name: "c", scope: !174, file: !4, line: 351, type: !24)
!182 = !DILocation(line: 351, column: 10, scope: !174)
!183 = !DILocalVariable(name: "section", scope: !174, file: !4, line: 351, type: !184)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, align: 8, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 16)
!187 = !DILocation(line: 351, column: 13, scope: !174)
!188 = !DILocalVariable(name: "i", scope: !174, file: !4, line: 352, type: !17)
!189 = !DILocation(line: 352, column: 9, scope: !174)
!190 = !DILocation(line: 354, column: 9, scope: !191)
!191 = distinct !DILexicalBlock(scope: !174, file: !4, line: 354, column: 9)
!192 = !DILocation(line: 354, column: 14, scope: !191)
!193 = !DILocation(line: 354, column: 30, scope: !191)
!194 = !DILocation(line: 354, column: 9, scope: !174)
!195 = !DILocation(line: 355, column: 33, scope: !191)
!196 = !DILocation(line: 355, column: 38, scope: !191)
!197 = !DILocation(line: 355, column: 15, scope: !191)
!198 = !DILocation(line: 355, column: 13, scope: !191)
!199 = !DILocation(line: 355, column: 9, scope: !191)
!200 = !DILocation(line: 357, column: 5, scope: !174)
!201 = !DILocation(line: 357, column: 12, scope: !202)
!202 = !DILexicalBlockFile(scope: !174, file: !4, discriminator: 1)
!203 = !DILocation(line: 357, column: 16, scope: !202)
!204 = !DILocation(line: 357, column: 20, scope: !205)
!205 = !DILexicalBlockFile(scope: !174, file: !4, discriminator: 2)
!206 = !DILocation(line: 357, column: 19, scope: !205)
!207 = !DILocation(line: 357, column: 16, scope: !205)
!208 = !DILocation(line: 357, column: 5, scope: !209)
!209 = !DILexicalBlockFile(scope: !174, file: !4, discriminator: 3)
!210 = !DILocation(line: 358, column: 20, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !4, line: 358, column: 13)
!212 = distinct !DILexicalBlock(scope: !174, file: !4, line: 357, column: 25)
!213 = !DILocation(line: 358, column: 49, scope: !211)
!214 = !DILocation(line: 358, column: 13, scope: !211)
!215 = !DILocation(line: 358, column: 62, scope: !211)
!216 = !DILocation(line: 358, column: 13, scope: !212)
!217 = !DILocation(line: 359, column: 28, scope: !218)
!218 = distinct !DILexicalBlock(scope: !211, file: !4, line: 358, column: 68)
!219 = !DILocation(line: 359, column: 20, scope: !218)
!220 = !DILocation(line: 359, column: 17, scope: !218)
!221 = !DILocation(line: 360, column: 23, scope: !218)
!222 = !DILocation(line: 360, column: 22, scope: !218)
!223 = !DILocation(line: 360, column: 21, scope: !218)
!224 = !DILocation(line: 360, column: 20, scope: !218)
!225 = !DILocation(line: 360, column: 17, scope: !218)
!226 = !DILocation(line: 361, column: 19, scope: !227)
!227 = distinct !DILexicalBlock(scope: !218, file: !4, line: 361, column: 13)
!228 = !DILocation(line: 361, column: 18, scope: !227)
!229 = !DILocation(line: 361, column: 23, scope: !230)
!230 = !DILexicalBlockFile(scope: !231, file: !4, discriminator: 1)
!231 = distinct !DILexicalBlock(scope: !227, file: !4, line: 361, column: 13)
!232 = !DILocation(line: 361, column: 24, scope: !230)
!233 = !DILocation(line: 361, column: 13, scope: !230)
!234 = !DILocation(line: 362, column: 29, scope: !235)
!235 = distinct !DILexicalBlock(scope: !231, file: !4, line: 362, column: 21)
!236 = !DILocation(line: 362, column: 51, scope: !235)
!237 = !DILocation(line: 362, column: 38, scope: !235)
!238 = !DILocation(line: 362, column: 54, scope: !235)
!239 = !DILocation(line: 362, column: 22, scope: !235)
!240 = !DILocation(line: 362, column: 21, scope: !231)
!241 = !DILocation(line: 363, column: 44, scope: !242)
!242 = distinct !DILexicalBlock(scope: !235, file: !4, line: 362, column: 64)
!243 = !DILocation(line: 363, column: 21, scope: !242)
!244 = !DILocation(line: 363, column: 26, scope: !242)
!245 = !DILocation(line: 363, column: 42, scope: !242)
!246 = !DILocation(line: 364, column: 45, scope: !242)
!247 = !DILocation(line: 364, column: 50, scope: !242)
!248 = !DILocation(line: 364, column: 27, scope: !242)
!249 = !DILocation(line: 364, column: 25, scope: !242)
!250 = !DILocation(line: 365, column: 17, scope: !242)
!251 = !DILocation(line: 362, column: 61, scope: !252)
!252 = !DILexicalBlockFile(scope: !235, file: !4, discriminator: 1)
!253 = !DILocation(line: 361, column: 78, scope: !254)
!254 = !DILexicalBlockFile(scope: !231, file: !4, discriminator: 2)
!255 = !DILocation(line: 361, column: 13, scope: !254)
!256 = distinct !{!256, !257}
!257 = !DILocation(line: 361, column: 13, scope: !218)
!258 = !DILocation(line: 366, column: 9, scope: !218)
!259 = !DILocation(line: 367, column: 28, scope: !260)
!260 = distinct !DILexicalBlock(scope: !211, file: !4, line: 366, column: 16)
!261 = !DILocation(line: 367, column: 20, scope: !260)
!262 = !DILocation(line: 367, column: 17, scope: !260)
!263 = !DILocation(line: 368, column: 23, scope: !260)
!264 = !DILocation(line: 368, column: 22, scope: !260)
!265 = !DILocation(line: 368, column: 21, scope: !260)
!266 = !DILocation(line: 368, column: 20, scope: !260)
!267 = !DILocation(line: 368, column: 17, scope: !260)
!268 = !DILocation(line: 357, column: 5, scope: !269)
!269 = !DILexicalBlockFile(scope: !174, file: !4, discriminator: 4)
!270 = distinct !{!270, !200}
!271 = !DILocation(line: 371, column: 12, scope: !174)
!272 = !DILocation(line: 371, column: 5, scope: !174)
!273 = distinct !DISubprogram(name: "ff_ass_split_free", scope: !4, file: !4, line: 479, type: !274, isLocal: false, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !48}
!276 = !DILocalVariable(name: "ctx", arg: 1, scope: !273, file: !4, line: 479, type: !48)
!277 = !DILocation(line: 479, column: 41, scope: !273)
!278 = !DILocation(line: 481, column: 9, scope: !279)
!279 = distinct !DILexicalBlock(scope: !273, file: !4, line: 481, column: 9)
!280 = !DILocation(line: 481, column: 9, scope: !273)
!281 = !DILocalVariable(name: "i", scope: !282, file: !4, line: 482, type: !17)
!282 = distinct !DILexicalBlock(scope: !279, file: !4, line: 481, column: 14)
!283 = !DILocation(line: 482, column: 13, scope: !282)
!284 = !DILocation(line: 483, column: 15, scope: !285)
!285 = distinct !DILexicalBlock(scope: !282, file: !4, line: 483, column: 9)
!286 = !DILocation(line: 483, column: 14, scope: !285)
!287 = !DILocation(line: 483, column: 19, scope: !288)
!288 = !DILexicalBlockFile(scope: !289, file: !4, discriminator: 1)
!289 = distinct !DILexicalBlock(scope: !285, file: !4, line: 483, column: 9)
!290 = !DILocation(line: 483, column: 20, scope: !288)
!291 = !DILocation(line: 483, column: 9, scope: !288)
!292 = !DILocation(line: 484, column: 26, scope: !293)
!293 = distinct !DILexicalBlock(scope: !289, file: !4, line: 483, column: 78)
!294 = !DILocation(line: 484, column: 45, scope: !293)
!295 = !DILocation(line: 484, column: 32, scope: !293)
!296 = !DILocation(line: 484, column: 13, scope: !293)
!297 = !DILocation(line: 485, column: 41, scope: !293)
!298 = !DILocation(line: 485, column: 24, scope: !293)
!299 = !DILocation(line: 485, column: 29, scope: !293)
!300 = !DILocation(line: 485, column: 22, scope: !293)
!301 = !DILocation(line: 485, column: 13, scope: !293)
!302 = !DILocation(line: 486, column: 9, scope: !293)
!303 = !DILocation(line: 483, column: 74, scope: !304)
!304 = !DILexicalBlockFile(scope: !289, file: !4, discriminator: 2)
!305 = !DILocation(line: 483, column: 9, scope: !304)
!306 = distinct !{!306, !307}
!307 = !DILocation(line: 483, column: 9, scope: !282)
!308 = !DILocation(line: 487, column: 17, scope: !282)
!309 = !DILocation(line: 487, column: 9, scope: !282)
!310 = !DILocation(line: 488, column: 5, scope: !282)
!311 = !DILocation(line: 489, column: 1, scope: !273)
!312 = distinct !DISubprogram(name: "ff_ass_split_dialog", scope: !4, file: !4, line: 411, type: !313, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!313 = !DISubroutineType(types: !314)
!314 = !{!32, !48, !104, !17, !19}
!315 = !DILocalVariable(name: "ctx", arg: 1, scope: !312, file: !4, line: 411, type: !48)
!316 = !DILocation(line: 411, column: 49, scope: !312)
!317 = !DILocalVariable(name: "buf", arg: 2, scope: !312, file: !4, line: 411, type: !104)
!318 = !DILocation(line: 411, column: 66, scope: !312)
!319 = !DILocalVariable(name: "cache", arg: 3, scope: !312, file: !4, line: 412, type: !17)
!320 = !DILocation(line: 412, column: 36, scope: !312)
!321 = !DILocalVariable(name: "number", arg: 4, scope: !312, file: !4, line: 412, type: !19)
!322 = !DILocation(line: 412, column: 48, scope: !312)
!323 = !DILocalVariable(name: "dialog", scope: !312, file: !4, line: 414, type: !32)
!324 = !DILocation(line: 414, column: 16, scope: !312)
!325 = !DILocalVariable(name: "i", scope: !312, file: !4, line: 415, type: !17)
!326 = !DILocation(line: 415, column: 9, scope: !312)
!327 = !DILocalVariable(name: "count", scope: !312, file: !4, line: 415, type: !17)
!328 = !DILocation(line: 415, column: 12, scope: !312)
!329 = !DILocation(line: 416, column: 10, scope: !330)
!330 = distinct !DILexicalBlock(scope: !312, file: !4, line: 416, column: 9)
!331 = !DILocation(line: 416, column: 9, scope: !312)
!332 = !DILocation(line: 417, column: 15, scope: !333)
!333 = distinct !DILexicalBlock(scope: !330, file: !4, line: 417, column: 9)
!334 = !DILocation(line: 417, column: 14, scope: !333)
!335 = !DILocation(line: 417, column: 19, scope: !336)
!336 = !DILexicalBlockFile(scope: !337, file: !4, discriminator: 1)
!337 = distinct !DILexicalBlock(scope: !333, file: !4, line: 417, column: 9)
!338 = !DILocation(line: 417, column: 20, scope: !336)
!339 = !DILocation(line: 417, column: 9, scope: !336)
!340 = !DILocation(line: 418, column: 38, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !4, line: 418, column: 17)
!342 = !DILocation(line: 418, column: 25, scope: !341)
!343 = !DILocation(line: 418, column: 41, scope: !341)
!344 = !DILocation(line: 418, column: 18, scope: !341)
!345 = !DILocation(line: 418, column: 17, scope: !337)
!346 = !DILocation(line: 419, column: 30, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !4, line: 418, column: 61)
!348 = !DILocation(line: 419, column: 49, scope: !347)
!349 = !DILocation(line: 419, column: 36, scope: !347)
!350 = !DILocation(line: 419, column: 17, scope: !347)
!351 = !DILocation(line: 420, column: 17, scope: !347)
!352 = !DILocation(line: 418, column: 58, scope: !353)
!353 = !DILexicalBlockFile(scope: !341, file: !4, discriminator: 1)
!354 = !DILocation(line: 417, column: 74, scope: !355)
!355 = !DILexicalBlockFile(scope: !337, file: !4, discriminator: 2)
!356 = !DILocation(line: 417, column: 9, scope: !355)
!357 = distinct !{!357, !358}
!358 = !DILocation(line: 417, column: 9, scope: !330)
!359 = !DILocation(line: 421, column: 13, scope: !333)
!360 = !DILocation(line: 422, column: 13, scope: !312)
!361 = !DILocation(line: 422, column: 18, scope: !312)
!362 = !DILocation(line: 422, column: 22, scope: !312)
!363 = !DILocation(line: 422, column: 11, scope: !312)
!364 = !DILocation(line: 423, column: 19, scope: !365)
!365 = distinct !DILexicalBlock(scope: !312, file: !4, line: 423, column: 9)
!366 = !DILocation(line: 423, column: 24, scope: !365)
!367 = !DILocation(line: 423, column: 9, scope: !365)
!368 = !DILocation(line: 423, column: 29, scope: !365)
!369 = !DILocation(line: 423, column: 9, scope: !312)
!370 = !DILocation(line: 424, column: 18, scope: !365)
!371 = !DILocation(line: 424, column: 23, scope: !365)
!372 = !DILocation(line: 424, column: 27, scope: !365)
!373 = !DILocation(line: 424, column: 37, scope: !365)
!374 = !DILocation(line: 424, column: 35, scope: !365)
!375 = !DILocation(line: 424, column: 16, scope: !365)
!376 = !DILocation(line: 424, column: 9, scope: !365)
!377 = !DILocation(line: 425, column: 9, scope: !378)
!378 = distinct !DILexicalBlock(scope: !312, file: !4, line: 425, column: 9)
!379 = !DILocation(line: 425, column: 9, scope: !312)
!380 = !DILocation(line: 426, column: 19, scope: !378)
!381 = !DILocation(line: 426, column: 24, scope: !378)
!382 = !DILocation(line: 426, column: 28, scope: !378)
!383 = !DILocation(line: 426, column: 44, scope: !378)
!384 = !DILocation(line: 426, column: 42, scope: !378)
!385 = !DILocation(line: 426, column: 10, scope: !378)
!386 = !DILocation(line: 426, column: 17, scope: !378)
!387 = !DILocation(line: 426, column: 9, scope: !378)
!388 = !DILocation(line: 427, column: 12, scope: !312)
!389 = !DILocation(line: 427, column: 5, scope: !312)
!390 = distinct !DISubprogram(name: "free_section", scope: !4, file: !4, line: 387, type: !391, isLocal: true, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !48, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!394 = !DILocalVariable(name: "ctx", arg: 1, scope: !390, file: !4, line: 387, type: !48)
!395 = !DILocation(line: 387, column: 43, scope: !390)
!396 = !DILocalVariable(name: "section", arg: 2, scope: !390, file: !4, line: 387, type: !393)
!397 = !DILocation(line: 387, column: 66, scope: !390)
!398 = !DILocalVariable(name: "ptr", scope: !390, file: !4, line: 389, type: !13)
!399 = !DILocation(line: 389, column: 14, scope: !390)
!400 = !DILocation(line: 389, column: 32, scope: !390)
!401 = !DILocation(line: 389, column: 37, scope: !390)
!402 = !DILocation(line: 389, column: 20, scope: !390)
!403 = !DILocation(line: 389, column: 43, scope: !390)
!404 = !DILocation(line: 389, column: 52, scope: !390)
!405 = !DILocation(line: 389, column: 41, scope: !390)
!406 = !DILocalVariable(name: "i", scope: !390, file: !4, line: 390, type: !17)
!407 = !DILocation(line: 390, column: 9, scope: !390)
!408 = !DILocalVariable(name: "j", scope: !390, file: !4, line: 390, type: !17)
!409 = !DILocation(line: 390, column: 12, scope: !390)
!410 = !DILocalVariable(name: "count", scope: !390, file: !4, line: 390, type: !19)
!411 = !DILocation(line: 390, column: 16, scope: !390)
!412 = !DILocalVariable(name: "c", scope: !390, file: !4, line: 390, type: !17)
!413 = !DILocation(line: 390, column: 23, scope: !390)
!414 = !DILocation(line: 392, column: 9, scope: !415)
!415 = distinct !DILexicalBlock(scope: !390, file: !4, line: 392, column: 9)
!416 = !DILocation(line: 392, column: 18, scope: !415)
!417 = !DILocation(line: 392, column: 9, scope: !390)
!418 = !DILocation(line: 393, column: 25, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !4, line: 392, column: 33)
!420 = !DILocation(line: 393, column: 15, scope: !419)
!421 = !DILocation(line: 393, column: 13, scope: !419)
!422 = !DILocation(line: 394, column: 37, scope: !419)
!423 = !DILocation(line: 394, column: 42, scope: !419)
!424 = !DILocation(line: 394, column: 25, scope: !419)
!425 = !DILocation(line: 394, column: 48, scope: !419)
!426 = !DILocation(line: 394, column: 57, scope: !419)
!427 = !DILocation(line: 394, column: 46, scope: !419)
!428 = !DILocation(line: 394, column: 17, scope: !419)
!429 = !DILocation(line: 394, column: 15, scope: !419)
!430 = !DILocation(line: 395, column: 5, scope: !419)
!431 = !DILocation(line: 396, column: 15, scope: !415)
!432 = !DILocation(line: 398, column: 9, scope: !433)
!433 = distinct !DILexicalBlock(scope: !390, file: !4, line: 398, column: 9)
!434 = !DILocation(line: 398, column: 9, scope: !390)
!435 = !DILocation(line: 399, column: 15, scope: !436)
!436 = distinct !DILexicalBlock(scope: !433, file: !4, line: 399, column: 9)
!437 = !DILocation(line: 399, column: 14, scope: !436)
!438 = !DILocation(line: 399, column: 19, scope: !439)
!439 = !DILexicalBlockFile(scope: !440, file: !4, discriminator: 1)
!440 = distinct !DILexicalBlock(scope: !436, file: !4, line: 399, column: 9)
!441 = !DILocation(line: 399, column: 22, scope: !439)
!442 = !DILocation(line: 399, column: 21, scope: !439)
!443 = !DILocation(line: 399, column: 20, scope: !439)
!444 = !DILocation(line: 399, column: 9, scope: !439)
!445 = !DILocation(line: 400, column: 19, scope: !446)
!446 = distinct !DILexicalBlock(scope: !440, file: !4, line: 400, column: 13)
!447 = !DILocation(line: 400, column: 18, scope: !446)
!448 = !DILocation(line: 400, column: 39, scope: !449)
!449 = !DILexicalBlockFile(scope: !450, file: !4, discriminator: 1)
!450 = distinct !DILexicalBlock(scope: !446, file: !4, line: 400, column: 13)
!451 = !DILocation(line: 400, column: 23, scope: !449)
!452 = !DILocation(line: 400, column: 32, scope: !449)
!453 = !DILocation(line: 400, column: 42, scope: !449)
!454 = !DILocation(line: 400, column: 13, scope: !449)
!455 = !DILocalVariable(name: "field", scope: !456, file: !4, line: 401, type: !457)
!456 = distinct !DILexicalBlock(scope: !450, file: !4, line: 400, column: 53)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!458 = !DILocation(line: 401, column: 34, scope: !456)
!459 = !DILocation(line: 401, column: 59, scope: !456)
!460 = !DILocation(line: 401, column: 43, scope: !456)
!461 = !DILocation(line: 401, column: 52, scope: !456)
!462 = !DILocation(line: 402, column: 21, scope: !463)
!463 = distinct !DILexicalBlock(scope: !456, file: !4, line: 402, column: 21)
!464 = !DILocation(line: 402, column: 28, scope: !463)
!465 = !DILocation(line: 402, column: 33, scope: !463)
!466 = !DILocation(line: 402, column: 21, scope: !456)
!467 = !DILocation(line: 403, column: 30, scope: !463)
!468 = !DILocation(line: 403, column: 36, scope: !463)
!469 = !DILocation(line: 403, column: 43, scope: !463)
!470 = !DILocation(line: 403, column: 34, scope: !463)
!471 = !DILocation(line: 403, column: 21, scope: !463)
!472 = !DILocation(line: 404, column: 13, scope: !456)
!473 = !DILocation(line: 400, column: 49, scope: !474)
!474 = !DILexicalBlockFile(scope: !450, file: !4, discriminator: 2)
!475 = !DILocation(line: 400, column: 13, scope: !474)
!476 = distinct !{!476, !477}
!477 = !DILocation(line: 400, column: 13, scope: !440)
!478 = !DILocation(line: 404, column: 13, scope: !479)
!479 = !DILexicalBlockFile(scope: !446, file: !4, discriminator: 1)
!480 = !DILocation(line: 399, column: 30, scope: !481)
!481 = !DILexicalBlockFile(scope: !440, file: !4, discriminator: 2)
!482 = !DILocation(line: 399, column: 41, scope: !481)
!483 = !DILocation(line: 399, column: 50, scope: !481)
!484 = !DILocation(line: 399, column: 38, scope: !481)
!485 = !DILocation(line: 399, column: 9, scope: !481)
!486 = distinct !{!486, !487}
!487 = !DILocation(line: 399, column: 9, scope: !433)
!488 = !DILocation(line: 404, column: 13, scope: !489)
!489 = !DILexicalBlockFile(scope: !436, file: !4, discriminator: 2)
!490 = !DILocation(line: 405, column: 6, scope: !390)
!491 = !DILocation(line: 405, column: 12, scope: !390)
!492 = !DILocation(line: 407, column: 9, scope: !493)
!493 = distinct !DILexicalBlock(scope: !390, file: !4, line: 407, column: 9)
!494 = !DILocation(line: 407, column: 18, scope: !493)
!495 = !DILocation(line: 407, column: 9, scope: !390)
!496 = !DILocation(line: 408, column: 30, scope: !493)
!497 = !DILocation(line: 408, column: 35, scope: !493)
!498 = !DILocation(line: 408, column: 18, scope: !493)
!499 = !DILocation(line: 408, column: 41, scope: !493)
!500 = !DILocation(line: 408, column: 50, scope: !493)
!501 = !DILocation(line: 408, column: 39, scope: !493)
!502 = !DILocation(line: 408, column: 9, scope: !493)
!503 = !DILocation(line: 409, column: 1, scope: !390)
!504 = distinct !DISubprogram(name: "ff_ass_free_dialog", scope: !4, file: !4, line: 430, type: !505, isLocal: false, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!508 = !DILocalVariable(name: "dialogp", arg: 1, scope: !504, file: !4, line: 430, type: !507)
!509 = !DILocation(line: 430, column: 37, scope: !504)
!510 = !DILocalVariable(name: "dialog", scope: !504, file: !4, line: 432, type: !32)
!511 = !DILocation(line: 432, column: 16, scope: !504)
!512 = !DILocation(line: 432, column: 26, scope: !504)
!513 = !DILocation(line: 432, column: 25, scope: !504)
!514 = !DILocation(line: 433, column: 10, scope: !515)
!515 = distinct !DILexicalBlock(scope: !504, file: !4, line: 433, column: 9)
!516 = !DILocation(line: 433, column: 9, scope: !504)
!517 = !DILocation(line: 434, column: 9, scope: !515)
!518 = !DILocation(line: 435, column: 15, scope: !504)
!519 = !DILocation(line: 435, column: 23, scope: !504)
!520 = !DILocation(line: 435, column: 14, scope: !504)
!521 = !DILocation(line: 435, column: 5, scope: !504)
!522 = !DILocation(line: 436, column: 15, scope: !504)
!523 = !DILocation(line: 436, column: 23, scope: !504)
!524 = !DILocation(line: 436, column: 14, scope: !504)
!525 = !DILocation(line: 436, column: 5, scope: !504)
!526 = !DILocation(line: 437, column: 15, scope: !504)
!527 = !DILocation(line: 437, column: 23, scope: !504)
!528 = !DILocation(line: 437, column: 14, scope: !504)
!529 = !DILocation(line: 437, column: 5, scope: !504)
!530 = !DILocation(line: 438, column: 15, scope: !504)
!531 = !DILocation(line: 438, column: 23, scope: !504)
!532 = !DILocation(line: 438, column: 14, scope: !504)
!533 = !DILocation(line: 438, column: 5, scope: !504)
!534 = !DILocation(line: 439, column: 14, scope: !504)
!535 = !DILocation(line: 439, column: 5, scope: !504)
!536 = !DILocation(line: 440, column: 1, scope: !504)
!537 = !DILocation(line: 440, column: 1, scope: !538)
!538 = !DILexicalBlockFile(scope: !504, file: !4, discriminator: 1)
!539 = !DILocalVariable(name: "ctx", arg: 1, scope: !29, file: !4, line: 442, type: !48)
!540 = !DILocation(line: 442, column: 50, scope: !29)
!541 = !DILocalVariable(name: "buf", arg: 2, scope: !29, file: !4, line: 442, type: !104)
!542 = !DILocation(line: 442, column: 67, scope: !29)
!543 = !DILocalVariable(name: "i", scope: !29, file: !4, line: 444, type: !17)
!544 = !DILocation(line: 444, column: 9, scope: !29)
!545 = !DILocalVariable(name: "dialog", scope: !29, file: !4, line: 457, type: !32)
!546 = !DILocation(line: 457, column: 16, scope: !29)
!547 = !DILocation(line: 457, column: 25, scope: !29)
!548 = !DILocation(line: 458, column: 10, scope: !549)
!549 = distinct !DILexicalBlock(scope: !29, file: !4, line: 458, column: 9)
!550 = !DILocation(line: 458, column: 9, scope: !29)
!551 = !DILocation(line: 459, column: 9, scope: !549)
!552 = !DILocation(line: 461, column: 12, scope: !553)
!553 = distinct !DILexicalBlock(scope: !29, file: !4, line: 461, column: 5)
!554 = !DILocation(line: 461, column: 10, scope: !553)
!555 = !DILocation(line: 461, column: 17, scope: !556)
!556 = !DILexicalBlockFile(scope: !557, file: !4, discriminator: 1)
!557 = distinct !DILexicalBlock(scope: !553, file: !4, line: 461, column: 5)
!558 = !DILocation(line: 461, column: 19, scope: !556)
!559 = !DILocation(line: 461, column: 5, scope: !556)
!560 = !DILocalVariable(name: "len", scope: !561, file: !4, line: 462, type: !562)
!561 = distinct !DILexicalBlock(scope: !557, file: !4, line: 461, column: 66)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !563, line: 216, baseType: !564)
!563 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!564 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!565 = !DILocation(line: 462, column: 16, scope: !561)
!566 = !DILocalVariable(name: "last", scope: !561, file: !4, line: 463, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!568 = !DILocation(line: 463, column: 19, scope: !561)
!569 = !DILocation(line: 463, column: 26, scope: !561)
!570 = !DILocation(line: 463, column: 28, scope: !561)
!571 = !DILocalVariable(name: "type", scope: !561, file: !4, line: 464, type: !572)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSFieldType", file: !4, line: 32, baseType: !3)
!574 = !DILocation(line: 464, column: 28, scope: !561)
!575 = !DILocation(line: 464, column: 42, scope: !561)
!576 = !DILocation(line: 464, column: 35, scope: !561)
!577 = !DILocation(line: 464, column: 45, scope: !561)
!578 = !DILocalVariable(name: "ptr", scope: !561, file: !4, line: 465, type: !13)
!579 = !DILocation(line: 465, column: 18, scope: !561)
!580 = !DILocation(line: 465, column: 35, scope: !561)
!581 = !DILocation(line: 465, column: 24, scope: !561)
!582 = !DILocation(line: 465, column: 51, scope: !561)
!583 = !DILocation(line: 465, column: 44, scope: !561)
!584 = !DILocation(line: 465, column: 54, scope: !561)
!585 = !DILocation(line: 465, column: 42, scope: !561)
!586 = !DILocation(line: 466, column: 26, scope: !561)
!587 = !DILocation(line: 466, column: 15, scope: !561)
!588 = !DILocation(line: 466, column: 13, scope: !561)
!589 = !DILocation(line: 467, column: 15, scope: !561)
!590 = !DILocation(line: 467, column: 29, scope: !591)
!591 = !DILexicalBlockFile(scope: !561, file: !4, discriminator: 1)
!592 = !DILocation(line: 467, column: 22, scope: !591)
!593 = !DILocation(line: 467, column: 15, scope: !591)
!594 = !DILocation(line: 467, column: 44, scope: !595)
!595 = !DILexicalBlockFile(scope: !561, file: !4, discriminator: 2)
!596 = !DILocation(line: 467, column: 36, scope: !595)
!597 = !DILocation(line: 467, column: 15, scope: !595)
!598 = !DILocation(line: 467, column: 15, scope: !599)
!599 = !DILexicalBlockFile(scope: !561, file: !4, discriminator: 3)
!600 = !DILocation(line: 467, column: 13, scope: !599)
!601 = !DILocation(line: 468, column: 13, scope: !602)
!602 = distinct !DILexicalBlock(scope: !561, file: !4, line: 468, column: 13)
!603 = !DILocation(line: 468, column: 17, scope: !602)
!604 = !DILocation(line: 468, column: 13, scope: !561)
!605 = !DILocation(line: 469, column: 13, scope: !606)
!606 = distinct !DILexicalBlock(scope: !602, file: !4, line: 468, column: 32)
!607 = !DILocation(line: 470, column: 13, scope: !606)
!608 = !DILocation(line: 472, column: 22, scope: !561)
!609 = !DILocation(line: 472, column: 9, scope: !561)
!610 = !DILocation(line: 472, column: 28, scope: !561)
!611 = !DILocation(line: 472, column: 33, scope: !561)
!612 = !DILocation(line: 472, column: 38, scope: !561)
!613 = !DILocation(line: 473, column: 16, scope: !561)
!614 = !DILocation(line: 473, column: 13, scope: !561)
!615 = !DILocation(line: 474, column: 14, scope: !616)
!616 = distinct !DILexicalBlock(scope: !561, file: !4, line: 474, column: 13)
!617 = !DILocation(line: 474, column: 13, scope: !616)
!618 = !DILocation(line: 474, column: 13, scope: !561)
!619 = !DILocation(line: 474, column: 22, scope: !620)
!620 = !DILexicalBlockFile(scope: !616, file: !4, discriminator: 1)
!621 = !DILocation(line: 474, column: 19, scope: !620)
!622 = !DILocation(line: 475, column: 5, scope: !561)
!623 = !DILocation(line: 461, column: 62, scope: !624)
!624 = !DILexicalBlockFile(scope: !557, file: !4, discriminator: 2)
!625 = !DILocation(line: 461, column: 5, scope: !624)
!626 = distinct !{!626, !627}
!627 = !DILocation(line: 461, column: 5, scope: !29)
!628 = !DILocation(line: 476, column: 12, scope: !29)
!629 = !DILocation(line: 476, column: 5, scope: !29)
!630 = !DILocation(line: 477, column: 1, scope: !29)
!631 = distinct !DISubprogram(name: "skip_space", scope: !4, file: !4, line: 225, type: !632, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!632 = !DISubroutineType(types: !633)
!633 = !{!104, !104}
!634 = !DILocalVariable(name: "buf", arg: 1, scope: !631, file: !4, line: 225, type: !104)
!635 = !DILocation(line: 225, column: 50, scope: !631)
!636 = !DILocation(line: 227, column: 5, scope: !631)
!637 = !DILocation(line: 227, column: 13, scope: !638)
!638 = !DILexicalBlockFile(scope: !631, file: !4, discriminator: 1)
!639 = !DILocation(line: 227, column: 12, scope: !638)
!640 = !DILocation(line: 227, column: 17, scope: !638)
!641 = !DILocation(line: 227, column: 5, scope: !638)
!642 = !DILocation(line: 228, column: 12, scope: !631)
!643 = !DILocation(line: 227, column: 5, scope: !644)
!644 = !DILexicalBlockFile(scope: !631, file: !4, discriminator: 2)
!645 = distinct !{!645, !636}
!646 = !DILocation(line: 229, column: 12, scope: !631)
!647 = !DILocation(line: 229, column: 5, scope: !631)
!648 = distinct !DISubprogram(name: "ff_ass_split_override_codes", scope: !4, file: !4, line: 492, type: !649, isLocal: false, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !106)
!649 = !DISubroutineType(types: !650)
!650 = !{!17, !651, !21, !104}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASSCodesCallbacks", file: !34, line: 184, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 154, size: 768, align: 64, elements: !655)
!655 = !{!656, !660, !664, !668, !672, !676, !680, !681, !682, !683, !687, !688}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !654, file: !34, line: 159, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !21, !104, !17}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "new_line", scope: !654, file: !34, line: 160, baseType: !661, size: 64, align: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !21, !17}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !654, file: !34, line: 161, baseType: !665, size: 64, align: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !21, !24, !17}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !654, file: !34, line: 162, baseType: !669, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !21, !18, !18}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !654, file: !34, line: 163, baseType: !673, size: 64, align: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !21, !17, !17}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "font_name", scope: !654, file: !34, line: 164, baseType: !677, size: 64, align: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !21, !104}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "font_size", scope: !654, file: !34, line: 165, baseType: !661, size: 64, align: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !654, file: !34, line: 166, baseType: !661, size: 64, align: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_overrides", scope: !654, file: !34, line: 167, baseType: !677, size: 64, align: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !654, file: !34, line: 174, baseType: !684, size: 64, align: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !21, !17, !17, !17, !17, !17, !17}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !654, file: !34, line: 175, baseType: !673, size: 64, align: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !654, file: !34, line: 182, baseType: !689, size: 64, align: 64, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !21}
!692 = !DILocalVariable(name: "callbacks", arg: 1, scope: !648, file: !4, line: 492, type: !651)
!693 = !DILocation(line: 492, column: 58, scope: !648)
!694 = !DILocalVariable(name: "priv", arg: 2, scope: !648, file: !4, line: 492, type: !21)
!695 = !DILocation(line: 492, column: 75, scope: !648)
!696 = !DILocalVariable(name: "buf", arg: 3, scope: !648, file: !4, line: 493, type: !104)
!697 = !DILocation(line: 493, column: 45, scope: !648)
!698 = !DILocalVariable(name: "text", scope: !648, file: !4, line: 495, type: !104)
!699 = !DILocation(line: 495, column: 17, scope: !648)
!700 = !DILocalVariable(name: "new_line", scope: !648, file: !4, line: 496, type: !701)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, align: 8, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 2)
!704 = !DILocation(line: 496, column: 10, scope: !648)
!705 = !DILocalVariable(name: "text_len", scope: !648, file: !4, line: 497, type: !17)
!706 = !DILocation(line: 497, column: 9, scope: !648)
!707 = !DILocation(line: 499, column: 5, scope: !648)
!708 = !DILocation(line: 499, column: 12, scope: !709)
!709 = !DILexicalBlockFile(scope: !648, file: !4, discriminator: 1)
!710 = !DILocation(line: 499, column: 16, scope: !709)
!711 = !DILocation(line: 499, column: 20, scope: !712)
!712 = !DILexicalBlockFile(scope: !648, file: !4, discriminator: 2)
!713 = !DILocation(line: 499, column: 19, scope: !712)
!714 = !DILocation(line: 499, column: 16, scope: !712)
!715 = !DILocation(line: 499, column: 5, scope: !716)
!716 = !DILexicalBlockFile(scope: !648, file: !4, discriminator: 3)
!717 = !DILocation(line: 500, column: 13, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !4, line: 500, column: 13)
!719 = distinct !DILexicalBlock(scope: !648, file: !4, line: 499, column: 25)
!720 = !DILocation(line: 500, column: 18, scope: !718)
!721 = !DILocation(line: 500, column: 21, scope: !722)
!722 = !DILexicalBlockFile(scope: !718, file: !4, discriminator: 1)
!723 = !DILocation(line: 500, column: 32, scope: !722)
!724 = !DILocation(line: 500, column: 37, scope: !722)
!725 = !DILocation(line: 501, column: 21, scope: !718)
!726 = !DILocation(line: 501, column: 38, scope: !718)
!727 = !DILocation(line: 501, column: 14, scope: !718)
!728 = !DILocation(line: 501, column: 48, scope: !718)
!729 = !DILocation(line: 501, column: 53, scope: !718)
!730 = !DILocation(line: 502, column: 23, scope: !718)
!731 = !DILocation(line: 502, column: 15, scope: !718)
!732 = !DILocation(line: 500, column: 13, scope: !733)
!733 = !DILexicalBlockFile(scope: !719, file: !4, discriminator: 2)
!734 = !DILocation(line: 503, column: 13, scope: !735)
!735 = distinct !DILexicalBlock(scope: !718, file: !4, line: 502, column: 40)
!736 = !DILocation(line: 503, column: 24, scope: !735)
!737 = !DILocation(line: 503, column: 29, scope: !735)
!738 = !DILocation(line: 503, column: 35, scope: !735)
!739 = !DILocation(line: 503, column: 41, scope: !735)
!740 = !DILocation(line: 504, column: 18, scope: !735)
!741 = !DILocation(line: 505, column: 9, scope: !735)
!742 = !DILocation(line: 506, column: 20, scope: !743)
!743 = distinct !DILexicalBlock(scope: !719, file: !4, line: 506, column: 13)
!744 = !DILocation(line: 506, column: 37, scope: !743)
!745 = !DILocation(line: 506, column: 13, scope: !743)
!746 = !DILocation(line: 506, column: 47, scope: !743)
!747 = !DILocation(line: 506, column: 13, scope: !719)
!748 = !DILocation(line: 507, column: 17, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !4, line: 507, column: 17)
!750 = distinct !DILexicalBlock(scope: !743, file: !4, line: 506, column: 53)
!751 = !DILocation(line: 507, column: 28, scope: !749)
!752 = !DILocation(line: 507, column: 17, scope: !750)
