; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--realtextdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--realtextdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!818 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!819 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!820 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!821 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829}
!824 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!825 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!826 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!827 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!828 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!829 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!832 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!833 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!834 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!835 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!836 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!837 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!838 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!839 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!840 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!841 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850}
!844 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!845 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!846 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!847 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!848 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!849 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!850 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888}
!888 = distinct !DIGlobalVariable(name: "ff_realtext_decoder", scope: !0, file: !889, line: 77, type: !890, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_realtext_decoder)
!889 = !DIFile(filename: "libavcodec/realtextdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !892)
!892 = !{!893, !897, !898, !899, !900, !902, !911, !914, !917, !920, !926, !929, !971, !979, !980, !981, !983, !1391, !1397, !1402, !1406, !1407, !1447, !1467, !1471, !1472, !1476, !1480, !1481, !1485, !1486, !1487}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !891, file: !14, line: 3475, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !891, file: !14, line: 3480, baseType: !894, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !891, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !891, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !891, file: !14, line: 3487, baseType: !901, size: 32, align: 32, offset: 192)
!901 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !891, file: !14, line: 3488, baseType: !903, size: 64, align: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !906, line: 61, baseType: !907)
!906 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !906, line: 58, size: 64, align: 32, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !907, file: !906, line: 59, baseType: !901, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !907, file: !906, line: 60, baseType: !901, size: 32, align: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !891, file: !14, line: 3489, baseType: !912, size: 64, align: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !891, file: !14, line: 3490, baseType: !915, size: 64, align: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !891, file: !14, line: 3491, baseType: !918, size: 64, align: 64, offset: 448)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !891, file: !14, line: 3492, baseType: !921, size: 64, align: 64, offset: 512)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !891, file: !14, line: 3493, baseType: !927, size: 8, align: 8, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !928)
!928 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !891, file: !14, line: 3494, baseType: !930, size: 64, align: 64, offset: 640)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !934)
!934 = !{!935, !936, !941, !945, !946, !947, !948, !952, !958, !960, !964}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !933, file: !691, line: 72, baseType: !894, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !933, file: !691, line: 78, baseType: !937, size: 64, align: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!894, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !933, file: !691, line: 85, baseType: !942, size: 64, align: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !933, file: !691, line: 93, baseType: !901, size: 32, align: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !933, file: !691, line: 99, baseType: !901, size: 32, align: 32, offset: 224)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !933, file: !691, line: 108, baseType: !901, size: 32, align: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !933, file: !691, line: 113, baseType: !949, size: 64, align: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!940, !940, !940}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !933, file: !691, line: 123, baseType: !953, size: 64, align: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !933, file: !691, line: 130, baseType: !959, size: 32, align: 32, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !933, file: !691, line: 136, baseType: !961, size: 64, align: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!959, !940}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !933, file: !691, line: 142, baseType: !965, size: 64, align: 64, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!901, !968, !940, !894, !901}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !891, file: !14, line: 3495, baseType: !972, size: 64, align: 64, offset: 704)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !975, file: !14, line: 3402, baseType: !901, size: 32, align: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !14, line: 3403, baseType: !894, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !891, file: !14, line: 3507, baseType: !894, size: 64, align: 64, offset: 768)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !891, file: !14, line: 3516, baseType: !901, size: 32, align: 32, offset: 832)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !891, file: !14, line: 3517, baseType: !982, size: 64, align: 64, offset: 896)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !891, file: !14, line: 3527, baseType: !984, size: 64, align: 64, offset: 960)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!901, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !990)
!990 = !{!991, !992, !993, !994, !997, !998, !1000, !1001, !1004, !1005, !1008, !1009, !1010, !1011, !1012, !1013, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1128, !1132, !1133, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1322, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !989, file: !14, line: 1561, baseType: !930, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !989, file: !14, line: 1562, baseType: !901, size: 32, align: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !989, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !989, file: !14, line: 1565, baseType: !995, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !989, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !989, file: !14, line: 1581, baseType: !999, size: 32, align: 32, offset: 224)
!999 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !989, file: !14, line: 1583, baseType: !940, size: 64, align: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !989, file: !14, line: 1591, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !989, file: !14, line: 1598, baseType: !940, size: 64, align: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !989, file: !14, line: 1606, baseType: !1006, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1007)
!1007 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !989, file: !14, line: 1614, baseType: !901, size: 32, align: 32, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !989, file: !14, line: 1622, baseType: !901, size: 32, align: 32, offset: 544)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !989, file: !14, line: 1628, baseType: !901, size: 32, align: 32, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !989, file: !14, line: 1636, baseType: !901, size: 32, align: 32, offset: 608)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !989, file: !14, line: 1643, baseType: !901, size: 32, align: 32, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !989, file: !14, line: 1657, baseType: !1014, size: 64, align: 64, offset: 704)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !989, file: !14, line: 1658, baseType: !901, size: 32, align: 32, offset: 768)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !989, file: !14, line: 1679, baseType: !905, size: 64, align: 32, offset: 800)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !989, file: !14, line: 1688, baseType: !901, size: 32, align: 32, offset: 864)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !989, file: !14, line: 1712, baseType: !901, size: 32, align: 32, offset: 896)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !989, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 928)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !989, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 960)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !989, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 992)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !989, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 1024)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !989, file: !14, line: 1751, baseType: !901, size: 32, align: 32, offset: 1056)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !989, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !989, file: !14, line: 1791, baseType: !1026, size: 64, align: 64, offset: 1152)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !1029, !1030, !1127, !901, !901, !901}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1034)
!1034 = !{!1035, !1039, !1041, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1079, !1081, !1082, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1115, !1116, !1117, !1118, !1119, !1120, !1123, !1124, !1125, !1126}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1033, file: !722, line: 282, baseType: !1036, size: 512, align: 64)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 512, align: 64, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 8)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1033, file: !722, line: 299, baseType: !1040, size: 256, align: 32, offset: 512)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 256, align: 32, elements: !1037)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1033, file: !722, line: 315, baseType: !1042, size: 64, align: 64, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1033, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1033, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 864)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1033, file: !722, line: 334, baseType: !901, size: 32, align: 32, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1033, file: !722, line: 341, baseType: !901, size: 32, align: 32, offset: 928)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1033, file: !722, line: 346, baseType: !901, size: 32, align: 32, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1033, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1033, file: !722, line: 356, baseType: !905, size: 64, align: 32, offset: 1024)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1033, file: !722, line: 361, baseType: !1006, size: 64, align: 64, offset: 1088)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1033, file: !722, line: 369, baseType: !1006, size: 64, align: 64, offset: 1152)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1033, file: !722, line: 377, baseType: !1006, size: 64, align: 64, offset: 1216)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1033, file: !722, line: 382, baseType: !901, size: 32, align: 32, offset: 1280)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1033, file: !722, line: 386, baseType: !901, size: 32, align: 32, offset: 1312)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1033, file: !722, line: 391, baseType: !901, size: 32, align: 32, offset: 1344)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1033, file: !722, line: 396, baseType: !940, size: 64, align: 64, offset: 1408)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1033, file: !722, line: 403, baseType: !1058, size: 512, align: 64, offset: 1472)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 512, align: 64, elements: !1037)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1033, file: !722, line: 410, baseType: !901, size: 32, align: 32, offset: 1984)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1033, file: !722, line: 415, baseType: !901, size: 32, align: 32, offset: 2016)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1033, file: !722, line: 420, baseType: !901, size: 32, align: 32, offset: 2048)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1033, file: !722, line: 425, baseType: !901, size: 32, align: 32, offset: 2080)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1033, file: !722, line: 435, baseType: !1006, size: 64, align: 64, offset: 2112)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1033, file: !722, line: 440, baseType: !901, size: 32, align: 32, offset: 2176)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1033, file: !722, line: 445, baseType: !923, size: 64, align: 64, offset: 2240)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1033, file: !722, line: 459, baseType: !1067, size: 512, align: 64, offset: 2304)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !1037)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1070, line: 94, baseType: !1071)
!1070 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1070, line: 81, size: 192, align: 64, elements: !1072)
!1072 = !{!1073, !1077, !1078}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1071, file: !1070, line: 82, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1070, line: 73, baseType: !1076)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1070, line: 73, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1071, file: !1070, line: 89, baseType: !1014, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1071, file: !1070, line: 93, baseType: !901, size: 32, align: 32, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1033, file: !722, line: 473, baseType: !1080, size: 64, align: 64, offset: 2816)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1033, file: !722, line: 477, baseType: !901, size: 32, align: 32, offset: 2880)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1033, file: !722, line: 479, baseType: !1083, size: 64, align: 64, offset: 2944)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1096}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1086, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1086, file: !722, line: 203, baseType: !1014, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1086, file: !722, line: 204, baseType: !901, size: 32, align: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1086, file: !722, line: 205, baseType: !1092, size: 64, align: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1094, line: 86, baseType: !1095)
!1094 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1094, line: 86, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1086, file: !722, line: 206, baseType: !1068, size: 64, align: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1033, file: !722, line: 480, baseType: !901, size: 32, align: 32, offset: 3008)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1033, file: !722, line: 505, baseType: !901, size: 32, align: 32, offset: 3040)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1033, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1033, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1033, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1033, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1033, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1033, file: !722, line: 532, baseType: !1006, size: 64, align: 64, offset: 3264)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1033, file: !722, line: 539, baseType: !1006, size: 64, align: 64, offset: 3328)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1033, file: !722, line: 547, baseType: !1006, size: 64, align: 64, offset: 3392)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1033, file: !722, line: 554, baseType: !1092, size: 64, align: 64, offset: 3456)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1033, file: !722, line: 563, baseType: !901, size: 32, align: 32, offset: 3520)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1033, file: !722, line: 572, baseType: !901, size: 32, align: 32, offset: 3552)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1033, file: !722, line: 581, baseType: !901, size: 32, align: 32, offset: 3584)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1033, file: !722, line: 588, baseType: !1112, size: 64, align: 64, offset: 3648)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1114)
!1114 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1033, file: !722, line: 593, baseType: !901, size: 32, align: 32, offset: 3712)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1033, file: !722, line: 596, baseType: !901, size: 32, align: 32, offset: 3744)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1033, file: !722, line: 599, baseType: !1068, size: 64, align: 64, offset: 3776)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1033, file: !722, line: 605, baseType: !1068, size: 64, align: 64, offset: 3840)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1033, file: !722, line: 616, baseType: !1068, size: 64, align: 64, offset: 3904)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1033, file: !722, line: 626, baseType: !1121, size: 64, align: 64, offset: 3968)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1122, line: 216, baseType: !925)
!1122 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1033, file: !722, line: 627, baseType: !1121, size: 64, align: 64, offset: 4032)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1033, file: !722, line: 628, baseType: !1121, size: 64, align: 64, offset: 4096)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1033, file: !722, line: 629, baseType: !1121, size: 64, align: 64, offset: 4160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1033, file: !722, line: 645, baseType: !1068, size: 64, align: 64, offset: 4224)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !989, file: !14, line: 1808, baseType: !1129, size: 64, align: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!473, !1029, !912}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !989, file: !14, line: 1816, baseType: !901, size: 32, align: 32, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !989, file: !14, line: 1825, baseType: !1134, size: 32, align: 32, offset: 1312)
!1134 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !989, file: !14, line: 1830, baseType: !901, size: 32, align: 32, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !989, file: !14, line: 1838, baseType: !1134, size: 32, align: 32, offset: 1376)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !989, file: !14, line: 1846, baseType: !901, size: 32, align: 32, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !989, file: !14, line: 1851, baseType: !901, size: 32, align: 32, offset: 1440)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !989, file: !14, line: 1861, baseType: !1134, size: 32, align: 32, offset: 1472)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !989, file: !14, line: 1868, baseType: !1134, size: 32, align: 32, offset: 1504)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !989, file: !14, line: 1875, baseType: !1134, size: 32, align: 32, offset: 1536)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !989, file: !14, line: 1882, baseType: !1134, size: 32, align: 32, offset: 1568)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !989, file: !14, line: 1889, baseType: !1134, size: 32, align: 32, offset: 1600)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !989, file: !14, line: 1896, baseType: !1134, size: 32, align: 32, offset: 1632)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !989, file: !14, line: 1903, baseType: !1134, size: 32, align: 32, offset: 1664)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !989, file: !14, line: 1910, baseType: !901, size: 32, align: 32, offset: 1696)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !989, file: !14, line: 1915, baseType: !901, size: 32, align: 32, offset: 1728)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !989, file: !14, line: 1926, baseType: !1127, size: 64, align: 64, offset: 1792)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !989, file: !14, line: 1935, baseType: !905, size: 64, align: 32, offset: 1856)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !989, file: !14, line: 1942, baseType: !901, size: 32, align: 32, offset: 1920)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !989, file: !14, line: 1948, baseType: !901, size: 32, align: 32, offset: 1952)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !989, file: !14, line: 1954, baseType: !901, size: 32, align: 32, offset: 1984)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !989, file: !14, line: 1960, baseType: !901, size: 32, align: 32, offset: 2016)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !989, file: !14, line: 1984, baseType: !901, size: 32, align: 32, offset: 2048)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !989, file: !14, line: 1991, baseType: !901, size: 32, align: 32, offset: 2080)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !989, file: !14, line: 1996, baseType: !901, size: 32, align: 32, offset: 2112)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !989, file: !14, line: 2004, baseType: !901, size: 32, align: 32, offset: 2144)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !989, file: !14, line: 2011, baseType: !901, size: 32, align: 32, offset: 2176)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !989, file: !14, line: 2018, baseType: !901, size: 32, align: 32, offset: 2208)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !989, file: !14, line: 2027, baseType: !901, size: 32, align: 32, offset: 2240)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !989, file: !14, line: 2034, baseType: !901, size: 32, align: 32, offset: 2272)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !989, file: !14, line: 2044, baseType: !901, size: 32, align: 32, offset: 2304)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !989, file: !14, line: 2054, baseType: !1164, size: 64, align: 64, offset: 2368)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !1166)
!1166 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !989, file: !14, line: 2061, baseType: !1164, size: 64, align: 64, offset: 2432)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !989, file: !14, line: 2066, baseType: !901, size: 32, align: 32, offset: 2496)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !989, file: !14, line: 2070, baseType: !901, size: 32, align: 32, offset: 2528)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !989, file: !14, line: 2078, baseType: !901, size: 32, align: 32, offset: 2560)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !989, file: !14, line: 2085, baseType: !901, size: 32, align: 32, offset: 2592)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !989, file: !14, line: 2092, baseType: !901, size: 32, align: 32, offset: 2624)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !989, file: !14, line: 2099, baseType: !901, size: 32, align: 32, offset: 2656)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !989, file: !14, line: 2106, baseType: !901, size: 32, align: 32, offset: 2688)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !989, file: !14, line: 2113, baseType: !901, size: 32, align: 32, offset: 2720)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !989, file: !14, line: 2120, baseType: !901, size: 32, align: 32, offset: 2752)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !989, file: !14, line: 2125, baseType: !901, size: 32, align: 32, offset: 2784)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !989, file: !14, line: 2133, baseType: !901, size: 32, align: 32, offset: 2816)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !989, file: !14, line: 2140, baseType: !901, size: 32, align: 32, offset: 2848)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !989, file: !14, line: 2145, baseType: !901, size: 32, align: 32, offset: 2880)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !989, file: !14, line: 2153, baseType: !901, size: 32, align: 32, offset: 2912)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !989, file: !14, line: 2158, baseType: !901, size: 32, align: 32, offset: 2944)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !989, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !989, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !989, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !989, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !989, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !989, file: !14, line: 2203, baseType: !901, size: 32, align: 32, offset: 3136)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !989, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !989, file: !14, line: 2212, baseType: !901, size: 32, align: 32, offset: 3200)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !989, file: !14, line: 2213, baseType: !901, size: 32, align: 32, offset: 3232)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !989, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !989, file: !14, line: 2232, baseType: !901, size: 32, align: 32, offset: 3296)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !989, file: !14, line: 2243, baseType: !901, size: 32, align: 32, offset: 3328)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !989, file: !14, line: 2249, baseType: !901, size: 32, align: 32, offset: 3360)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !989, file: !14, line: 2256, baseType: !901, size: 32, align: 32, offset: 3392)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !989, file: !14, line: 2263, baseType: !923, size: 64, align: 64, offset: 3456)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !989, file: !14, line: 2270, baseType: !923, size: 64, align: 64, offset: 3520)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !989, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !989, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !989, file: !14, line: 2367, baseType: !1202, size: 64, align: 64, offset: 3648)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!901, !1029, !1205, !901}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !989, file: !14, line: 2383, baseType: !901, size: 32, align: 32, offset: 3712)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !989, file: !14, line: 2386, baseType: !1134, size: 32, align: 32, offset: 3744)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !989, file: !14, line: 2387, baseType: !1134, size: 32, align: 32, offset: 3776)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !989, file: !14, line: 2394, baseType: !901, size: 32, align: 32, offset: 3808)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !989, file: !14, line: 2401, baseType: !901, size: 32, align: 32, offset: 3840)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !989, file: !14, line: 2408, baseType: !901, size: 32, align: 32, offset: 3872)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !989, file: !14, line: 2415, baseType: !901, size: 32, align: 32, offset: 3904)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !989, file: !14, line: 2422, baseType: !901, size: 32, align: 32, offset: 3936)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !989, file: !14, line: 2423, baseType: !1215, size: 64, align: 64, offset: 3968)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1217, file: !14, line: 827, baseType: !901, size: 32, align: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1217, file: !14, line: 828, baseType: !901, size: 32, align: 32, offset: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1217, file: !14, line: 829, baseType: !901, size: 32, align: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1217, file: !14, line: 830, baseType: !1134, size: 32, align: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !989, file: !14, line: 2430, baseType: !1006, size: 64, align: 64, offset: 4032)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !989, file: !14, line: 2437, baseType: !1006, size: 64, align: 64, offset: 4096)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !989, file: !14, line: 2444, baseType: !1134, size: 32, align: 32, offset: 4160)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !989, file: !14, line: 2451, baseType: !1134, size: 32, align: 32, offset: 4192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !989, file: !14, line: 2458, baseType: !901, size: 32, align: 32, offset: 4224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !989, file: !14, line: 2469, baseType: !901, size: 32, align: 32, offset: 4256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !989, file: !14, line: 2475, baseType: !901, size: 32, align: 32, offset: 4288)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !989, file: !14, line: 2481, baseType: !901, size: 32, align: 32, offset: 4320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !989, file: !14, line: 2485, baseType: !901, size: 32, align: 32, offset: 4352)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !989, file: !14, line: 2489, baseType: !901, size: 32, align: 32, offset: 4384)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !989, file: !14, line: 2493, baseType: !901, size: 32, align: 32, offset: 4416)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !989, file: !14, line: 2501, baseType: !901, size: 32, align: 32, offset: 4448)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !989, file: !14, line: 2506, baseType: !901, size: 32, align: 32, offset: 4480)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !989, file: !14, line: 2510, baseType: !901, size: 32, align: 32, offset: 4512)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !989, file: !14, line: 2514, baseType: !1006, size: 64, align: 64, offset: 4544)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !989, file: !14, line: 2528, baseType: !1239, size: 64, align: 64, offset: 4608)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !1029, !940, !901, !901}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !989, file: !14, line: 2534, baseType: !901, size: 32, align: 32, offset: 4672)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !989, file: !14, line: 2545, baseType: !901, size: 32, align: 32, offset: 4704)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !989, file: !14, line: 2547, baseType: !901, size: 32, align: 32, offset: 4736)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !989, file: !14, line: 2549, baseType: !901, size: 32, align: 32, offset: 4768)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !989, file: !14, line: 2551, baseType: !901, size: 32, align: 32, offset: 4800)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !989, file: !14, line: 2553, baseType: !901, size: 32, align: 32, offset: 4832)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !989, file: !14, line: 2555, baseType: !901, size: 32, align: 32, offset: 4864)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !989, file: !14, line: 2557, baseType: !901, size: 32, align: 32, offset: 4896)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !989, file: !14, line: 2559, baseType: !901, size: 32, align: 32, offset: 4928)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !989, file: !14, line: 2563, baseType: !901, size: 32, align: 32, offset: 4960)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !989, file: !14, line: 2571, baseType: !1253, size: 64, align: 64, offset: 4992)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !989, file: !14, line: 2579, baseType: !1253, size: 64, align: 64, offset: 5056)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !989, file: !14, line: 2586, baseType: !901, size: 32, align: 32, offset: 5120)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !989, file: !14, line: 2615, baseType: !901, size: 32, align: 32, offset: 5152)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !989, file: !14, line: 2627, baseType: !901, size: 32, align: 32, offset: 5184)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !989, file: !14, line: 2637, baseType: !901, size: 32, align: 32, offset: 5216)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !989, file: !14, line: 2681, baseType: !901, size: 32, align: 32, offset: 5248)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !989, file: !14, line: 2709, baseType: !1006, size: 64, align: 64, offset: 5312)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !989, file: !14, line: 2716, baseType: !1262, size: 64, align: 64, offset: 5376)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1275, !1282, !1286, !1287, !1288, !1289, !1295, !1296, !1297, !1298, !1299}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1264, file: !14, line: 3642, baseType: !894, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1264, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1264, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1264, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1264, file: !14, line: 3669, baseType: !901, size: 32, align: 32, offset: 160)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1264, file: !14, line: 3682, baseType: !1272, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!901, !987, !1205}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1264, file: !14, line: 3698, baseType: !1276, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!901, !987, !1279, !1281}
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !999)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1264, file: !14, line: 3712, baseType: !1283, size: 64, align: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!901, !987, !901, !1279, !1281}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1264, file: !14, line: 3726, baseType: !1276, size: 64, align: 64, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1264, file: !14, line: 3737, baseType: !984, size: 64, align: 64, offset: 448)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1264, file: !14, line: 3746, baseType: !901, size: 32, align: 32, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1264, file: !14, line: 3757, baseType: !1290, size: 64, align: 64, offset: 576)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1293}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1264, file: !14, line: 3766, baseType: !984, size: 64, align: 64, offset: 640)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1264, file: !14, line: 3774, baseType: !984, size: 64, align: 64, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1264, file: !14, line: 3780, baseType: !901, size: 32, align: 32, offset: 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1264, file: !14, line: 3785, baseType: !901, size: 32, align: 32, offset: 800)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1264, file: !14, line: 3795, baseType: !1300, size: 64, align: 64, offset: 832)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!901, !987, !1068}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !989, file: !14, line: 2728, baseType: !940, size: 64, align: 64, offset: 5440)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !989, file: !14, line: 2735, baseType: !1058, size: 512, align: 64, offset: 5504)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !989, file: !14, line: 2742, baseType: !901, size: 32, align: 32, offset: 6016)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !989, file: !14, line: 2755, baseType: !901, size: 32, align: 32, offset: 6048)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !989, file: !14, line: 2776, baseType: !901, size: 32, align: 32, offset: 6080)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !989, file: !14, line: 2783, baseType: !901, size: 32, align: 32, offset: 6112)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !989, file: !14, line: 2791, baseType: !901, size: 32, align: 32, offset: 6144)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !989, file: !14, line: 2802, baseType: !1205, size: 64, align: 64, offset: 6208)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !989, file: !14, line: 2811, baseType: !901, size: 32, align: 32, offset: 6272)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !989, file: !14, line: 2821, baseType: !901, size: 32, align: 32, offset: 6304)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !989, file: !14, line: 2830, baseType: !901, size: 32, align: 32, offset: 6336)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !989, file: !14, line: 2840, baseType: !901, size: 32, align: 32, offset: 6368)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !989, file: !14, line: 2851, baseType: !1316, size: 64, align: 64, offset: 6400)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!901, !1029, !1319, !940, !1127, !901, !901}
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!901, !1029, !940}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !989, file: !14, line: 2871, baseType: !1323, size: 64, align: 64, offset: 6464)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!901, !1029, !1326, !940, !1127, !901}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!901, !1029, !940, !901, !901}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !989, file: !14, line: 2878, baseType: !901, size: 32, align: 32, offset: 6528)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !989, file: !14, line: 2885, baseType: !901, size: 32, align: 32, offset: 6560)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !989, file: !14, line: 3005, baseType: !901, size: 32, align: 32, offset: 6592)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !989, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !989, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !989, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !989, file: !14, line: 3037, baseType: !1014, size: 64, align: 64, offset: 6720)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !989, file: !14, line: 3038, baseType: !901, size: 32, align: 32, offset: 6784)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !989, file: !14, line: 3050, baseType: !923, size: 64, align: 64, offset: 6848)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !989, file: !14, line: 3065, baseType: !901, size: 32, align: 32, offset: 6912)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !989, file: !14, line: 3083, baseType: !901, size: 32, align: 32, offset: 6944)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !989, file: !14, line: 3092, baseType: !905, size: 64, align: 32, offset: 6976)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !989, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !989, file: !14, line: 3106, baseType: !905, size: 64, align: 32, offset: 7072)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !989, file: !14, line: 3113, baseType: !1344, size: 64, align: 64, offset: 7168)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1348)
!1348 = !{!1349, !1350, !1351, !1352, !1353, !1354, !1357}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1347, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1347, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1347, file: !14, line: 720, baseType: !894, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1347, file: !14, line: 724, baseType: !894, size: 64, align: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1347, file: !14, line: 728, baseType: !901, size: 32, align: 32, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1347, file: !14, line: 734, baseType: !1355, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1347, file: !14, line: 739, baseType: !1358, size: 64, align: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !989, file: !14, line: 3129, baseType: !1006, size: 64, align: 64, offset: 7232)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !989, file: !14, line: 3130, baseType: !1006, size: 64, align: 64, offset: 7296)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !989, file: !14, line: 3131, baseType: !1006, size: 64, align: 64, offset: 7360)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !989, file: !14, line: 3132, baseType: !1006, size: 64, align: 64, offset: 7424)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !989, file: !14, line: 3139, baseType: !1253, size: 64, align: 64, offset: 7488)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !989, file: !14, line: 3147, baseType: !901, size: 32, align: 32, offset: 7552)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !989, file: !14, line: 3165, baseType: !901, size: 32, align: 32, offset: 7584)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !989, file: !14, line: 3172, baseType: !901, size: 32, align: 32, offset: 7616)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !989, file: !14, line: 3180, baseType: !901, size: 32, align: 32, offset: 7648)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !989, file: !14, line: 3191, baseType: !1164, size: 64, align: 64, offset: 7680)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !989, file: !14, line: 3199, baseType: !1014, size: 64, align: 64, offset: 7744)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !989, file: !14, line: 3207, baseType: !1253, size: 64, align: 64, offset: 7808)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !989, file: !14, line: 3214, baseType: !999, size: 32, align: 32, offset: 7872)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !989, file: !14, line: 3224, baseType: !1374, size: 64, align: 64, offset: 7936)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1376, file: !14, line: 1412, baseType: !1014, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1376, file: !14, line: 1413, baseType: !901, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1376, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !989, file: !14, line: 3225, baseType: !901, size: 32, align: 32, offset: 8000)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !989, file: !14, line: 3249, baseType: !1068, size: 64, align: 64, offset: 8064)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !989, file: !14, line: 3256, baseType: !901, size: 32, align: 32, offset: 8128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !989, file: !14, line: 3271, baseType: !901, size: 32, align: 32, offset: 8160)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !989, file: !14, line: 3279, baseType: !1006, size: 64, align: 64, offset: 8192)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !989, file: !14, line: 3301, baseType: !1068, size: 64, align: 64, offset: 8256)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !989, file: !14, line: 3310, baseType: !901, size: 32, align: 32, offset: 8320)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !989, file: !14, line: 3337, baseType: !901, size: 32, align: 32, offset: 8352)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !989, file: !14, line: 3351, baseType: !901, size: 32, align: 32, offset: 8384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !989, file: !14, line: 3359, baseType: !901, size: 32, align: 32, offset: 8416)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !891, file: !14, line: 3535, baseType: !1392, size: 64, align: 64, offset: 1024)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!901, !987, !1395}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !891, file: !14, line: 3541, baseType: !1398, size: 64, align: 64, offset: 1088)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1400)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1401)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !891, file: !14, line: 3549, baseType: !1403, size: 64, align: 64, offset: 1152)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{null, !982}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !891, file: !14, line: 3551, baseType: !984, size: 64, align: 64, offset: 1216)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !891, file: !14, line: 3552, baseType: !1408, size: 64, align: 64, offset: 1280)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!901, !987, !1014, !901, !1411}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418, !1419, !1446}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1413, file: !14, line: 3921, baseType: !1165, size: 16, align: 16)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1413, file: !14, line: 3922, baseType: !1281, size: 32, align: 32, offset: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1413, file: !14, line: 3923, baseType: !1281, size: 32, align: 32, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1413, file: !14, line: 3924, baseType: !999, size: 32, align: 32, offset: 96)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1413, file: !14, line: 3925, baseType: !1420, size: 64, align: 64, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1428, !1429, !1430, !1436, !1440, !1442, !1443, !1444, !1445}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1423, file: !14, line: 3886, baseType: !901, size: 32, align: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1423, file: !14, line: 3887, baseType: !901, size: 32, align: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1423, file: !14, line: 3888, baseType: !901, size: 32, align: 32, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1423, file: !14, line: 3889, baseType: !901, size: 32, align: 32, offset: 96)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1423, file: !14, line: 3890, baseType: !901, size: 32, align: 32, offset: 128)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1423, file: !14, line: 3897, baseType: !1431, size: 768, align: 64, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1433)
!1433 = !{!1434, !1435}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1432, file: !14, line: 3855, baseType: !1036, size: 512, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1432, file: !14, line: 3857, baseType: !1040, size: 256, align: 32, offset: 512)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1423, file: !14, line: 3903, baseType: !1437, size: 256, align: 64, offset: 960)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 256, align: 64, elements: !1438)
!1438 = !{!1439}
!1439 = !DISubrange(count: 4)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1423, file: !14, line: 3904, baseType: !1441, size: 128, align: 32, offset: 1216)
!1441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, align: 32, elements: !1438)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1423, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1423, file: !14, line: 3908, baseType: !1253, size: 64, align: 64, offset: 1408)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1423, file: !14, line: 3915, baseType: !1253, size: 64, align: 64, offset: 1472)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1423, file: !14, line: 3917, baseType: !901, size: 32, align: 32, offset: 1536)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1413, file: !14, line: 3926, baseType: !1006, size: 64, align: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !891, file: !14, line: 3564, baseType: !1448, size: 64, align: 64, offset: 1344)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!901, !987, !1451, !1030, !1127}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1453, file: !14, line: 1451, baseType: !1068, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1453, file: !14, line: 1461, baseType: !1006, size: 64, align: 64, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1453, file: !14, line: 1467, baseType: !1006, size: 64, align: 64, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1453, file: !14, line: 1468, baseType: !1014, size: 64, align: 64, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1453, file: !14, line: 1469, baseType: !901, size: 32, align: 32, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1453, file: !14, line: 1470, baseType: !901, size: 32, align: 32, offset: 288)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1453, file: !14, line: 1474, baseType: !901, size: 32, align: 32, offset: 320)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1453, file: !14, line: 1479, baseType: !1374, size: 64, align: 64, offset: 384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1453, file: !14, line: 1480, baseType: !901, size: 32, align: 32, offset: 448)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1453, file: !14, line: 1486, baseType: !1006, size: 64, align: 64, offset: 512)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1453, file: !14, line: 1488, baseType: !1006, size: 64, align: 64, offset: 576)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1453, file: !14, line: 1497, baseType: !1006, size: 64, align: 64, offset: 640)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !891, file: !14, line: 3566, baseType: !1468, size: 64, align: 64, offset: 1408)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!901, !987, !940, !1127, !1451}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !891, file: !14, line: 3567, baseType: !984, size: 64, align: 64, offset: 1472)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !891, file: !14, line: 3576, baseType: !1473, size: 64, align: 64, offset: 1536)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!901, !987, !1030}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !891, file: !14, line: 3577, baseType: !1477, size: 64, align: 64, offset: 1600)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!901, !987, !1451}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !891, file: !14, line: 3584, baseType: !1272, size: 64, align: 64, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !891, file: !14, line: 3589, baseType: !1482, size: 64, align: 64, offset: 1728)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{null, !987}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !891, file: !14, line: 3594, baseType: !901, size: 32, align: 32, offset: 1792)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !891, file: !14, line: 3600, baseType: !894, size: 64, align: 64, offset: 1856)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !891, file: !14, line: 3609, baseType: !1488, size: 64, align: 64, offset: 1920)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1491)
!1491 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1492 = !{i32 2, !"Dwarf Version", i32 4}
!1493 = !{i32 2, !"Debug Info Version", i32 3}
!1494 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1495 = distinct !DISubprogram(name: "realtext_decode_frame", scope: !889, file: !889, line: 58, type: !1469, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1496)
!1496 = !{}
!1497 = !DILocalVariable(name: "avctx", arg: 1, scope: !1495, file: !889, line: 58, type: !987)
!1498 = !DIExpression()
!1499 = !DILocation(line: 58, column: 50, scope: !1495)
!1500 = !DILocalVariable(name: "data", arg: 2, scope: !1495, file: !889, line: 59, type: !940)
!1501 = !DILocation(line: 59, column: 40, scope: !1495)
!1502 = !DILocalVariable(name: "got_sub_ptr", arg: 3, scope: !1495, file: !889, line: 59, type: !1127)
!1503 = !DILocation(line: 59, column: 51, scope: !1495)
!1504 = !DILocalVariable(name: "avpkt", arg: 4, scope: !1495, file: !889, line: 59, type: !1451)
!1505 = !DILocation(line: 59, column: 74, scope: !1495)
!1506 = !DILocalVariable(name: "ret", scope: !1495, file: !889, line: 61, type: !901)
!1507 = !DILocation(line: 61, column: 9, scope: !1495)
!1508 = !DILocalVariable(name: "sub", scope: !1495, file: !889, line: 62, type: !1509)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1413)
!1511 = !DILocation(line: 62, column: 17, scope: !1495)
!1512 = !DILocation(line: 62, column: 23, scope: !1495)
!1513 = !DILocalVariable(name: "ptr", scope: !1495, file: !889, line: 63, type: !894)
!1514 = !DILocation(line: 63, column: 17, scope: !1495)
!1515 = !DILocation(line: 63, column: 23, scope: !1495)
!1516 = !DILocation(line: 63, column: 30, scope: !1495)
!1517 = !DILocalVariable(name: "s", scope: !1495, file: !889, line: 64, type: !1518)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFASSDecoderContext", file: !1520, line: 48, baseType: !1521)
!1520 = !DIFile(filename: "libavcodec/ass.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFASSDecoderContext", file: !1520, line: 46, size: 32, align: 32, elements: !1522)
!1522 = !{!1523}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1521, file: !1520, line: 47, baseType: !901, size: 32, align: 32)
!1524 = !DILocation(line: 64, column: 26, scope: !1495)
!1525 = !DILocation(line: 64, column: 30, scope: !1495)
!1526 = !DILocation(line: 64, column: 37, scope: !1495)
!1527 = !DILocalVariable(name: "buf", scope: !1495, file: !889, line: 65, type: !1528)
!1528 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1529, line: 82, baseType: !1530)
!1529 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1529, line: 82, size: 8192, align: 64, elements: !1531)
!1531 = !{!1532, !1533, !1534, !1535, !1536, !1540}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1530, file: !1529, line: 82, baseType: !1253, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1530, file: !1529, line: 82, baseType: !999, size: 32, align: 32, offset: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1530, file: !1529, line: 82, baseType: !999, size: 32, align: 32, offset: 96)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1530, file: !1529, line: 82, baseType: !999, size: 32, align: 32, offset: 128)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1530, file: !1529, line: 82, baseType: !1537, size: 8, align: 8, offset: 160)
!1537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 8, align: 8, elements: !1538)
!1538 = !{!1539}
!1539 = !DISubrange(count: 1)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1530, file: !1529, line: 82, baseType: !1541, size: 8000, align: 8, offset: 168)
!1541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 8000, align: 8, elements: !1542)
!1542 = !{!1543}
!1543 = !DISubrange(count: 1000)
!1544 = !DILocation(line: 65, column: 14, scope: !1495)
!1545 = !DILocation(line: 67, column: 5, scope: !1495)
!1546 = !DILocation(line: 68, column: 9, scope: !1547)
!1547 = distinct !DILexicalBlock(scope: !1495, file: !889, line: 68, column: 9)
!1548 = !DILocation(line: 68, column: 13, scope: !1547)
!1549 = !DILocation(line: 68, column: 16, scope: !1550)
!1550 = !DILexicalBlockFile(scope: !1547, file: !889, discriminator: 1)
!1551 = !DILocation(line: 68, column: 23, scope: !1550)
!1552 = !DILocation(line: 68, column: 28, scope: !1550)
!1553 = !DILocation(line: 68, column: 32, scope: !1550)
!1554 = !DILocation(line: 68, column: 58, scope: !1555)
!1555 = !DILexicalBlockFile(scope: !1547, file: !889, discriminator: 2)
!1556 = !DILocation(line: 68, column: 36, scope: !1555)
!1557 = !DILocation(line: 68, column: 9, scope: !1555)
!1558 = !DILocation(line: 69, column: 31, scope: !1547)
!1559 = !DILocation(line: 69, column: 40, scope: !1547)
!1560 = !DILocation(line: 69, column: 45, scope: !1547)
!1561 = !DILocation(line: 69, column: 48, scope: !1547)
!1562 = !DILocation(line: 69, column: 57, scope: !1547)
!1563 = !DILocation(line: 69, column: 15, scope: !1547)
!1564 = !DILocation(line: 69, column: 13, scope: !1547)
!1565 = !DILocation(line: 69, column: 9, scope: !1547)
!1566 = !DILocation(line: 70, column: 5, scope: !1495)
!1567 = !DILocation(line: 71, column: 9, scope: !1568)
!1568 = distinct !DILexicalBlock(scope: !1495, file: !889, line: 71, column: 9)
!1569 = !DILocation(line: 71, column: 13, scope: !1568)
!1570 = !DILocation(line: 71, column: 9, scope: !1495)
!1571 = !DILocation(line: 72, column: 16, scope: !1568)
!1572 = !DILocation(line: 72, column: 9, scope: !1568)
!1573 = !DILocation(line: 73, column: 20, scope: !1495)
!1574 = !DILocation(line: 73, column: 25, scope: !1495)
!1575 = !DILocation(line: 73, column: 35, scope: !1495)
!1576 = !DILocation(line: 73, column: 6, scope: !1495)
!1577 = !DILocation(line: 73, column: 18, scope: !1495)
!1578 = !DILocation(line: 74, column: 12, scope: !1495)
!1579 = !DILocation(line: 74, column: 19, scope: !1495)
!1580 = !DILocation(line: 74, column: 5, scope: !1495)
!1581 = !DILocation(line: 75, column: 1, scope: !1495)
!1582 = distinct !DISubprogram(name: "rt_event_to_ass", scope: !889, file: !889, line: 32, type: !1583, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1496)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!901, !1585, !894}
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1586 = !DILocalVariable(name: "buf", arg: 1, scope: !1582, file: !889, line: 32, type: !1585)
!1587 = !DILocation(line: 32, column: 38, scope: !1582)
!1588 = !DILocalVariable(name: "p", arg: 2, scope: !1582, file: !889, line: 32, type: !894)
!1589 = !DILocation(line: 32, column: 55, scope: !1582)
!1590 = !DILocalVariable(name: "prev_chr_is_space", scope: !1582, file: !889, line: 34, type: !901)
!1591 = !DILocation(line: 34, column: 9, scope: !1582)
!1592 = !DILocation(line: 36, column: 5, scope: !1582)
!1593 = !DILocation(line: 36, column: 13, scope: !1594)
!1594 = !DILexicalBlockFile(scope: !1582, file: !889, discriminator: 1)
!1595 = !DILocation(line: 36, column: 12, scope: !1594)
!1596 = !DILocation(line: 36, column: 5, scope: !1594)
!1597 = !DILocation(line: 37, column: 14, scope: !1598)
!1598 = distinct !DILexicalBlock(scope: !1599, file: !889, line: 37, column: 13)
!1599 = distinct !DILexicalBlock(scope: !1582, file: !889, line: 36, column: 16)
!1600 = !DILocation(line: 37, column: 13, scope: !1598)
!1601 = !DILocation(line: 37, column: 16, scope: !1598)
!1602 = !DILocation(line: 37, column: 13, scope: !1599)
