; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--mdct15_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--mdct15_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MDCT15Context = type { i32, i32, i32, i32, i32*, i32*, %struct.FFTContext, %struct.FFTComplex*, %struct.FFTComplex*, [64 x %struct.FFTComplex], void (%struct.FFTComplex*, %struct.FFTComplex*, %struct.FFTComplex*, i64)*, void (%struct.FFTComplex*, %struct.FFTComplex*, %struct.FFTComplex*, i32*, i64)*, void (%struct.MDCT15Context*, float*, float*, i64)*, void (%struct.MDCT15Context*, float*, float*, i64)* }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }
%struct.FFTComplex = type { float, float }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_mdct15_init_x86(%struct.MDCT15Context* %s) #0 !dbg !16 {
entry:
  %s.addr = alloca %struct.MDCT15Context*, align 8
  %adjust_twiddles = alloca i32, align 4
  %cpu_flags = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--mdct15_init.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "ff_mdct15_init_x86", scope: !17, file: !17, line: 81, type: !18, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !111)
!17 = !DIFile(filename: "libavcodec/x86/mdct15_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDCT15Context", file: !22, line: 54, baseType: !23)
!22 = !DIFile(filename: "./libavcodec/mdct15.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDCT15Context", file: !22, line: 28, size: 5632, align: 256, elements: !24)
!24 = !{!25, !27, !28, !29, !30, !32, !33, !85, !86, !87, !91, !98, !102, !110}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "fft_n", scope: !23, file: !22, line: 29, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "len2", scope: !23, file: !22, line: 30, baseType: !26, size: 32, align: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len4", scope: !23, file: !22, line: 31, baseType: !26, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !23, file: !22, line: 32, baseType: !26, size: 32, align: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_prereindex", scope: !23, file: !22, line: 33, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_postreindex", scope: !23, file: !22, line: 34, baseType: !31, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptwo_fft", scope: !23, file: !22, line: 36, baseType: !34, size: 896, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !35, line: 41, baseType: !36)
!35 = !DIFile(filename: "./libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !37)
!37 = !{!38, !39, !40, !45, !54, !55, !56, !58, !59, !64, !65, !71, !72, !73, !79, !80, !81}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !36, file: !4, line: 89, baseType: !26, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !36, file: !4, line: 90, baseType: !26, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !36, file: !4, line: 91, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 49, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !36, file: !4, line: 92, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !35, line: 39, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !35, line: 37, size: 64, align: 32, elements: !49)
!49 = !{!50, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !48, file: !35, line: 38, baseType: !51, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !35, line: 35, baseType: !52)
!52 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !48, file: !35, line: 38, baseType: !51, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !36, file: !4, line: 93, baseType: !26, size: 32, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !36, file: !4, line: 94, baseType: !26, size: 32, align: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !36, file: !4, line: 96, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !36, file: !4, line: 97, baseType: !57, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !36, file: !4, line: 101, baseType: !60, size: 64, align: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !46}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !36, file: !4, line: 106, baseType: !60, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !36, file: !4, line: 107, baseType: !66, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !63, !57, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !36, file: !4, line: 108, baseType: !66, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !36, file: !4, line: 109, baseType: !66, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !36, file: !4, line: 110, baseType: !74, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !63, !77, !69}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !52)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !36, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !36, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !36, file: !4, line: 113, baseType: !82, size: 64, align: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 51, baseType: !84)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !23, file: !22, line: 37, baseType: !46, size: 64, align: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "twiddle_exptab", scope: !23, file: !22, line: 38, baseType: !46, size: 64, align: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "exptab", scope: !23, file: !22, line: 40, baseType: !88, size: 4096, align: 32, offset: 1280)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 4096, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fft15", scope: !23, file: !22, line: 43, baseType: !92, size: 64, align: 64, offset: 5376)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !46, !46, !46, !95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !96, line: 149, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!97 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "postreindex", scope: !23, file: !22, line: 46, baseType: !99, size: 64, align: 64, offset: 5440)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !46, !46, !46, !31, !95}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !23, file: !22, line: 49, baseType: !103, size: 64, align: 64, offset: 5504)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106, !107, !108, !95}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !23, file: !22, line: 52, baseType: !103, size: 64, align: 64, offset: 5568)
!111 = !{}
!112 = !DILocalVariable(name: "s", arg: 1, scope: !16, file: !17, line: 81, type: !20)
!113 = !DIExpression()
!114 = !DILocation(line: 81, column: 62, scope: !16)
!115 = !DILocalVariable(name: "adjust_twiddles", scope: !16, file: !17, line: 83, type: !26)
!116 = !DILocation(line: 83, column: 9, scope: !16)
!117 = !DILocalVariable(name: "cpu_flags", scope: !16, file: !17, line: 84, type: !26)
!118 = !DILocation(line: 84, column: 9, scope: !16)
!119 = !DILocation(line: 84, column: 21, scope: !16)
!120 = !DILocation(line: 97, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !16, file: !17, line: 97, column: 9)
!122 = !DILocation(line: 97, column: 9, scope: !16)
!123 = !DILocation(line: 98, column: 23, scope: !121)
!124 = !DILocation(line: 98, column: 9, scope: !121)
!125 = !DILocation(line: 99, column: 1, scope: !16)
!126 = distinct !DISubprogram(name: "perm_twiddles", scope: !17, file: !17, line: 33, type: !18, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !111)
!127 = !DILocalVariable(name: "s", arg: 1, scope: !126, file: !17, line: 33, type: !20)
!128 = !DILocation(line: 33, column: 42, scope: !126)
!129 = !DILocalVariable(name: "k", scope: !126, file: !17, line: 35, type: !26)
!130 = !DILocation(line: 35, column: 9, scope: !126)
!131 = !DILocalVariable(name: "tmp", scope: !126, file: !17, line: 36, type: !132)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1920, align: 32, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 30)
!135 = !DILocation(line: 36, column: 16, scope: !126)
!136 = !DILocation(line: 39, column: 43, scope: !126)
!137 = !DILocation(line: 39, column: 46, scope: !126)
!138 = !DILocation(line: 39, column: 57, scope: !126)
!139 = !DILocation(line: 39, column: 24, scope: !126)
!140 = !DILocation(line: 39, column: 27, scope: !126)
!141 = !DILocation(line: 39, column: 38, scope: !126)
!142 = !DILocation(line: 39, column: 41, scope: !126)
!143 = !DILocation(line: 39, column: 5, scope: !126)
!144 = !DILocation(line: 39, column: 8, scope: !126)
!145 = !DILocation(line: 39, column: 19, scope: !126)
!146 = !DILocation(line: 39, column: 22, scope: !126)
!147 = !DILocation(line: 40, column: 43, scope: !126)
!148 = !DILocation(line: 40, column: 46, scope: !126)
!149 = !DILocation(line: 40, column: 57, scope: !126)
!150 = !DILocation(line: 40, column: 24, scope: !126)
!151 = !DILocation(line: 40, column: 27, scope: !126)
!152 = !DILocation(line: 40, column: 38, scope: !126)
!153 = !DILocation(line: 40, column: 41, scope: !126)
!154 = !DILocation(line: 40, column: 5, scope: !126)
!155 = !DILocation(line: 40, column: 8, scope: !126)
!156 = !DILocation(line: 40, column: 19, scope: !126)
!157 = !DILocation(line: 40, column: 22, scope: !126)
!158 = !DILocation(line: 41, column: 43, scope: !126)
!159 = !DILocation(line: 41, column: 46, scope: !126)
!160 = !DILocation(line: 41, column: 57, scope: !126)
!161 = !DILocation(line: 41, column: 24, scope: !126)
!162 = !DILocation(line: 41, column: 27, scope: !126)
!163 = !DILocation(line: 41, column: 38, scope: !126)
!164 = !DILocation(line: 41, column: 41, scope: !126)
!165 = !DILocation(line: 41, column: 5, scope: !126)
!166 = !DILocation(line: 41, column: 8, scope: !126)
!167 = !DILocation(line: 41, column: 19, scope: !126)
!168 = !DILocation(line: 41, column: 22, scope: !126)
!169 = !DILocation(line: 42, column: 43, scope: !126)
!170 = !DILocation(line: 42, column: 46, scope: !126)
!171 = !DILocation(line: 42, column: 57, scope: !126)
!172 = !DILocation(line: 42, column: 24, scope: !126)
!173 = !DILocation(line: 42, column: 27, scope: !126)
!174 = !DILocation(line: 42, column: 38, scope: !126)
!175 = !DILocation(line: 42, column: 41, scope: !126)
!176 = !DILocation(line: 42, column: 5, scope: !126)
