; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msgsmdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--msgsmdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !889, !890}
!888 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!889 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !893, line: 221, size: 32, align: 8, elements: !894)
!893 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !892, file: !893, line: 221, baseType: !896, size: 32, align: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !897, line: 51, baseType: !889)
!897 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!898 = !{i32 2, !"Dwarf Version", i32 4}
!899 = !{i32 2, !"Debug Info Version", i32 3}
!900 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!901 = distinct !DISubprogram(name: "ff_msgsm_decode_block", scope: !902, file: !902, line: 29, type: !903, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1505)
!902 = !DIFile(filename: "libavcodec/msgsmdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!903 = !DISubroutineType(types: !904)
!904 = !{!888, !905, !1502, !1398, !888}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !908)
!908 = !{!909, !954, !955, !956, !1225, !1226, !1227, !1228, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1254, !1258, !1259, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1440, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !907, file: !35, line: 1561, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !914)
!914 = !{!915, !919, !924, !928, !929, !930, !931, !935, !941, !943, !947}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !913, file: !4, line: 72, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !913, file: !4, line: 78, baseType: !920, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!916, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !913, file: !4, line: 85, baseType: !925, size: 64, align: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !913, file: !4, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !913, file: !4, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !913, file: !4, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !913, file: !4, line: 113, baseType: !932, size: 64, align: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!923, !923, !923}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !913, file: !4, line: 123, baseType: !936, size: 64, align: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!939, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !913, file: !4, line: 130, baseType: !942, size: 32, align: 32, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !913, file: !4, line: 136, baseType: !944, size: 64, align: 64, offset: 512)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!942, !923}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !913, file: !4, line: 142, baseType: !948, size: 64, align: 64, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!888, !951, !923, !916, !888}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !907, file: !35, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !907, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !907, file: !35, line: 1565, baseType: !957, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !966, !975, !978, !981, !984, !989, !992, !993, !1001, !1002, !1003, !1005, !1009, !1015, !1020, !1024, !1025, !1075, !1196, !1200, !1201, !1205, !1209, !1214, !1218, !1219, !1220}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !35, line: 3475, baseType: !916, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !959, file: !35, line: 3480, baseType: !916, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !959, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !959, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !959, file: !35, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !959, file: !35, line: 3488, baseType: !967, size: 64, align: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !970, line: 61, baseType: !971)
!970 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !970, line: 58, size: 64, align: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !971, file: !970, line: 59, baseType: !888, size: 32, align: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !971, file: !970, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !959, file: !35, line: 3489, baseType: !976, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !959, file: !35, line: 3490, baseType: !979, size: 64, align: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !959, file: !35, line: 3491, baseType: !982, size: 64, align: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !959, file: !35, line: 3492, baseType: !985, size: 64, align: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !897, line: 55, baseType: !988)
!988 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !959, file: !35, line: 3493, baseType: !990, size: 8, align: 8, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !897, line: 48, baseType: !991)
!991 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !959, file: !35, line: 3494, baseType: !910, size: 64, align: 64, offset: 640)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !959, file: !35, line: 3495, baseType: !994, size: 64, align: 64, offset: 704)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !997, file: !35, line: 3402, baseType: !888, size: 32, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !35, line: 3403, baseType: !916, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !959, file: !35, line: 3507, baseType: !916, size: 64, align: 64, offset: 768)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !959, file: !35, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !35, line: 3517, baseType: !1004, size: 64, align: 64, offset: 896)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !959, file: !35, line: 3527, baseType: !1006, size: 64, align: 64, offset: 960)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!888, !905}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !959, file: !35, line: 3535, baseType: !1010, size: 64, align: 64, offset: 1024)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!888, !905, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !959, file: !35, line: 3541, baseType: !1016, size: 64, align: 64, offset: 1088)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1019)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !959, file: !35, line: 3549, baseType: !1021, size: 64, align: 64, offset: 1152)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !1004}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !959, file: !35, line: 3551, baseType: !1006, size: 64, align: 64, offset: 1216)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !959, file: !35, line: 3552, baseType: !1026, size: 64, align: 64, offset: 1280)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!888, !905, !1029, !888, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1033)
!1033 = !{!1034, !1037, !1038, !1039, !1040, !1072}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1032, file: !35, line: 3921, baseType: !1035, size: 16, align: 16)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !897, line: 49, baseType: !1036)
!1036 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1032, file: !35, line: 3922, baseType: !896, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1032, file: !35, line: 3923, baseType: !896, size: 32, align: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1032, file: !35, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1032, file: !35, line: 3925, baseType: !1041, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1061, !1065, !1067, !1068, !1070, !1071}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1044, file: !35, line: 3886, baseType: !888, size: 32, align: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1044, file: !35, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1044, file: !35, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1044, file: !35, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1044, file: !35, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1044, file: !35, line: 3897, baseType: !1052, size: 768, align: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1054)
!1054 = !{!1055, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !35, line: 3855, baseType: !1056, size: 512, align: 64)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 512, align: 64, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 8)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1053, file: !35, line: 3857, baseType: !1060, size: 256, align: 32, offset: 512)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1057)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1044, file: !35, line: 3903, baseType: !1062, size: 256, align: 64, offset: 960)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 256, align: 64, elements: !1063)
!1063 = !{!1064}
!1064 = !DISubrange(count: 4)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1044, file: !35, line: 3904, baseType: !1066, size: 128, align: 32, offset: 1216)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1063)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1044, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1044, file: !35, line: 3908, baseType: !1069, size: 64, align: 64, offset: 1408)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1044, file: !35, line: 3915, baseType: !1069, size: 64, align: 64, offset: 1472)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1044, file: !35, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1032, file: !35, line: 3926, baseType: !1073, size: 64, align: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !897, line: 40, baseType: !1074)
!1074 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !959, file: !35, line: 3564, baseType: !1076, size: 64, align: 64, offset: 1344)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!888, !905, !1079, !1113, !1195}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1082)
!1082 = !{!1083, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1109, !1110, !1111, !1112}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1081, file: !35, line: 1451, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1086, line: 94, baseType: !1087)
!1086 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1086, line: 81, size: 192, align: 64, elements: !1088)
!1088 = !{!1089, !1093, !1094}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1087, file: !1086, line: 82, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1086, line: 73, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1086, line: 73, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1086, line: 89, baseType: !1029, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !1086, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1081, file: !35, line: 1461, baseType: !1073, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1081, file: !35, line: 1467, baseType: !1073, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !35, line: 1468, baseType: !1029, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1081, file: !35, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1081, file: !35, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1081, file: !35, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1081, file: !35, line: 1479, baseType: !1102, size: 64, align: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !35, line: 1412, baseType: !1029, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !35, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1104, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1081, file: !35, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1081, file: !35, line: 1486, baseType: !1073, size: 64, align: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1081, file: !35, line: 1488, baseType: !1073, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1081, file: !35, line: 1497, baseType: !1073, size: 64, align: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1147, !1149, !1150, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1183, !1184, !1185, !1186, !1187, !1188, !1191, !1192, !1193, !1194}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !758, line: 282, baseType: !1056, size: 512, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1116, file: !758, line: 299, baseType: !1060, size: 256, align: 32, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1116, file: !758, line: 315, baseType: !1121, size: 64, align: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1116, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1116, file: !758, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1116, file: !758, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1116, file: !758, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1116, file: !758, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1116, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1116, file: !758, line: 356, baseType: !969, size: 64, align: 32, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !758, line: 361, baseType: !1073, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1116, file: !758, line: 369, baseType: !1073, size: 64, align: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1116, file: !758, line: 377, baseType: !1073, size: 64, align: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1116, file: !758, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1116, file: !758, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1116, file: !758, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1116, file: !758, line: 396, baseType: !923, size: 64, align: 64, offset: 1408)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1116, file: !758, line: 403, baseType: !1137, size: 512, align: 64, offset: 1472)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 512, align: 64, elements: !1057)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1116, file: !758, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1116, file: !758, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1116, file: !758, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1116, file: !758, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1116, file: !758, line: 435, baseType: !1073, size: 64, align: 64, offset: 2112)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1116, file: !758, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1116, file: !758, line: 445, baseType: !987, size: 64, align: 64, offset: 2240)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1116, file: !758, line: 459, baseType: !1146, size: 512, align: 64, offset: 2304)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, align: 64, elements: !1057)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1116, file: !758, line: 473, baseType: !1148, size: 64, align: 64, offset: 2816)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1116, file: !758, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1116, file: !758, line: 479, baseType: !1151, size: 64, align: 64, offset: 2944)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1164}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1154, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !758, line: 203, baseType: !1029, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !758, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1154, file: !758, line: 205, baseType: !1160, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1162, line: 86, baseType: !1163)
!1162 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1162, line: 86, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1154, file: !758, line: 206, baseType: !1084, size: 64, align: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1116, file: !758, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !758, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1116, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1116, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1116, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1116, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1116, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1116, file: !758, line: 532, baseType: !1073, size: 64, align: 64, offset: 3264)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1116, file: !758, line: 539, baseType: !1073, size: 64, align: 64, offset: 3328)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1116, file: !758, line: 547, baseType: !1073, size: 64, align: 64, offset: 3392)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1116, file: !758, line: 554, baseType: !1160, size: 64, align: 64, offset: 3456)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1116, file: !758, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1116, file: !758, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1116, file: !758, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1116, file: !758, line: 588, baseType: !1180, size: 64, align: 64, offset: 3648)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !897, line: 36, baseType: !1182)
!1182 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1116, file: !758, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1116, file: !758, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1116, file: !758, line: 599, baseType: !1084, size: 64, align: 64, offset: 3776)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1116, file: !758, line: 605, baseType: !1084, size: 64, align: 64, offset: 3840)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1116, file: !758, line: 616, baseType: !1084, size: 64, align: 64, offset: 3904)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1116, file: !758, line: 626, baseType: !1189, size: 64, align: 64, offset: 3968)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1190, line: 216, baseType: !988)
!1190 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1116, file: !758, line: 627, baseType: !1189, size: 64, align: 64, offset: 4032)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1116, file: !758, line: 628, baseType: !1189, size: 64, align: 64, offset: 4096)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1116, file: !758, line: 629, baseType: !1189, size: 64, align: 64, offset: 4160)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1116, file: !758, line: 645, baseType: !1084, size: 64, align: 64, offset: 4224)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !959, file: !35, line: 3566, baseType: !1197, size: 64, align: 64, offset: 1408)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!888, !905, !923, !1195, !1079}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !959, file: !35, line: 3567, baseType: !1006, size: 64, align: 64, offset: 1472)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !959, file: !35, line: 3576, baseType: !1202, size: 64, align: 64, offset: 1536)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!888, !905, !1113}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !959, file: !35, line: 3577, baseType: !1206, size: 64, align: 64, offset: 1600)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!888, !905, !1079}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !959, file: !35, line: 3584, baseType: !1210, size: 64, align: 64, offset: 1664)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!888, !905, !1213}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !959, file: !35, line: 3589, baseType: !1215, size: 64, align: 64, offset: 1728)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !905}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !959, file: !35, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !959, file: !35, line: 3600, baseType: !916, size: 64, align: 64, offset: 1856)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !959, file: !35, line: 3609, baseType: !1221, size: 64, align: 64, offset: 1920)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1224)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !907, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !907, file: !35, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !907, file: !35, line: 1583, baseType: !923, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !907, file: !35, line: 1591, baseType: !1229, size: 64, align: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !907, file: !35, line: 1598, baseType: !923, size: 64, align: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !907, file: !35, line: 1606, baseType: !1073, size: 64, align: 64, offset: 448)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !907, file: !35, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !907, file: !35, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !907, file: !35, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !907, file: !35, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !907, file: !35, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !907, file: !35, line: 1657, baseType: !1029, size: 64, align: 64, offset: 704)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !907, file: !35, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !907, file: !35, line: 1679, baseType: !969, size: 64, align: 32, offset: 800)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !907, file: !35, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !907, file: !35, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !907, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !907, file: !35, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !907, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !907, file: !35, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !907, file: !35, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !907, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !907, file: !35, line: 1791, baseType: !1250, size: 64, align: 64, offset: 1152)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !1253, !1113, !1195, !888, !888, !888}
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !907, file: !35, line: 1808, baseType: !1255, size: 64, align: 64, offset: 1216)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!494, !1253, !976}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !907, file: !35, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !907, file: !35, line: 1825, baseType: !1260, size: 32, align: 32, offset: 1312)
!1260 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !907, file: !35, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !907, file: !35, line: 1838, baseType: !1260, size: 32, align: 32, offset: 1376)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !907, file: !35, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !907, file: !35, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !907, file: !35, line: 1861, baseType: !1260, size: 32, align: 32, offset: 1472)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !907, file: !35, line: 1868, baseType: !1260, size: 32, align: 32, offset: 1504)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !907, file: !35, line: 1875, baseType: !1260, size: 32, align: 32, offset: 1536)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !907, file: !35, line: 1882, baseType: !1260, size: 32, align: 32, offset: 1568)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !907, file: !35, line: 1889, baseType: !1260, size: 32, align: 32, offset: 1600)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !907, file: !35, line: 1896, baseType: !1260, size: 32, align: 32, offset: 1632)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !907, file: !35, line: 1903, baseType: !1260, size: 32, align: 32, offset: 1664)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !907, file: !35, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !907, file: !35, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !907, file: !35, line: 1926, baseType: !1195, size: 64, align: 64, offset: 1792)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !907, file: !35, line: 1935, baseType: !969, size: 64, align: 32, offset: 1856)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !907, file: !35, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !907, file: !35, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !907, file: !35, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !907, file: !35, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !907, file: !35, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !907, file: !35, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !907, file: !35, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !907, file: !35, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !907, file: !35, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !907, file: !35, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !907, file: !35, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !907, file: !35, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !907, file: !35, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !907, file: !35, line: 2054, baseType: !1290, size: 64, align: 64, offset: 2368)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !907, file: !35, line: 2061, baseType: !1290, size: 64, align: 64, offset: 2432)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !907, file: !35, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !907, file: !35, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !907, file: !35, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !907, file: !35, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !907, file: !35, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !907, file: !35, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !907, file: !35, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !907, file: !35, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !907, file: !35, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !907, file: !35, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !907, file: !35, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !907, file: !35, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !907, file: !35, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !907, file: !35, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !907, file: !35, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !907, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !907, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !907, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !907, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !907, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !907, file: !35, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !907, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !907, file: !35, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !907, file: !35, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !907, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !907, file: !35, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !907, file: !35, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !907, file: !35, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !907, file: !35, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !907, file: !35, line: 2263, baseType: !987, size: 64, align: 64, offset: 3456)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !907, file: !35, line: 2270, baseType: !987, size: 64, align: 64, offset: 3520)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !907, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !907, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !907, file: !35, line: 2367, baseType: !1326, size: 64, align: 64, offset: 3648)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!888, !1253, !1213, !888}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !907, file: !35, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !907, file: !35, line: 2386, baseType: !1260, size: 32, align: 32, offset: 3744)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !907, file: !35, line: 2387, baseType: !1260, size: 32, align: 32, offset: 3776)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !907, file: !35, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !907, file: !35, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !907, file: !35, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !907, file: !35, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !907, file: !35, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !907, file: !35, line: 2423, baseType: !1338, size: 64, align: 64, offset: 3968)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1341)
!1341 = !{!1342, !1343, !1344, !1345}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1340, file: !35, line: 827, baseType: !888, size: 32, align: 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1340, file: !35, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1340, file: !35, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1340, file: !35, line: 830, baseType: !1260, size: 32, align: 32, offset: 96)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !907, file: !35, line: 2430, baseType: !1073, size: 64, align: 64, offset: 4032)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !907, file: !35, line: 2437, baseType: !1073, size: 64, align: 64, offset: 4096)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !907, file: !35, line: 2444, baseType: !1260, size: 32, align: 32, offset: 4160)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !907, file: !35, line: 2451, baseType: !1260, size: 32, align: 32, offset: 4192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !907, file: !35, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !907, file: !35, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !907, file: !35, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !907, file: !35, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !907, file: !35, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !907, file: !35, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !907, file: !35, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !907, file: !35, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !907, file: !35, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !907, file: !35, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !907, file: !35, line: 2514, baseType: !1073, size: 64, align: 64, offset: 4544)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !907, file: !35, line: 2528, baseType: !1362, size: 64, align: 64, offset: 4608)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !1253, !923, !888, !888}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !907, file: !35, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !907, file: !35, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !907, file: !35, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !907, file: !35, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !907, file: !35, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !907, file: !35, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !907, file: !35, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !907, file: !35, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !907, file: !35, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !907, file: !35, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !907, file: !35, line: 2571, baseType: !1069, size: 64, align: 64, offset: 4992)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !907, file: !35, line: 2579, baseType: !1069, size: 64, align: 64, offset: 5056)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !907, file: !35, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !907, file: !35, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !907, file: !35, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !907, file: !35, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !907, file: !35, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !907, file: !35, line: 2709, baseType: !1073, size: 64, align: 64, offset: 5312)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !907, file: !35, line: 2716, baseType: !1384, size: 64, align: 64, offset: 5376)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393, !1394, !1400, !1404, !1405, !1406, !1407, !1413, !1414, !1415, !1416, !1417}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1386, file: !35, line: 3642, baseType: !916, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1386, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1386, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1386, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1386, file: !35, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1386, file: !35, line: 3682, baseType: !1210, size: 64, align: 64, offset: 192)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1386, file: !35, line: 3698, baseType: !1395, size: 64, align: 64, offset: 256)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!888, !905, !1398, !896}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1386, file: !35, line: 3712, baseType: !1401, size: 64, align: 64, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!888, !905, !888, !1398, !896}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1386, file: !35, line: 3726, baseType: !1395, size: 64, align: 64, offset: 384)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1386, file: !35, line: 3737, baseType: !1006, size: 64, align: 64, offset: 448)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1386, file: !35, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1386, file: !35, line: 3757, baseType: !1408, size: 64, align: 64, offset: 576)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{null, !1411}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1386, file: !35, line: 3766, baseType: !1006, size: 64, align: 64, offset: 640)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1386, file: !35, line: 3774, baseType: !1006, size: 64, align: 64, offset: 704)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1386, file: !35, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1386, file: !35, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1386, file: !35, line: 3795, baseType: !1418, size: 64, align: 64, offset: 832)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!888, !905, !1084}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !907, file: !35, line: 2728, baseType: !923, size: 64, align: 64, offset: 5440)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !907, file: !35, line: 2735, baseType: !1137, size: 512, align: 64, offset: 5504)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !907, file: !35, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !907, file: !35, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !907, file: !35, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !907, file: !35, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !907, file: !35, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !907, file: !35, line: 2802, baseType: !1213, size: 64, align: 64, offset: 6208)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !907, file: !35, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !907, file: !35, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !907, file: !35, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !907, file: !35, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !907, file: !35, line: 2851, baseType: !1434, size: 64, align: 64, offset: 6400)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!888, !1253, !1437, !923, !1195, !888, !888}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!888, !1253, !923}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !907, file: !35, line: 2871, baseType: !1441, size: 64, align: 64, offset: 6464)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!888, !1253, !1444, !923, !1195, !888}
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!888, !1253, !923, !888, !888}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !907, file: !35, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !907, file: !35, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !907, file: !35, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !907, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !907, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !907, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !907, file: !35, line: 3037, baseType: !1029, size: 64, align: 64, offset: 6720)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !907, file: !35, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !907, file: !35, line: 3050, baseType: !987, size: 64, align: 64, offset: 6848)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !907, file: !35, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !907, file: !35, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !907, file: !35, line: 3092, baseType: !969, size: 64, align: 32, offset: 6976)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !907, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !907, file: !35, line: 3106, baseType: !969, size: 64, align: 32, offset: 7072)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !907, file: !35, line: 3113, baseType: !1462, size: 64, align: 64, offset: 7168)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1464)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1466)
!1466 = !{!1467, !1468, !1469, !1470, !1471, !1472, !1475}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1465, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1465, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1465, file: !35, line: 720, baseType: !916, size: 64, align: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1465, file: !35, line: 724, baseType: !916, size: 64, align: 64, offset: 128)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1465, file: !35, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1465, file: !35, line: 734, baseType: !1473, size: 64, align: 64, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1465, file: !35, line: 739, baseType: !1476, size: 64, align: 64, offset: 320)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !907, file: !35, line: 3129, baseType: !1073, size: 64, align: 64, offset: 7232)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !907, file: !35, line: 3130, baseType: !1073, size: 64, align: 64, offset: 7296)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !907, file: !35, line: 3131, baseType: !1073, size: 64, align: 64, offset: 7360)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !907, file: !35, line: 3132, baseType: !1073, size: 64, align: 64, offset: 7424)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !907, file: !35, line: 3139, baseType: !1069, size: 64, align: 64, offset: 7488)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !907, file: !35, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !907, file: !35, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !907, file: !35, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !907, file: !35, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !907, file: !35, line: 3191, baseType: !1290, size: 64, align: 64, offset: 7680)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !907, file: !35, line: 3199, baseType: !1029, size: 64, align: 64, offset: 7744)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !907, file: !35, line: 3207, baseType: !1069, size: 64, align: 64, offset: 7808)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !907, file: !35, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !907, file: !35, line: 3224, baseType: !1102, size: 64, align: 64, offset: 7936)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !907, file: !35, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !907, file: !35, line: 3249, baseType: !1084, size: 64, align: 64, offset: 8064)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !907, file: !35, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !907, file: !35, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !907, file: !35, line: 3279, baseType: !1073, size: 64, align: 64, offset: 8192)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !907, file: !35, line: 3301, baseType: !1084, size: 64, align: 64, offset: 8256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !907, file: !35, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !907, file: !35, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !907, file: !35, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !907, file: !35, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !897, line: 37, baseType: !1504)
!1504 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1505 = !{}
!1506 = !DILocalVariable(name: "avctx", arg: 1, scope: !901, file: !902, line: 29, type: !905)
!1507 = !DIExpression()
!1508 = !DILocation(line: 29, column: 43, scope: !901)
!1509 = !DILocalVariable(name: "samples", arg: 2, scope: !901, file: !902, line: 29, type: !1502)
!1510 = !DILocation(line: 29, column: 59, scope: !901)
!1511 = !DILocalVariable(name: "buf", arg: 3, scope: !901, file: !902, line: 30, type: !1398)
!1512 = !DILocation(line: 30, column: 42, scope: !901)
!1513 = !DILocalVariable(name: "mode", arg: 4, scope: !901, file: !902, line: 30, type: !888)
!1514 = !DILocation(line: 30, column: 51, scope: !901)
!1515 = !DILocalVariable(name: "res", scope: !901, file: !902, line: 32, type: !888)
!1516 = !DILocation(line: 32, column: 9, scope: !901)
!1517 = !DILocalVariable(name: "gb", scope: !901, file: !902, line: 33, type: !1518)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1519, line: 70, baseType: !1520)
!1519 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1519, line: 61, size: 256, align: 64, elements: !1521)
!1521 = !{!1522, !1523, !1524, !1525, !1526}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1520, file: !1519, line: 62, baseType: !1398, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1520, file: !1519, line: 62, baseType: !1398, size: 64, align: 64, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1520, file: !1519, line: 67, baseType: !888, size: 32, align: 32, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1520, file: !1519, line: 68, baseType: !888, size: 32, align: 32, offset: 160)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1520, file: !1519, line: 69, baseType: !888, size: 32, align: 32, offset: 192)
!1527 = !DILocation(line: 33, column: 19, scope: !901)
!1528 = !DILocation(line: 34, column: 24, scope: !901)
!1529 = !DILocation(line: 34, column: 5, scope: !901)
!1530 = !DILocation(line: 35, column: 28, scope: !901)
!1531 = !DILocation(line: 35, column: 35, scope: !901)
!1532 = !DILocation(line: 35, column: 49, scope: !901)
!1533 = !DILocation(line: 35, column: 11, scope: !901)
!1534 = !DILocation(line: 35, column: 9, scope: !901)
!1535 = !DILocation(line: 36, column: 9, scope: !1536)
!1536 = distinct !DILexicalBlock(scope: !901, file: !902, line: 36, column: 9)
!1537 = !DILocation(line: 36, column: 13, scope: !1536)
!1538 = !DILocation(line: 36, column: 9, scope: !901)
!1539 = !DILocation(line: 37, column: 16, scope: !1536)
!1540 = !DILocation(line: 37, column: 9, scope: !1536)
!1541 = !DILocation(line: 38, column: 29, scope: !901)
!1542 = !DILocation(line: 38, column: 36, scope: !901)
!1543 = !DILocation(line: 38, column: 44, scope: !901)
!1544 = !DILocation(line: 38, column: 56, scope: !901)
!1545 = !DILocation(line: 38, column: 12, scope: !901)
!1546 = !DILocation(line: 38, column: 5, scope: !901)
!1547 = !DILocation(line: 39, column: 1, scope: !901)
!1548 = distinct !DISubprogram(name: "init_get_bits", scope: !1519, file: !1519, line: 615, type: !1549, isLocal: true, isDefinition: true, scopeLine: 617, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1505)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!888, !1551, !1398, !888}
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1552 = !DILocalVariable(name: "s", arg: 1, scope: !1548, file: !1519, line: 615, type: !1551)
!1553 = !DILocation(line: 615, column: 48, scope: !1548)
!1554 = !DILocalVariable(name: "buffer", arg: 2, scope: !1548, file: !1519, line: 615, type: !1398)
!1555 = !DILocation(line: 615, column: 66, scope: !1548)
!1556 = !DILocalVariable(name: "bit_size", arg: 3, scope: !1548, file: !1519, line: 616, type: !888)
!1557 = !DILocation(line: 616, column: 37, scope: !1548)
!1558 = !DILocalVariable(name: "buffer_size", scope: !1548, file: !1519, line: 618, type: !888)
!1559 = !DILocation(line: 618, column: 9, scope: !1548)
!1560 = !DILocalVariable(name: "ret", scope: !1548, file: !1519, line: 619, type: !888)
!1561 = !DILocation(line: 619, column: 9, scope: !1548)
!1562 = !DILocation(line: 621, column: 9, scope: !1563)
!1563 = distinct !DILexicalBlock(scope: !1548, file: !1519, line: 621, column: 9)
!1564 = !DILocation(line: 621, column: 18, scope: !1563)
!1565 = !DILocation(line: 621, column: 64, scope: !1563)
!1566 = !DILocation(line: 621, column: 67, scope: !1567)
!1567 = !DILexicalBlockFile(scope: !1563, file: !1519, discriminator: 1)
!1568 = !DILocation(line: 621, column: 76, scope: !1567)
!1569 = !DILocation(line: 621, column: 80, scope: !1567)
!1570 = !DILocation(line: 621, column: 84, scope: !1571)
!1571 = !DILexicalBlockFile(scope: !1563, file: !1519, discriminator: 2)
!1572 = !DILocation(line: 621, column: 9, scope: !1571)
!1573 = !DILocation(line: 622, column: 18, scope: !1574)
!1574 = distinct !DILexicalBlock(scope: !1563, file: !1519, line: 621, column: 92)
!1575 = !DILocation(line: 623, column: 16, scope: !1574)
!1576 = !DILocation(line: 624, column: 13, scope: !1574)
!1577 = !DILocation(line: 625, column: 5, scope: !1574)
!1578 = !DILocation(line: 627, column: 20, scope: !1548)
!1579 = !DILocation(line: 627, column: 29, scope: !1548)
!1580 = !DILocation(line: 627, column: 34, scope: !1548)
!1581 = !DILocation(line: 627, column: 17, scope: !1548)
!1582 = !DILocation(line: 629, column: 17, scope: !1548)
!1583 = !DILocation(line: 629, column: 5, scope: !1548)
!1584 = !DILocation(line: 629, column: 8, scope: !1548)
!1585 = !DILocation(line: 629, column: 15, scope: !1548)
!1586 = !DILocation(line: 630, column: 23, scope: !1548)
!1587 = !DILocation(line: 630, column: 5, scope: !1548)
!1588 = !DILocation(line: 630, column: 8, scope: !1548)
!1589 = !DILocation(line: 630, column: 21, scope: !1548)
!1590 = !DILocation(line: 631, column: 29, scope: !1548)
!1591 = !DILocation(line: 631, column: 38, scope: !1548)
!1592 = !DILocation(line: 631, column: 5, scope: !1548)
!1593 = !DILocation(line: 631, column: 8, scope: !1548)
!1594 = !DILocation(line: 631, column: 27, scope: !1548)
!1595 = !DILocation(line: 632, column: 21, scope: !1548)
!1596 = !DILocation(line: 632, column: 30, scope: !1548)
!1597 = !DILocation(line: 632, column: 28, scope: !1548)
!1598 = !DILocation(line: 632, column: 5, scope: !1548)
!1599 = !DILocation(line: 632, column: 8, scope: !1548)
!1600 = !DILocation(line: 632, column: 19, scope: !1548)
!1601 = !DILocation(line: 633, column: 5, scope: !1548)
!1602 = !DILocation(line: 633, column: 8, scope: !1548)
!1603 = !DILocation(line: 633, column: 14, scope: !1548)
!1604 = !DILocation(line: 639, column: 12, scope: !1548)
!1605 = !DILocation(line: 639, column: 5, scope: !1548)
!1606 = distinct !DISubprogram(name: "gsm_decode_block", scope: !1607, file: !1607, line: 122, type: !1608, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1505)
!1607 = !DIFile(filename: "libavcodec/gsmdec_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!888, !905, !1502, !1551, !888}
!1610 = !DILocalVariable(name: "a", arg: 1, scope: !1611, file: !1612, line: 127, type: !888)
!1611 = distinct !DISubprogram(name: "av_clip_c", scope: !1612, file: !1612, line: 127, type: !1613, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1505)
!1612 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!888, !888, !888, !888}
!1615 = !DILocation(line: 127, column: 87, scope: !1611, inlinedAt: !1616)
!1616 = distinct !DILocation(line: 142, column: 15, scope: !1617)
!1617 = distinct !DILexicalBlock(scope: !1618, file: !1607, line: 138, column: 29)
!1618 = distinct !DILexicalBlock(scope: !1619, file: !1607, line: 138, column: 5)
!1619 = distinct !DILexicalBlock(scope: !1606, file: !1607, line: 138, column: 5)
!1620 = !DILocalVariable(name: "amin", arg: 2, scope: !1611, file: !1612, line: 127, type: !888)
!1621 = !DILocation(line: 127, column: 94, scope: !1611, inlinedAt: !1616)
!1622 = !DILocalVariable(name: "amax", arg: 3, scope: !1611, file: !1612, line: 127, type: !888)
!1623 = !DILocation(line: 127, column: 104, scope: !1611, inlinedAt: !1616)
!1624 = !DILocalVariable(name: "avctx", arg: 1, scope: !1606, file: !1607, line: 122, type: !905)
!1625 = !DILocation(line: 122, column: 45, scope: !1606)
!1626 = !DILocalVariable(name: "samples", arg: 2, scope: !1606, file: !1607, line: 122, type: !1502)
!1627 = !DILocation(line: 122, column: 61, scope: !1606)
!1628 = !DILocalVariable(name: "gb", arg: 3, scope: !1606, file: !1607, line: 123, type: !1551)
!1629 = !DILocation(line: 123, column: 44, scope: !1606)
!1630 = !DILocalVariable(name: "mode", arg: 4, scope: !1606, file: !1607, line: 123, type: !888)
!1631 = !DILocation(line: 123, column: 52, scope: !1606)
!1632 = !DILocalVariable(name: "ctx", scope: !1606, file: !1607, line: 125, type: !1633)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSMContext", file: !1635, line: 38, baseType: !1636)
!1635 = !DIFile(filename: "libavcodec/gsmdec_data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GSMContext", file: !1635, line: 28, size: 5344, align: 32, elements: !1637)
!1637 = !{!1638, !1642, !1646, !1650, !1651}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "ref_buf", scope: !1636, file: !1635, line: 33, baseType: !1639, size: 4480, align: 16)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1503, size: 4480, align: 16, elements: !1640)
!1640 = !{!1641}
!1641 = !DISubrange(count: 280)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1636, file: !1635, line: 34, baseType: !1643, size: 288, align: 32, offset: 4480)
!1643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 288, align: 32, elements: !1644)
!1644 = !{!1645}
!1645 = !DISubrange(count: 9)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "lar", scope: !1636, file: !1635, line: 35, baseType: !1647, size: 512, align: 32, offset: 4768)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 512, align: 32, elements: !1648)
!1648 = !{!1649, !1058}
!1649 = !DISubrange(count: 2)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "lar_idx", scope: !1636, file: !1635, line: 36, baseType: !888, size: 32, align: 32, offset: 5280)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "msr", scope: !1636, file: !1635, line: 37, baseType: !888, size: 32, align: 32, offset: 5312)
!1652 = !DILocation(line: 125, column: 17, scope: !1606)
!1653 = !DILocation(line: 125, column: 23, scope: !1606)
!1654 = !DILocation(line: 125, column: 30, scope: !1606)
!1655 = !DILocalVariable(name: "i", scope: !1606, file: !1607, line: 126, type: !888)
!1656 = !DILocation(line: 126, column: 9, scope: !1606)
!1657 = !DILocalVariable(name: "ref_dst", scope: !1606, file: !1607, line: 127, type: !1502)
!1658 = !DILocation(line: 127, column: 14, scope: !1606)
!1659 = !DILocation(line: 127, column: 24, scope: !1606)
!1660 = !DILocation(line: 127, column: 29, scope: !1606)
!1661 = !DILocation(line: 127, column: 37, scope: !1606)
!1662 = !DILocalVariable(name: "lar", scope: !1606, file: !1607, line: 128, type: !1195)
!1663 = !DILocation(line: 128, column: 10, scope: !1606)
!1664 = !DILocation(line: 128, column: 25, scope: !1606)
!1665 = !DILocation(line: 128, column: 30, scope: !1606)
!1666 = !DILocation(line: 128, column: 16, scope: !1606)
!1667 = !DILocation(line: 128, column: 21, scope: !1606)
!1668 = !DILocation(line: 129, column: 39, scope: !1606)
!1669 = !DILocation(line: 129, column: 30, scope: !1606)
!1670 = !DILocation(line: 129, column: 14, scope: !1671)
!1671 = !DILexicalBlockFile(scope: !1606, file: !1607, discriminator: 1)
!1672 = !DILocation(line: 129, column: 5, scope: !1606)
!1673 = !DILocation(line: 129, column: 12, scope: !1606)
!1674 = !DILocation(line: 130, column: 39, scope: !1606)
!1675 = !DILocation(line: 130, column: 30, scope: !1606)
!1676 = !DILocation(line: 130, column: 14, scope: !1671)
!1677 = !DILocation(line: 130, column: 5, scope: !1606)
!1678 = !DILocation(line: 130, column: 12, scope: !1606)
!1679 = !DILocation(line: 131, column: 39, scope: !1606)
!1680 = !DILocation(line: 131, column: 30, scope: !1606)
!1681 = !DILocation(line: 131, column: 14, scope: !1671)
!1682 = !DILocation(line: 131, column: 5, scope: !1606)
!1683 = !DILocation(line: 131, column: 12, scope: !1606)
!1684 = !DILocation(line: 132, column: 39, scope: !1606)
!1685 = !DILocation(line: 132, column: 30, scope: !1606)
!1686 = !DILocation(line: 132, column: 14, scope: !1671)
!1687 = !DILocation(line: 132, column: 5, scope: !1606)
!1688 = !DILocation(line: 132, column: 12, scope: !1606)
!1689 = !DILocation(line: 133, column: 39, scope: !1606)
!1690 = !DILocation(line: 133, column: 30, scope: !1606)
!1691 = !DILocation(line: 133, column: 14, scope: !1671)
!1692 = !DILocation(line: 133, column: 5, scope: !1606)
!1693 = !DILocation(line: 133, column: 12, scope: !1606)
!1694 = !DILocation(line: 134, column: 39, scope: !1606)
!1695 = !DILocation(line: 134, column: 30, scope: !1606)
!1696 = !DILocation(line: 134, column: 14, scope: !1671)
!1697 = !DILocation(line: 134, column: 5, scope: !1606)
!1698 = !DILocation(line: 134, column: 12, scope: !1606)
!1699 = !DILocation(line: 135, column: 39, scope: !1606)
!1700 = !DILocation(line: 135, column: 30, scope: !1606)
!1701 = !DILocation(line: 135, column: 14, scope: !1671)
!1702 = !DILocation(line: 135, column: 5, scope: !1606)
!1703 = !DILocation(line: 135, column: 12, scope: !1606)
!1704 = !DILocation(line: 136, column: 39, scope: !1606)
!1705 = !DILocation(line: 136, column: 30, scope: !1606)
!1706 = !DILocation(line: 136, column: 14, scope: !1671)
!1707 = !DILocation(line: 136, column: 5, scope: !1606)
!1708 = !DILocation(line: 136, column: 12, scope: !1606)
!1709 = !DILocation(line: 138, column: 12, scope: !1619)
!1710 = !DILocation(line: 138, column: 10, scope: !1619)
!1711 = !DILocation(line: 138, column: 17, scope: !1712)
!1712 = !DILexicalBlockFile(scope: !1618, file: !1607, discriminator: 1)
!1713 = !DILocation(line: 138, column: 19, scope: !1712)
!1714 = !DILocation(line: 138, column: 5, scope: !1712)
!1715 = !DILocalVariable(name: "lag", scope: !1617, file: !1607, line: 139, type: !888)
!1716 = !DILocation(line: 139, column: 13, scope: !1617)
