; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--utils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }

!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVHWDeviceType", file: !926, line: 27, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "./libavutil/hwcontext.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!928 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_NONE", value: 0)
!929 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VDPAU", value: 1)
!930 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_CUDA", value: 2)
!931 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VAAPI", value: 3)
!932 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DXVA2", value: 4)
!933 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_QSV", value: 5)
!934 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VIDEOTOOLBOX", value: 6)
!935 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_D3D11VA", value: 7)
!936 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DRM", value: 8)
!937 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_OPENCL", value: 9)
!938 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_MEDIACODEC", value: 10)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMatrixEncoding", file: !940, line: 114, size: 32, align: 32, elements: !941)
!940 = !DIFile(filename: "./libavutil/channel_layout.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949}
!942 = !DIEnumerator(name: "AV_MATRIX_ENCODING_NONE", value: 0)
!943 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBY", value: 1)
!944 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLII", value: 2)
!945 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLIIX", value: 3)
!946 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLIIZ", value: 4)
!947 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBYEX", value: 5)
!948 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBYHEADPHONE", value: 6)
!949 = !DIEnumerator(name: "AV_MATRIX_ENCODING_NB", value: 7)
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVLockOp", file: !14, line: 6113, size: 32, align: 32, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIEnumerator(name: "AV_LOCK_CREATE", value: 0)
!953 = !DIEnumerator(name: "AV_LOCK_OBTAIN", value: 1)
!954 = !DIEnumerator(name: "AV_LOCK_RELEASE", value: 2)
!955 = !DIEnumerator(name: "AV_LOCK_DESTROY", value: 3)
!956 = !{!957, !958, !962, !964, !965, !968, !970, !1054, !1109, !977, !991, !997, !1111, !1112, !1119}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !960, line: 48, baseType: !961)
!960 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!961 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !960, line: 119, baseType: !963)
!963 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !960, line: 49, baseType: !967)
!967 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !975)
!975 = !{!976, !979, !983, !1013, !1014, !1015, !1016, !1020, !1026, !1028, !1032}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !974, file: !713, line: 72, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !974, file: !713, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!977, !964}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !974, file: !713, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !987)
!987 = !{!988, !989, !990, !992, !993, !1009, !1010, !1011, !1012}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !691, line: 247, baseType: !977, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !986, file: !691, line: 253, baseType: !977, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !986, file: !691, line: 259, baseType: !991, size: 32, align: 32, offset: 128)
!991 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !986, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !986, file: !691, line: 271, baseType: !994, size: 64, align: 64, offset: 192)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !691, line: 265, size: 64, align: 64, elements: !995)
!995 = !{!996, !999, !1001, !1002}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !994, file: !691, line: 266, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !998, line: 197, baseType: !963)
!998 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!999 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !994, file: !691, line: 267, baseType: !1000, size: 64, align: 64)
!1000 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !994, file: !691, line: 268, baseType: !977, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !994, file: !691, line: 270, baseType: !1003, size: 64, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1004, line: 61, baseType: !1005)
!1004 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1004, line: 58, size: 64, align: 32, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1005, file: !1004, line: 59, baseType: !991, size: 32, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1005, file: !1004, line: 60, baseType: !991, size: 32, align: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !986, file: !691, line: 272, baseType: !1000, size: 64, align: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !986, file: !691, line: 273, baseType: !1000, size: 64, align: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !691, line: 275, baseType: !991, size: 32, align: 32, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !986, file: !691, line: 300, baseType: !977, size: 64, align: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !974, file: !713, line: 93, baseType: !991, size: 32, align: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !974, file: !713, line: 99, baseType: !991, size: 32, align: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !974, file: !713, line: 108, baseType: !991, size: 32, align: 32, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !974, file: !713, line: 113, baseType: !1017, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!964, !964, !964}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !974, file: !713, line: 123, baseType: !1021, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !974, file: !713, line: 130, baseType: !1027, size: 32, align: 32, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !974, file: !713, line: 136, baseType: !1029, size: 64, align: 64, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1027, !964}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !974, file: !713, line: 142, baseType: !1033, size: 64, align: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!991, !1036, !964, !977, !991}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1039)
!1039 = !{!1040, !1052, !1053}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1038, file: !691, line: 360, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1044, file: !691, line: 307, baseType: !977, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1044, file: !691, line: 313, baseType: !1000, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1044, file: !691, line: 313, baseType: !1000, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1044, file: !691, line: 318, baseType: !1000, size: 64, align: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1044, file: !691, line: 318, baseType: !1000, size: 64, align: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1044, file: !691, line: 323, baseType: !991, size: 32, align: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1038, file: !691, line: 364, baseType: !991, size: 32, align: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1038, file: !691, line: 368, baseType: !991, size: 32, align: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesContext", file: !926, line: 229, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesContext", file: !926, line: 123, size: 704, align: 64, elements: !1057)
!1057 = !{!1058, !1059, !1063, !1075, !1093, !1094, !1099, !1100, !1104, !1105, !1106, !1107, !1108}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1056, file: !926, line: 127, baseType: !971, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1056, file: !926, line: 133, baseType: !1060, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesInternal", file: !926, line: 111, baseType: !1062)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesInternal", file: !926, line: 111, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "device_ref", scope: !1056, file: !926, line: 140, baseType: !1064, size: 64, align: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1066, line: 94, baseType: !1067)
!1066 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1066, line: 81, size: 192, align: 64, elements: !1068)
!1068 = !{!1069, !1073, !1074}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1067, file: !1066, line: 82, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1066, line: 73, baseType: !1072)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1066, line: 73, flags: DIFlagFwdDecl)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1067, file: !1066, line: 89, baseType: !958, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1067, file: !1066, line: 93, baseType: !991, size: 32, align: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "device_ctx", scope: !1056, file: !926, line: 148, baseType: !1076, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceContext", file: !926, line: 109, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceContext", file: !926, line: 60, size: 384, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1085, !1086, !1087, !1092}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1078, file: !926, line: 64, baseType: !971, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1078, file: !926, line: 70, baseType: !1082, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceInternal", file: !926, line: 41, baseType: !1084)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceInternal", file: !926, line: 41, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1078, file: !926, line: 78, baseType: !925, size: 32, align: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !1078, file: !926, line: 91, baseType: !964, size: 64, align: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1078, file: !926, line: 103, baseType: !1088, size: 64, align: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !1078, file: !926, line: 108, baseType: !964, size: 64, align: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !1056, file: !926, line: 161, baseType: !964, size: 64, align: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1056, file: !926, line: 169, baseType: !1095, size: 64, align: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !1056, file: !926, line: 174, baseType: !964, size: 64, align: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1056, file: !926, line: 189, baseType: !1101, size: 64, align: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1066, line: 238, baseType: !1103)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1066, line: 238, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "initial_pool_size", scope: !1056, file: !926, line: 198, baseType: !991, size: 32, align: 32, offset: 512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1056, file: !926, line: 208, baseType: !473, size: 32, align: 32, offset: 544)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "sw_format", scope: !1056, file: !926, line: 221, baseType: !473, size: 32, align: 32, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1056, file: !926, line: 228, baseType: !991, size: 32, align: 32, offset: 608)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1056, file: !926, line: 228, baseType: !991, size: 32, align: 32, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !1110, line: 29, baseType: !964)
!1110 = !DIFile(filename: "/usr/include/iconv.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1111 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1115, line: 221, size: 32, align: 8, elements: !1116)
!1115 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1114, file: !1115, line: 221, baseType: !1118, size: 32, align: 32)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !960, line: 51, baseType: !1111)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1120 = !{!1121, !1126, !1136}
!1121 = distinct !DIGlobalVariable(name: "av_codec_ffversion", scope: !0, file: !1122, line: 66, type: !1123, isLocal: false, isDefinition: true, variable: [32 x i8]* @av_codec_ffversion)
!1122 = !DIFile(filename: "libavcodec/utils.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 256, align: 8, elements: !1124)
!1124 = !{!1125}
!1125 = !DISubrange(count: 32)
!1126 = distinct !DIGlobalVariable(name: "map", scope: !1127, file: !1122, line: 1488, type: !1131, isLocal: true, isDefinition: true, variable: [12 x [2 x i32]]* @av_get_pcm_codec.map)
!1127 = distinct !DISubprogram(name: "av_get_pcm_codec", scope: !1122, file: !1122, line: 1486, type: !1128, isLocal: false, isDefinition: true, scopeLine: 1487, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1130)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!13, !673, !991}
!1130 = !{}
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 768, align: 32, elements: !1133)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1133 = !{!1134, !1135}
!1134 = !DISubrange(count: 12)
!1135 = !DISubrange(count: 2)
!1136 = distinct !DIGlobalVariable(name: "codec_mutex", scope: !0, file: !1122, line: 68, type: !1137, isLocal: true, isDefinition: true, variable: %union.pthread_mutex_t* @codec_mutex)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1138, line: 128, baseType: !1139)
!1138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1139 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1138, line: 90, size: 320, align: 64, elements: !1140)
!1140 = !{!1141, !1159, !1163}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1139, file: !1138, line: 125, baseType: !1142, size: 320, align: 64)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1138, line: 92, size: 320, align: 64, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1151, !1152}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1142, file: !1138, line: 94, baseType: !991, size: 32, align: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1142, file: !1138, line: 95, baseType: !1111, size: 32, align: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1142, file: !1138, line: 96, baseType: !991, size: 32, align: 32, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1142, file: !1138, line: 98, baseType: !1111, size: 32, align: 32, offset: 96)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1142, file: !1138, line: 102, baseType: !991, size: 32, align: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1142, file: !1138, line: 104, baseType: !1150, size: 16, align: 16, offset: 160)
!1150 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1142, file: !1138, line: 105, baseType: !1150, size: 16, align: 16, offset: 176)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1142, file: !1138, line: 106, baseType: !1153, size: 128, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1138, line: 79, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1138, line: 75, size: 128, align: 64, elements: !1155)
!1155 = !{!1156, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1154, file: !1138, line: 77, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1154, file: !1138, line: 78, baseType: !1157, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1139, file: !1138, line: 126, baseType: !1160, size: 320, align: 8)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 320, align: 8, elements: !1161)
!1161 = !{!1162}
!1162 = !DISubrange(count: 40)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1139, file: !1138, line: 127, baseType: !963, size: 64, align: 64)
!1164 = !{i32 2, !"Dwarf Version", i32 4}
!1165 = !{i32 2, !"Debug Info Version", i32 3}
!1166 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1167 = distinct !DISubprogram(name: "av_fast_padded_malloc", scope: !1122, file: !1122, line: 70, type: !1168, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1130)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !964, !1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1172, line: 216, baseType: !1173)
!1172 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1173 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1174 = !DILocalVariable(name: "ptr", arg: 1, scope: !1167, file: !1122, line: 70, type: !964)
!1175 = !DIExpression()
!1176 = !DILocation(line: 70, column: 34, scope: !1167)
!1177 = !DILocalVariable(name: "size", arg: 2, scope: !1167, file: !1122, line: 70, type: !1170)
!1178 = !DILocation(line: 70, column: 53, scope: !1167)
!1179 = !DILocalVariable(name: "min_size", arg: 3, scope: !1167, file: !1122, line: 70, type: !1171)
!1180 = !DILocation(line: 70, column: 66, scope: !1167)
!1181 = !DILocalVariable(name: "p", scope: !1167, file: !1122, line: 72, type: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1183 = !DILocation(line: 72, column: 15, scope: !1167)
!1184 = !DILocation(line: 72, column: 19, scope: !1167)
!1185 = !DILocation(line: 73, column: 9, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1167, file: !1122, line: 73, column: 9)
!1187 = !DILocation(line: 73, column: 18, scope: !1186)
!1188 = !DILocation(line: 73, column: 9, scope: !1167)
!1189 = !DILocation(line: 74, column: 18, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1186, file: !1122, line: 73, column: 34)
!1191 = !DILocation(line: 74, column: 9, scope: !1190)
!1192 = !DILocation(line: 75, column: 10, scope: !1190)
!1193 = !DILocation(line: 75, column: 15, scope: !1190)
!1194 = !DILocation(line: 76, column: 9, scope: !1190)
!1195 = !DILocation(line: 78, column: 25, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1167, file: !1122, line: 78, column: 9)
!1197 = !DILocation(line: 78, column: 28, scope: !1196)
!1198 = !DILocation(line: 78, column: 34, scope: !1196)
!1199 = !DILocation(line: 78, column: 43, scope: !1196)
!1200 = !DILocation(line: 78, column: 10, scope: !1196)
!1201 = !DILocation(line: 78, column: 9, scope: !1167)
!1202 = !DILocation(line: 79, column: 17, scope: !1196)
!1203 = !DILocation(line: 79, column: 16, scope: !1196)
!1204 = !DILocation(line: 79, column: 21, scope: !1196)
!1205 = !DILocation(line: 79, column: 19, scope: !1196)
!1206 = !DILocation(line: 79, column: 9, scope: !1196)
!1207 = !DILocation(line: 80, column: 1, scope: !1167)
!1208 = distinct !DISubprogram(name: "ff_fast_malloc", scope: !1209, file: !1209, line: 27, type: !1210, isLocal: true, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1130)
!1209 = !DIFile(filename: "./libavutil/mem_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!991, !964, !1170, !1171, !991}
!1212 = !DILocalVariable(name: "ptr", arg: 1, scope: !1208, file: !1209, line: 27, type: !964)
!1213 = !DILocation(line: 27, column: 40, scope: !1208)
!1214 = !DILocalVariable(name: "size", arg: 2, scope: !1208, file: !1209, line: 27, type: !1170)
!1215 = !DILocation(line: 27, column: 59, scope: !1208)
!1216 = !DILocalVariable(name: "min_size", arg: 3, scope: !1208, file: !1209, line: 27, type: !1171)
!1217 = !DILocation(line: 27, column: 72, scope: !1208)
!1218 = !DILocalVariable(name: "zero_realloc", arg: 4, scope: !1208, file: !1209, line: 27, type: !991)
!1219 = !DILocation(line: 27, column: 86, scope: !1208)
!1220 = !DILocalVariable(name: "val", scope: !1208, file: !1209, line: 29, type: !964)
!1221 = !DILocation(line: 29, column: 11, scope: !1208)
!1222 = !DILocation(line: 31, column: 5, scope: !1208)
!1223 = !DILocation(line: 31, column: 18, scope: !1208)
!1224 = !DILocation(line: 32, column: 9, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1208, file: !1209, line: 32, column: 9)
!1226 = !DILocation(line: 32, column: 22, scope: !1225)
!1227 = !DILocation(line: 32, column: 21, scope: !1225)
!1228 = !DILocation(line: 32, column: 18, scope: !1225)
!1229 = !DILocation(line: 32, column: 9, scope: !1208)
!1230 = !DILocation(line: 33, column: 9, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1225, file: !1209, line: 32, column: 28)
!1232 = distinct !{!1232, !1230}
!1233 = !DILocation(line: 33, column: 20, scope: !1234)
!1234 = !DILexicalBlockFile(scope: !1235, file: !1209, discriminator: 1)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !1209, line: 33, column: 18)
!1236 = distinct !DILexicalBlock(scope: !1231, file: !1209, line: 33, column: 12)
!1237 = !DILocation(line: 33, column: 24, scope: !1234)
!1238 = !DILocation(line: 33, column: 28, scope: !1239)
!1239 = !DILexicalBlockFile(scope: !1235, file: !1209, discriminator: 2)
!1240 = !DILocation(line: 33, column: 18, scope: !1239)
!1241 = !DILocation(line: 33, column: 41, scope: !1242)
!1242 = !DILexicalBlockFile(scope: !1243, file: !1209, discriminator: 3)
!1243 = distinct !DILexicalBlock(scope: !1235, file: !1209, line: 33, column: 39)
!1244 = !DILocation(line: 33, column: 102, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1242, file: !1209, discriminator: 5)
!1246 = !DILocation(line: 33, column: 102, scope: !1242)
!1247 = !DILocation(line: 33, column: 113, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !1236, file: !1209, discriminator: 4)
!1249 = !DILocation(line: 34, column: 9, scope: !1231)
!1250 = !DILocation(line: 36, column: 18, scope: !1208)
!1251 = !DILocation(line: 36, column: 29, scope: !1208)
!1252 = !DILocation(line: 36, column: 38, scope: !1208)
!1253 = !DILocation(line: 36, column: 27, scope: !1208)
!1254 = !DILocation(line: 36, column: 43, scope: !1208)
!1255 = !DILocation(line: 36, column: 52, scope: !1208)
!1256 = !DILocation(line: 36, column: 49, scope: !1208)
!1257 = !DILocation(line: 36, column: 17, scope: !1208)
!1258 = !DILocation(line: 36, column: 65, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1208, file: !1209, discriminator: 1)
!1260 = !DILocation(line: 36, column: 76, scope: !1259)
!1261 = !DILocation(line: 36, column: 85, scope: !1259)
!1262 = !DILocation(line: 36, column: 74, scope: !1259)
!1263 = !DILocation(line: 36, column: 90, scope: !1259)
!1264 = !DILocation(line: 36, column: 17, scope: !1259)
!1265 = !DILocation(line: 36, column: 99, scope: !1266)
!1266 = !DILexicalBlockFile(scope: !1208, file: !1209, discriminator: 2)
!1267 = !DILocation(line: 36, column: 17, scope: !1266)
!1268 = !DILocation(line: 36, column: 17, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1208, file: !1209, discriminator: 3)
!1270 = !DILocation(line: 36, column: 14, scope: !1269)
!1271 = !DILocation(line: 37, column: 14, scope: !1208)
!1272 = !DILocation(line: 37, column: 5, scope: !1208)
!1273 = !DILocation(line: 38, column: 11, scope: !1208)
!1274 = !DILocation(line: 38, column: 37, scope: !1259)
!1275 = !DILocation(line: 38, column: 26, scope: !1259)
!1276 = !DILocation(line: 38, column: 11, scope: !1259)
!1277 = !DILocation(line: 38, column: 59, scope: !1266)
!1278 = !DILocation(line: 38, column: 49, scope: !1266)
!1279 = !DILocation(line: 38, column: 11, scope: !1266)
!1280 = !DILocation(line: 38, column: 11, scope: !1269)
!1281 = !DILocation(line: 38, column: 9, scope: !1269)
!1282 = !DILocation(line: 39, column: 12, scope: !1208)
!1283 = !DILocation(line: 39, column: 5, scope: !1208)
!1284 = !DILocation(line: 40, column: 10, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1208, file: !1209, line: 40, column: 9)
!1286 = !DILocation(line: 40, column: 9, scope: !1208)
!1287 = !DILocation(line: 41, column: 18, scope: !1285)
!1288 = !DILocation(line: 41, column: 9, scope: !1285)
!1289 = !DILocation(line: 42, column: 13, scope: !1208)
!1290 = !DILocation(line: 42, column: 6, scope: !1208)
!1291 = !DILocation(line: 42, column: 11, scope: !1208)
!1292 = !DILocation(line: 43, column: 5, scope: !1208)
!1293 = !DILocation(line: 44, column: 1, scope: !1208)
!1294 = distinct !DISubprogram(name: "av_fast_padded_mallocz", scope: !1122, file: !1122, line: 82, type: !1168, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1130)
!1295 = !DILocalVariable(name: "ptr", arg: 1, scope: !1294, file: !1122, line: 82, type: !964)
!1296 = !DILocation(line: 82, column: 35, scope: !1294)
!1297 = !DILocalVariable(name: "size", arg: 2, scope: !1294, file: !1122, line: 82, type: !1170)
!1298 = !DILocation(line: 82, column: 54, scope: !1294)
!1299 = !DILocalVariable(name: "min_size", arg: 3, scope: !1294, file: !1122, line: 82, type: !1171)
!1300 = !DILocation(line: 82, column: 67, scope: !1294)
!1301 = !DILocalVariable(name: "p", scope: !1294, file: !1122, line: 84, type: !1182)
!1302 = !DILocation(line: 84, column: 15, scope: !1294)
!1303 = !DILocation(line: 84, column: 19, scope: !1294)
!1304 = !DILocation(line: 85, column: 9, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1294, file: !1122, line: 85, column: 9)
!1306 = !DILocation(line: 85, column: 18, scope: !1305)
!1307 = !DILocation(line: 85, column: 9, scope: !1294)
!1308 = !DILocation(line: 86, column: 18, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1305, file: !1122, line: 85, column: 34)
!1310 = !DILocation(line: 86, column: 9, scope: !1309)
!1311 = !DILocation(line: 87, column: 10, scope: !1309)
!1312 = !DILocation(line: 87, column: 15, scope: !1309)
!1313 = !DILocation(line: 88, column: 9, scope: !1309)
!1314 = !DILocation(line: 90, column: 25, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1294, file: !1122, line: 90, column: 9)
!1316 = !DILocation(line: 90, column: 28, scope: !1315)
!1317 = !DILocation(line: 90, column: 34, scope: !1315)
!1318 = !DILocation(line: 90, column: 43, scope: !1315)
!1319 = !DILocation(line: 90, column: 10, scope: !1315)
!1320 = !DILocation(line: 90, column: 9, scope: !1294)
!1321 = !DILocation(line: 91, column: 17, scope: !1315)
!1322 = !DILocation(line: 91, column: 16, scope: !1315)
!1323 = !DILocation(line: 91, column: 23, scope: !1315)
!1324 = !DILocation(line: 91, column: 32, scope: !1315)
!1325 = !DILocation(line: 91, column: 9, scope: !1315)
!1326 = !DILocation(line: 92, column: 1, scope: !1294)
!1327 = distinct !DISubprogram(name: "av_codec_is_encoder", scope: !1122, file: !1122, line: 94, type: !1328, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1130)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!991, !1330}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338, !1339, !1340, !1343, !1346, !1349, !1352, !1356, !1357, !1358, !1366, !1367, !1368, !1370, !2788, !2794, !2802, !2806, !2807, !2844, !2848, !2852, !2853, !2857, !2861, !2862, !2866, !2867, !2868}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1333, file: !14, line: 3475, baseType: !977, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1333, file: !14, line: 3480, baseType: !977, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1333, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1333, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1333, file: !14, line: 3487, baseType: !991, size: 32, align: 32, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1333, file: !14, line: 3488, baseType: !1341, size: 64, align: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1333, file: !14, line: 3489, baseType: !1344, size: 64, align: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1333, file: !14, line: 3490, baseType: !1347, size: 64, align: 64, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1333, file: !14, line: 3491, baseType: !1350, size: 64, align: 64, offset: 448)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1333, file: !14, line: 3492, baseType: !1353, size: 64, align: 64, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !960, line: 55, baseType: !1173)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1333, file: !14, line: 3493, baseType: !959, size: 8, align: 8, offset: 576)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1333, file: !14, line: 3494, baseType: !971, size: 64, align: 64, offset: 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1333, file: !14, line: 3495, baseType: !1359, size: 64, align: 64, offset: 704)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1362, file: !14, line: 3402, baseType: !991, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1362, file: !14, line: 3403, baseType: !977, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1333, file: !14, line: 3507, baseType: !977, size: 64, align: 64, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1333, file: !14, line: 3516, baseType: !991, size: 32, align: 32, offset: 832)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1333, file: !14, line: 3517, baseType: !1369, size: 64, align: 64, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1333, file: !14, line: 3527, baseType: !1371, size: 64, align: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!991, !1374}
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1384, !1385, !1386, !1387, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1648, !1652, !1653, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2726, !2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1376, file: !14, line: 1561, baseType: !971, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1376, file: !14, line: 1562, baseType: !991, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1376, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1376, file: !14, line: 1565, baseType: !1382, size: 64, align: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1333)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1376, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1376, file: !14, line: 1581, baseType: !1111, size: 32, align: 32, offset: 224)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1376, file: !14, line: 1583, baseType: !964, size: 64, align: 64, offset: 256)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1376, file: !14, line: 1591, baseType: !1388, size: 64, align: 64, offset: 320)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1390, line: 129, size: 1664, align: 64, elements: !1391)
!1390 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1391 = !{!1392, !1393, !1394, !1395, !1478, !1496, !1497, !1526, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1389, file: !1390, line: 136, baseType: !991, size: 32, align: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1389, file: !1390, line: 151, baseType: !991, size: 32, align: 32, offset: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1389, file: !1390, line: 157, baseType: !991, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1389, file: !1390, line: 159, baseType: !1396, size: 64, align: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1399)
!1399 = !{!1400, !1404, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1432, !1434, !1435, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1398, file: !744, line: 282, baseType: !1401, size: 512, align: 64)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 512, align: 64, elements: !1402)
!1402 = !{!1403}
!1403 = !DISubrange(count: 8)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1398, file: !744, line: 299, baseType: !1405, size: 256, align: 32, offset: 512)
!1405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 256, align: 32, elements: !1402)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1398, file: !744, line: 315, baseType: !1182, size: 64, align: 64, offset: 768)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1398, file: !744, line: 326, baseType: !991, size: 32, align: 32, offset: 832)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1398, file: !744, line: 326, baseType: !991, size: 32, align: 32, offset: 864)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1398, file: !744, line: 334, baseType: !991, size: 32, align: 32, offset: 896)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1398, file: !744, line: 341, baseType: !991, size: 32, align: 32, offset: 928)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1398, file: !744, line: 346, baseType: !991, size: 32, align: 32, offset: 960)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1398, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1398, file: !744, line: 356, baseType: !1003, size: 64, align: 32, offset: 1024)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1398, file: !744, line: 361, baseType: !997, size: 64, align: 64, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1398, file: !744, line: 369, baseType: !997, size: 64, align: 64, offset: 1152)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1398, file: !744, line: 377, baseType: !997, size: 64, align: 64, offset: 1216)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1398, file: !744, line: 382, baseType: !991, size: 32, align: 32, offset: 1280)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1398, file: !744, line: 386, baseType: !991, size: 32, align: 32, offset: 1312)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1398, file: !744, line: 391, baseType: !991, size: 32, align: 32, offset: 1344)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1398, file: !744, line: 396, baseType: !964, size: 64, align: 64, offset: 1408)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1398, file: !744, line: 403, baseType: !1422, size: 512, align: 64, offset: 1472)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1355, size: 512, align: 64, elements: !1402)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1398, file: !744, line: 410, baseType: !991, size: 32, align: 32, offset: 1984)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1398, file: !744, line: 415, baseType: !991, size: 32, align: 32, offset: 2016)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1398, file: !744, line: 420, baseType: !991, size: 32, align: 32, offset: 2048)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1398, file: !744, line: 425, baseType: !991, size: 32, align: 32, offset: 2080)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1398, file: !744, line: 435, baseType: !997, size: 64, align: 64, offset: 2112)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1398, file: !744, line: 440, baseType: !991, size: 32, align: 32, offset: 2176)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1398, file: !744, line: 445, baseType: !1355, size: 64, align: 64, offset: 2240)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1398, file: !744, line: 459, baseType: !1431, size: 512, align: 64, offset: 2304)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 512, align: 64, elements: !1402)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1398, file: !744, line: 473, baseType: !1433, size: 64, align: 64, offset: 2816)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1398, file: !744, line: 477, baseType: !991, size: 32, align: 32, offset: 2880)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1398, file: !744, line: 479, baseType: !1436, size: 64, align: 64, offset: 2944)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1449}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1439, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1439, file: !744, line: 203, baseType: !958, size: 64, align: 64, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1439, file: !744, line: 204, baseType: !991, size: 32, align: 32, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1439, file: !744, line: 205, baseType: !1445, size: 64, align: 64, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1447, line: 86, baseType: !1448)
!1447 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1448 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1447, line: 86, flags: DIFlagFwdDecl)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1439, file: !744, line: 206, baseType: !1064, size: 64, align: 64, offset: 256)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1398, file: !744, line: 480, baseType: !991, size: 32, align: 32, offset: 3008)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1398, file: !744, line: 505, baseType: !991, size: 32, align: 32, offset: 3040)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1398, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1398, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1398, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1398, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1398, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1398, file: !744, line: 532, baseType: !997, size: 64, align: 64, offset: 3264)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1398, file: !744, line: 539, baseType: !997, size: 64, align: 64, offset: 3328)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1398, file: !744, line: 547, baseType: !997, size: 64, align: 64, offset: 3392)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1398, file: !744, line: 554, baseType: !1445, size: 64, align: 64, offset: 3456)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1398, file: !744, line: 563, baseType: !991, size: 32, align: 32, offset: 3520)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1398, file: !744, line: 572, baseType: !991, size: 32, align: 32, offset: 3552)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1398, file: !744, line: 581, baseType: !991, size: 32, align: 32, offset: 3584)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1398, file: !744, line: 588, baseType: !1465, size: 64, align: 64, offset: 3648)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !998, line: 194, baseType: !1467)
!1467 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1398, file: !744, line: 593, baseType: !991, size: 32, align: 32, offset: 3712)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1398, file: !744, line: 596, baseType: !991, size: 32, align: 32, offset: 3744)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1398, file: !744, line: 599, baseType: !1064, size: 64, align: 64, offset: 3776)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1398, file: !744, line: 605, baseType: !1064, size: 64, align: 64, offset: 3840)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1398, file: !744, line: 616, baseType: !1064, size: 64, align: 64, offset: 3904)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1398, file: !744, line: 626, baseType: !1171, size: 64, align: 64, offset: 3968)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1398, file: !744, line: 627, baseType: !1171, size: 64, align: 64, offset: 4032)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1398, file: !744, line: 628, baseType: !1171, size: 64, align: 64, offset: 4096)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1398, file: !744, line: 629, baseType: !1171, size: 64, align: 64, offset: 4160)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1398, file: !744, line: 645, baseType: !1064, size: 64, align: 64, offset: 4224)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1389, file: !1390, line: 161, baseType: !1479, size: 64, align: 64, offset: 192)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1390, line: 117, baseType: !1481)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1390, line: 100, size: 832, align: 64, elements: !1482)
!1482 = !{!1483, !1487, !1488, !1489, !1490, !1491, !1493, !1494, !1495}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1481, file: !1390, line: 105, baseType: !1484, size: 256, align: 64)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 256, align: 64, elements: !1485)
!1485 = !{!1486}
!1486 = !DISubrange(count: 4)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1481, file: !1390, line: 110, baseType: !991, size: 32, align: 32, offset: 256)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1481, file: !1390, line: 111, baseType: !991, size: 32, align: 32, offset: 288)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1481, file: !1390, line: 111, baseType: !991, size: 32, align: 32, offset: 320)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1481, file: !1390, line: 112, baseType: !1405, size: 256, align: 32, offset: 352)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1481, file: !1390, line: 113, baseType: !1492, size: 128, align: 32, offset: 608)
!1492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 128, align: 32, elements: !1485)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1481, file: !1390, line: 114, baseType: !991, size: 32, align: 32, offset: 736)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1481, file: !1390, line: 115, baseType: !991, size: 32, align: 32, offset: 768)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1481, file: !1390, line: 116, baseType: !991, size: 32, align: 32, offset: 800)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1389, file: !1390, line: 163, baseType: !964, size: 64, align: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1389, file: !1390, line: 165, baseType: !1498, size: 128, align: 64, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1390, line: 122, baseType: !1499)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1390, line: 119, size: 128, align: 64, elements: !1500)
!1500 = !{!1501, !1525}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1499, file: !1390, line: 120, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1504)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1521, !1522, !1523, !1524}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1504, file: !14, line: 1451, baseType: !1064, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1504, file: !14, line: 1461, baseType: !997, size: 64, align: 64, offset: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1504, file: !14, line: 1467, baseType: !997, size: 64, align: 64, offset: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1504, file: !14, line: 1468, baseType: !958, size: 64, align: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1504, file: !14, line: 1469, baseType: !991, size: 32, align: 32, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1504, file: !14, line: 1470, baseType: !991, size: 32, align: 32, offset: 288)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1504, file: !14, line: 1474, baseType: !991, size: 32, align: 32, offset: 320)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1504, file: !14, line: 1479, baseType: !1514, size: 64, align: 64, offset: 384)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1516)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1517)
!1517 = !{!1518, !1519, !1520}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1516, file: !14, line: 1412, baseType: !958, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1516, file: !14, line: 1413, baseType: !991, size: 32, align: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1516, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1504, file: !14, line: 1480, baseType: !991, size: 32, align: 32, offset: 448)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1504, file: !14, line: 1486, baseType: !997, size: 64, align: 64, offset: 512)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1504, file: !14, line: 1488, baseType: !997, size: 64, align: 64, offset: 576)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1504, file: !14, line: 1497, baseType: !997, size: 64, align: 64, offset: 640)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1499, file: !1390, line: 121, baseType: !1396, size: 64, align: 64, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1389, file: !1390, line: 166, baseType: !1527, size: 128, align: 64, offset: 448)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1390, line: 127, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1390, line: 124, size: 128, align: 64, elements: !1529)
!1529 = !{!1530, !1602}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1528, file: !1390, line: 125, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1535)
!1535 = !{!1536, !1537, !1560, !1564, !1565, !1599, !1600, !1601}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1534, file: !14, line: 5751, baseType: !971, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1534, file: !14, line: 5756, baseType: !1538, size: 64, align: 64, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1541)
!1541 = !{!1542, !1543, !1545, !1546, !1547, !1551, !1555, !1559}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1540, file: !14, line: 5797, baseType: !977, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1540, file: !14, line: 5804, baseType: !1544, size: 64, align: 64, offset: 64)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1540, file: !14, line: 5815, baseType: !971, size: 64, align: 64, offset: 128)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1540, file: !14, line: 5825, baseType: !991, size: 32, align: 32, offset: 192)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1540, file: !14, line: 5826, baseType: !1548, size: 64, align: 64, offset: 256)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!991, !1532}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1540, file: !14, line: 5827, baseType: !1552, size: 64, align: 64, offset: 320)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!991, !1532, !1502}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1540, file: !14, line: 5828, baseType: !1556, size: 64, align: 64, offset: 384)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{null, !1532}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1540, file: !14, line: 5829, baseType: !1556, size: 64, align: 64, offset: 448)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1534, file: !14, line: 5762, baseType: !1561, size: 64, align: 64, offset: 128)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1563)
!1563 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1534, file: !14, line: 5768, baseType: !964, size: 64, align: 64, offset: 192)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1534, file: !14, line: 5775, baseType: !1566, size: 64, align: 64, offset: 256)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1568)
!1568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1569)
!1569 = !{!1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1568, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1568, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1568, file: !14, line: 3948, baseType: !1118, size: 32, align: 32, offset: 64)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1568, file: !14, line: 3958, baseType: !958, size: 64, align: 64, offset: 128)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1568, file: !14, line: 3962, baseType: !991, size: 32, align: 32, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1568, file: !14, line: 3968, baseType: !991, size: 32, align: 32, offset: 224)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1568, file: !14, line: 3973, baseType: !997, size: 64, align: 64, offset: 256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1568, file: !14, line: 3986, baseType: !991, size: 32, align: 32, offset: 320)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1568, file: !14, line: 3999, baseType: !991, size: 32, align: 32, offset: 352)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1568, file: !14, line: 4004, baseType: !991, size: 32, align: 32, offset: 384)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1568, file: !14, line: 4005, baseType: !991, size: 32, align: 32, offset: 416)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1568, file: !14, line: 4010, baseType: !991, size: 32, align: 32, offset: 448)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1568, file: !14, line: 4011, baseType: !991, size: 32, align: 32, offset: 480)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1568, file: !14, line: 4020, baseType: !1003, size: 64, align: 32, offset: 512)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1568, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1568, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1568, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1568, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1568, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1568, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1568, file: !14, line: 4039, baseType: !991, size: 32, align: 32, offset: 768)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1568, file: !14, line: 4046, baseType: !1355, size: 64, align: 64, offset: 832)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1568, file: !14, line: 4050, baseType: !991, size: 32, align: 32, offset: 896)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1568, file: !14, line: 4054, baseType: !991, size: 32, align: 32, offset: 928)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1568, file: !14, line: 4061, baseType: !991, size: 32, align: 32, offset: 960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1568, file: !14, line: 4065, baseType: !991, size: 32, align: 32, offset: 992)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1568, file: !14, line: 4073, baseType: !991, size: 32, align: 32, offset: 1024)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1568, file: !14, line: 4080, baseType: !991, size: 32, align: 32, offset: 1056)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1568, file: !14, line: 4084, baseType: !991, size: 32, align: 32, offset: 1088)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1534, file: !14, line: 5781, baseType: !1566, size: 64, align: 64, offset: 320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1534, file: !14, line: 5787, baseType: !1003, size: 64, align: 32, offset: 384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1534, file: !14, line: 5793, baseType: !1003, size: 64, align: 32, offset: 448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1528, file: !1390, line: 126, baseType: !991, size: 32, align: 32, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1389, file: !1390, line: 172, baseType: !1502, size: 64, align: 64, offset: 576)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1389, file: !1390, line: 177, baseType: !958, size: 64, align: 64, offset: 640)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1389, file: !1390, line: 178, baseType: !1111, size: 32, align: 32, offset: 704)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1389, file: !1390, line: 180, baseType: !964, size: 64, align: 64, offset: 768)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1389, file: !1390, line: 185, baseType: !991, size: 32, align: 32, offset: 832)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1389, file: !1390, line: 190, baseType: !964, size: 64, align: 64, offset: 896)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1389, file: !1390, line: 195, baseType: !991, size: 32, align: 32, offset: 960)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1389, file: !1390, line: 200, baseType: !1502, size: 64, align: 64, offset: 1024)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1389, file: !1390, line: 201, baseType: !991, size: 32, align: 32, offset: 1088)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1389, file: !1390, line: 202, baseType: !1396, size: 64, align: 64, offset: 1152)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1389, file: !1390, line: 203, baseType: !991, size: 32, align: 32, offset: 1216)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1389, file: !1390, line: 205, baseType: !991, size: 32, align: 32, offset: 1248)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1389, file: !1390, line: 206, baseType: !991, size: 32, align: 32, offset: 1280)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1389, file: !1390, line: 209, baseType: !1171, size: 64, align: 64, offset: 1344)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1389, file: !1390, line: 212, baseType: !1171, size: 64, align: 64, offset: 1408)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1389, file: !1390, line: 213, baseType: !1396, size: 64, align: 64, offset: 1472)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1389, file: !1390, line: 215, baseType: !991, size: 32, align: 32, offset: 1536)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1389, file: !1390, line: 217, baseType: !991, size: 32, align: 32, offset: 1568)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1389, file: !1390, line: 220, baseType: !991, size: 32, align: 32, offset: 1600)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1376, file: !14, line: 1598, baseType: !964, size: 64, align: 64, offset: 384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1376, file: !14, line: 1606, baseType: !997, size: 64, align: 64, offset: 448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1376, file: !14, line: 1614, baseType: !991, size: 32, align: 32, offset: 512)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1376, file: !14, line: 1622, baseType: !991, size: 32, align: 32, offset: 544)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1376, file: !14, line: 1628, baseType: !991, size: 32, align: 32, offset: 576)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1376, file: !14, line: 1636, baseType: !991, size: 32, align: 32, offset: 608)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1376, file: !14, line: 1643, baseType: !991, size: 32, align: 32, offset: 640)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1376, file: !14, line: 1657, baseType: !958, size: 64, align: 64, offset: 704)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1376, file: !14, line: 1658, baseType: !991, size: 32, align: 32, offset: 768)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1376, file: !14, line: 1679, baseType: !1003, size: 64, align: 32, offset: 800)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1376, file: !14, line: 1688, baseType: !991, size: 32, align: 32, offset: 864)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1376, file: !14, line: 1712, baseType: !991, size: 32, align: 32, offset: 896)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1376, file: !14, line: 1729, baseType: !991, size: 32, align: 32, offset: 928)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1376, file: !14, line: 1729, baseType: !991, size: 32, align: 32, offset: 960)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1376, file: !14, line: 1744, baseType: !991, size: 32, align: 32, offset: 992)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1376, file: !14, line: 1744, baseType: !991, size: 32, align: 32, offset: 1024)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1376, file: !14, line: 1751, baseType: !991, size: 32, align: 32, offset: 1056)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1376, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1376, file: !14, line: 1791, baseType: !1641, size: 64, align: 64, offset: 1152)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !1644, !1645, !1647, !991, !991, !991}
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1397)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1376, file: !14, line: 1808, baseType: !1649, size: 64, align: 64, offset: 1216)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!473, !1644, !1344}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1376, file: !14, line: 1816, baseType: !991, size: 32, align: 32, offset: 1280)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1376, file: !14, line: 1825, baseType: !1654, size: 32, align: 32, offset: 1312)
!1654 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1376, file: !14, line: 1830, baseType: !991, size: 32, align: 32, offset: 1344)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1376, file: !14, line: 1838, baseType: !1654, size: 32, align: 32, offset: 1376)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1376, file: !14, line: 1846, baseType: !991, size: 32, align: 32, offset: 1408)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1376, file: !14, line: 1851, baseType: !991, size: 32, align: 32, offset: 1440)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1376, file: !14, line: 1861, baseType: !1654, size: 32, align: 32, offset: 1472)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1376, file: !14, line: 1868, baseType: !1654, size: 32, align: 32, offset: 1504)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1376, file: !14, line: 1875, baseType: !1654, size: 32, align: 32, offset: 1536)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1376, file: !14, line: 1882, baseType: !1654, size: 32, align: 32, offset: 1568)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1376, file: !14, line: 1889, baseType: !1654, size: 32, align: 32, offset: 1600)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1376, file: !14, line: 1896, baseType: !1654, size: 32, align: 32, offset: 1632)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1376, file: !14, line: 1903, baseType: !1654, size: 32, align: 32, offset: 1664)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1376, file: !14, line: 1910, baseType: !991, size: 32, align: 32, offset: 1696)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1376, file: !14, line: 1915, baseType: !991, size: 32, align: 32, offset: 1728)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1376, file: !14, line: 1926, baseType: !1647, size: 64, align: 64, offset: 1792)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1376, file: !14, line: 1935, baseType: !1003, size: 64, align: 32, offset: 1856)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1376, file: !14, line: 1942, baseType: !991, size: 32, align: 32, offset: 1920)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1376, file: !14, line: 1948, baseType: !991, size: 32, align: 32, offset: 1952)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1376, file: !14, line: 1954, baseType: !991, size: 32, align: 32, offset: 1984)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1376, file: !14, line: 1960, baseType: !991, size: 32, align: 32, offset: 2016)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1376, file: !14, line: 1984, baseType: !991, size: 32, align: 32, offset: 2048)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1376, file: !14, line: 1991, baseType: !991, size: 32, align: 32, offset: 2080)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1376, file: !14, line: 1996, baseType: !991, size: 32, align: 32, offset: 2112)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1376, file: !14, line: 2004, baseType: !991, size: 32, align: 32, offset: 2144)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1376, file: !14, line: 2011, baseType: !991, size: 32, align: 32, offset: 2176)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1376, file: !14, line: 2018, baseType: !991, size: 32, align: 32, offset: 2208)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1376, file: !14, line: 2027, baseType: !991, size: 32, align: 32, offset: 2240)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1376, file: !14, line: 2034, baseType: !991, size: 32, align: 32, offset: 2272)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1376, file: !14, line: 2044, baseType: !991, size: 32, align: 32, offset: 2304)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1376, file: !14, line: 2054, baseType: !965, size: 64, align: 64, offset: 2368)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1376, file: !14, line: 2061, baseType: !965, size: 64, align: 64, offset: 2432)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1376, file: !14, line: 2066, baseType: !991, size: 32, align: 32, offset: 2496)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1376, file: !14, line: 2070, baseType: !991, size: 32, align: 32, offset: 2528)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1376, file: !14, line: 2078, baseType: !991, size: 32, align: 32, offset: 2560)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1376, file: !14, line: 2085, baseType: !991, size: 32, align: 32, offset: 2592)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1376, file: !14, line: 2092, baseType: !991, size: 32, align: 32, offset: 2624)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1376, file: !14, line: 2099, baseType: !991, size: 32, align: 32, offset: 2656)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1376, file: !14, line: 2106, baseType: !991, size: 32, align: 32, offset: 2688)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1376, file: !14, line: 2113, baseType: !991, size: 32, align: 32, offset: 2720)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1376, file: !14, line: 2120, baseType: !991, size: 32, align: 32, offset: 2752)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1376, file: !14, line: 2125, baseType: !991, size: 32, align: 32, offset: 2784)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1376, file: !14, line: 2133, baseType: !991, size: 32, align: 32, offset: 2816)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1376, file: !14, line: 2140, baseType: !991, size: 32, align: 32, offset: 2848)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1376, file: !14, line: 2145, baseType: !991, size: 32, align: 32, offset: 2880)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1376, file: !14, line: 2153, baseType: !991, size: 32, align: 32, offset: 2912)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1376, file: !14, line: 2158, baseType: !991, size: 32, align: 32, offset: 2944)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1376, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1376, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1376, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1376, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1376, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1376, file: !14, line: 2203, baseType: !991, size: 32, align: 32, offset: 3136)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1376, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1376, file: !14, line: 2212, baseType: !991, size: 32, align: 32, offset: 3200)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1376, file: !14, line: 2213, baseType: !991, size: 32, align: 32, offset: 3232)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1376, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1376, file: !14, line: 2232, baseType: !991, size: 32, align: 32, offset: 3296)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1376, file: !14, line: 2243, baseType: !991, size: 32, align: 32, offset: 3328)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1376, file: !14, line: 2249, baseType: !991, size: 32, align: 32, offset: 3360)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1376, file: !14, line: 2256, baseType: !991, size: 32, align: 32, offset: 3392)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1376, file: !14, line: 2263, baseType: !1355, size: 64, align: 64, offset: 3456)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1376, file: !14, line: 2270, baseType: !1355, size: 64, align: 64, offset: 3520)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1376, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1376, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1376, file: !14, line: 2367, baseType: !1719, size: 64, align: 64, offset: 3648)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DISubroutineType(types: !1721)
!1721 = !{!991, !1644, !1396, !991}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1376, file: !14, line: 2383, baseType: !991, size: 32, align: 32, offset: 3712)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1376, file: !14, line: 2386, baseType: !1654, size: 32, align: 32, offset: 3744)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1376, file: !14, line: 2387, baseType: !1654, size: 32, align: 32, offset: 3776)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1376, file: !14, line: 2394, baseType: !991, size: 32, align: 32, offset: 3808)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1376, file: !14, line: 2401, baseType: !991, size: 32, align: 32, offset: 3840)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1376, file: !14, line: 2408, baseType: !991, size: 32, align: 32, offset: 3872)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1376, file: !14, line: 2415, baseType: !991, size: 32, align: 32, offset: 3904)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1376, file: !14, line: 2422, baseType: !991, size: 32, align: 32, offset: 3936)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1376, file: !14, line: 2423, baseType: !1731, size: 64, align: 64, offset: 3968)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1733)
!1733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1734)
!1734 = !{!1735, !1736, !1737, !1738}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1733, file: !14, line: 827, baseType: !991, size: 32, align: 32)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1733, file: !14, line: 828, baseType: !991, size: 32, align: 32, offset: 32)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1733, file: !14, line: 829, baseType: !991, size: 32, align: 32, offset: 64)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1733, file: !14, line: 830, baseType: !1654, size: 32, align: 32, offset: 96)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1376, file: !14, line: 2430, baseType: !997, size: 64, align: 64, offset: 4032)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1376, file: !14, line: 2437, baseType: !997, size: 64, align: 64, offset: 4096)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1376, file: !14, line: 2444, baseType: !1654, size: 32, align: 32, offset: 4160)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1376, file: !14, line: 2451, baseType: !1654, size: 32, align: 32, offset: 4192)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1376, file: !14, line: 2458, baseType: !991, size: 32, align: 32, offset: 4224)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1376, file: !14, line: 2469, baseType: !991, size: 32, align: 32, offset: 4256)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1376, file: !14, line: 2475, baseType: !991, size: 32, align: 32, offset: 4288)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1376, file: !14, line: 2481, baseType: !991, size: 32, align: 32, offset: 4320)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1376, file: !14, line: 2485, baseType: !991, size: 32, align: 32, offset: 4352)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1376, file: !14, line: 2489, baseType: !991, size: 32, align: 32, offset: 4384)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1376, file: !14, line: 2493, baseType: !991, size: 32, align: 32, offset: 4416)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1376, file: !14, line: 2501, baseType: !991, size: 32, align: 32, offset: 4448)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1376, file: !14, line: 2506, baseType: !991, size: 32, align: 32, offset: 4480)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1376, file: !14, line: 2510, baseType: !991, size: 32, align: 32, offset: 4512)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1376, file: !14, line: 2514, baseType: !997, size: 64, align: 64, offset: 4544)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1376, file: !14, line: 2528, baseType: !1755, size: 64, align: 64, offset: 4608)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64, align: 64)
!1756 = !DISubroutineType(types: !1757)
!1757 = !{null, !1644, !964, !991, !991}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1376, file: !14, line: 2534, baseType: !991, size: 32, align: 32, offset: 4672)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1376, file: !14, line: 2545, baseType: !991, size: 32, align: 32, offset: 4704)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1376, file: !14, line: 2547, baseType: !991, size: 32, align: 32, offset: 4736)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1376, file: !14, line: 2549, baseType: !991, size: 32, align: 32, offset: 4768)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1376, file: !14, line: 2551, baseType: !991, size: 32, align: 32, offset: 4800)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1376, file: !14, line: 2553, baseType: !991, size: 32, align: 32, offset: 4832)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1376, file: !14, line: 2555, baseType: !991, size: 32, align: 32, offset: 4864)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1376, file: !14, line: 2557, baseType: !991, size: 32, align: 32, offset: 4896)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1376, file: !14, line: 2559, baseType: !991, size: 32, align: 32, offset: 4928)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1376, file: !14, line: 2563, baseType: !991, size: 32, align: 32, offset: 4960)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1376, file: !14, line: 2571, baseType: !968, size: 64, align: 64, offset: 4992)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1376, file: !14, line: 2579, baseType: !968, size: 64, align: 64, offset: 5056)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1376, file: !14, line: 2586, baseType: !991, size: 32, align: 32, offset: 5120)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1376, file: !14, line: 2615, baseType: !991, size: 32, align: 32, offset: 5152)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1376, file: !14, line: 2627, baseType: !991, size: 32, align: 32, offset: 5184)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1376, file: !14, line: 2637, baseType: !991, size: 32, align: 32, offset: 5216)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1376, file: !14, line: 2681, baseType: !991, size: 32, align: 32, offset: 5248)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1376, file: !14, line: 2709, baseType: !997, size: 64, align: 64, offset: 5312)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1376, file: !14, line: 2716, baseType: !1777, size: 64, align: 64, offset: 5376)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
