; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_parse.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--h264_parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.SPS = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i16], i32, i32, i32, [6 x [16 x i8]], [6 x [64 x i8]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [4096 x i8], i64 }
%struct.AVRational = type { i32, i32 }
%struct.H264PredWeightTable = type { i32, i32, i32, i32, [2 x i32], [2 x i32], [48 x [2 x [2 x i32]]], [48 x [2 x [2 x [2 x i32]]]], [48 x [48 x [2 x i32]]] }
%union.unaligned_32 = type { i32 }
%struct.PPS = type { i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, [6 x [16 x i8]], [6 x [64 x i8]], [2 x [88 x i8]], i32, [4096 x i8], i64, [6 x [88 x [16 x i32]]], [6 x [88 x [64 x i32]]], [6 x [16 x i32]*], [6 x [64 x i32]*] }
%struct.H264POCContext = type { i32, i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32 }

!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !545, line: 222, size: 16, align: 8, elements: !546)
!545 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !544, file: !545, line: 222, baseType: !548, size: 16, align: 16)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !538, line: 49, baseType: !549)
!549 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !545, line: 221, size: 32, align: 8, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !552, file: !545, line: 221, baseType: !555, size: 32, align: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !538, line: 51, baseType: !541)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !538, line: 48, baseType: !561)
!561 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!563 = !{!564, !575, !576, !581, !586, !590}
!564 = distinct !DIGlobalVariable(name: "top", scope: !565, file: !566, line: 134, type: !571, isLocal: true, isDefinition: true, variable: [12 x i8]* @ff_h264_check_intra4x4_pred_mode.top)
!565 = distinct !DISubprogram(name: "ff_h264_check_intra4x4_pred_mode", scope: !566, file: !566, line: 131, type: !567, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!566 = !DIFile(filename: "libavcodec/h264_parse.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!567 = !DISubroutineType(types: !568)
!568 = !{!540, !569, !556, !540, !540}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!570 = !{}
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 96, align: 8, elements: !573)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!573 = !{!574}
!574 = !DISubrange(count: 12)
!575 = distinct !DIGlobalVariable(name: "left", scope: !565, file: !566, line: 137, type: !571, isLocal: true, isDefinition: true, variable: [12 x i8]* @ff_h264_check_intra4x4_pred_mode.left)
!576 = distinct !DIGlobalVariable(name: "mask", scope: !565, file: !566, line: 157, type: !577, isLocal: true, isDefinition: true, variable: [4 x i32]* @ff_h264_check_intra4x4_pred_mode.mask)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 128, align: 32, elements: !579)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!579 = !{!580}
!580 = !DISubrange(count: 4)
!581 = distinct !DIGlobalVariable(name: "top", scope: !582, file: !566, line: 183, type: !585, isLocal: true, isDefinition: true, variable: [4 x i8]* @ff_h264_check_intra_pred_mode.top)
!582 = distinct !DISubprogram(name: "ff_h264_check_intra_pred_mode", scope: !566, file: !566, line: 179, type: !583, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!583 = !DISubroutineType(types: !584)
!584 = !{!540, !556, !540, !540, !540, !540}
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 32, align: 8, elements: !579)
!586 = distinct !DIGlobalVariable(name: "left", scope: !582, file: !566, line: 184, type: !587, isLocal: true, isDefinition: true, variable: [5 x i8]* @ff_h264_check_intra_pred_mode.left)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 40, align: 8, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 5)
!590 = distinct !DIGlobalVariable(name: "scan8", scope: !0, file: !591, line: 644, type: !592, isLocal: true, isDefinition: true, variable: [51 x i8]* @scan8)
!591 = !DIFile(filename: "libavcodec/h264dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 408, align: 8, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 51)
!595 = !{i32 2, !"Dwarf Version", i32 4}
!596 = !{i32 2, !"Debug Info Version", i32 3}
!597 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!598 = distinct !DISubprogram(name: "ff_h264_pred_weight_table", scope: !566, file: !566, line: 27, type: !599, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!599 = !DISubroutineType(types: !600)
!600 = !{!540, !601, !611, !696, !540, !697, !540, !556}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !603, line: 70, baseType: !604)
!603 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !603, line: 61, size: 256, align: 64, elements: !605)
!605 = !{!606, !607, !608, !609, !610}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !604, file: !603, line: 62, baseType: !558, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !604, file: !603, line: 62, baseType: !558, size: 64, align: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !604, file: !603, line: 67, baseType: !540, size: 32, align: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !604, file: !603, line: 68, baseType: !540, size: 32, align: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !604, file: !603, line: 69, baseType: !540, size: 32, align: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPS", file: !614, line: 104, baseType: !615)
!614 = !DIFile(filename: "libavcodec/h264_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SPS", file: !614, line: 44, size: 42432, align: 64, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !664, !665, !666, !667, !672, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !692}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !615, file: !614, line: 45, baseType: !541, size: 32, align: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !615, file: !614, line: 46, baseType: !540, size: 32, align: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !615, file: !614, line: 47, baseType: !540, size: 32, align: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !615, file: !614, line: 48, baseType: !540, size: 32, align: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transform_bypass", scope: !615, file: !614, line: 49, baseType: !540, size: 32, align: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num", scope: !615, file: !614, line: 50, baseType: !540, size: 32, align: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "poc_type", scope: !615, file: !614, line: 51, baseType: !540, size: 32, align: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !615, file: !614, line: 52, baseType: !540, size: 32, align: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !615, file: !614, line: 53, baseType: !540, size: 32, align: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !615, file: !614, line: 54, baseType: !540, size: 32, align: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !615, file: !614, line: 55, baseType: !540, size: 32, align: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "poc_cycle_length", scope: !615, file: !614, line: 56, baseType: !540, size: 32, align: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_count", scope: !615, file: !614, line: 57, baseType: !540, size: 32, align: 32, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_allowed_flag", scope: !615, file: !614, line: 58, baseType: !540, size: 32, align: 32, offset: 416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !615, file: !614, line: 59, baseType: !540, size: 32, align: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !615, file: !614, line: 61, baseType: !540, size: 32, align: 32, offset: 480)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !615, file: !614, line: 62, baseType: !540, size: 32, align: 32, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff", scope: !615, file: !614, line: 63, baseType: !540, size: 32, align: 32, offset: 544)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !615, file: !614, line: 64, baseType: !540, size: 32, align: 32, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !615, file: !614, line: 65, baseType: !540, size: 32, align: 32, offset: 608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !615, file: !614, line: 68, baseType: !541, size: 32, align: 32, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !615, file: !614, line: 69, baseType: !541, size: 32, align: 32, offset: 672)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !615, file: !614, line: 70, baseType: !541, size: 32, align: 32, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !615, file: !614, line: 71, baseType: !541, size: 32, align: 32, offset: 736)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !615, file: !614, line: 72, baseType: !540, size: 32, align: 32, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !615, file: !614, line: 73, baseType: !643, size: 64, align: 32, offset: 800)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !644, line: 61, baseType: !645)
!644 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !644, line: 58, size: 64, align: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !645, file: !644, line: 59, baseType: !540, size: 32, align: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !645, file: !644, line: 60, baseType: !540, size: 32, align: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !615, file: !614, line: 74, baseType: !540, size: 32, align: 32, offset: 864)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "full_range", scope: !615, file: !614, line: 75, baseType: !540, size: 32, align: 32, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !615, file: !614, line: 76, baseType: !540, size: 32, align: 32, offset: 928)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !615, file: !614, line: 77, baseType: !3, size: 32, align: 32, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !615, file: !614, line: 78, baseType: !22, size: 32, align: 32, offset: 992)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !615, file: !614, line: 79, baseType: !46, size: 32, align: 32, offset: 1024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !615, file: !614, line: 80, baseType: !540, size: 32, align: 32, offset: 1056)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !615, file: !614, line: 81, baseType: !555, size: 32, align: 32, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !615, file: !614, line: 82, baseType: !555, size: 32, align: 32, offset: 1120)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !615, file: !614, line: 83, baseType: !540, size: 32, align: 32, offset: 1152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !615, file: !614, line: 84, baseType: !660, size: 4096, align: 16, offset: 1184)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 4096, align: 16, elements: !662)
!661 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!662 = !{!663}
!663 = !DISubrange(count: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !615, file: !614, line: 85, baseType: !540, size: 32, align: 32, offset: 5280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !615, file: !614, line: 86, baseType: !540, size: 32, align: 32, offset: 5312)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix_present", scope: !615, file: !614, line: 87, baseType: !540, size: 32, align: 32, offset: 5344)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !615, file: !614, line: 88, baseType: !668, size: 768, align: 8, offset: 5376)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 768, align: 8, elements: !669)
!669 = !{!670, !671}
!670 = !DISubrange(count: 6)
!671 = !DISubrange(count: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !615, file: !614, line: 89, baseType: !673, size: 3072, align: 8, offset: 6144)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 3072, align: 8, elements: !674)
!674 = !{!670, !675}
!675 = !DISubrange(count: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !615, file: !614, line: 90, baseType: !540, size: 32, align: 32, offset: 9216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !615, file: !614, line: 91, baseType: !540, size: 32, align: 32, offset: 9248)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !615, file: !614, line: 92, baseType: !540, size: 32, align: 32, offset: 9280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !615, file: !614, line: 93, baseType: !540, size: 32, align: 32, offset: 9312)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !615, file: !614, line: 94, baseType: !540, size: 32, align: 32, offset: 9344)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length", scope: !615, file: !614, line: 95, baseType: !540, size: 32, align: 32, offset: 9376)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length", scope: !615, file: !614, line: 96, baseType: !540, size: 32, align: 32, offset: 9408)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length", scope: !615, file: !614, line: 97, baseType: !540, size: 32, align: 32, offset: 9440)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma", scope: !615, file: !614, line: 98, baseType: !540, size: 32, align: 32, offset: 9472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !615, file: !614, line: 99, baseType: !540, size: 32, align: 32, offset: 9504)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "residual_color_transform_flag", scope: !615, file: !614, line: 100, baseType: !540, size: 32, align: 32, offset: 9536)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set_flags", scope: !615, file: !614, line: 101, baseType: !540, size: 32, align: 32, offset: 9568)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !615, file: !614, line: 102, baseType: !689, size: 32768, align: 8, offset: 9600)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 32768, align: 8, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 4096)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !615, file: !614, line: 103, baseType: !693, size: 64, align: 64, offset: 42368)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !694, line: 216, baseType: !695)
!694 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!695 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264PredWeightTable", file: !699, line: 41, baseType: !700)
!699 = !DIFile(filename: "libavcodec/h264_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264PredWeightTable", file: !699, line: 30, size: 166144, align: 32, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !710, !711, !715, !718}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "use_weight", scope: !700, file: !699, line: 31, baseType: !540, size: 32, align: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "use_weight_chroma", scope: !700, file: !699, line: 32, baseType: !540, size: 32, align: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "luma_log2_weight_denom", scope: !700, file: !699, line: 33, baseType: !540, size: 32, align: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_log2_weight_denom", scope: !700, file: !699, line: 34, baseType: !540, size: 32, align: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight_flag", scope: !700, file: !699, line: 35, baseType: !707, size: 64, align: 32, offset: 128)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 64, align: 32, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 2)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight_flag", scope: !700, file: !699, line: 36, baseType: !707, size: 64, align: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "luma_weight", scope: !700, file: !699, line: 38, baseType: !712, size: 6144, align: 32, offset: 256)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 6144, align: 32, elements: !713)
!713 = !{!714, !709, !709}
!714 = !DISubrange(count: 48)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_weight", scope: !700, file: !699, line: 39, baseType: !716, size: 12288, align: 32, offset: 6400)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 12288, align: 32, elements: !717)
!717 = !{!714, !709, !709, !709}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_weight", scope: !700, file: !699, line: 40, baseType: !719, size: 147456, align: 32, offset: 18688)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 147456, align: 32, elements: !720)
!720 = !{!714, !714, !709}
!721 = !DILocalVariable(name: "gb", arg: 1, scope: !598, file: !566, line: 27, type: !601)
!722 = !DIExpression()
!723 = !DILocation(line: 27, column: 46, scope: !598)
!724 = !DILocalVariable(name: "sps", arg: 2, scope: !598, file: !566, line: 27, type: !611)
!725 = !DILocation(line: 27, column: 61, scope: !598)
!726 = !DILocalVariable(name: "ref_count", arg: 3, scope: !598, file: !566, line: 28, type: !696)
!727 = !DILocation(line: 28, column: 42, scope: !598)
!728 = !DILocalVariable(name: "slice_type_nos", arg: 4, scope: !598, file: !566, line: 28, type: !540)
!729 = !DILocation(line: 28, column: 57, scope: !598)
!730 = !DILocalVariable(name: "pwt", arg: 5, scope: !598, file: !566, line: 29, type: !697)
!731 = !DILocation(line: 29, column: 52, scope: !598)
!732 = !DILocalVariable(name: "picture_structure", arg: 6, scope: !598, file: !566, line: 30, type: !540)
!733 = !DILocation(line: 30, column: 35, scope: !598)
!734 = !DILocalVariable(name: "logctx", arg: 7, scope: !598, file: !566, line: 30, type: !556)
!735 = !DILocation(line: 30, column: 60, scope: !598)
!736 = !DILocalVariable(name: "list", scope: !598, file: !566, line: 32, type: !540)
!737 = !DILocation(line: 32, column: 9, scope: !598)
!738 = !DILocalVariable(name: "i", scope: !598, file: !566, line: 32, type: !540)
!739 = !DILocation(line: 32, column: 15, scope: !598)
!740 = !DILocalVariable(name: "j", scope: !598, file: !566, line: 32, type: !540)
!741 = !DILocation(line: 32, column: 18, scope: !598)
!742 = !DILocalVariable(name: "luma_def", scope: !598, file: !566, line: 33, type: !540)
!743 = !DILocation(line: 33, column: 9, scope: !598)
!744 = !DILocalVariable(name: "chroma_def", scope: !598, file: !566, line: 33, type: !540)
!745 = !DILocation(line: 33, column: 19, scope: !598)
!746 = !DILocation(line: 35, column: 5, scope: !598)
!747 = !DILocation(line: 35, column: 10, scope: !598)
!748 = !DILocation(line: 35, column: 21, scope: !598)
!749 = !DILocation(line: 36, column: 5, scope: !598)
!750 = !DILocation(line: 36, column: 10, scope: !598)
!751 = !DILocation(line: 36, column: 28, scope: !598)
!752 = !DILocation(line: 38, column: 49, scope: !598)
!753 = !DILocation(line: 38, column: 35, scope: !598)
!754 = !DILocation(line: 38, column: 5, scope: !598)
!755 = !DILocation(line: 38, column: 10, scope: !598)
!756 = !DILocation(line: 38, column: 33, scope: !598)
!757 = !DILocation(line: 39, column: 9, scope: !758)
!758 = distinct !DILexicalBlock(scope: !598, file: !566, line: 39, column: 9)
!759 = !DILocation(line: 39, column: 14, scope: !758)
!760 = !DILocation(line: 39, column: 37, scope: !758)
!761 = !DILocation(line: 39, column: 9, scope: !598)
!762 = !DILocation(line: 40, column: 16, scope: !763)
!763 = distinct !DILexicalBlock(scope: !758, file: !566, line: 39, column: 43)
!764 = !DILocation(line: 40, column: 75, scope: !763)
!765 = !DILocation(line: 40, column: 80, scope: !763)
!766 = !DILocation(line: 40, column: 9, scope: !763)
!767 = !DILocation(line: 41, column: 9, scope: !763)
!768 = !DILocation(line: 41, column: 14, scope: !763)
!769 = !DILocation(line: 41, column: 37, scope: !763)
!770 = !DILocation(line: 42, column: 5, scope: !763)
!771 = !DILocation(line: 43, column: 21, scope: !598)
!772 = !DILocation(line: 43, column: 26, scope: !598)
!773 = !DILocation(line: 43, column: 18, scope: !598)
!774 = !DILocation(line: 43, column: 14, scope: !598)
!775 = !DILocation(line: 45, column: 9, scope: !776)
!776 = distinct !DILexicalBlock(scope: !598, file: !566, line: 45, column: 9)
!777 = !DILocation(line: 45, column: 14, scope: !776)
!778 = !DILocation(line: 45, column: 9, scope: !598)
!779 = !DILocation(line: 46, column: 55, scope: !780)
!780 = distinct !DILexicalBlock(scope: !776, file: !566, line: 45, column: 33)
!781 = !DILocation(line: 46, column: 41, scope: !780)
!782 = !DILocation(line: 46, column: 9, scope: !780)
!783 = !DILocation(line: 46, column: 14, scope: !780)
!784 = !DILocation(line: 46, column: 39, scope: !780)
!785 = !DILocation(line: 47, column: 13, scope: !786)
!786 = distinct !DILexicalBlock(scope: !780, file: !566, line: 47, column: 13)
!787 = !DILocation(line: 47, column: 18, scope: !786)
!788 = !DILocation(line: 47, column: 43, scope: !786)
!789 = !DILocation(line: 47, column: 13, scope: !780)
!790 = !DILocation(line: 48, column: 20, scope: !791)
!791 = distinct !DILexicalBlock(scope: !786, file: !566, line: 47, column: 49)
!792 = !DILocation(line: 48, column: 81, scope: !791)
!793 = !DILocation(line: 48, column: 86, scope: !791)
!794 = !DILocation(line: 48, column: 13, scope: !791)
!795 = !DILocation(line: 49, column: 13, scope: !791)
!796 = !DILocation(line: 49, column: 18, scope: !791)
!797 = !DILocation(line: 49, column: 43, scope: !791)
!798 = !DILocation(line: 50, column: 9, scope: !791)
!799 = !DILocation(line: 51, column: 27, scope: !780)
!800 = !DILocation(line: 51, column: 32, scope: !780)
!801 = !DILocation(line: 51, column: 24, scope: !780)
!802 = !DILocation(line: 51, column: 20, scope: !780)
!803 = !DILocation(line: 52, column: 5, scope: !780)
!804 = !DILocation(line: 54, column: 15, scope: !805)
!805 = distinct !DILexicalBlock(scope: !598, file: !566, line: 54, column: 5)
!806 = !DILocation(line: 54, column: 10, scope: !805)
!807 = !DILocation(line: 54, column: 20, scope: !808)
!808 = !DILexicalBlockFile(scope: !809, file: !566, discriminator: 1)
!809 = distinct !DILexicalBlock(scope: !805, file: !566, line: 54, column: 5)
!810 = !DILocation(line: 54, column: 25, scope: !808)
!811 = !DILocation(line: 54, column: 5, scope: !808)
!812 = !DILocation(line: 55, column: 31, scope: !813)
!813 = distinct !DILexicalBlock(scope: !809, file: !566, line: 54, column: 38)
!814 = !DILocation(line: 55, column: 9, scope: !813)
!815 = !DILocation(line: 55, column: 14, scope: !813)
!816 = !DILocation(line: 55, column: 37, scope: !813)
!817 = !DILocation(line: 56, column: 33, scope: !813)
!818 = !DILocation(line: 56, column: 9, scope: !813)
!819 = !DILocation(line: 56, column: 14, scope: !813)
!820 = !DILocation(line: 56, column: 39, scope: !813)
!821 = !DILocation(line: 57, column: 16, scope: !822)
!822 = distinct !DILexicalBlock(scope: !813, file: !566, line: 57, column: 9)
!823 = !DILocation(line: 57, column: 14, scope: !822)
!824 = !DILocation(line: 57, column: 21, scope: !825)
!825 = !DILexicalBlockFile(scope: !826, file: !566, discriminator: 1)
!826 = distinct !DILexicalBlock(scope: !822, file: !566, line: 57, column: 9)
!827 = !DILocation(line: 57, column: 35, scope: !825)
!828 = !DILocation(line: 57, column: 25, scope: !825)
!829 = !DILocation(line: 57, column: 23, scope: !825)
!830 = !DILocation(line: 57, column: 9, scope: !825)
!831 = !DILocalVariable(name: "luma_weight_flag", scope: !832, file: !566, line: 58, type: !540)
!832 = distinct !DILexicalBlock(scope: !826, file: !566, line: 57, column: 47)
!833 = !DILocation(line: 58, column: 17, scope: !832)
!834 = !DILocalVariable(name: "chroma_weight_flag", scope: !832, file: !566, line: 58, type: !540)
!835 = !DILocation(line: 58, column: 35, scope: !832)
!836 = !DILocation(line: 60, column: 42, scope: !832)
!837 = !DILocation(line: 60, column: 32, scope: !832)
!838 = !DILocation(line: 60, column: 30, scope: !832)
!839 = !DILocation(line: 61, column: 17, scope: !840)
!840 = distinct !DILexicalBlock(scope: !832, file: !566, line: 61, column: 17)
!841 = !DILocation(line: 61, column: 17, scope: !832)
!842 = !DILocation(line: 62, column: 62, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !566, line: 61, column: 35)
!844 = !DILocation(line: 62, column: 48, scope: !843)
!845 = !DILocation(line: 62, column: 37, scope: !843)
!846 = !DILocation(line: 62, column: 17, scope: !843)
!847 = !DILocation(line: 62, column: 34, scope: !843)
!848 = !DILocation(line: 62, column: 22, scope: !843)
!849 = !DILocation(line: 62, column: 46, scope: !843)
!850 = !DILocation(line: 63, column: 62, scope: !843)
!851 = !DILocation(line: 63, column: 48, scope: !843)
!852 = !DILocation(line: 63, column: 37, scope: !843)
!853 = !DILocation(line: 63, column: 17, scope: !843)
!854 = !DILocation(line: 63, column: 34, scope: !843)
!855 = !DILocation(line: 63, column: 22, scope: !843)
!856 = !DILocation(line: 63, column: 46, scope: !843)
!857 = !DILocation(line: 64, column: 49, scope: !858)
!858 = distinct !DILexicalBlock(scope: !843, file: !566, line: 64, column: 21)
!859 = !DILocation(line: 64, column: 29, scope: !858)
!860 = !DILocation(line: 64, column: 46, scope: !858)
!861 = !DILocation(line: 64, column: 34, scope: !858)
!862 = !DILocation(line: 64, column: 21, scope: !858)
!863 = !DILocation(line: 64, column: 81, scope: !858)
!864 = !DILocation(line: 64, column: 61, scope: !858)
!865 = !DILocation(line: 64, column: 78, scope: !858)
!866 = !DILocation(line: 64, column: 66, scope: !858)
!867 = !DILocation(line: 64, column: 58, scope: !858)
!868 = !DILocation(line: 64, column: 90, scope: !858)
!869 = !DILocation(line: 65, column: 49, scope: !858)
!870 = !DILocation(line: 65, column: 29, scope: !858)
!871 = !DILocation(line: 65, column: 46, scope: !858)
!872 = !DILocation(line: 65, column: 34, scope: !858)
!873 = !DILocation(line: 65, column: 21, scope: !858)
!874 = !DILocation(line: 65, column: 81, scope: !858)
!875 = !DILocation(line: 65, column: 61, scope: !858)
!876 = !DILocation(line: 65, column: 78, scope: !858)
!877 = !DILocation(line: 65, column: 66, scope: !858)
!878 = !DILocation(line: 65, column: 58, scope: !858)
!879 = !DILocation(line: 64, column: 21, scope: !880)
!880 = !DILexicalBlockFile(scope: !843, file: !566, discriminator: 1)
!881 = !DILocation(line: 66, column: 21, scope: !858)
!882 = !DILocation(line: 67, column: 41, scope: !883)
!883 = distinct !DILexicalBlock(scope: !843, file: !566, line: 67, column: 21)
!884 = !DILocation(line: 67, column: 21, scope: !883)
!885 = !DILocation(line: 67, column: 38, scope: !883)
!886 = !DILocation(line: 67, column: 26, scope: !883)
!887 = !DILocation(line: 67, column: 53, scope: !883)
!888 = !DILocation(line: 67, column: 50, scope: !883)
!889 = !DILocation(line: 67, column: 62, scope: !883)
!890 = !DILocation(line: 68, column: 41, scope: !883)
!891 = !DILocation(line: 68, column: 21, scope: !883)
!892 = !DILocation(line: 68, column: 38, scope: !883)
!893 = !DILocation(line: 68, column: 26, scope: !883)
!894 = !DILocation(line: 68, column: 50, scope: !883)
!895 = !DILocation(line: 67, column: 21, scope: !880)
!896 = !DILocation(line: 69, column: 21, scope: !897)
!897 = distinct !DILexicalBlock(scope: !883, file: !566, line: 68, column: 56)
!898 = !DILocation(line: 69, column: 26, scope: !897)
!899 = !DILocation(line: 69, column: 37, scope: !897)
!900 = !DILocation(line: 70, column: 43, scope: !897)
!901 = !DILocation(line: 70, column: 21, scope: !897)
!902 = !DILocation(line: 70, column: 26, scope: !897)
!903 = !DILocation(line: 70, column: 49, scope: !897)
!904 = !DILocation(line: 71, column: 17, scope: !897)
!905 = !DILocation(line: 72, column: 13, scope: !843)
!906 = !DILocation(line: 73, column: 48, scope: !907)
!907 = distinct !DILexicalBlock(scope: !840, file: !566, line: 72, column: 20)
!908 = !DILocation(line: 73, column: 37, scope: !907)
!909 = !DILocation(line: 73, column: 17, scope: !907)
!910 = !DILocation(line: 73, column: 34, scope: !907)
!911 = !DILocation(line: 73, column: 22, scope: !907)
!912 = !DILocation(line: 73, column: 46, scope: !907)
!913 = !DILocation(line: 74, column: 37, scope: !907)
!914 = !DILocation(line: 74, column: 17, scope: !907)
!915 = !DILocation(line: 74, column: 34, scope: !907)
!916 = !DILocation(line: 74, column: 22, scope: !907)
!917 = !DILocation(line: 74, column: 46, scope: !907)
!918 = !DILocation(line: 77, column: 17, scope: !919)
!919 = distinct !DILexicalBlock(scope: !832, file: !566, line: 77, column: 17)
!920 = !DILocation(line: 77, column: 22, scope: !919)
!921 = !DILocation(line: 77, column: 17, scope: !832)
!922 = !DILocation(line: 78, column: 48, scope: !923)
!923 = distinct !DILexicalBlock(scope: !919, file: !566, line: 77, column: 41)
!924 = !DILocation(line: 78, column: 38, scope: !923)
!925 = !DILocation(line: 78, column: 36, scope: !923)
!926 = !DILocation(line: 79, column: 21, scope: !927)
!927 = distinct !DILexicalBlock(scope: !923, file: !566, line: 79, column: 21)
!928 = !DILocation(line: 79, column: 21, scope: !923)
!929 = !DILocalVariable(name: "j", scope: !930, file: !566, line: 80, type: !540)
!930 = distinct !DILexicalBlock(scope: !927, file: !566, line: 79, column: 41)
!931 = !DILocation(line: 80, column: 25, scope: !930)
!932 = !DILocation(line: 81, column: 28, scope: !933)
!933 = distinct !DILexicalBlock(scope: !930, file: !566, line: 81, column: 21)
!934 = !DILocation(line: 81, column: 26, scope: !933)
!935 = !DILocation(line: 81, column: 33, scope: !936)
!936 = !DILexicalBlockFile(scope: !937, file: !566, discriminator: 1)
!937 = distinct !DILexicalBlock(scope: !933, file: !566, line: 81, column: 21)
!938 = !DILocation(line: 81, column: 35, scope: !936)
!939 = !DILocation(line: 81, column: 21, scope: !936)
!940 = !DILocation(line: 82, column: 75, scope: !941)
!941 = distinct !DILexicalBlock(scope: !937, file: !566, line: 81, column: 45)
!942 = !DILocation(line: 82, column: 61, scope: !941)
!943 = !DILocation(line: 82, column: 53, scope: !941)
!944 = !DILocation(line: 82, column: 25, scope: !941)
!945 = !DILocation(line: 82, column: 47, scope: !941)
!946 = !DILocation(line: 82, column: 44, scope: !941)
!947 = !DILocation(line: 82, column: 30, scope: !941)
!948 = !DILocation(line: 82, column: 59, scope: !941)
!949 = !DILocation(line: 83, column: 75, scope: !941)
!950 = !DILocation(line: 83, column: 61, scope: !941)
!951 = !DILocation(line: 83, column: 53, scope: !941)
!952 = !DILocation(line: 83, column: 25, scope: !941)
!953 = !DILocation(line: 83, column: 47, scope: !941)
!954 = !DILocation(line: 83, column: 44, scope: !941)
!955 = !DILocation(line: 83, column: 30, scope: !941)
!956 = !DILocation(line: 83, column: 59, scope: !941)
!957 = !DILocation(line: 84, column: 65, scope: !958)
!958 = distinct !DILexicalBlock(scope: !941, file: !566, line: 84, column: 29)
!959 = !DILocation(line: 84, column: 37, scope: !958)
!960 = !DILocation(line: 84, column: 59, scope: !958)
!961 = !DILocation(line: 84, column: 56, scope: !958)
!962 = !DILocation(line: 84, column: 42, scope: !958)
!963 = !DILocation(line: 84, column: 29, scope: !958)
!964 = !DILocation(line: 84, column: 102, scope: !958)
!965 = !DILocation(line: 84, column: 74, scope: !958)
!966 = !DILocation(line: 84, column: 96, scope: !958)
!967 = !DILocation(line: 84, column: 93, scope: !958)
!968 = !DILocation(line: 84, column: 79, scope: !958)
!969 = !DILocation(line: 84, column: 71, scope: !958)
!970 = !DILocation(line: 84, column: 108, scope: !958)
!971 = !DILocation(line: 85, column: 65, scope: !958)
!972 = !DILocation(line: 85, column: 37, scope: !958)
!973 = !DILocation(line: 85, column: 59, scope: !958)
!974 = !DILocation(line: 85, column: 56, scope: !958)
!975 = !DILocation(line: 85, column: 42, scope: !958)
!976 = !DILocation(line: 85, column: 29, scope: !958)
!977 = !DILocation(line: 85, column: 102, scope: !958)
!978 = !DILocation(line: 85, column: 74, scope: !958)
!979 = !DILocation(line: 85, column: 96, scope: !958)
!980 = !DILocation(line: 85, column: 93, scope: !958)
!981 = !DILocation(line: 85, column: 79, scope: !958)
!982 = !DILocation(line: 85, column: 71, scope: !958)
!983 = !DILocation(line: 84, column: 29, scope: !984)
!984 = !DILexicalBlockFile(scope: !941, file: !566, discriminator: 1)
!985 = !DILocation(line: 86, column: 65, scope: !986)
!986 = distinct !DILexicalBlock(scope: !958, file: !566, line: 85, column: 109)
!987 = !DILocation(line: 86, column: 57, scope: !986)
!988 = !DILocation(line: 86, column: 29, scope: !986)
!989 = !DILocation(line: 86, column: 51, scope: !986)
!990 = !DILocation(line: 86, column: 48, scope: !986)
!991 = !DILocation(line: 86, column: 34, scope: !986)
!992 = !DILocation(line: 86, column: 63, scope: !986)
!993 = !DILocation(line: 87, column: 57, scope: !986)
!994 = !DILocation(line: 87, column: 29, scope: !986)
!995 = !DILocation(line: 87, column: 51, scope: !986)
!996 = !DILocation(line: 87, column: 48, scope: !986)
!997 = !DILocation(line: 87, column: 34, scope: !986)
!998 = !DILocation(line: 87, column: 63, scope: !986)
!999 = !DILocation(line: 88, column: 29, scope: !986)
!1000 = !DILocation(line: 90, column: 57, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !941, file: !566, line: 90, column: 29)
!1002 = !DILocation(line: 90, column: 29, scope: !1001)
!1003 = !DILocation(line: 90, column: 51, scope: !1001)
!1004 = !DILocation(line: 90, column: 48, scope: !1001)
!1005 = !DILocation(line: 90, column: 34, scope: !1001)
!1006 = !DILocation(line: 90, column: 66, scope: !1001)
!1007 = !DILocation(line: 90, column: 63, scope: !1001)
!1008 = !DILocation(line: 90, column: 77, scope: !1001)
!1009 = !DILocation(line: 91, column: 57, scope: !1001)
!1010 = !DILocation(line: 91, column: 29, scope: !1001)
!1011 = !DILocation(line: 91, column: 51, scope: !1001)
!1012 = !DILocation(line: 91, column: 48, scope: !1001)
!1013 = !DILocation(line: 91, column: 34, scope: !1001)
!1014 = !DILocation(line: 91, column: 63, scope: !1001)
!1015 = !DILocation(line: 90, column: 29, scope: !984)
!1016 = !DILocation(line: 92, column: 29, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1001, file: !566, line: 91, column: 69)
!1018 = !DILocation(line: 92, column: 34, scope: !1017)
!1019 = !DILocation(line: 92, column: 52, scope: !1017)
!1020 = !DILocation(line: 93, column: 53, scope: !1017)
!1021 = !DILocation(line: 93, column: 29, scope: !1017)
!1022 = !DILocation(line: 93, column: 34, scope: !1017)
!1023 = !DILocation(line: 93, column: 59, scope: !1017)
!1024 = !DILocation(line: 94, column: 25, scope: !1017)
!1025 = !DILocation(line: 95, column: 21, scope: !941)
!1026 = !DILocation(line: 81, column: 41, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !937, file: !566, discriminator: 2)
!1028 = !DILocation(line: 81, column: 21, scope: !1027)
!1029 = distinct !{!1029, !1030}
!1030 = !DILocation(line: 81, column: 21, scope: !930)
!1031 = !DILocation(line: 96, column: 17, scope: !930)
!1032 = !DILocalVariable(name: "j", scope: !1033, file: !566, line: 97, type: !540)
!1033 = distinct !DILexicalBlock(scope: !927, file: !566, line: 96, column: 24)
!1034 = !DILocation(line: 97, column: 25, scope: !1033)
!1035 = !DILocation(line: 98, column: 28, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1033, file: !566, line: 98, column: 21)
!1037 = !DILocation(line: 98, column: 26, scope: !1036)
!1038 = !DILocation(line: 98, column: 33, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1040, file: !566, discriminator: 1)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !566, line: 98, column: 21)
!1041 = !DILocation(line: 98, column: 35, scope: !1039)
!1042 = !DILocation(line: 98, column: 21, scope: !1039)
!1043 = !DILocation(line: 99, column: 61, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !566, line: 98, column: 45)
!1045 = !DILocation(line: 99, column: 53, scope: !1044)
!1046 = !DILocation(line: 99, column: 25, scope: !1044)
!1047 = !DILocation(line: 99, column: 47, scope: !1044)
!1048 = !DILocation(line: 99, column: 44, scope: !1044)
!1049 = !DILocation(line: 99, column: 30, scope: !1044)
!1050 = !DILocation(line: 99, column: 59, scope: !1044)
!1051 = !DILocation(line: 100, column: 53, scope: !1044)
!1052 = !DILocation(line: 100, column: 25, scope: !1044)
!1053 = !DILocation(line: 100, column: 47, scope: !1044)
!1054 = !DILocation(line: 100, column: 44, scope: !1044)
!1055 = !DILocation(line: 100, column: 30, scope: !1044)
!1056 = !DILocation(line: 100, column: 59, scope: !1044)
!1057 = !DILocation(line: 101, column: 21, scope: !1044)
!1058 = !DILocation(line: 98, column: 41, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1040, file: !566, discriminator: 2)
!1060 = !DILocation(line: 98, column: 21, scope: !1059)
!1061 = distinct !{!1061, !1062}
!1062 = !DILocation(line: 98, column: 21, scope: !1033)
!1063 = !DILocation(line: 103, column: 13, scope: !923)
!1064 = !DILocation(line: 106, column: 17, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !832, file: !566, line: 106, column: 17)
!1066 = !DILocation(line: 106, column: 35, scope: !1065)
!1067 = !DILocation(line: 106, column: 17, scope: !832)
!1068 = !DILocation(line: 107, column: 121, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !566, line: 106, column: 41)
!1070 = !DILocation(line: 107, column: 101, scope: !1069)
!1071 = !DILocation(line: 107, column: 118, scope: !1069)
!1072 = !DILocation(line: 107, column: 106, scope: !1069)
!1073 = !DILocation(line: 107, column: 90, scope: !1069)
!1074 = !DILocation(line: 107, column: 57, scope: !1069)
!1075 = !DILocation(line: 107, column: 83, scope: !1069)
!1076 = !DILocation(line: 107, column: 81, scope: !1069)
!1077 = !DILocation(line: 107, column: 77, scope: !1069)
!1078 = !DILocation(line: 107, column: 85, scope: !1069)
!1079 = !DILocation(line: 107, column: 62, scope: !1069)
!1080 = !DILocation(line: 107, column: 99, scope: !1069)
!1081 = !DILocation(line: 107, column: 46, scope: !1069)
!1082 = !DILocation(line: 107, column: 17, scope: !1069)
!1083 = !DILocation(line: 107, column: 43, scope: !1069)
!1084 = !DILocation(line: 107, column: 41, scope: !1069)
!1085 = !DILocation(line: 107, column: 37, scope: !1069)
!1086 = !DILocation(line: 107, column: 22, scope: !1069)
!1087 = !DILocation(line: 107, column: 55, scope: !1069)
!1088 = !DILocation(line: 108, column: 121, scope: !1069)
!1089 = !DILocation(line: 108, column: 101, scope: !1069)
!1090 = !DILocation(line: 108, column: 118, scope: !1069)
!1091 = !DILocation(line: 108, column: 106, scope: !1069)
!1092 = !DILocation(line: 108, column: 90, scope: !1069)
!1093 = !DILocation(line: 108, column: 57, scope: !1069)
!1094 = !DILocation(line: 108, column: 83, scope: !1069)
!1095 = !DILocation(line: 108, column: 81, scope: !1069)
!1096 = !DILocation(line: 108, column: 77, scope: !1069)
!1097 = !DILocation(line: 108, column: 85, scope: !1069)
!1098 = !DILocation(line: 108, column: 62, scope: !1069)
!1099 = !DILocation(line: 108, column: 99, scope: !1069)
!1100 = !DILocation(line: 108, column: 46, scope: !1069)
!1101 = !DILocation(line: 108, column: 17, scope: !1069)
!1102 = !DILocation(line: 108, column: 43, scope: !1069)
!1103 = !DILocation(line: 108, column: 41, scope: !1069)
!1104 = !DILocation(line: 108, column: 37, scope: !1069)
!1105 = !DILocation(line: 108, column: 22, scope: !1069)
!1106 = !DILocation(line: 108, column: 55, scope: !1069)
!1107 = !DILocation(line: 109, column: 21, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1069, file: !566, line: 109, column: 21)
!1109 = !DILocation(line: 109, column: 26, scope: !1108)
!1110 = !DILocation(line: 109, column: 21, scope: !1069)
!1111 = !DILocation(line: 110, column: 28, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !566, line: 110, column: 21)
!1113 = distinct !DILexicalBlock(scope: !1108, file: !566, line: 109, column: 45)
!1114 = !DILocation(line: 110, column: 26, scope: !1112)
!1115 = !DILocation(line: 110, column: 33, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1117, file: !566, discriminator: 1)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !566, line: 110, column: 21)
!1118 = !DILocation(line: 110, column: 35, scope: !1116)
!1119 = !DILocation(line: 110, column: 21, scope: !1116)
!1120 = !DILocation(line: 111, column: 147, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1117, file: !566, line: 110, column: 45)
!1122 = !DILocation(line: 111, column: 119, scope: !1121)
!1123 = !DILocation(line: 111, column: 141, scope: !1121)
!1124 = !DILocation(line: 111, column: 138, scope: !1121)
!1125 = !DILocation(line: 111, column: 124, scope: !1121)
!1126 = !DILocation(line: 111, column: 111, scope: !1121)
!1127 = !DILocation(line: 111, column: 70, scope: !1121)
!1128 = !DILocation(line: 111, column: 105, scope: !1121)
!1129 = !DILocation(line: 111, column: 98, scope: !1121)
!1130 = !DILocation(line: 111, column: 96, scope: !1121)
!1131 = !DILocation(line: 111, column: 92, scope: !1121)
!1132 = !DILocation(line: 111, column: 100, scope: !1121)
!1133 = !DILocation(line: 111, column: 75, scope: !1121)
!1134 = !DILocation(line: 111, column: 117, scope: !1121)
!1135 = !DILocation(line: 111, column: 62, scope: !1121)
!1136 = !DILocation(line: 111, column: 25, scope: !1121)
!1137 = !DILocation(line: 111, column: 56, scope: !1121)
!1138 = !DILocation(line: 111, column: 53, scope: !1121)
!1139 = !DILocation(line: 111, column: 51, scope: !1121)
!1140 = !DILocation(line: 111, column: 47, scope: !1121)
!1141 = !DILocation(line: 111, column: 30, scope: !1121)
!1142 = !DILocation(line: 111, column: 68, scope: !1121)
!1143 = !DILocation(line: 112, column: 147, scope: !1121)
!1144 = !DILocation(line: 112, column: 119, scope: !1121)
!1145 = !DILocation(line: 112, column: 141, scope: !1121)
!1146 = !DILocation(line: 112, column: 138, scope: !1121)
!1147 = !DILocation(line: 112, column: 124, scope: !1121)
!1148 = !DILocation(line: 112, column: 111, scope: !1121)
!1149 = !DILocation(line: 112, column: 70, scope: !1121)
!1150 = !DILocation(line: 112, column: 105, scope: !1121)
!1151 = !DILocation(line: 112, column: 98, scope: !1121)
!1152 = !DILocation(line: 112, column: 96, scope: !1121)
!1153 = !DILocation(line: 112, column: 92, scope: !1121)
!1154 = !DILocation(line: 112, column: 100, scope: !1121)
!1155 = !DILocation(line: 112, column: 75, scope: !1121)
!1156 = !DILocation(line: 112, column: 117, scope: !1121)
!1157 = !DILocation(line: 112, column: 62, scope: !1121)
!1158 = !DILocation(line: 112, column: 25, scope: !1121)
!1159 = !DILocation(line: 112, column: 56, scope: !1121)
!1160 = !DILocation(line: 112, column: 53, scope: !1121)
!1161 = !DILocation(line: 112, column: 51, scope: !1121)
!1162 = !DILocation(line: 112, column: 47, scope: !1121)
!1163 = !DILocation(line: 112, column: 30, scope: !1121)
!1164 = !DILocation(line: 112, column: 68, scope: !1121)
!1165 = !DILocation(line: 113, column: 21, scope: !1121)
!1166 = !DILocation(line: 110, column: 41, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1117, file: !566, discriminator: 2)
!1168 = !DILocation(line: 110, column: 21, scope: !1167)
!1169 = distinct !{!1169, !1170}
!1170 = !DILocation(line: 110, column: 21, scope: !1113)
!1171 = !DILocation(line: 114, column: 17, scope: !1113)
!1172 = !DILocation(line: 115, column: 13, scope: !1069)
!1173 = !DILocation(line: 116, column: 9, scope: !832)
!1174 = !DILocation(line: 57, column: 43, scope: !1175)
!1175 = !DILexicalBlockFile(scope: !826, file: !566, discriminator: 2)
!1176 = !DILocation(line: 57, column: 9, scope: !1175)
!1177 = distinct !{!1177, !1178}
!1178 = !DILocation(line: 57, column: 9, scope: !813)
!1179 = !DILocation(line: 117, column: 13, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !813, file: !566, line: 117, column: 13)
!1181 = !DILocation(line: 117, column: 28, scope: !1180)
!1182 = !DILocation(line: 117, column: 13, scope: !813)
!1183 = !DILocation(line: 118, column: 13, scope: !1180)
!1184 = !DILocation(line: 119, column: 5, scope: !813)
!1185 = !DILocation(line: 54, column: 34, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !809, file: !566, discriminator: 2)
!1187 = !DILocation(line: 54, column: 5, scope: !1186)
!1188 = distinct !{!1188, !1189}
!1189 = !DILocation(line: 54, column: 5, scope: !598)
!1190 = !DILocation(line: 120, column: 23, scope: !598)
!1191 = !DILocation(line: 120, column: 28, scope: !598)
!1192 = !DILocation(line: 120, column: 39, scope: !598)
!1193 = !DILocation(line: 120, column: 42, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !598, file: !566, discriminator: 1)
!1195 = !DILocation(line: 120, column: 47, scope: !1194)
!1196 = !DILocation(line: 120, column: 39, scope: !1194)
!1197 = !DILocation(line: 120, column: 39, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !598, file: !566, discriminator: 2)
!1199 = !DILocation(line: 120, column: 5, scope: !1198)
!1200 = !DILocation(line: 120, column: 10, scope: !1198)
!1201 = !DILocation(line: 120, column: 21, scope: !1198)
!1202 = !DILocation(line: 121, column: 5, scope: !598)
!1203 = !DILocation(line: 123, column: 27, scope: !598)
!1204 = !DILocation(line: 123, column: 5, scope: !598)
!1205 = !DILocation(line: 124, column: 5, scope: !598)
!1206 = !DILocation(line: 125, column: 1, scope: !598)
!1207 = distinct !DISubprogram(name: "get_ue_golomb", scope: !1208, file: !1208, line: 53, type: !1209, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!1208 = !DIFile(filename: "libavcodec/golomb.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!540, !601}
!1211 = !DILocalVariable(name: "x", arg: 1, scope: !1212, file: !1213, line: 66, type: !555)
!1212 = distinct !DISubprogram(name: "av_bswap32", scope: !1213, file: !1213, line: 66, type: !1214, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!1213 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!555, !555}
!1216 = !DILocation(line: 66, column: 98, scope: !1212, inlinedAt: !1217)
!1217 = distinct !DILocation(line: 75, column: 16, scope: !1207)
!1218 = !DILocalVariable(name: "gb", arg: 1, scope: !1207, file: !1208, line: 53, type: !601)
!1219 = !DILocation(line: 53, column: 48, scope: !1207)
!1220 = !DILocalVariable(name: "buf", scope: !1207, file: !1208, line: 55, type: !541)
!1221 = !DILocation(line: 55, column: 18, scope: !1207)
!1222 = !DILocalVariable(name: "re_index", scope: !1207, file: !1208, line: 74, type: !541)
!1223 = !DILocation(line: 74, column: 18, scope: !1207)
!1224 = !DILocation(line: 74, column: 30, scope: !1207)
!1225 = !DILocation(line: 74, column: 35, scope: !1207)
!1226 = !DILocalVariable(name: "re_cache", scope: !1207, file: !1208, line: 74, type: !541)
!1227 = !DILocation(line: 74, column: 79, scope: !1207)
!1228 = !DILocalVariable(name: "re_size_plus8", scope: !1207, file: !1208, line: 74, type: !541)
!1229 = !DILocation(line: 74, column: 102, scope: !1207)
!1230 = !DILocation(line: 74, column: 119, scope: !1207)
!1231 = !DILocation(line: 74, column: 124, scope: !1207)
!1232 = !DILocation(line: 75, column: 60, scope: !1207)
!1233 = !DILocation(line: 75, column: 65, scope: !1207)
!1234 = !DILocation(line: 75, column: 75, scope: !1207)
!1235 = !DILocation(line: 75, column: 84, scope: !1207)
!1236 = !DILocation(line: 75, column: 72, scope: !1207)
!1237 = !DILocation(line: 75, column: 93, scope: !1207)
!1238 = !DILocation(line: 75, column: 16, scope: !1207)
!1239 = !DILocation(line: 68, column: 16, scope: !1212, inlinedAt: !1217)
!1240 = !DILocation(line: 68, column: 19, scope: !1212, inlinedAt: !1217)
!1241 = !DILocation(line: 68, column: 24, scope: !1212, inlinedAt: !1217)
!1242 = !DILocation(line: 68, column: 38, scope: !1212, inlinedAt: !1217)
!1243 = !DILocation(line: 68, column: 41, scope: !1212, inlinedAt: !1217)
!1244 = !DILocation(line: 68, column: 46, scope: !1212, inlinedAt: !1217)
!1245 = !DILocation(line: 68, column: 34, scope: !1212, inlinedAt: !1217)
!1246 = !DILocation(line: 68, column: 57, scope: !1212, inlinedAt: !1217)
!1247 = !DILocation(line: 68, column: 69, scope: !1212, inlinedAt: !1217)
!1248 = !DILocation(line: 68, column: 72, scope: !1212, inlinedAt: !1217)
!1249 = !DILocation(line: 68, column: 79, scope: !1212, inlinedAt: !1217)
!1250 = !DILocation(line: 68, column: 84, scope: !1212, inlinedAt: !1217)
!1251 = !DILocation(line: 68, column: 99, scope: !1212, inlinedAt: !1217)
!1252 = !DILocation(line: 68, column: 102, scope: !1212, inlinedAt: !1217)
!1253 = !DILocation(line: 68, column: 109, scope: !1212, inlinedAt: !1217)
!1254 = !DILocation(line: 68, column: 114, scope: !1212, inlinedAt: !1217)
!1255 = !DILocation(line: 68, column: 94, scope: !1212, inlinedAt: !1217)
!1256 = !DILocation(line: 68, column: 63, scope: !1212, inlinedAt: !1217)
!1257 = !DILocation(line: 75, column: 101, scope: !1207)
!1258 = !DILocation(line: 75, column: 110, scope: !1207)
!1259 = !DILocation(line: 75, column: 97, scope: !1207)
!1260 = !DILocation(line: 75, column: 14, scope: !1207)
!1261 = !DILocation(line: 76, column: 23, scope: !1207)
!1262 = !DILocation(line: 76, column: 9, scope: !1207)
!1263 = !DILocation(line: 78, column: 9, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1207, file: !1208, line: 78, column: 9)
!1265 = !DILocation(line: 78, column: 13, scope: !1264)
!1266 = !DILocation(line: 78, column: 9, scope: !1207)
!1267 = !DILocation(line: 79, column: 13, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1264, file: !1208, line: 78, column: 27)
!1269 = !DILocation(line: 80, column: 22, scope: !1268)
!1270 = !DILocation(line: 80, column: 40, scope: !1268)
!1271 = !DILocation(line: 80, column: 70, scope: !1268)
!1272 = !DILocation(line: 80, column: 52, scope: !1268)
!1273 = !DILocation(line: 80, column: 51, scope: !1268)
!1274 = !DILocation(line: 80, column: 49, scope: !1268)
!1275 = !DILocation(line: 80, column: 37, scope: !1268)
!1276 = !DILocation(line: 80, column: 21, scope: !1268)
!1277 = !DILocation(line: 80, column: 80, scope: !1278)
!1278 = !DILexicalBlockFile(scope: !1268, file: !1208, discriminator: 1)
!1279 = !DILocation(line: 80, column: 110, scope: !1278)
!1280 = !DILocation(line: 80, column: 92, scope: !1278)
!1281 = !DILocation(line: 80, column: 91, scope: !1278)
!1282 = !DILocation(line: 80, column: 89, scope: !1278)
!1283 = !DILocation(line: 80, column: 21, scope: !1278)
!1284 = !DILocation(line: 80, column: 120, scope: !1285)
!1285 = !DILexicalBlockFile(scope: !1268, file: !1208, discriminator: 2)
!1286 = !DILocation(line: 80, column: 21, scope: !1285)
!1287 = !DILocation(line: 80, column: 21, scope: !1288)
!1288 = !DILexicalBlockFile(scope: !1268, file: !1208, discriminator: 3)
!1289 = !DILocation(line: 80, column: 18, scope: !1288)
!1290 = !DILocation(line: 81, column: 23, scope: !1268)
!1291 = !DILocation(line: 81, column: 10, scope: !1268)
!1292 = !DILocation(line: 81, column: 15, scope: !1268)
!1293 = !DILocation(line: 81, column: 21, scope: !1268)
!1294 = !DILocation(line: 83, column: 38, scope: !1268)
!1295 = !DILocation(line: 83, column: 16, scope: !1268)
!1296 = !DILocation(line: 83, column: 9, scope: !1268)
!1297 = !DILocalVariable(name: "log", scope: !1298, file: !1208, line: 85, type: !540)
!1298 = distinct !DILexicalBlock(scope: !1264, file: !1208, line: 84, column: 12)
!1299 = !DILocation(line: 85, column: 13, scope: !1298)
!1300 = !DILocation(line: 85, column: 44, scope: !1298)
!1301 = !DILocation(line: 85, column: 48, scope: !1298)
!1302 = !DILocation(line: 85, column: 29, scope: !1298)
!1303 = !DILocation(line: 85, column: 27, scope: !1298)
!1304 = !DILocation(line: 85, column: 21, scope: !1298)
!1305 = !DILocation(line: 85, column: 53, scope: !1298)
!1306 = !DILocation(line: 86, column: 22, scope: !1298)
!1307 = !DILocation(line: 86, column: 40, scope: !1298)
!1308 = !DILocation(line: 86, column: 57, scope: !1298)
!1309 = !DILocation(line: 86, column: 55, scope: !1298)
!1310 = !DILocation(line: 86, column: 49, scope: !1298)
!1311 = !DILocation(line: 86, column: 37, scope: !1298)
!1312 = !DILocation(line: 86, column: 21, scope: !1298)
!1313 = !DILocation(line: 86, column: 66, scope: !1314)
!1314 = !DILexicalBlockFile(scope: !1298, file: !1208, discriminator: 1)
!1315 = !DILocation(line: 86, column: 83, scope: !1314)
!1316 = !DILocation(line: 86, column: 81, scope: !1314)
!1317 = !DILocation(line: 86, column: 75, scope: !1314)
!1318 = !DILocation(line: 86, column: 21, scope: !1314)
!1319 = !DILocation(line: 86, column: 92, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !1298, file: !1208, discriminator: 2)
!1321 = !DILocation(line: 86, column: 21, scope: !1320)
!1322 = !DILocation(line: 86, column: 21, scope: !1323)
!1323 = !DILexicalBlockFile(scope: !1298, file: !1208, discriminator: 3)
!1324 = !DILocation(line: 86, column: 18, scope: !1323)
!1325 = !DILocation(line: 87, column: 23, scope: !1298)
!1326 = !DILocation(line: 87, column: 10, scope: !1298)
!1327 = !DILocation(line: 87, column: 15, scope: !1298)
!1328 = !DILocation(line: 87, column: 21, scope: !1298)
!1329 = !DILocation(line: 88, column: 13, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1298, file: !1208, line: 88, column: 13)
!1331 = !DILocation(line: 88, column: 17, scope: !1330)
!1332 = !DILocation(line: 88, column: 13, scope: !1298)
!1333 = !DILocation(line: 89, column: 13, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1330, file: !1208, line: 88, column: 22)
!1335 = !DILocation(line: 90, column: 13, scope: !1334)
!1336 = !DILocation(line: 92, column: 17, scope: !1298)
!1337 = !DILocation(line: 92, column: 13, scope: !1298)
!1338 = !DILocation(line: 93, column: 12, scope: !1298)
!1339 = !DILocation(line: 95, column: 16, scope: !1298)
!1340 = !DILocation(line: 95, column: 9, scope: !1298)
!1341 = !DILocation(line: 98, column: 1, scope: !1207)
!1342 = distinct !DISubprogram(name: "get_bits1", scope: !603, file: !603, line: 487, type: !1343, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!541, !601}
!1345 = !DILocalVariable(name: "s", arg: 1, scope: !1342, file: !603, line: 487, type: !601)
!1346 = !DILocation(line: 487, column: 53, scope: !1342)
!1347 = !DILocalVariable(name: "index", scope: !1342, file: !603, line: 499, type: !541)
!1348 = !DILocation(line: 499, column: 18, scope: !1342)
!1349 = !DILocation(line: 499, column: 26, scope: !1342)
!1350 = !DILocation(line: 499, column: 29, scope: !1342)
!1351 = !DILocalVariable(name: "result", scope: !1342, file: !603, line: 500, type: !560)
!1352 = !DILocation(line: 500, column: 13, scope: !1342)
!1353 = !DILocation(line: 500, column: 32, scope: !1342)
!1354 = !DILocation(line: 500, column: 38, scope: !1342)
!1355 = !DILocation(line: 500, column: 22, scope: !1342)
!1356 = !DILocation(line: 500, column: 25, scope: !1342)
!1357 = !DILocation(line: 505, column: 16, scope: !1342)
!1358 = !DILocation(line: 505, column: 22, scope: !1342)
!1359 = !DILocation(line: 505, column: 12, scope: !1342)
!1360 = !DILocation(line: 506, column: 12, scope: !1342)
!1361 = !DILocation(line: 509, column: 9, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1342, file: !603, line: 509, column: 9)
!1363 = !DILocation(line: 509, column: 12, scope: !1362)
!1364 = !DILocation(line: 509, column: 20, scope: !1362)
!1365 = !DILocation(line: 509, column: 23, scope: !1362)
!1366 = !DILocation(line: 509, column: 18, scope: !1362)
!1367 = !DILocation(line: 509, column: 9, scope: !1342)
!1368 = !DILocation(line: 511, column: 14, scope: !1362)
!1369 = !DILocation(line: 511, column: 9, scope: !1362)
!1370 = !DILocation(line: 512, column: 16, scope: !1342)
!1371 = !DILocation(line: 512, column: 5, scope: !1342)
!1372 = !DILocation(line: 512, column: 8, scope: !1342)
!1373 = !DILocation(line: 512, column: 14, scope: !1342)
!1374 = !DILocation(line: 514, column: 12, scope: !1342)
!1375 = !DILocation(line: 514, column: 5, scope: !1342)
!1376 = distinct !DISubprogram(name: "get_se_golomb", scope: !1208, file: !1208, line: 237, type: !1209, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!1377 = !DILocation(line: 66, column: 98, scope: !1212, inlinedAt: !1378)
!1378 = distinct !DILocation(line: 276, column: 20, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1380, file: !1208, line: 273, column: 12)
!1380 = distinct !DILexicalBlock(scope: !1376, file: !1208, line: 267, column: 9)
!1381 = !DILocation(line: 66, column: 98, scope: !1212, inlinedAt: !1382)
!1382 = distinct !DILocation(line: 264, column: 16, scope: !1376)
!1383 = !DILocalVariable(name: "gb", arg: 1, scope: !1376, file: !1208, line: 237, type: !601)
!1384 = !DILocation(line: 237, column: 48, scope: !1376)
!1385 = !DILocalVariable(name: "buf", scope: !1376, file: !1208, line: 239, type: !541)
!1386 = !DILocation(line: 239, column: 18, scope: !1376)
!1387 = !DILocalVariable(name: "re_index", scope: !1376, file: !1208, line: 263, type: !541)
!1388 = !DILocation(line: 263, column: 18, scope: !1376)
!1389 = !DILocation(line: 263, column: 30, scope: !1376)
!1390 = !DILocation(line: 263, column: 35, scope: !1376)
!1391 = !DILocalVariable(name: "re_cache", scope: !1376, file: !1208, line: 263, type: !541)
!1392 = !DILocation(line: 263, column: 79, scope: !1376)
!1393 = !DILocalVariable(name: "re_size_plus8", scope: !1376, file: !1208, line: 263, type: !541)
!1394 = !DILocation(line: 263, column: 102, scope: !1376)
!1395 = !DILocation(line: 263, column: 119, scope: !1376)
!1396 = !DILocation(line: 263, column: 124, scope: !1376)
!1397 = !DILocation(line: 264, column: 60, scope: !1376)
!1398 = !DILocation(line: 264, column: 65, scope: !1376)
!1399 = !DILocation(line: 264, column: 75, scope: !1376)
!1400 = !DILocation(line: 264, column: 84, scope: !1376)
!1401 = !DILocation(line: 264, column: 72, scope: !1376)
!1402 = !DILocation(line: 264, column: 93, scope: !1376)
!1403 = !DILocation(line: 264, column: 16, scope: !1376)
!1404 = !DILocation(line: 68, column: 16, scope: !1212, inlinedAt: !1382)
!1405 = !DILocation(line: 68, column: 19, scope: !1212, inlinedAt: !1382)
!1406 = !DILocation(line: 68, column: 24, scope: !1212, inlinedAt: !1382)
!1407 = !DILocation(line: 68, column: 38, scope: !1212, inlinedAt: !1382)
!1408 = !DILocation(line: 68, column: 41, scope: !1212, inlinedAt: !1382)
!1409 = !DILocation(line: 68, column: 46, scope: !1212, inlinedAt: !1382)
!1410 = !DILocation(line: 68, column: 34, scope: !1212, inlinedAt: !1382)
!1411 = !DILocation(line: 68, column: 57, scope: !1212, inlinedAt: !1382)
!1412 = !DILocation(line: 68, column: 69, scope: !1212, inlinedAt: !1382)
!1413 = !DILocation(line: 68, column: 72, scope: !1212, inlinedAt: !1382)
!1414 = !DILocation(line: 68, column: 79, scope: !1212, inlinedAt: !1382)
!1415 = !DILocation(line: 68, column: 84, scope: !1212, inlinedAt: !1382)
!1416 = !DILocation(line: 68, column: 99, scope: !1212, inlinedAt: !1382)
!1417 = !DILocation(line: 68, column: 102, scope: !1212, inlinedAt: !1382)
!1418 = !DILocation(line: 68, column: 109, scope: !1212, inlinedAt: !1382)
!1419 = !DILocation(line: 68, column: 114, scope: !1212, inlinedAt: !1382)
!1420 = !DILocation(line: 68, column: 94, scope: !1212, inlinedAt: !1382)
!1421 = !DILocation(line: 68, column: 63, scope: !1212, inlinedAt: !1382)
!1422 = !DILocation(line: 264, column: 101, scope: !1376)
!1423 = !DILocation(line: 264, column: 110, scope: !1376)
!1424 = !DILocation(line: 264, column: 97, scope: !1376)
!1425 = !DILocation(line: 264, column: 14, scope: !1376)
!1426 = !DILocation(line: 265, column: 23, scope: !1376)
!1427 = !DILocation(line: 265, column: 9, scope: !1376)
!1428 = !DILocation(line: 267, column: 9, scope: !1380)
!1429 = !DILocation(line: 267, column: 13, scope: !1380)
!1430 = !DILocation(line: 267, column: 9, scope: !1376)
!1431 = !DILocation(line: 268, column: 13, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1380, file: !1208, line: 267, column: 27)
!1433 = !DILocation(line: 269, column: 22, scope: !1432)
!1434 = !DILocation(line: 269, column: 40, scope: !1432)
!1435 = !DILocation(line: 269, column: 70, scope: !1432)
!1436 = !DILocation(line: 269, column: 52, scope: !1432)
!1437 = !DILocation(line: 269, column: 51, scope: !1432)
!1438 = !DILocation(line: 269, column: 49, scope: !1432)
!1439 = !DILocation(line: 269, column: 37, scope: !1432)
!1440 = !DILocation(line: 269, column: 21, scope: !1432)
!1441 = !DILocation(line: 269, column: 80, scope: !1442)
!1442 = !DILexicalBlockFile(scope: !1432, file: !1208, discriminator: 1)
!1443 = !DILocation(line: 269, column: 110, scope: !1442)
!1444 = !DILocation(line: 269, column: 92, scope: !1442)
!1445 = !DILocation(line: 269, column: 91, scope: !1442)
!1446 = !DILocation(line: 269, column: 89, scope: !1442)
!1447 = !DILocation(line: 269, column: 21, scope: !1442)
!1448 = !DILocation(line: 269, column: 120, scope: !1449)
!1449 = !DILexicalBlockFile(scope: !1432, file: !1208, discriminator: 2)
!1450 = !DILocation(line: 269, column: 21, scope: !1449)
!1451 = !DILocation(line: 269, column: 21, scope: !1452)
!1452 = !DILexicalBlockFile(scope: !1432, file: !1208, discriminator: 3)
!1453 = !DILocation(line: 269, column: 18, scope: !1452)
!1454 = !DILocation(line: 270, column: 23, scope: !1432)
!1455 = !DILocation(line: 270, column: 10, scope: !1432)
!1456 = !DILocation(line: 270, column: 15, scope: !1432)
!1457 = !DILocation(line: 270, column: 21, scope: !1432)
!1458 = !DILocation(line: 272, column: 38, scope: !1432)
!1459 = !DILocation(line: 272, column: 16, scope: !1432)
!1460 = !DILocation(line: 272, column: 9, scope: !1432)
!1461 = !DILocalVariable(name: "log", scope: !1379, file: !1208, line: 274, type: !540)
!1462 = !DILocation(line: 274, column: 13, scope: !1379)
!1463 = !DILocation(line: 274, column: 40, scope: !1379)
!1464 = !DILocation(line: 274, column: 44, scope: !1379)
!1465 = !DILocation(line: 274, column: 25, scope: !1379)
!1466 = !DILocation(line: 274, column: 23, scope: !1379)
!1467 = !DILocalVariable(name: "sign", scope: !1379, file: !1208, line: 274, type: !540)
!1468 = !DILocation(line: 274, column: 50, scope: !1379)
!1469 = !DILocation(line: 275, column: 22, scope: !1379)
!1470 = !DILocation(line: 275, column: 40, scope: !1379)
!1471 = !DILocation(line: 275, column: 57, scope: !1379)
!1472 = !DILocation(line: 275, column: 55, scope: !1379)
!1473 = !DILocation(line: 275, column: 49, scope: !1379)
!1474 = !DILocation(line: 275, column: 37, scope: !1379)
!1475 = !DILocation(line: 275, column: 21, scope: !1379)
!1476 = !DILocation(line: 275, column: 66, scope: !1477)
!1477 = !DILexicalBlockFile(scope: !1379, file: !1208, discriminator: 1)
!1478 = !DILocation(line: 275, column: 83, scope: !1477)
!1479 = !DILocation(line: 275, column: 81, scope: !1477)
!1480 = !DILocation(line: 275, column: 75, scope: !1477)
!1481 = !DILocation(line: 275, column: 21, scope: !1477)
!1482 = !DILocation(line: 275, column: 92, scope: !1483)
!1483 = !DILexicalBlockFile(scope: !1379, file: !1208, discriminator: 2)
!1484 = !DILocation(line: 275, column: 21, scope: !1483)
!1485 = !DILocation(line: 275, column: 21, scope: !1486)
!1486 = !DILexicalBlockFile(scope: !1379, file: !1208, discriminator: 3)
!1487 = !DILocation(line: 275, column: 18, scope: !1486)
!1488 = !DILocation(line: 276, column: 64, scope: !1379)
!1489 = !DILocation(line: 276, column: 69, scope: !1379)
!1490 = !DILocation(line: 276, column: 79, scope: !1379)
!1491 = !DILocation(line: 276, column: 88, scope: !1379)
!1492 = !DILocation(line: 276, column: 76, scope: !1379)
!1493 = !DILocation(line: 276, column: 97, scope: !1379)
!1494 = !DILocation(line: 276, column: 20, scope: !1379)
!1495 = !DILocation(line: 68, column: 16, scope: !1212, inlinedAt: !1378)
!1496 = !DILocation(line: 68, column: 19, scope: !1212, inlinedAt: !1378)
!1497 = !DILocation(line: 68, column: 24, scope: !1212, inlinedAt: !1378)
!1498 = !DILocation(line: 68, column: 38, scope: !1212, inlinedAt: !1378)
!1499 = !DILocation(line: 68, column: 41, scope: !1212, inlinedAt: !1378)
!1500 = !DILocation(line: 68, column: 46, scope: !1212, inlinedAt: !1378)
!1501 = !DILocation(line: 68, column: 34, scope: !1212, inlinedAt: !1378)
!1502 = !DILocation(line: 68, column: 57, scope: !1212, inlinedAt: !1378)
!1503 = !DILocation(line: 68, column: 69, scope: !1212, inlinedAt: !1378)
!1504 = !DILocation(line: 68, column: 72, scope: !1212, inlinedAt: !1378)
!1505 = !DILocation(line: 68, column: 79, scope: !1212, inlinedAt: !1378)
!1506 = !DILocation(line: 68, column: 84, scope: !1212, inlinedAt: !1378)
!1507 = !DILocation(line: 68, column: 99, scope: !1212, inlinedAt: !1378)
!1508 = !DILocation(line: 68, column: 102, scope: !1212, inlinedAt: !1378)
!1509 = !DILocation(line: 68, column: 109, scope: !1212, inlinedAt: !1378)
!1510 = !DILocation(line: 68, column: 114, scope: !1212, inlinedAt: !1378)
!1511 = !DILocation(line: 68, column: 94, scope: !1212, inlinedAt: !1378)
!1512 = !DILocation(line: 68, column: 63, scope: !1212, inlinedAt: !1378)
!1513 = !DILocation(line: 276, column: 105, scope: !1379)
!1514 = !DILocation(line: 276, column: 114, scope: !1379)
!1515 = !DILocation(line: 276, column: 101, scope: !1379)
!1516 = !DILocation(line: 276, column: 18, scope: !1379)
!1517 = !DILocation(line: 277, column: 27, scope: !1379)
!1518 = !DILocation(line: 277, column: 13, scope: !1379)
!1519 = !DILocation(line: 279, column: 17, scope: !1379)
!1520 = !DILocation(line: 279, column: 13, scope: !1379)
!1521 = !DILocation(line: 281, column: 22, scope: !1379)
!1522 = !DILocation(line: 281, column: 40, scope: !1379)
!1523 = !DILocation(line: 281, column: 57, scope: !1379)
!1524 = !DILocation(line: 281, column: 55, scope: !1379)
!1525 = !DILocation(line: 281, column: 49, scope: !1379)
!1526 = !DILocation(line: 281, column: 37, scope: !1379)
!1527 = !DILocation(line: 281, column: 21, scope: !1379)
!1528 = !DILocation(line: 281, column: 66, scope: !1477)
!1529 = !DILocation(line: 281, column: 83, scope: !1477)
!1530 = !DILocation(line: 281, column: 81, scope: !1477)
!1531 = !DILocation(line: 281, column: 75, scope: !1477)
!1532 = !DILocation(line: 281, column: 21, scope: !1477)
!1533 = !DILocation(line: 281, column: 92, scope: !1483)
!1534 = !DILocation(line: 281, column: 21, scope: !1483)
!1535 = !DILocation(line: 281, column: 21, scope: !1486)
!1536 = !DILocation(line: 281, column: 18, scope: !1486)
!1537 = !DILocation(line: 282, column: 23, scope: !1379)
!1538 = !DILocation(line: 282, column: 10, scope: !1379)
!1539 = !DILocation(line: 282, column: 15, scope: !1379)
!1540 = !DILocation(line: 282, column: 21, scope: !1379)
!1541 = !DILocation(line: 284, column: 18, scope: !1379)
!1542 = !DILocation(line: 284, column: 22, scope: !1379)
!1543 = !DILocation(line: 284, column: 16, scope: !1379)
!1544 = !DILocation(line: 284, column: 14, scope: !1379)
!1545 = !DILocation(line: 285, column: 17, scope: !1379)
!1546 = !DILocation(line: 285, column: 21, scope: !1379)
!1547 = !DILocation(line: 285, column: 29, scope: !1379)
!1548 = !DILocation(line: 285, column: 27, scope: !1379)
!1549 = !DILocation(line: 285, column: 37, scope: !1379)
!1550 = !DILocation(line: 285, column: 35, scope: !1379)
!1551 = !DILocation(line: 285, column: 13, scope: !1379)
!1552 = !DILocation(line: 287, column: 16, scope: !1379)
!1553 = !DILocation(line: 287, column: 9, scope: !1379)
!1554 = !DILocation(line: 290, column: 1, scope: !1376)
!1555 = !DILocalVariable(name: "pred_mode_cache", arg: 1, scope: !565, file: !566, line: 131, type: !569)
!1556 = !DILocation(line: 131, column: 46, scope: !565)
!1557 = !DILocalVariable(name: "logctx", arg: 2, scope: !565, file: !566, line: 131, type: !556)
!1558 = !DILocation(line: 131, column: 69, scope: !565)
!1559 = !DILocalVariable(name: "top_samples_available", arg: 3, scope: !565, file: !566, line: 132, type: !540)
!1560 = !DILocation(line: 132, column: 42, scope: !565)
!1561 = !DILocalVariable(name: "left_samples_available", arg: 4, scope: !565, file: !566, line: 132, type: !540)
!1562 = !DILocation(line: 132, column: 69, scope: !565)
!1563 = !DILocalVariable(name: "i", scope: !565, file: !566, line: 140, type: !540)
!1564 = !DILocation(line: 140, column: 9, scope: !565)
!1565 = !DILocation(line: 142, column: 11, scope: !1566)
!1566 = distinct !DILexicalBlock(scope: !565, file: !566, line: 142, column: 9)
!1567 = !DILocation(line: 142, column: 33, scope: !1566)
!1568 = !DILocation(line: 142, column: 9, scope: !565)
!1569 = !DILocation(line: 143, column: 16, scope: !1570)
!1570 = distinct !DILexicalBlock(scope: !1571, file: !566, line: 143, column: 9)
!1571 = distinct !DILexicalBlock(scope: !1566, file: !566, line: 142, column: 44)
!1572 = !DILocation(line: 143, column: 14, scope: !1570)
!1573 = !DILocation(line: 143, column: 21, scope: !1574)
!1574 = !DILexicalBlockFile(scope: !1575, file: !566, discriminator: 1)
!1575 = distinct !DILexicalBlock(scope: !1570, file: !566, line: 143, column: 9)
!1576 = !DILocation(line: 143, column: 23, scope: !1574)
!1577 = !DILocation(line: 143, column: 9, scope: !1574)
!1578 = !DILocalVariable(name: "status", scope: !1579, file: !566, line: 144, type: !540)
!1579 = distinct !DILexicalBlock(scope: !1575, file: !566, line: 143, column: 33)
!1580 = !DILocation(line: 144, column: 17, scope: !1579)
!1581 = !DILocation(line: 144, column: 46, scope: !1579)
!1582 = !DILocation(line: 144, column: 57, scope: !1579)
!1583 = !DILocation(line: 144, column: 55, scope: !1579)
!1584 = !DILocation(line: 144, column: 30, scope: !1579)
!1585 = !DILocation(line: 144, column: 26, scope: !1579)
!1586 = !DILocation(line: 145, column: 17, scope: !1587)
!1587 = distinct !DILexicalBlock(scope: !1579, file: !566, line: 145, column: 17)
!1588 = !DILocation(line: 145, column: 24, scope: !1587)
!1589 = !DILocation(line: 145, column: 17, scope: !1579)
!1590 = !DILocation(line: 146, column: 24, scope: !1591)
!1591 = distinct !DILexicalBlock(scope: !1587, file: !566, line: 145, column: 29)
!1592 = !DILocation(line: 148, column: 24, scope: !1591)
!1593 = !DILocation(line: 146, column: 17, scope: !1591)
!1594 = !DILocation(line: 149, column: 17, scope: !1591)
!1595 = !DILocation(line: 150, column: 24, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1587, file: !566, line: 150, column: 24)
!1597 = !DILocation(line: 150, column: 24, scope: !1587)
!1598 = !DILocation(line: 151, column: 49, scope: !1599)
!1599 = distinct !DILexicalBlock(scope: !1596, file: !566, line: 150, column: 32)
!1600 = !DILocation(line: 151, column: 33, scope: !1599)
!1601 = !DILocation(line: 151, column: 44, scope: !1599)
!1602 = !DILocation(line: 151, column: 42, scope: !1599)
!1603 = !DILocation(line: 151, column: 17, scope: !1599)
!1604 = !DILocation(line: 151, column: 47, scope: !1599)
!1605 = !DILocation(line: 152, column: 13, scope: !1599)
!1606 = !DILocation(line: 153, column: 9, scope: !1579)
!1607 = !DILocation(line: 143, column: 29, scope: !1608)
!1608 = !DILexicalBlockFile(scope: !1575, file: !566, discriminator: 2)
!1609 = !DILocation(line: 143, column: 9, scope: !1608)
!1610 = distinct !{!1610, !1611}
!1611 = !DILocation(line: 143, column: 9, scope: !1571)
!1612 = !DILocation(line: 154, column: 5, scope: !1571)
!1613 = !DILocation(line: 156, column: 10, scope: !1614)
!1614 = distinct !DILexicalBlock(scope: !565, file: !566, line: 156, column: 9)
!1615 = !DILocation(line: 156, column: 33, scope: !1614)
!1616 = !DILocation(line: 156, column: 43, scope: !1614)
!1617 = !DILocation(line: 156, column: 9, scope: !565)
!1618 = !DILocation(line: 158, column: 16, scope: !1619)
!1619 = distinct !DILexicalBlock(scope: !1620, file: !566, line: 158, column: 9)
!1620 = distinct !DILexicalBlock(scope: !1614, file: !566, line: 156, column: 54)
!1621 = !DILocation(line: 158, column: 14, scope: !1619)
!1622 = !DILocation(line: 158, column: 21, scope: !1623)
!1623 = !DILexicalBlockFile(scope: !1624, file: !566, discriminator: 1)
!1624 = distinct !DILexicalBlock(scope: !1619, file: !566, line: 158, column: 9)
!1625 = !DILocation(line: 158, column: 23, scope: !1623)
!1626 = !DILocation(line: 158, column: 9, scope: !1623)
!1627 = !DILocation(line: 159, column: 19, scope: !1628)
!1628 = distinct !DILexicalBlock(scope: !1624, file: !566, line: 159, column: 17)
!1629 = !DILocation(line: 159, column: 49, scope: !1628)
!1630 = !DILocation(line: 159, column: 44, scope: !1628)
!1631 = !DILocation(line: 159, column: 42, scope: !1628)
!1632 = !DILocation(line: 159, column: 17, scope: !1624)
!1633 = !DILocalVariable(name: "status", scope: !1634, file: !566, line: 160, type: !540)
!1634 = distinct !DILexicalBlock(scope: !1628, file: !566, line: 159, column: 54)
!1635 = !DILocation(line: 160, column: 21, scope: !1634)
!1636 = !DILocation(line: 160, column: 51, scope: !1634)
!1637 = !DILocation(line: 160, column: 66, scope: !1634)
!1638 = !DILocation(line: 160, column: 64, scope: !1634)
!1639 = !DILocation(line: 160, column: 60, scope: !1634)
!1640 = !DILocation(line: 160, column: 35, scope: !1634)
!1641 = !DILocation(line: 160, column: 30, scope: !1634)
!1642 = !DILocation(line: 161, column: 21, scope: !1643)
!1643 = distinct !DILexicalBlock(scope: !1634, file: !566, line: 161, column: 21)
!1644 = !DILocation(line: 161, column: 28, scope: !1643)
!1645 = !DILocation(line: 161, column: 21, scope: !1634)
!1646 = !DILocation(line: 162, column: 28, scope: !1647)
!1647 = distinct !DILexicalBlock(scope: !1643, file: !566, line: 161, column: 33)
!1648 = !DILocation(line: 164, column: 28, scope: !1647)
!1649 = !DILocation(line: 162, column: 21, scope: !1647)
!1650 = !DILocation(line: 165, column: 21, scope: !1647)
!1651 = !DILocation(line: 166, column: 28, scope: !1652)
!1652 = distinct !DILexicalBlock(scope: !1643, file: !566, line: 166, column: 28)
!1653 = !DILocation(line: 166, column: 28, scope: !1643)
!1654 = !DILocation(line: 167, column: 57, scope: !1655)
!1655 = distinct !DILexicalBlock(scope: !1652, file: !566, line: 166, column: 36)
!1656 = !DILocation(line: 167, column: 37, scope: !1655)
!1657 = !DILocation(line: 167, column: 52, scope: !1655)
!1658 = !DILocation(line: 167, column: 50, scope: !1655)
!1659 = !DILocation(line: 167, column: 46, scope: !1655)
!1660 = !DILocation(line: 167, column: 21, scope: !1655)
!1661 = !DILocation(line: 167, column: 55, scope: !1655)
!1662 = !DILocation(line: 168, column: 17, scope: !1655)
!1663 = !DILocation(line: 169, column: 13, scope: !1634)
!1664 = !DILocation(line: 159, column: 51, scope: !1665)
!1665 = !DILexicalBlockFile(scope: !1628, file: !566, discriminator: 1)
!1666 = !DILocation(line: 158, column: 29, scope: !1667)
!1667 = !DILexicalBlockFile(scope: !1624, file: !566, discriminator: 2)
!1668 = !DILocation(line: 158, column: 9, scope: !1667)
!1669 = distinct !{!1669, !1670}
!1670 = !DILocation(line: 158, column: 9, scope: !1620)
!1671 = !DILocation(line: 170, column: 5, scope: !1620)
!1672 = !DILocation(line: 172, column: 5, scope: !565)
!1673 = !DILocation(line: 173, column: 1, scope: !565)
!1674 = !DILocalVariable(name: "logctx", arg: 1, scope: !582, file: !566, line: 179, type: !556)
!1675 = !DILocation(line: 179, column: 41, scope: !582)
!1676 = !DILocalVariable(name: "top_samples_available", arg: 2, scope: !582, file: !566, line: 179, type: !540)
!1677 = !DILocation(line: 179, column: 53, scope: !582)
!1678 = !DILocalVariable(name: "left_samples_available", arg: 3, scope: !582, file: !566, line: 180, type: !540)
!1679 = !DILocation(line: 180, column: 39, scope: !582)
!1680 = !DILocalVariable(name: "mode", arg: 4, scope: !582, file: !566, line: 181, type: !540)
!1681 = !DILocation(line: 181, column: 39, scope: !582)
!1682 = !DILocalVariable(name: "is_chroma", arg: 5, scope: !582, file: !566, line: 181, type: !540)
!1683 = !DILocation(line: 181, column: 49, scope: !582)
!1684 = !DILocation(line: 186, column: 9, scope: !1685)
!1685 = distinct !DILexicalBlock(scope: !582, file: !566, line: 186, column: 9)
!1686 = !DILocation(line: 186, column: 14, scope: !1685)
!1687 = !DILocation(line: 186, column: 9, scope: !582)
!1688 = !DILocation(line: 187, column: 16, scope: !1689)
!1689 = distinct !DILexicalBlock(scope: !1685, file: !566, line: 186, column: 20)
!1690 = !DILocation(line: 187, column: 9, scope: !1689)
!1691 = !DILocation(line: 189, column: 9, scope: !1689)
!1692 = !DILocation(line: 192, column: 11, scope: !1693)
!1693 = distinct !DILexicalBlock(scope: !582, file: !566, line: 192, column: 9)
!1694 = !DILocation(line: 192, column: 33, scope: !1693)
!1695 = !DILocation(line: 192, column: 9, scope: !582)
!1696 = !DILocation(line: 193, column: 20, scope: !1697)
!1697 = distinct !DILexicalBlock(scope: !1693, file: !566, line: 192, column: 44)
!1698 = !DILocation(line: 193, column: 16, scope: !1697)
!1699 = !DILocation(line: 193, column: 14, scope: !1697)
!1700 = !DILocation(line: 194, column: 13, scope: !1701)
!1701 = distinct !DILexicalBlock(scope: !1697, file: !566, line: 194, column: 13)
!1702 = !DILocation(line: 194, column: 18, scope: !1701)
!1703 = !DILocation(line: 194, column: 13, scope: !1697)
!1704 = !DILocation(line: 195, column: 20, scope: !1705)
!1705 = distinct !DILexicalBlock(scope: !1701, file: !566, line: 194, column: 23)
!1706 = !DILocation(line: 195, column: 13, scope: !1705)
!1707 = !DILocation(line: 197, column: 13, scope: !1705)
!1708 = !DILocation(line: 199, column: 5, scope: !1697)
!1709 = !DILocation(line: 201, column: 10, scope: !1710)
!1710 = distinct !DILexicalBlock(scope: !582, file: !566, line: 201, column: 9)
!1711 = !DILocation(line: 201, column: 33, scope: !1710)
!1712 = !DILocation(line: 201, column: 43, scope: !1710)
!1713 = !DILocation(line: 201, column: 9, scope: !582)
!1714 = !DILocation(line: 202, column: 21, scope: !1715)
!1715 = distinct !DILexicalBlock(scope: !1710, file: !566, line: 201, column: 54)
!1716 = !DILocation(line: 202, column: 16, scope: !1715)
!1717 = !DILocation(line: 202, column: 14, scope: !1715)
!1718 = !DILocation(line: 203, column: 13, scope: !1719)
!1719 = distinct !DILexicalBlock(scope: !1715, file: !566, line: 203, column: 13)
!1720 = !DILocation(line: 203, column: 18, scope: !1719)
!1721 = !DILocation(line: 203, column: 13, scope: !1715)
!1722 = !DILocation(line: 204, column: 20, scope: !1723)
!1723 = distinct !DILexicalBlock(scope: !1719, file: !566, line: 203, column: 23)
!1724 = !DILocation(line: 204, column: 13, scope: !1723)
!1725 = !DILocation(line: 206, column: 13, scope: !1723)
!1726 = !DILocation(line: 208, column: 13, scope: !1727)
!1727 = distinct !DILexicalBlock(scope: !1715, file: !566, line: 208, column: 13)
!1728 = !DILocation(line: 208, column: 23, scope: !1727)
!1729 = !DILocation(line: 208, column: 27, scope: !1730)
!1730 = !DILexicalBlockFile(scope: !1727, file: !566, discriminator: 1)
!1731 = !DILocation(line: 208, column: 50, scope: !1730)
!1732 = !DILocation(line: 208, column: 13, scope: !1730)
!1733 = !DILocation(line: 211, column: 23, scope: !1734)
!1734 = distinct !DILexicalBlock(scope: !1727, file: !566, line: 208, column: 61)
!1735 = !DILocation(line: 211, column: 46, scope: !1734)
!1736 = !DILocation(line: 211, column: 21, scope: !1734)
!1737 = !DILocation(line: 210, column: 22, scope: !1734)
!1738 = !DILocation(line: 212, column: 25, scope: !1734)
!1739 = !DILocation(line: 212, column: 30, scope: !1734)
!1740 = !DILocation(line: 212, column: 22, scope: !1734)
!1741 = !DILocation(line: 211, column: 57, scope: !1734)
!1742 = !DILocation(line: 210, column: 18, scope: !1734)
!1743 = !DILocation(line: 213, column: 9, scope: !1734)
!1744 = !DILocation(line: 214, column: 5, scope: !1715)
!1745 = !DILocation(line: 216, column: 12, scope: !582)
!1746 = !DILocation(line: 216, column: 5, scope: !582)
!1747 = !DILocation(line: 217, column: 1, scope: !582)
!1748 = distinct !DISubprogram(name: "ff_h264_parse_ref_count", scope: !566, file: !566, line: 219, type: !1749, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!1749 = !DISubroutineType(types: !1750)
!1750 = !{!540, !1751, !1751, !601, !1752, !540, !540, !556}
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1754)
!1754 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPS", file: !614, line: 136, baseType: !1755)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PPS", file: !614, line: 109, size: 1391104, align: 64, elements: !1756)
!1756 = !{!1757, !1758, !1759, !1760, !1761, !1762, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1779, !1780, !1781, !1782, !1785, !1788, !1794}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !1755, file: !614, line: 110, baseType: !541, size: 32, align: 32)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !1755, file: !614, line: 111, baseType: !540, size: 32, align: 32, offset: 32)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present", scope: !1755, file: !614, line: 112, baseType: !540, size: 32, align: 32, offset: 64)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_count", scope: !1755, file: !614, line: 113, baseType: !540, size: 32, align: 32, offset: 96)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "mb_slice_group_map_type", scope: !1755, file: !614, line: 114, baseType: !540, size: 32, align: 32, offset: 128)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1755, file: !614, line: 115, baseType: !1763, size: 64, align: 32, offset: 160)
!1763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 64, align: 32, elements: !708)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred", scope: !1755, file: !614, line: 116, baseType: !540, size: 32, align: 32, offset: 224)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !1755, file: !614, line: 117, baseType: !540, size: 32, align: 32, offset: 256)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "init_qp", scope: !1755, file: !614, line: 118, baseType: !540, size: 32, align: 32, offset: 288)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "init_qs", scope: !1755, file: !614, line: 119, baseType: !540, size: 32, align: 32, offset: 320)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !1755, file: !614, line: 120, baseType: !707, size: 64, align: 32, offset: 352)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_parameters_present", scope: !1755, file: !614, line: 121, baseType: !540, size: 32, align: 32, offset: 416)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred", scope: !1755, file: !614, line: 122, baseType: !540, size: 32, align: 32, offset: 448)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present", scope: !1755, file: !614, line: 123, baseType: !540, size: 32, align: 32, offset: 480)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode", scope: !1755, file: !614, line: 124, baseType: !540, size: 32, align: 32, offset: 512)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !1755, file: !614, line: 125, baseType: !668, size: 768, align: 8, offset: 544)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !1755, file: !614, line: 126, baseType: !673, size: 3072, align: 8, offset: 1312)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !1755, file: !614, line: 127, baseType: !1776, size: 1408, align: 8, offset: 4384)
!1776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 1408, align: 8, elements: !1777)
!1777 = !{!709, !1778}
!1778 = !DISubrange(count: 88)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_diff", scope: !1755, file: !614, line: 128, baseType: !540, size: 32, align: 32, offset: 5792)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1755, file: !614, line: 129, baseType: !689, size: 32768, align: 8, offset: 5824)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1755, file: !614, line: 130, baseType: !693, size: 64, align: 64, offset: 38592)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_buffer", scope: !1755, file: !614, line: 132, baseType: !1783, size: 270336, align: 32, offset: 38656)
!1783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 270336, align: 32, elements: !1784)
!1784 = !{!670, !1778, !671}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_buffer", scope: !1755, file: !614, line: 133, baseType: !1786, size: 1081344, align: 32, offset: 308992)
!1786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 1081344, align: 32, elements: !1787)
!1787 = !{!670, !1778, !675}
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_coeff", scope: !1755, file: !614, line: 134, baseType: !1789, size: 384, align: 64, offset: 1390336)
!1789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1790, size: 384, align: 64, elements: !1793)
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64, align: 64)
!1791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 512, align: 32, elements: !1792)
!1792 = !{!671}
!1793 = !{!670}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_coeff", scope: !1755, file: !614, line: 135, baseType: !1795, size: 384, align: 64, offset: 1390720)
!1795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1796, size: 384, align: 64, elements: !1793)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1797, size: 64, align: 64)
!1797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 2048, align: 32, elements: !1798)
!1798 = !{!675}
!1799 = !DILocalVariable(name: "plist_count", arg: 1, scope: !1748, file: !566, line: 219, type: !1751)
!1800 = !DILocation(line: 219, column: 34, scope: !1748)
!1801 = !DILocalVariable(name: "ref_count", arg: 2, scope: !1748, file: !566, line: 219, type: !1751)
!1802 = !DILocation(line: 219, column: 51, scope: !1748)
!1803 = !DILocalVariable(name: "gb", arg: 3, scope: !1748, file: !566, line: 220, type: !601)
!1804 = !DILocation(line: 220, column: 44, scope: !1748)
!1805 = !DILocalVariable(name: "pps", arg: 4, scope: !1748, file: !566, line: 220, type: !1752)
!1806 = !DILocation(line: 220, column: 59, scope: !1748)
!1807 = !DILocalVariable(name: "slice_type_nos", arg: 5, scope: !1748, file: !566, line: 221, type: !540)
!1808 = !DILocation(line: 221, column: 33, scope: !1748)
!1809 = !DILocalVariable(name: "picture_structure", arg: 6, scope: !1748, file: !566, line: 221, type: !540)
!1810 = !DILocation(line: 221, column: 53, scope: !1748)
!1811 = !DILocalVariable(name: "logctx", arg: 7, scope: !1748, file: !566, line: 221, type: !556)
!1812 = !DILocation(line: 221, column: 78, scope: !1748)
!1813 = !DILocalVariable(name: "list_count", scope: !1748, file: !566, line: 223, type: !540)
!1814 = !DILocation(line: 223, column: 9, scope: !1748)
!1815 = !DILocalVariable(name: "num_ref_idx_active_override_flag", scope: !1748, file: !566, line: 224, type: !540)
!1816 = !DILocation(line: 224, column: 9, scope: !1748)
!1817 = !DILocation(line: 227, column: 20, scope: !1748)
!1818 = !DILocation(line: 227, column: 25, scope: !1748)
!1819 = !DILocation(line: 227, column: 5, scope: !1748)
!1820 = !DILocation(line: 227, column: 18, scope: !1748)
!1821 = !DILocation(line: 228, column: 20, scope: !1748)
!1822 = !DILocation(line: 228, column: 25, scope: !1748)
!1823 = !DILocation(line: 228, column: 5, scope: !1748)
!1824 = !DILocation(line: 228, column: 18, scope: !1748)
!1825 = !DILocation(line: 230, column: 9, scope: !1826)
!1826 = distinct !DILexicalBlock(scope: !1748, file: !566, line: 230, column: 9)
!1827 = !DILocation(line: 230, column: 24, scope: !1826)
!1828 = !DILocation(line: 230, column: 9, scope: !1748)
!1829 = !DILocalVariable(name: "max", scope: !1830, file: !566, line: 231, type: !1763)
!1830 = distinct !DILexicalBlock(scope: !1826, file: !566, line: 230, column: 46)
!1831 = !DILocation(line: 231, column: 18, scope: !1830)
!1832 = !DILocation(line: 232, column: 27, scope: !1830)
!1833 = !DILocation(line: 232, column: 45, scope: !1830)
!1834 = !DILocation(line: 232, column: 18, scope: !1830)
!1835 = !DILocation(line: 232, column: 25, scope: !1830)
!1836 = !DILocation(line: 232, column: 9, scope: !1830)
!1837 = !DILocation(line: 232, column: 16, scope: !1830)
!1838 = !DILocation(line: 234, column: 54, scope: !1830)
!1839 = !DILocation(line: 234, column: 44, scope: !1830)
!1840 = !DILocation(line: 234, column: 42, scope: !1830)
!1841 = !DILocation(line: 236, column: 13, scope: !1842)
!1842 = distinct !DILexicalBlock(scope: !1830, file: !566, line: 236, column: 13)
!1843 = !DILocation(line: 236, column: 13, scope: !1830)
!1844 = !DILocation(line: 237, column: 42, scope: !1845)
!1845 = distinct !DILexicalBlock(scope: !1842, file: !566, line: 236, column: 47)
!1846 = !DILocation(line: 237, column: 28, scope: !1845)
!1847 = !DILocation(line: 237, column: 46, scope: !1845)
!1848 = !DILocation(line: 237, column: 13, scope: !1845)
!1849 = !DILocation(line: 237, column: 26, scope: !1845)
!1850 = !DILocation(line: 238, column: 17, scope: !1851)
!1851 = distinct !DILexicalBlock(scope: !1845, file: !566, line: 238, column: 17)
!1852 = !DILocation(line: 238, column: 32, scope: !1851)
!1853 = !DILocation(line: 238, column: 17, scope: !1845)
!1854 = !DILocation(line: 239, column: 46, scope: !1855)
!1855 = distinct !DILexicalBlock(scope: !1851, file: !566, line: 238, column: 54)
!1856 = !DILocation(line: 239, column: 32, scope: !1855)
!1857 = !DILocation(line: 239, column: 50, scope: !1855)
!1858 = !DILocation(line: 239, column: 17, scope: !1855)
!1859 = !DILocation(line: 239, column: 30, scope: !1855)
!1860 = !DILocation(line: 240, column: 13, scope: !1855)
!1861 = !DILocation(line: 242, column: 17, scope: !1851)
!1862 = !DILocation(line: 242, column: 30, scope: !1851)
!1863 = !DILocation(line: 243, column: 9, scope: !1845)
!1864 = !DILocation(line: 245, column: 13, scope: !1865)
!1865 = distinct !DILexicalBlock(scope: !1830, file: !566, line: 245, column: 13)
!1866 = !DILocation(line: 245, column: 28, scope: !1865)
!1867 = !DILocation(line: 245, column: 13, scope: !1830)
!1868 = !DILocation(line: 246, column: 24, scope: !1865)
!1869 = !DILocation(line: 246, column: 13, scope: !1865)
!1870 = !DILocation(line: 248, column: 24, scope: !1865)
!1871 = !DILocation(line: 250, column: 13, scope: !1872)
!1872 = distinct !DILexicalBlock(scope: !1830, file: !566, line: 250, column: 13)
!1873 = !DILocation(line: 250, column: 26, scope: !1872)
!1874 = !DILocation(line: 250, column: 32, scope: !1872)
!1875 = !DILocation(line: 250, column: 30, scope: !1872)
!1876 = !DILocation(line: 250, column: 39, scope: !1872)
!1877 = !DILocation(line: 250, column: 43, scope: !1878)
!1878 = !DILexicalBlockFile(scope: !1872, file: !566, discriminator: 1)
!1879 = !DILocation(line: 250, column: 54, scope: !1878)
!1880 = !DILocation(line: 250, column: 59, scope: !1878)
!1881 = !DILocation(line: 250, column: 63, scope: !1882)
!1882 = !DILexicalBlockFile(scope: !1872, file: !566, discriminator: 2)
!1883 = !DILocation(line: 250, column: 76, scope: !1882)
!1884 = !DILocation(line: 250, column: 82, scope: !1882)
!1885 = !DILocation(line: 250, column: 80, scope: !1882)
!1886 = !DILocation(line: 250, column: 13, scope: !1882)
!1887 = !DILocation(line: 251, column: 20, scope: !1888)
!1888 = distinct !DILexicalBlock(scope: !1872, file: !566, line: 250, column: 92)
!1889 = !DILocation(line: 252, column: 20, scope: !1888)
!1890 = !DILocation(line: 252, column: 33, scope: !1888)
!1891 = !DILocation(line: 252, column: 38, scope: !1888)
!1892 = !DILocation(line: 252, column: 46, scope: !1888)
!1893 = !DILocation(line: 252, column: 59, scope: !1888)
!1894 = !DILocation(line: 252, column: 64, scope: !1888)
!1895 = !DILocation(line: 251, column: 13, scope: !1888)
!1896 = !DILocation(line: 253, column: 28, scope: !1888)
!1897 = !DILocation(line: 253, column: 41, scope: !1888)
!1898 = !DILocation(line: 253, column: 13, scope: !1888)
!1899 = !DILocation(line: 253, column: 26, scope: !1888)
!1900 = !DILocation(line: 254, column: 14, scope: !1888)
!1901 = !DILocation(line: 254, column: 26, scope: !1888)
!1902 = !DILocation(line: 255, column: 13, scope: !1888)
!1903 = !DILocation(line: 256, column: 20, scope: !1904)
!1904 = distinct !DILexicalBlock(scope: !1872, file: !566, line: 256, column: 20)
!1905 = !DILocation(line: 256, column: 33, scope: !1904)
!1906 = !DILocation(line: 256, column: 39, scope: !1904)
!1907 = !DILocation(line: 256, column: 37, scope: !1904)
!1908 = !DILocation(line: 256, column: 20, scope: !1872)
!1909 = !DILocation(line: 257, column: 20, scope: !1910)
!1910 = distinct !DILexicalBlock(scope: !1904, file: !566, line: 256, column: 47)
!1911 = !DILocation(line: 258, column: 20, scope: !1910)
!1912 = !DILocation(line: 258, column: 33, scope: !1910)
!1913 = !DILocation(line: 258, column: 38, scope: !1910)
!1914 = !DILocation(line: 257, column: 13, scope: !1910)
!1915 = !DILocation(line: 259, column: 13, scope: !1910)
!1916 = !DILocation(line: 259, column: 26, scope: !1910)
!1917 = !DILocation(line: 260, column: 9, scope: !1910)
!1918 = !DILocation(line: 262, column: 5, scope: !1830)
!1919 = !DILocation(line: 263, column: 20, scope: !1920)
!1920 = distinct !DILexicalBlock(scope: !1826, file: !566, line: 262, column: 12)
!1921 = !DILocation(line: 264, column: 24, scope: !1920)
!1922 = !DILocation(line: 264, column: 37, scope: !1920)
!1923 = !DILocation(line: 264, column: 9, scope: !1920)
!1924 = !DILocation(line: 264, column: 22, scope: !1920)
!1925 = !DILocation(line: 267, column: 20, scope: !1748)
!1926 = !DILocation(line: 267, column: 6, scope: !1748)
!1927 = !DILocation(line: 267, column: 18, scope: !1748)
!1928 = !DILocation(line: 269, column: 5, scope: !1748)
!1929 = !DILocation(line: 271, column: 6, scope: !1748)
!1930 = !DILocation(line: 271, column: 18, scope: !1748)
!1931 = !DILocation(line: 272, column: 5, scope: !1748)
!1932 = !DILocation(line: 272, column: 18, scope: !1748)
!1933 = !DILocation(line: 273, column: 5, scope: !1748)
!1934 = !DILocation(line: 273, column: 18, scope: !1748)
!1935 = !DILocation(line: 274, column: 5, scope: !1748)
!1936 = !DILocation(line: 275, column: 1, scope: !1748)
!1937 = distinct !DISubprogram(name: "ff_h264_init_poc", scope: !566, file: !566, line: 277, type: !1938, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !570)
!1938 = !DISubroutineType(types: !1939)
!1939 = !{!540, !1751, !1751, !611, !1940, !540, !540}
