; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacsbr_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacsbr_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i8*, i8*, i32, i32 }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.SoftFloat = type { i32, i32 }
%struct.AACContext = type { %struct.AVClass*, %struct.AVCodecContext*, %struct.AVFrame*, i32, %struct.DynamicRangeControl, [4 x [16 x %struct.ChannelElement*]], [4 x [16 x %struct.ChannelElement*]], i32, i32, [1024 x i32], %struct.FFTContext, %struct.FFTContext, %struct.FFTContext, %struct.FFTContext, %struct.AVFixedDSPContext*, i32, [64 x %struct.SingleChannelElement*], i32, i32, [8 x i8], [128 x i32], [2 x %struct.OutputConfiguration], i32, i32, i32, void (%struct.AACContext*, %struct.SingleChannelElement*)*, void (%struct.AACContext*, %struct.SingleChannelElement*)*, void (i32*, %struct.TemporalNoiseShaping*, %struct.IndividualChannelStream*, i32)*, void (%struct.AACContext*, i32*, i32*, %struct.IndividualChannelStream*)*, void (%struct.AACContext*, %struct.SingleChannelElement*)*, void (i32*, i32)*, void (i32*, i32*, i32, i32, i32, i8*)*, [8 x i8] }

!946 = !DIEnumerator(name: "T_HUFFMAN_ENV_BAL_1_5DB", value: 2)
!947 = !DIEnumerator(name: "F_HUFFMAN_ENV_BAL_1_5DB", value: 3)
!948 = !DIEnumerator(name: "T_HUFFMAN_ENV_3_0DB", value: 4)
!949 = !DIEnumerator(name: "F_HUFFMAN_ENV_3_0DB", value: 5)
!950 = !DIEnumerator(name: "T_HUFFMAN_ENV_BAL_3_0DB", value: 6)
!951 = !DIEnumerator(name: "F_HUFFMAN_ENV_BAL_3_0DB", value: 7)
!952 = !DIEnumerator(name: "T_HUFFMAN_NOISE_3_0DB", value: 8)
!953 = !DIEnumerator(name: "T_HUFFMAN_NOISE_BAL_3_0DB", value: 9)
!954 = !{!955, !959, !965, !969, !970, !973, !977, !986, !988, !958, !992, !985, !994}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !957, line: 37, baseType: !958)
!957 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!958 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 65536, align: 32, elements: !962)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!962 = !{!963, !963, !964}
!963 = !DISubrange(count: 32)
!964 = !DISubrange(count: 2)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 2560, align: 32, elements: !967)
!967 = !{!968, !964}
!968 = !DISubrange(count: 40)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 64, align: 32, elements: !972)
!972 = !{!964}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 4096, align: 32, elements: !975)
!975 = !{!976, !964}
!976 = !DISubrange(count: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !980, line: 221, size: 32, align: 8, elements: !981)
!980 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !979, file: !980, line: 221, baseType: !983, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !984, line: 51, baseType: !985)
!984 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!985 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !984, line: 48, baseType: !987)
!987 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !984, line: 37, baseType: !991)
!991 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !984, line: 40, baseType: !993)
!993 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !984, line: 38, baseType: !958)
!995 = !{!996, !1001, !1020, !1024, !1028, !1032, !1036, !1040, !1044, !1048, !1049, !1053, !1057, !1070, !1075, !1078, !1079, !1080, !1084, !1086, !1087, !1088, !1092, !1094, !1095, !1096, !1103, !1105, !1106, !1107, !1109, !1110, !1111, !1112, !1117, !1121, !2527, !2528, !2529, !2533, !2534, !2536, !2538, !2540, !2542, !2544, !2545, !2550, !2555, !2560, !2562, !2563, !2564, !2565, !2566, !2575}
!996 = distinct !DIGlobalVariable(name: "ff_sbr_noise_table_fixed", scope: !0, file: !997, line: 271, type: !998, isLocal: false, isDefinition: true, variable: [520 x [2 x i32]]* @ff_sbr_noise_table_fixed)
!997 = !DIFile(filename: "libavcodec/aacsbrdata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 33280, align: 32, elements: !999)
!999 = !{!1000, !964}
!1000 = !DISubrange(count: 520)
!1001 = distinct !DIGlobalVariable(name: "sbr_tmp", scope: !1002, file: !1003, line: 54, type: !1007, isLocal: true, isDefinition: true, variable: [10 x %struct.anon]* @ff_aac_sbr_init_fixed.sbr_tmp)
!1002 = distinct !DISubprogram(name: "ff_aac_sbr_init_fixed", scope: !1003, file: !1003, line: 49, type: !1004, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1006)
!1003 = !DIFile(filename: "libavcodec/aacsbr_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null}
!1006 = !{}
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 1920, align: 64, elements: !1018)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1002, file: !1003, line: 51, size: 192, align: 64, elements: !1010)
!1010 = !{!1011, !1014, !1015, !1017}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_codes", scope: !1009, file: !1003, line: 52, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_bits", scope: !1009, file: !1003, line: 52, baseType: !1012, size: 64, align: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1009, file: !1003, line: 53, baseType: !1016, size: 32, align: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !1009, file: !1003, line: 53, baseType: !1016, size: 32, align: 32, offset: 160)
!1018 = !{!1019}
!1019 = !DISubrange(count: 10)
!1020 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 68, type: !1021, isLocal: true, isDefinition: true, variable: [1098 x [2 x i16]]* @ff_aac_sbr_init_fixed.table)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 35136, align: 16, elements: !1022)
!1022 = !{!1023, !964}
!1023 = !DISubrange(count: 1098)
!1024 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 69, type: !1025, isLocal: true, isDefinition: true, variable: [1092 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.1)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 34944, align: 16, elements: !1026)
!1026 = !{!1027, !964}
!1027 = !DISubrange(count: 1092)
!1028 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 70, type: !1029, isLocal: true, isDefinition: true, variable: [768 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.2)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 24576, align: 16, elements: !1030)
!1030 = !{!1031, !964}
!1031 = !DISubrange(count: 768)
!1032 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 71, type: !1033, isLocal: true, isDefinition: true, variable: [1026 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.3)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 32832, align: 16, elements: !1034)
!1034 = !{!1035, !964}
!1035 = !DISubrange(count: 1026)
!1036 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 72, type: !1037, isLocal: true, isDefinition: true, variable: [1058 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.4)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 33856, align: 16, elements: !1038)
!1038 = !{!1039, !964}
!1039 = !DISubrange(count: 1058)
!1040 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 73, type: !1041, isLocal: true, isDefinition: true, variable: [1052 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.5)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 33664, align: 16, elements: !1042)
!1042 = !{!1043, !964}
!1043 = !DISubrange(count: 1052)
!1044 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 74, type: !1045, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.6)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 17408, align: 16, elements: !1046)
!1046 = !{!1047, !964}
!1047 = !DISubrange(count: 544)
!1048 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 75, type: !1045, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.7)
!1049 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 76, type: !1050, isLocal: true, isDefinition: true, variable: [592 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.8)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 18944, align: 16, elements: !1051)
!1051 = !{!1052, !964}
!1052 = !DISubrange(count: 592)
!1053 = distinct !DIGlobalVariable(name: "table", scope: !1002, file: !1003, line: 77, type: !1054, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_aac_sbr_init_fixed.table.9)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 16384, align: 16, elements: !1055)
!1055 = !{!1056, !964}
!1056 = !DISubrange(count: 512)
!1057 = distinct !DIGlobalVariable(name: "vlc_sbr", scope: !0, file: !1058, line: 75, type: !1059, isLocal: true, isDefinition: true, variable: [10 x %struct.VLC]* @vlc_sbr)
!1058 = !DIFile(filename: "libavcodec/aacsbr_fixed.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 1920, align: 64, elements: !1018)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !1061, line: 30, baseType: !1062)
!1061 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !1061, line: 26, size: 192, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1068, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1062, file: !1061, line: 27, baseType: !958, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1062, file: !1061, line: 28, baseType: !1066, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 32, align: 16, elements: !972)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1062, file: !1061, line: 29, baseType: !958, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !1062, file: !1061, line: 29, baseType: !958, size: 32, align: 32, offset: 160)
!1070 = distinct !DIGlobalVariable(name: "t_huffman_env_1_5dB_codes", scope: !0, file: !997, line: 56, type: !1071, isLocal: true, isDefinition: true, variable: [121 x i32]* @t_huffman_env_1_5dB_codes)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 3872, align: 32, elements: !1073)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1073 = !{!1074}
!1074 = !DISubrange(count: 121)
!1075 = distinct !DIGlobalVariable(name: "t_huffman_env_1_5dB_bits", scope: !0, file: !997, line: 37, type: !1076, isLocal: true, isDefinition: true, variable: [121 x i8]* @t_huffman_env_1_5dB_bits)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 968, align: 8, elements: !1073)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1078 = distinct !DIGlobalVariable(name: "f_huffman_env_1_5dB_codes", scope: !0, file: !997, line: 94, type: !1071, isLocal: true, isDefinition: true, variable: [121 x i32]* @f_huffman_env_1_5dB_codes)
!1079 = distinct !DIGlobalVariable(name: "f_huffman_env_1_5dB_bits", scope: !0, file: !997, line: 75, type: !1076, isLocal: true, isDefinition: true, variable: [121 x i8]* @f_huffman_env_1_5dB_bits)
!1080 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_1_5dB_codes", scope: !0, file: !997, line: 123, type: !1081, isLocal: true, isDefinition: true, variable: [49 x i32]* @t_huffman_env_bal_1_5dB_codes)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 1568, align: 32, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 49)
!1084 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_1_5dB_bits", scope: !0, file: !997, line: 113, type: !1085, isLocal: true, isDefinition: true, variable: [49 x i8]* @t_huffman_env_bal_1_5dB_bits)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 392, align: 8, elements: !1082)
!1086 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_1_5dB_codes", scope: !0, file: !997, line: 143, type: !1081, isLocal: true, isDefinition: true, variable: [49 x i32]* @f_huffman_env_bal_1_5dB_codes)
!1087 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_1_5dB_bits", scope: !0, file: !997, line: 133, type: !1085, isLocal: true, isDefinition: true, variable: [49 x i8]* @f_huffman_env_bal_1_5dB_bits)
!1088 = distinct !DIGlobalVariable(name: "t_huffman_env_3_0dB_codes", scope: !0, file: !997, line: 164, type: !1089, isLocal: true, isDefinition: true, variable: [63 x i32]* @t_huffman_env_3_0dB_codes)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 2016, align: 32, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 63)
!1092 = distinct !DIGlobalVariable(name: "t_huffman_env_3_0dB_bits", scope: !0, file: !997, line: 153, type: !1093, isLocal: true, isDefinition: true, variable: [63 x i8]* @t_huffman_env_3_0dB_bits)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 504, align: 8, elements: !1090)
!1094 = distinct !DIGlobalVariable(name: "f_huffman_env_3_0dB_codes", scope: !0, file: !997, line: 186, type: !1089, isLocal: true, isDefinition: true, variable: [63 x i32]* @f_huffman_env_3_0dB_codes)
!1095 = distinct !DIGlobalVariable(name: "f_huffman_env_3_0dB_bits", scope: !0, file: !997, line: 175, type: !1093, isLocal: true, isDefinition: true, variable: [63 x i8]* @f_huffman_env_3_0dB_bits)
!1096 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_3_0dB_codes", scope: !0, file: !997, line: 204, type: !1097, isLocal: true, isDefinition: true, variable: [25 x i16]* @t_huffman_env_bal_3_0dB_codes)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 400, align: 16, elements: !1101)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !984, line: 49, baseType: !1100)
!1100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1101 = !{!1102}
!1102 = !DISubrange(count: 25)
!1103 = distinct !DIGlobalVariable(name: "t_huffman_env_bal_3_0dB_bits", scope: !0, file: !997, line: 197, type: !1104, isLocal: true, isDefinition: true, variable: [25 x i8]* @t_huffman_env_bal_3_0dB_bits)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 200, align: 8, elements: !1101)
!1105 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_3_0dB_codes", scope: !0, file: !997, line: 218, type: !1097, isLocal: true, isDefinition: true, variable: [25 x i16]* @f_huffman_env_bal_3_0dB_codes)
!1106 = distinct !DIGlobalVariable(name: "f_huffman_env_bal_3_0dB_bits", scope: !0, file: !997, line: 211, type: !1104, isLocal: true, isDefinition: true, variable: [25 x i8]* @f_huffman_env_bal_3_0dB_bits)
!1107 = distinct !DIGlobalVariable(name: "t_huffman_noise_3_0dB_codes", scope: !0, file: !997, line: 236, type: !1108, isLocal: true, isDefinition: true, variable: [63 x i16]* @t_huffman_noise_3_0dB_codes)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 1008, align: 16, elements: !1090)
!1109 = distinct !DIGlobalVariable(name: "t_huffman_noise_3_0dB_bits", scope: !0, file: !997, line: 225, type: !1093, isLocal: true, isDefinition: true, variable: [63 x i8]* @t_huffman_noise_3_0dB_bits)
!1110 = distinct !DIGlobalVariable(name: "t_huffman_noise_bal_3_0dB_codes", scope: !0, file: !997, line: 254, type: !1104, isLocal: true, isDefinition: true, variable: [25 x i8]* @t_huffman_noise_bal_3_0dB_codes)
!1111 = distinct !DIGlobalVariable(name: "t_huffman_noise_bal_3_0dB_bits", scope: !0, file: !997, line: 247, type: !1104, isLocal: true, isDefinition: true, variable: [25 x i8]* @t_huffman_noise_bal_3_0dB_bits)
!1112 = distinct !DIGlobalVariable(name: "sbr_qmf_window_us", scope: !0, file: !1113, line: 30, type: !1114, isLocal: true, isDefinition: true, variable: [640 x i32]* @sbr_qmf_window_us)
!1113 = !DIFile(filename: "libavcodec/aacsbr_tablegen_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 20480, align: 32, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 640)
!1117 = distinct !DIGlobalVariable(name: "sbr_qmf_window_ds", scope: !0, file: !1113, line: 29, type: !1118, isLocal: true, isDefinition: true, variable: [320 x i32]* @sbr_qmf_window_ds)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 10240, align: 32, elements: !1119)
!1119 = !{!1120}
!1120 = !DISubrange(count: 320)
!1121 = distinct !DIGlobalVariable(name: "bands_warped", scope: !1122, file: !1003, line: 140, type: !2526, isLocal: true, isDefinition: true, variable: [3 x i32]* @sbr_make_f_tablelim.bands_warped)
!1122 = distinct !DISubprogram(name: "sbr_make_f_tablelim", scope: !1003, file: !1003, line: 136, type: !1123, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1006)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectralBandReplication", file: !1127, line: 115, baseType: !1128)
!1127 = !DIFile(filename: "libavcodec/sbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectralBandReplication", file: !1127, line: 139, size: 3471872, align: 256, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1156, !1158, !1159, !1160, !1161, !1244, !1363, !1364, !1365, !1366, !1368, !1370, !1371, !1373, !1377, !1378, !1380, !1381, !1384, !1387, !1390, !1392, !1393, !1396, !1397, !1399, !1400, !1401, !1402, !1403, !1406, !1451, !1452, !1502}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1128, file: !1127, line: 140, baseType: !958, size: 32, align: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1128, file: !1127, line: 141, baseType: !958, size: 32, align: 32, offset: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ready_for_dequant", scope: !1128, file: !1127, line: 142, baseType: !958, size: 32, align: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "id_aac", scope: !1128, file: !1127, line: 143, baseType: !958, size: 32, align: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1128, file: !1127, line: 144, baseType: !958, size: 32, align: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "spectrum_params", scope: !1128, file: !1127, line: 145, baseType: !1136, size: 48, align: 8, offset: 160)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpectrumParameters", file: !1127, line: 55, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpectrumParameters", file: !1127, line: 42, size: 48, align: 8, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "bs_start_freq", scope: !1137, file: !1127, line: 43, baseType: !986, size: 8, align: 8)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "bs_stop_freq", scope: !1137, file: !1127, line: 44, baseType: !986, size: 8, align: 8, offset: 8)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "bs_xover_band", scope: !1137, file: !1127, line: 45, baseType: !986, size: 8, align: 8, offset: 16)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_scale", scope: !1137, file: !1127, line: 51, baseType: !986, size: 8, align: 8, offset: 24)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bs_alter_scale", scope: !1137, file: !1127, line: 52, baseType: !986, size: 8, align: 8, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bs_noise_bands", scope: !1137, file: !1127, line: 53, baseType: !986, size: 8, align: 8, offset: 40)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res_header", scope: !1128, file: !1127, line: 146, baseType: !958, size: 32, align: 32, offset: 224)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_bands", scope: !1128, file: !1127, line: 151, baseType: !985, size: 32, align: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bs_limiter_gains", scope: !1128, file: !1127, line: 152, baseType: !985, size: 32, align: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "bs_interpol_freq", scope: !1128, file: !1127, line: 153, baseType: !985, size: 32, align: 32, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "bs_smoothing_mode", scope: !1128, file: !1127, line: 154, baseType: !985, size: 32, align: 32, offset: 352)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "bs_coupling", scope: !1128, file: !1127, line: 156, baseType: !985, size: 32, align: 32, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1128, file: !1127, line: 157, baseType: !1152, size: 160, align: 32, offset: 416)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 160, align: 32, elements: !1154)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !957, line: 42, baseType: !958)
!1154 = !{!1155}
!1155 = !DISubrange(count: 5)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !1128, file: !1127, line: 160, baseType: !1157, size: 64, align: 32, offset: 576)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 64, align: 32, elements: !972)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1128, file: !1127, line: 162, baseType: !1157, size: 64, align: 32, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "kx_and_m_pushed", scope: !1128, file: !1127, line: 163, baseType: !985, size: 32, align: 32, offset: 704)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "n_master", scope: !1128, file: !1127, line: 165, baseType: !1153, size: 32, align: 32, offset: 736)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !1127, line: 166, baseType: !1162, size: 1684992, align: 256, offset: 768)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 1684992, align: 256, elements: !972)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRData", file: !1127, line: 113, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRData", file: !1127, line: 62, size: 842496, align: 256, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1173, !1174, !1176, !1178, !1181, !1185, !1186, !1190, !1194, !1195, !1197, !1199, !1202, !1203, !1207, !1218, !1219, !1223, !1227, !1229, !1233, !1235, !1238, !1239, !1242, !1243}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "bs_frame_class", scope: !1164, file: !1127, line: 67, baseType: !985, size: 32, align: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic_flag", scope: !1164, file: !1127, line: 68, baseType: !985, size: 32, align: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_env", scope: !1164, file: !1127, line: 69, baseType: !1153, size: 32, align: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "bs_freq_res", scope: !1164, file: !1127, line: 70, baseType: !1170, size: 56, align: 8, offset: 96)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 56, align: 8, elements: !1171)
!1171 = !{!1172}
!1172 = !DISubrange(count: 7)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "bs_num_noise", scope: !1164, file: !1127, line: 71, baseType: !1153, size: 32, align: 32, offset: 160)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_env", scope: !1164, file: !1127, line: 72, baseType: !1175, size: 40, align: 8, offset: 192)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 40, align: 8, elements: !1154)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "bs_df_noise", scope: !1164, file: !1127, line: 73, baseType: !1177, size: 16, align: 8, offset: 232)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 16, align: 8, elements: !972)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "bs_invf_mode", scope: !1164, file: !1127, line: 74, baseType: !1179, size: 80, align: 8, offset: 248)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 80, align: 8, elements: !1180)
!1180 = !{!964, !1155}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "bs_add_harmonic", scope: !1164, file: !1127, line: 75, baseType: !1182, size: 384, align: 8, offset: 328)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 384, align: 8, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 48)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "bs_amp_res", scope: !1164, file: !1127, line: 76, baseType: !985, size: 32, align: 32, offset: 736)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples", scope: !1164, file: !1127, line: 83, baseType: !1187, size: 73728, align: 32, offset: 768)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 73728, align: 32, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 2304)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "analysis_filterbank_samples", scope: !1164, file: !1127, line: 84, baseType: !1191, size: 41984, align: 32, offset: 74496)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 41984, align: 32, elements: !1192)
!1192 = !{!1193}
!1193 = !DISubrange(count: 1312)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "synthesis_filterbank_samples_offset", scope: !1164, file: !1127, line: 85, baseType: !958, size: 32, align: 32, offset: 116480)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "e_a", scope: !1164, file: !1127, line: 87, baseType: !1196, size: 64, align: 32, offset: 116512)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 64, align: 32, elements: !972)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "bw_array", scope: !1164, file: !1127, line: 89, baseType: !1198, size: 160, align: 32, offset: 116576)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 160, align: 32, elements: !1154)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !1164, file: !1127, line: 91, baseType: !1200, size: 131072, align: 32, offset: 116736)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 131072, align: 32, elements: !1201)
!1201 = !{!964, !963, !963, !964}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "Ypos", scope: !1164, file: !1127, line: 93, baseType: !958, size: 32, align: 32, offset: 247808)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !1164, file: !1127, line: 94, baseType: !1204, size: 311296, align: 32, offset: 247936)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 311296, align: 32, elements: !1205)
!1205 = !{!964, !1206, !976, !964}
!1206 = !DISubrange(count: 38)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "g_temp", scope: !1164, file: !1127, line: 95, baseType: !1208, size: 129024, align: 32, offset: 559232)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 129024, align: 32, elements: !1216)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !957, line: 41, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "SoftFloat", file: !1211, line: 37, baseType: !1212)
!1211 = !DIFile(filename: "./libavutil/softfloat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftFloat", file: !1211, line: 34, size: 64, align: 32, elements: !1213)
!1213 = !{!1214, !1215}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "mant", scope: !1212, file: !1211, line: 35, baseType: !994, size: 32, align: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1212, file: !1211, line: 36, baseType: !994, size: 32, align: 32, offset: 32)
!1216 = !{!1217, !1184}
!1217 = !DISubrange(count: 42)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "q_temp", scope: !1164, file: !1127, line: 96, baseType: !1208, size: 129024, align: 32, offset: 688256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "s_indexmapped", scope: !1164, file: !1127, line: 97, baseType: !1220, size: 3072, align: 8, offset: 817280)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 3072, align: 8, elements: !1221)
!1221 = !{!1222, !1184}
!1222 = !DISubrange(count: 8)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs_q", scope: !1164, file: !1127, line: 99, baseType: !1224, size: 2304, align: 8, offset: 820352)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 2304, align: 8, elements: !1225)
!1225 = !{!1226, !1184}
!1226 = !DISubrange(count: 6)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "env_facs", scope: !1164, file: !1127, line: 100, baseType: !1228, size: 18432, align: 32, offset: 822656)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 18432, align: 32, elements: !1225)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs_q", scope: !1164, file: !1127, line: 102, baseType: !1230, size: 120, align: 8, offset: 841088)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 120, align: 8, elements: !1231)
!1231 = !{!1232, !1155}
!1232 = !DISubrange(count: 3)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "noise_facs", scope: !1164, file: !1127, line: 103, baseType: !1234, size: 960, align: 32, offset: 841216)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 960, align: 32, elements: !1231)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "t_env", scope: !1164, file: !1127, line: 105, baseType: !1236, size: 64, align: 8, offset: 842176)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 64, align: 8, elements: !1237)
!1237 = !{!1222}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "t_env_num_env_old", scope: !1164, file: !1127, line: 107, baseType: !986, size: 8, align: 8, offset: 842240)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "t_q", scope: !1164, file: !1127, line: 109, baseType: !1240, size: 24, align: 8, offset: 842248)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 24, align: 8, elements: !1241)
!1241 = !{!1232}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexnoise", scope: !1164, file: !1127, line: 110, baseType: !985, size: 32, align: 32, offset: 842272)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "f_indexsine", scope: !1164, file: !1127, line: 111, baseType: !985, size: 32, align: 32, offset: 842304)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !1128, file: !1127, line: 167, baseType: !1245, size: 1072896, align: 128, offset: 1685760)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSContext", file: !1246, line: 79, baseType: !1247)
!1246 = !DIFile(filename: "libavcodec/aacps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSContext", file: !1246, line: 41, size: 1072896, align: 128, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1265, !1271, !1272, !1273, !1274, !1275, !1276, !1280, !1285, !1290, !1293, !1294, !1295, !1298, !1299, !1300, !1301, !1304, !1305, !1307, !1308}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1247, file: !1246, line: 42, baseType: !958, size: 32, align: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "enable_iid", scope: !1247, file: !1246, line: 43, baseType: !958, size: 32, align: 32, offset: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "iid_quant", scope: !1247, file: !1246, line: 44, baseType: !958, size: 32, align: 32, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nr_iid_par", scope: !1247, file: !1246, line: 45, baseType: !958, size: 32, align: 32, offset: 96)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ipdopd_par", scope: !1247, file: !1246, line: 46, baseType: !958, size: 32, align: 32, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "enable_icc", scope: !1247, file: !1246, line: 47, baseType: !958, size: 32, align: 32, offset: 160)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "icc_mode", scope: !1247, file: !1246, line: 48, baseType: !958, size: 32, align: 32, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "nr_icc_par", scope: !1247, file: !1246, line: 49, baseType: !958, size: 32, align: 32, offset: 224)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ext", scope: !1247, file: !1246, line: 50, baseType: !958, size: 32, align: 32, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "frame_class", scope: !1247, file: !1246, line: 51, baseType: !958, size: 32, align: 32, offset: 288)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "num_env_old", scope: !1247, file: !1246, line: 52, baseType: !958, size: 32, align: 32, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "num_env", scope: !1247, file: !1246, line: 53, baseType: !958, size: 32, align: 32, offset: 352)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "enable_ipdopd", scope: !1247, file: !1246, line: 54, baseType: !958, size: 32, align: 32, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "border_position", scope: !1247, file: !1246, line: 55, baseType: !1263, size: 192, align: 32, offset: 416)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 192, align: 32, elements: !1264)
!1264 = !{!1226}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "iid_par", scope: !1247, file: !1246, line: 56, baseType: !1266, size: 1360, align: 8, offset: 608)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1267, size: 1360, align: 8, elements: !1269)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !984, line: 36, baseType: !1268)
!1268 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1269 = !{!1155, !1270}
!1270 = !DISubrange(count: 34)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "icc_par", scope: !1247, file: !1246, line: 57, baseType: !1266, size: 1360, align: 8, offset: 1968)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_par", scope: !1247, file: !1246, line: 59, baseType: !1266, size: 1360, align: 8, offset: 3328)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opd_par", scope: !1247, file: !1246, line: 60, baseType: !1266, size: 1360, align: 8, offset: 4688)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands", scope: !1247, file: !1246, line: 61, baseType: !958, size: 32, align: 32, offset: 6048)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "is34bands_old", scope: !1247, file: !1246, line: 62, baseType: !958, size: 32, align: 32, offset: 6080)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1247, file: !1246, line: 64, baseType: !1277, size: 14080, align: 32, offset: 6144)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 14080, align: 32, elements: !1278)
!1278 = !{!1155, !1279, !964}
!1279 = !DISubrange(count: 44)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1247, file: !1246, line: 65, baseType: !1281, size: 267904, align: 32, offset: 20224)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 267904, align: 32, elements: !1282)
!1282 = !{!1283, !1284, !964}
!1283 = !DISubrange(count: 91)
!1284 = !DISubrange(count: 46)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "ap_delay", scope: !1247, file: !1246, line: 66, baseType: !1286, size: 355200, align: 32, offset: 288128)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 355200, align: 32, elements: !1287)
!1287 = !{!1288, !1232, !1289, !964}
!1288 = !DISubrange(count: 50)
!1289 = !DISubrange(count: 37)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_nrg", scope: !1247, file: !1246, line: 67, baseType: !1291, size: 1088, align: 32, offset: 643328)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 1088, align: 32, elements: !1292)
!1292 = !{!1270}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "power_smooth", scope: !1247, file: !1246, line: 68, baseType: !1291, size: 1088, align: 32, offset: 644480)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "peak_decay_diff_smooth", scope: !1247, file: !1246, line: 69, baseType: !1291, size: 1088, align: 32, offset: 645632)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "H11", scope: !1247, file: !1246, line: 70, baseType: !1296, size: 13056, align: 32, offset: 646784)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 13056, align: 32, elements: !1297)
!1297 = !{!964, !1226, !1270}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "H12", scope: !1247, file: !1246, line: 71, baseType: !1296, size: 13056, align: 32, offset: 659840)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "H21", scope: !1247, file: !1246, line: 72, baseType: !1296, size: 13056, align: 32, offset: 672896)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "H22", scope: !1247, file: !1246, line: 73, baseType: !1296, size: 13056, align: 32, offset: 685952)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "Lbuf", scope: !1247, file: !1246, line: 74, baseType: !1302, size: 186368, align: 32, offset: 699008)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 186368, align: 32, elements: !1303)
!1303 = !{!1283, !963, !964}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "Rbuf", scope: !1247, file: !1246, line: 75, baseType: !1302, size: 186368, align: 32, offset: 885376)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "opd_hist", scope: !1247, file: !1246, line: 76, baseType: !1306, size: 272, align: 8, offset: 1071744)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1267, size: 272, align: 8, elements: !1292)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ipd_hist", scope: !1247, file: !1246, line: 77, baseType: !1306, size: 272, align: 8, offset: 1072016)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1247, file: !1246, line: 78, baseType: !1309, size: 512, align: 64, offset: 1072320)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PSDSPContext", file: !1310, line: 52, baseType: !1311)
!1310 = !DIFile(filename: "libavcodec/aacpsdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PSDSPContext", file: !1310, line: 32, size: 512, align: 64, elements: !1312)
!1312 = !{!1313, !1317, !1323, !1332, !1342, !1346, !1354}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "add_squares", scope: !1311, file: !1310, line: 33, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{null, !955, !970, !958}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "mul_pair_single", scope: !1311, file: !1310, line: 34, baseType: !1318, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{null, !1321, !1321, !955, !958}
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 64, align: 32, elements: !972)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis", scope: !1311, file: !1310, line: 36, baseType: !1324, size: 64, align: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{null, !1321, !1321, !1327, !1330, !958}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 512, align: 32, elements: !1329)
!1329 = !{!1222, !964}
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1331, line: 149, baseType: !993)
!1331 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_analysis_ileave", scope: !1311, file: !1310, line: 39, baseType: !1333, size: 64, align: 64, offset: 192)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{null, !1336, !1339, !958, !958}
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 2048, align: 32, elements: !1338)
!1338 = !{!963, !964}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 77824, align: 32, elements: !1341)
!1341 = !{!1206, !976}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "hybrid_synthesis_deint", scope: !1311, file: !1310, line: 41, baseType: !1343, size: 64, align: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !1339, !1336, !958, !958}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "decorrelate", scope: !1311, file: !1310, line: 43, baseType: !1347, size: 64, align: 64, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{null, !1321, !1321, !1350, !1353, !970, !1353, !956, !958}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 2368, align: 32, elements: !1352)
!1352 = !{!1289, !964}
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_interpolate", scope: !1311, file: !1310, line: 49, baseType: !1355, size: 128, align: 64, offset: 384)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1356, size: 128, align: 64, elements: !972)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{null, !1321, !1321, !1359, !1359, !958}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, align: 32, elements: !1361)
!1361 = !{!1362}
!1362 = !DISubrange(count: 4)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1128, file: !1127, line: 169, baseType: !1157, size: 64, align: 32, offset: 2758656)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "n_q", scope: !1128, file: !1127, line: 171, baseType: !1153, size: 32, align: 32, offset: 2758720)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "n_lim", scope: !1128, file: !1127, line: 173, baseType: !1153, size: 32, align: 32, offset: 2758752)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "f_master", scope: !1128, file: !1127, line: 175, baseType: !1367, size: 784, align: 16, offset: 2758784)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 784, align: 16, elements: !1082)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelow", scope: !1128, file: !1127, line: 177, baseType: !1369, size: 400, align: 16, offset: 2759568)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 400, align: 16, elements: !1101)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablehigh", scope: !1128, file: !1127, line: 179, baseType: !1367, size: 784, align: 16, offset: 2759968)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablenoise", scope: !1128, file: !1127, line: 181, baseType: !1372, size: 96, align: 16, offset: 2760752)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 96, align: 16, elements: !1264)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "f_tablelim", scope: !1128, file: !1127, line: 183, baseType: !1374, size: 480, align: 16, offset: 2760848)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 480, align: 16, elements: !1375)
!1375 = !{!1376}
!1376 = !DISubrange(count: 30)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "num_patches", scope: !1128, file: !1127, line: 184, baseType: !1153, size: 32, align: 32, offset: 2761344)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "patch_num_subbands", scope: !1128, file: !1127, line: 185, baseType: !1379, size: 48, align: 8, offset: 2761376)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 48, align: 8, elements: !1264)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "patch_start_subband", scope: !1128, file: !1127, line: 186, baseType: !1379, size: 48, align: 8, offset: 2761424)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "X_low", scope: !1128, file: !1127, line: 188, baseType: !1382, size: 81920, align: 32, offset: 2761472)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 81920, align: 32, elements: !1383)
!1383 = !{!963, !968, !964}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "X_high", scope: !1128, file: !1127, line: 190, baseType: !1385, size: 163840, align: 32, offset: 2843392)
!1385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 163840, align: 32, elements: !1386)
!1386 = !{!976, !968, !964}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !1128, file: !1127, line: 192, baseType: !1388, size: 311296, align: 32, offset: 3007232)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 311296, align: 32, elements: !1389)
!1389 = !{!964, !964, !1206, !976}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "alpha0", scope: !1128, file: !1127, line: 194, baseType: !1391, size: 4096, align: 32, offset: 3318528)
!1391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 4096, align: 32, elements: !975)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !1128, file: !1127, line: 196, baseType: !1391, size: 4096, align: 32, offset: 3322624)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "e_origmapped", scope: !1128, file: !1127, line: 198, baseType: !1394, size: 21504, align: 32, offset: 3326720)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 21504, align: 32, elements: !1395)
!1395 = !{!1172, !1184}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "q_mapped", scope: !1128, file: !1127, line: 200, baseType: !1394, size: 21504, align: 32, offset: 3348224)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "s_mapped", scope: !1128, file: !1127, line: 202, baseType: !1398, size: 2688, align: 8, offset: 3369728)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 2688, align: 8, elements: !1395)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "e_curr", scope: !1128, file: !1127, line: 204, baseType: !1394, size: 21504, align: 32, offset: 3372416)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "q_m", scope: !1128, file: !1127, line: 206, baseType: !1394, size: 21504, align: 32, offset: 3393920)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "s_m", scope: !1128, file: !1127, line: 208, baseType: !1394, size: 21504, align: 32, offset: 3415424)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1128, file: !1127, line: 209, baseType: !1394, size: 21504, align: 32, offset: 3436928)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_filter_scratch", scope: !1128, file: !1127, line: 210, baseType: !1404, size: 10240, align: 32, offset: 3458560)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 10240, align: 32, elements: !1405)
!1405 = !{!1155, !976}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_ana", scope: !1128, file: !1127, line: 211, baseType: !1407, size: 896, align: 64, offset: 3468800)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !919, line: 67, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !919, line: 88, size: 896, align: 64, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1414, !1422, !1423, !1424, !1426, !1427, !1432, !1433, !1439, !1440, !1441, !1447, !1448, !1449}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1408, file: !919, line: 89, baseType: !958, size: 32, align: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1408, file: !919, line: 90, baseType: !958, size: 32, align: 32, offset: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1408, file: !919, line: 91, baseType: !1413, size: 64, align: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1408, file: !919, line: 92, baseType: !1415, size: 64, align: 64, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !919, line: 64, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !919, line: 62, size: 64, align: 32, elements: !1418)
!1418 = !{!1419, !1421}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1417, file: !919, line: 63, baseType: !1420, size: 32, align: 32)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !919, line: 52, baseType: !994)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1417, file: !919, line: 63, baseType: !1420, size: 32, align: 32, offset: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1408, file: !919, line: 93, baseType: !958, size: 32, align: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1408, file: !919, line: 94, baseType: !958, size: 32, align: 32, offset: 224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1408, file: !919, line: 96, baseType: !1425, size: 64, align: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1408, file: !919, line: 97, baseType: !1425, size: 64, align: 64, offset: 320)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1408, file: !919, line: 101, baseType: !1428, size: 64, align: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1431, !1415}
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1408, file: !919, line: 106, baseType: !1428, size: 64, align: 64, offset: 448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1408, file: !919, line: 107, baseType: !1434, size: 64, align: 64, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{null, !1431, !1425, !1437}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1408, file: !919, line: 108, baseType: !1434, size: 64, align: 64, offset: 576)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1408, file: !919, line: 109, baseType: !1434, size: 64, align: 64, offset: 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1408, file: !919, line: 110, baseType: !1442, size: 64, align: 64, offset: 704)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{null, !1431, !1445, !1437}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !919, line: 66, baseType: !958)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1408, file: !919, line: 111, baseType: !918, size: 32, align: 32, offset: 768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1408, file: !919, line: 112, baseType: !924, size: 32, align: 32, offset: 800)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1408, file: !919, line: 113, baseType: !1450, size: 64, align: 64, offset: 832)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1128, file: !1127, line: 212, baseType: !1407, size: 896, align: 64, offset: 3469696)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !1128, file: !1127, line: 213, baseType: !1453, size: 896, align: 64, offset: 3470592)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !1454, line: 45, baseType: !1455)
!1454 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !1454, line: 28, size: 896, align: 64, elements: !1456)
!1456 = !{!1457, !1461, !1465, !1466, !1467, !1471, !1475, !1479, !1486, !1490, !1497}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !1455, file: !1454, line: 29, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !955}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !1455, file: !1454, line: 30, baseType: !1462, size: 64, align: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!1209, !1321, !958}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !1455, file: !1454, line: 31, baseType: !1458, size: 64, align: 64, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !1455, file: !1454, line: 32, baseType: !1458, size: 64, align: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !1455, file: !1454, line: 33, baseType: !1468, size: 64, align: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{null, !1321, !1353}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !1455, file: !1454, line: 34, baseType: !1472, size: 64, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{null, !955, !1353}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !1455, file: !1454, line: 35, baseType: !1476, size: 64, align: 64, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !955, !1353, !1353}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !1455, file: !1454, line: 36, baseType: !1480, size: 64, align: 64, offset: 448)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{null, !970, !1483}
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1209, size: 256, align: 32, elements: !1485)
!1485 = !{!964, !964}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !1455, file: !1454, line: 37, baseType: !1487, size: 64, align: 64, offset: 512)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{null, !1321, !970, !1353, !1353, !956, !958, !958}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !1455, file: !1454, line: 40, baseType: !1491, size: 64, align: 64, offset: 576)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1321, !965, !1494, !958, !1496}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1209)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !984, line: 119, baseType: !993)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !1455, file: !1454, line: 42, baseType: !1498, size: 256, align: 64, offset: 640)
!1498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1499, size: 256, align: 64, elements: !1361)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1321, !1494, !1494, !958, !958, !958}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1128, file: !1127, line: 214, baseType: !1503, size: 256, align: 64, offset: 3471488)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACSBRContext", file: !1127, line: 134, baseType: !1504)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACSBRContext", file: !1127, line: 120, size: 256, align: 64, elements: !1505)
!1505 = !{!1506, !2511, !2517, !2521}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sbr_lf_gen", scope: !1504, file: !1127, line: 121, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!958, !1510, !1125, !2509, !959, !958}
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACContext", file: !1127, line: 37, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACContext", file: !888, line: 293, size: 61952, align: 256, elements: !1513)
!1513 = !{!1514, !1557, !2229, !2230, !2231, !2248, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2445, !2446, !2449, !2450, !2451, !2453, !2482, !2483, !2484, !2485, !2489, !2490, !2496, !2500, !2501, !2505}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1512, file: !888, line: 294, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1518)
!1518 = !{!1519, !1523, !1527, !1531, !1532, !1533, !1534, !1538, !1544, !1546, !1550}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1517, file: !4, line: 72, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1517, file: !4, line: 78, baseType: !1524, size: 64, align: 64, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!1520, !969}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1517, file: !4, line: 85, baseType: !1528, size: 64, align: 64, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1530)
!1530 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1517, file: !4, line: 93, baseType: !958, size: 32, align: 32, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1517, file: !4, line: 99, baseType: !958, size: 32, align: 32, offset: 224)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1517, file: !4, line: 108, baseType: !958, size: 32, align: 32, offset: 256)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1517, file: !4, line: 113, baseType: !1535, size: 64, align: 64, offset: 320)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!969, !969, !969}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1517, file: !4, line: 123, baseType: !1539, size: 64, align: 64, offset: 384)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!1542, !1542}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1517)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1517, file: !4, line: 130, baseType: !1545, size: 32, align: 32, offset: 448)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1517, file: !4, line: 136, baseType: !1547, size: 64, align: 64, offset: 512)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!1545, !969}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1517, file: !4, line: 142, baseType: !1551, size: 64, align: 64, offset: 576)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!958, !1554, !969, !1520, !958}
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1512, file: !888, line: 295, baseType: !1558, size: 64, align: 64, offset: 64)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1561)
!1561 = !{!1562, !1565, !1566, !1567, !1828, !1829, !1830, !1831, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1984, !1988, !1989, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2167, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1560, file: !35, line: 1561, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1560, file: !35, line: 1562, baseType: !958, size: 32, align: 32, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1560, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1560, file: !35, line: 1565, baseType: !1568, size: 64, align: 64, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1571)
!1571 = !{!1572, !1573, !1574, !1575, !1576, !1577, !1586, !1589, !1592, !1595, !1600, !1601, !1602, !1610, !1611, !1612, !1614, !1618, !1624, !1634, !1638, !1639, !1681, !1799, !1803, !1804, !1808, !1812, !1817, !1821, !1822, !1823}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1570, file: !35, line: 3475, baseType: !1520, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1570, file: !35, line: 3480, baseType: !1520, size: 64, align: 64, offset: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1570, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1570, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1570, file: !35, line: 3487, baseType: !958, size: 32, align: 32, offset: 192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1570, file: !35, line: 3488, baseType: !1578, size: 64, align: 64, offset: 256)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1580)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1581, line: 61, baseType: !1582)
!1581 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1581, line: 58, size: 64, align: 32, elements: !1583)
!1583 = !{!1584, !1585}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1582, file: !1581, line: 59, baseType: !958, size: 32, align: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1582, file: !1581, line: 60, baseType: !958, size: 32, align: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1570, file: !35, line: 3489, baseType: !1587, size: 64, align: 64, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1570, file: !35, line: 3490, baseType: !1590, size: 64, align: 64, offset: 384)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1570, file: !35, line: 3491, baseType: !1593, size: 64, align: 64, offset: 448)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1570, file: !35, line: 3492, baseType: !1596, size: 64, align: 64, offset: 512)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1598)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !984, line: 55, baseType: !1599)
!1599 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1570, file: !35, line: 3493, baseType: !986, size: 8, align: 8, offset: 576)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1570, file: !35, line: 3494, baseType: !1563, size: 64, align: 64, offset: 640)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1570, file: !35, line: 3495, baseType: !1603, size: 64, align: 64, offset: 704)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1605)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1607)
!1607 = !{!1608, !1609}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1606, file: !35, line: 3402, baseType: !958, size: 32, align: 32)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1606, file: !35, line: 3403, baseType: !1520, size: 64, align: 64, offset: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1570, file: !35, line: 3507, baseType: !1520, size: 64, align: 64, offset: 768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1570, file: !35, line: 3516, baseType: !958, size: 32, align: 32, offset: 832)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1570, file: !35, line: 3517, baseType: !1613, size: 64, align: 64, offset: 896)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1570, file: !35, line: 3527, baseType: !1615, size: 64, align: 64, offset: 960)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!958, !1558}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1570, file: !35, line: 3535, baseType: !1619, size: 64, align: 64, offset: 1024)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!958, !1558, !1622}
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1559)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1570, file: !35, line: 3541, baseType: !1625, size: 64, align: 64, offset: 1088)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1627)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1629, line: 223, size: 128, align: 64, elements: !1630)
!1629 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1630 = !{!1631, !1633}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1628, file: !1629, line: 224, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1628, file: !1629, line: 225, baseType: !1632, size: 64, align: 64, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1570, file: !35, line: 3549, baseType: !1635, size: 64, align: 64, offset: 1152)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1613}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1570, file: !35, line: 3551, baseType: !1615, size: 64, align: 64, offset: 1216)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1570, file: !35, line: 3552, baseType: !1640, size: 64, align: 64, offset: 1280)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!958, !1558, !1643, !958, !1644}
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1646)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1647)
!1647 = !{!1648, !1649, !1650, !1651, !1652, !1680}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1646, file: !35, line: 3921, baseType: !1099, size: 16, align: 16)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1646, file: !35, line: 3922, baseType: !983, size: 32, align: 32, offset: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1646, file: !35, line: 3923, baseType: !983, size: 32, align: 32, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1646, file: !35, line: 3924, baseType: !985, size: 32, align: 32, offset: 96)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1646, file: !35, line: 3925, baseType: !1653, size: 64, align: 64, offset: 128)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1656)
!1656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1657)
!1657 = !{!1658, !1659, !1660, !1661, !1662, !1663, !1671, !1673, !1675, !1676, !1678, !1679}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1656, file: !35, line: 3886, baseType: !958, size: 32, align: 32)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1656, file: !35, line: 3887, baseType: !958, size: 32, align: 32, offset: 32)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1656, file: !35, line: 3888, baseType: !958, size: 32, align: 32, offset: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1656, file: !35, line: 3889, baseType: !958, size: 32, align: 32, offset: 96)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1656, file: !35, line: 3890, baseType: !958, size: 32, align: 32, offset: 128)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1656, file: !35, line: 3897, baseType: !1664, size: 768, align: 64, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1665)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1666)
!1666 = !{!1667, !1669}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1665, file: !35, line: 3855, baseType: !1668, size: 512, align: 64)
!1668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1643, size: 512, align: 64, elements: !1237)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1665, file: !35, line: 3857, baseType: !1670, size: 256, align: 32, offset: 512)
!1670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, align: 32, elements: !1237)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1656, file: !35, line: 3903, baseType: !1672, size: 256, align: 64, offset: 960)
!1672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1643, size: 256, align: 64, elements: !1361)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1656, file: !35, line: 3904, baseType: !1674, size: 128, align: 32, offset: 1216)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 128, align: 32, elements: !1361)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1656, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1656, file: !35, line: 3908, baseType: !1677, size: 64, align: 64, offset: 1408)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1656, file: !35, line: 3915, baseType: !1677, size: 64, align: 64, offset: 1472)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1656, file: !35, line: 3917, baseType: !958, size: 32, align: 32, offset: 1536)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1646, file: !35, line: 3926, baseType: !992, size: 64, align: 64, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1570, file: !35, line: 3564, baseType: !1682, size: 64, align: 64, offset: 1344)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!958, !1558, !1685, !1719, !1798}
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1687)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1688)
!1688 = !{!1689, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1715, !1716, !1717, !1718}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1687, file: !35, line: 1451, baseType: !1690, size: 64, align: 64)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1692, line: 94, baseType: !1693)
!1692 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1692, line: 81, size: 192, align: 64, elements: !1694)
!1694 = !{!1695, !1699, !1700}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1693, file: !1692, line: 82, baseType: !1696, size: 64, align: 64)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1692, line: 73, baseType: !1698)
!1698 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1692, line: 73, flags: DIFlagFwdDecl)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1693, file: !1692, line: 89, baseType: !1643, size: 64, align: 64, offset: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1693, file: !1692, line: 93, baseType: !958, size: 32, align: 32, offset: 128)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1687, file: !35, line: 1461, baseType: !992, size: 64, align: 64, offset: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1687, file: !35, line: 1467, baseType: !992, size: 64, align: 64, offset: 128)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1687, file: !35, line: 1468, baseType: !1643, size: 64, align: 64, offset: 192)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1687, file: !35, line: 1469, baseType: !958, size: 32, align: 32, offset: 256)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1687, file: !35, line: 1470, baseType: !958, size: 32, align: 32, offset: 288)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1687, file: !35, line: 1474, baseType: !958, size: 32, align: 32, offset: 320)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1687, file: !35, line: 1479, baseType: !1708, size: 64, align: 64, offset: 384)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1710)
!1710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1711)
!1711 = !{!1712, !1713, !1714}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1710, file: !35, line: 1412, baseType: !1643, size: 64, align: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1710, file: !35, line: 1413, baseType: !958, size: 32, align: 32, offset: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1710, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1687, file: !35, line: 1480, baseType: !958, size: 32, align: 32, offset: 448)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1687, file: !35, line: 1486, baseType: !992, size: 64, align: 64, offset: 512)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1687, file: !35, line: 1488, baseType: !992, size: 64, align: 64, offset: 576)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1687, file: !35, line: 1497, baseType: !992, size: 64, align: 64, offset: 640)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1721)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1722)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1723)
!1723 = !{!1724, !1725, !1726, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1753, !1755, !1756, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1787, !1788, !1789, !1790, !1791, !1792, !1794, !1795, !1796, !1797}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1722, file: !758, line: 282, baseType: !1668, size: 512, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1722, file: !758, line: 299, baseType: !1670, size: 256, align: 32, offset: 512)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1722, file: !758, line: 315, baseType: !1727, size: 64, align: 64, offset: 768)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1722, file: !758, line: 326, baseType: !958, size: 32, align: 32, offset: 832)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1722, file: !758, line: 326, baseType: !958, size: 32, align: 32, offset: 864)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1722, file: !758, line: 334, baseType: !958, size: 32, align: 32, offset: 896)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1722, file: !758, line: 341, baseType: !958, size: 32, align: 32, offset: 928)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1722, file: !758, line: 346, baseType: !958, size: 32, align: 32, offset: 960)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1722, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1722, file: !758, line: 356, baseType: !1580, size: 64, align: 32, offset: 1024)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1722, file: !758, line: 361, baseType: !992, size: 64, align: 64, offset: 1088)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1722, file: !758, line: 369, baseType: !992, size: 64, align: 64, offset: 1152)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1722, file: !758, line: 377, baseType: !992, size: 64, align: 64, offset: 1216)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1722, file: !758, line: 382, baseType: !958, size: 32, align: 32, offset: 1280)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1722, file: !758, line: 386, baseType: !958, size: 32, align: 32, offset: 1312)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1722, file: !758, line: 391, baseType: !958, size: 32, align: 32, offset: 1344)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1722, file: !758, line: 396, baseType: !969, size: 64, align: 64, offset: 1408)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1722, file: !758, line: 403, baseType: !1743, size: 512, align: 64, offset: 1472)
!1743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1598, size: 512, align: 64, elements: !1237)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1722, file: !758, line: 410, baseType: !958, size: 32, align: 32, offset: 1984)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1722, file: !758, line: 415, baseType: !958, size: 32, align: 32, offset: 2016)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1722, file: !758, line: 420, baseType: !958, size: 32, align: 32, offset: 2048)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1722, file: !758, line: 425, baseType: !958, size: 32, align: 32, offset: 2080)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1722, file: !758, line: 435, baseType: !992, size: 64, align: 64, offset: 2112)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1722, file: !758, line: 440, baseType: !958, size: 32, align: 32, offset: 2176)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1722, file: !758, line: 445, baseType: !1598, size: 64, align: 64, offset: 2240)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1722, file: !758, line: 459, baseType: !1752, size: 512, align: 64, offset: 2304)
!1752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1690, size: 512, align: 64, elements: !1237)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1722, file: !758, line: 473, baseType: !1754, size: 64, align: 64, offset: 2816)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1722, file: !758, line: 477, baseType: !958, size: 32, align: 32, offset: 2880)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1722, file: !758, line: 479, baseType: !1757, size: 64, align: 64, offset: 2944)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1758, size: 64, align: 64)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64, align: 64)
!1759 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1760)
!1760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1761)
!1761 = !{!1762, !1763, !1764, !1765, !1770}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1760, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1760, file: !758, line: 203, baseType: !1643, size: 64, align: 64, offset: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1760, file: !758, line: 204, baseType: !958, size: 32, align: 32, offset: 128)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1760, file: !758, line: 205, baseType: !1766, size: 64, align: 64, offset: 192)
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1767, size: 64, align: 64)
!1767 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1768, line: 86, baseType: !1769)
!1768 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1769 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1768, line: 86, flags: DIFlagFwdDecl)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1760, file: !758, line: 206, baseType: !1690, size: 64, align: 64, offset: 256)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1722, file: !758, line: 480, baseType: !958, size: 32, align: 32, offset: 3008)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1722, file: !758, line: 505, baseType: !958, size: 32, align: 32, offset: 3040)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1722, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1722, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1722, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1722, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1722, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1722, file: !758, line: 532, baseType: !992, size: 64, align: 64, offset: 3264)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1722, file: !758, line: 539, baseType: !992, size: 64, align: 64, offset: 3328)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1722, file: !758, line: 547, baseType: !992, size: 64, align: 64, offset: 3392)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1722, file: !758, line: 554, baseType: !1766, size: 64, align: 64, offset: 3456)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1722, file: !758, line: 563, baseType: !958, size: 32, align: 32, offset: 3520)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1722, file: !758, line: 572, baseType: !958, size: 32, align: 32, offset: 3552)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1722, file: !758, line: 581, baseType: !958, size: 32, align: 32, offset: 3584)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1722, file: !758, line: 588, baseType: !1786, size: 64, align: 64, offset: 3648)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1722, file: !758, line: 593, baseType: !958, size: 32, align: 32, offset: 3712)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1722, file: !758, line: 596, baseType: !958, size: 32, align: 32, offset: 3744)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1722, file: !758, line: 599, baseType: !1690, size: 64, align: 64, offset: 3776)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1722, file: !758, line: 605, baseType: !1690, size: 64, align: 64, offset: 3840)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1722, file: !758, line: 616, baseType: !1690, size: 64, align: 64, offset: 3904)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1722, file: !758, line: 626, baseType: !1793, size: 64, align: 64, offset: 3968)
!1793 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1331, line: 216, baseType: !1599)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1722, file: !758, line: 627, baseType: !1793, size: 64, align: 64, offset: 4032)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1722, file: !758, line: 628, baseType: !1793, size: 64, align: 64, offset: 4096)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1722, file: !758, line: 629, baseType: !1793, size: 64, align: 64, offset: 4160)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1722, file: !758, line: 645, baseType: !1690, size: 64, align: 64, offset: 4224)
!1798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1570, file: !35, line: 3566, baseType: !1800, size: 64, align: 64, offset: 1408)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64, align: 64)
!1801 = !DISubroutineType(types: !1802)
!1802 = !{!958, !1558, !969, !1798, !1685}
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1570, file: !35, line: 3567, baseType: !1615, size: 64, align: 64, offset: 1472)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1570, file: !35, line: 3576, baseType: !1805, size: 64, align: 64, offset: 1536)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64, align: 64)
!1806 = !DISubroutineType(types: !1807)
!1807 = !{!958, !1558, !1719}
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1570, file: !35, line: 3577, baseType: !1809, size: 64, align: 64, offset: 1600)
!1809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1810, size: 64, align: 64)
!1810 = !DISubroutineType(types: !1811)
!1811 = !{!958, !1558, !1685}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1570, file: !35, line: 3584, baseType: !1813, size: 64, align: 64, offset: 1664)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64, align: 64)
!1814 = !DISubroutineType(types: !1815)
!1815 = !{!958, !1558, !1816}
!1816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1570, file: !35, line: 3589, baseType: !1818, size: 64, align: 64, offset: 1728)
!1818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1819, size: 64, align: 64)
!1819 = !DISubroutineType(types: !1820)
!1820 = !{null, !1558}
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1570, file: !35, line: 3594, baseType: !958, size: 32, align: 32, offset: 1792)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1570, file: !35, line: 3600, baseType: !1520, size: 64, align: 64, offset: 1856)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1570, file: !35, line: 3609, baseType: !1824, size: 64, align: 64, offset: 1920)
!1824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1825, size: 64, align: 64)
!1825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1826, size: 64, align: 64)
!1826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1827)
!1827 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1560, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1560, file: !35, line: 1581, baseType: !985, size: 32, align: 32, offset: 224)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1560, file: !35, line: 1583, baseType: !969, size: 64, align: 64, offset: 256)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1560, file: !35, line: 1591, baseType: !1832, size: 64, align: 64, offset: 320)
!1832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1833, size: 64, align: 64)
