; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fft_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--fft_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CosTabsInitOnce = type { void ()*, i32 }
%struct.FFTComplex = type { i16, i16 }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, i16*, i16*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, i16*, i16*)*, void (%struct.FFTContext*, i16*, i16*)*, void (%struct.FFTContext*, i16*, i16*)*, void (%struct.FFTContext*, i32*, i16*)*, i32, i32, i32* }

@ff_cos_16_fixed = common global [8 x i16] zeroinitializer, align 32
@ff_cos_32_fixed = common global [16 x i16] zeroinitializer, align 32
@ff_cos_64_fixed = common global [32 x i16] zeroinitializer, align 32
@ff_cos_128_fixed = common global [64 x i16] zeroinitializer, align 32
@ff_cos_256_fixed = common global [128 x i16] zeroinitializer, align 32
@ff_cos_512_fixed = common global [256 x i16] zeroinitializer, align 32
@ff_cos_1024_fixed = common global [512 x i16] zeroinitializer, align 32
@ff_cos_2048_fixed = common global [1024 x i16] zeroinitializer, align 32
@ff_cos_4096_fixed = common global [2048 x i16] zeroinitializer, align 32

!19 = distinct !DIGlobalVariable(name: "ff_cos_tabs_fixed", scope: !0, file: !20, line: 124, type: !21, isLocal: false, isDefinition: true, variable: [18 x i16*]* @ff_cos_tabs_fixed)
!20 = !DIFile(filename: "libavcodec/fft_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1152, align: 64, elements: !25)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !4, line: 58, baseType: !15)
!25 = !{!26}
!26 = !DISubrange(count: 18)
!27 = distinct !DIGlobalVariable(name: "ff_cos_16_fixed", scope: !0, file: !20, line: 49, type: !28, isLocal: false, isDefinition: true, variable: [8 x i16]* @ff_cos_16_fixed)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, align: 16, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 8)
!31 = distinct !DIGlobalVariable(name: "ff_cos_32_fixed", scope: !0, file: !20, line: 50, type: !32, isLocal: false, isDefinition: true, variable: [16 x i16]* @ff_cos_32_fixed)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 16, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 16)
!35 = distinct !DIGlobalVariable(name: "ff_cos_64_fixed", scope: !0, file: !20, line: 51, type: !36, isLocal: false, isDefinition: true, variable: [32 x i16]* @ff_cos_64_fixed)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 16, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 32)
!39 = distinct !DIGlobalVariable(name: "ff_cos_128_fixed", scope: !0, file: !20, line: 52, type: !40, isLocal: false, isDefinition: true, variable: [64 x i16]* @ff_cos_128_fixed)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1024, align: 16, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 64)
!43 = distinct !DIGlobalVariable(name: "ff_cos_256_fixed", scope: !0, file: !20, line: 53, type: !44, isLocal: false, isDefinition: true, variable: [128 x i16]* @ff_cos_256_fixed)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, align: 16, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 128)
!47 = distinct !DIGlobalVariable(name: "ff_cos_512_fixed", scope: !0, file: !20, line: 54, type: !48, isLocal: false, isDefinition: true, variable: [256 x i16]* @ff_cos_512_fixed)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4096, align: 16, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 256)
!51 = distinct !DIGlobalVariable(name: "ff_cos_1024_fixed", scope: !0, file: !20, line: 55, type: !52, isLocal: false, isDefinition: true, variable: [512 x i16]* @ff_cos_1024_fixed)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 16, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 512)
!55 = distinct !DIGlobalVariable(name: "ff_cos_2048_fixed", scope: !0, file: !20, line: 56, type: !56, isLocal: false, isDefinition: true, variable: [1024 x i16]* @ff_cos_2048_fixed)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16384, align: 16, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1024)
!59 = distinct !DIGlobalVariable(name: "ff_cos_4096_fixed", scope: !0, file: !20, line: 57, type: !60, isLocal: false, isDefinition: true, variable: [2048 x i16]* @ff_cos_4096_fixed)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32768, align: 16, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 2048)
!63 = distinct !DIGlobalVariable(name: "ff_cos_8192_fixed", scope: !0, file: !20, line: 58, type: !64, isLocal: false, isDefinition: true, variable: [4096 x i16]* @ff_cos_8192_fixed)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 65536, align: 16, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 4096)
!67 = distinct !DIGlobalVariable(name: "ff_cos_16384_fixed", scope: !0, file: !20, line: 59, type: !68, isLocal: false, isDefinition: true, variable: [8192 x i16]* @ff_cos_16384_fixed)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 131072, align: 16, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 8192)
!71 = distinct !DIGlobalVariable(name: "ff_cos_32768_fixed", scope: !0, file: !20, line: 60, type: !72, isLocal: false, isDefinition: true, variable: [16384 x i16]* @ff_cos_32768_fixed)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 262144, align: 16, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 16384)
!75 = distinct !DIGlobalVariable(name: "ff_cos_65536_fixed", scope: !0, file: !20, line: 61, type: !76, isLocal: false, isDefinition: true, variable: [32768 x i16]* @ff_cos_65536_fixed)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 524288, align: 16, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 32768)
!79 = distinct !DIGlobalVariable(name: "ff_cos_131072_fixed", scope: !0, file: !20, line: 62, type: !80, isLocal: false, isDefinition: true, variable: [65536 x i16]* @ff_cos_131072_fixed)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1048576, align: 16, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 65536)
!83 = distinct !DIGlobalVariable(name: "cos_tabs_init_once", scope: !0, file: !20, line: 102, type: !84, isLocal: true, isDefinition: true, variable: [18 x %struct.CosTabsInitOnce]* @cos_tabs_init_once)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2304, align: 64, elements: !25)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "CosTabsInitOnce", file: !20, line: 79, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CosTabsInitOnce", file: !20, line: 76, size: 128, align: 64, elements: !87)
!87 = !{!88, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !86, file: !20, line: 77, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !86, file: !20, line: 78, baseType: !93, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !94, line: 168, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!95 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!96 = distinct !DIGlobalVariable(name: "avx_tab", scope: !0, file: !20, line: 165, type: !97, isLocal: true, isDefinition: true, variable: [16 x i32]* @avx_tab)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, align: 32, elements: !33)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!99 = distinct !DIGlobalVariable(name: "fft_dispatch", scope: !0, file: !20, line: 630, type: !100, isLocal: true, isDefinition: true, variable: [16 x void (%struct.FFTComplex*)*]* @fft_dispatch)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1024, align: 64, elements: !33)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !4, line: 64, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !4, line: 62, size: 32, align: 16, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !107, file: !4, line: 63, baseType: !24, size: 16, align: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !107, file: !4, line: 63, baseType: !24, size: 16, align: 16, offset: 16)
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!114 = distinct !DISubprogram(name: "ff_init_ff_cos_tabs_fixed", scope: !20, file: !20, line: 158, type: !115, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !95}
!117 = !{}
!118 = !DILocalVariable(name: "index", arg: 1, scope: !114, file: !20, line: 158, type: !95)
!119 = !DIExpression()
!120 = !DILocation(line: 158, column: 58, scope: !114)
!121 = !DILocation(line: 161, column: 38, scope: !114)
!122 = !DILocation(line: 161, column: 19, scope: !114)
!123 = !DILocation(line: 161, column: 45, scope: !114)
!124 = !DILocation(line: 161, column: 73, scope: !114)
!125 = !DILocation(line: 161, column: 54, scope: !114)
!126 = !DILocation(line: 161, column: 80, scope: !114)
!127 = !DILocation(line: 161, column: 5, scope: !114)
!128 = !DILocation(line: 163, column: 1, scope: !114)
!129 = distinct !DISubprogram(name: "ff_fft_init_fixed", scope: !20, file: !20, line: 203, type: !130, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !117)
!130 = !DISubroutineType(types: !131)
!131 = !{!95, !132, !95, !95}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !4, line: 67, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !135)
!135 = !{!136, !137, !138, !143, !144, !145, !146, !147, !148, !153, !154, !160, !161, !162, !168, !169, !170}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !134, file: !4, line: 89, baseType: !95, size: 32, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !134, file: !4, line: 90, baseType: !95, size: 32, align: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !134, file: !4, line: 91, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !141, line: 49, baseType: !142)
!141 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!142 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !134, file: !4, line: 92, baseType: !105, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !134, file: !4, line: 93, baseType: !95, size: 32, align: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !134, file: !4, line: 94, baseType: !95, size: 32, align: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !134, file: !4, line: 96, baseType: !23, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !134, file: !4, line: 97, baseType: !23, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !134, file: !4, line: 101, baseType: !149, size: 64, align: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152, !105}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !134, file: !4, line: 106, baseType: !149, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !134, file: !4, line: 107, baseType: !155, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !152, !23, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !134, file: !4, line: 108, baseType: !155, size: 64, align: 64, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !134, file: !4, line: 109, baseType: !155, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !134, file: !4, line: 110, baseType: !163, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !152, !166, !158}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 66, baseType: !95)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !134, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !134, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !134, file: !4, line: 113, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !141, line: 51, baseType: !173)
!173 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!174 = !DILocalVariable(name: "s", arg: 1, scope: !129, file: !20, line: 203, type: !132)
!175 = !DILocation(line: 203, column: 57, scope: !129)
!176 = !DILocalVariable(name: "nbits", arg: 2, scope: !129, file: !20, line: 203, type: !95)
!177 = !DILocation(line: 203, column: 64, scope: !129)
!178 = !DILocalVariable(name: "inverse", arg: 3, scope: !129, file: !20, line: 203, type: !95)
!179 = !DILocation(line: 203, column: 75, scope: !129)
!180 = !DILocalVariable(name: "i", scope: !129, file: !20, line: 205, type: !95)
!181 = !DILocation(line: 205, column: 9, scope: !129)
!182 = !DILocalVariable(name: "j", scope: !129, file: !20, line: 205, type: !95)
!183 = !DILocation(line: 205, column: 12, scope: !129)
!184 = !DILocalVariable(name: "n", scope: !129, file: !20, line: 205, type: !95)
!185 = !DILocation(line: 205, column: 15, scope: !129)
!186 = !DILocation(line: 207, column: 5, scope: !129)
!187 = !DILocation(line: 207, column: 8, scope: !129)
!188 = !DILocation(line: 207, column: 15, scope: !129)
!189 = !DILocation(line: 208, column: 5, scope: !129)
!190 = !DILocation(line: 208, column: 8, scope: !129)
!191 = !DILocation(line: 208, column: 17, scope: !129)
!192 = !DILocation(line: 210, column: 9, scope: !193)
!193 = distinct !DILexicalBlock(scope: !129, file: !20, line: 210, column: 9)
!194 = !DILocation(line: 210, column: 15, scope: !193)
!195 = !DILocation(line: 210, column: 19, scope: !193)
!196 = !DILocation(line: 210, column: 22, scope: !197)
!197 = !DILexicalBlockFile(scope: !193, file: !20, discriminator: 1)
!198 = !DILocation(line: 210, column: 28, scope: !197)
!199 = !DILocation(line: 210, column: 9, scope: !197)
!200 = !DILocation(line: 211, column: 9, scope: !193)
!201 = !DILocation(line: 212, column: 16, scope: !129)
!202 = !DILocation(line: 212, column: 5, scope: !129)
!203 = !DILocation(line: 212, column: 8, scope: !129)
!204 = !DILocation(line: 212, column: 14, scope: !129)
!205 = !DILocation(line: 213, column: 14, scope: !129)
!206 = !DILocation(line: 213, column: 11, scope: !129)
!207 = !DILocation(line: 213, column: 7, scope: !129)
!208 = !DILocation(line: 215, column: 9, scope: !209)
!209 = distinct !DILexicalBlock(scope: !129, file: !20, line: 215, column: 9)
!210 = !DILocation(line: 215, column: 15, scope: !209)
!211 = !DILocation(line: 215, column: 9, scope: !129)
!212 = !DILocation(line: 216, column: 31, scope: !213)
!213 = distinct !DILexicalBlock(scope: !209, file: !20, line: 215, column: 22)
!214 = !DILocation(line: 216, column: 33, scope: !213)
!215 = !DILocation(line: 216, column: 21, scope: !213)
!216 = !DILocation(line: 216, column: 9, scope: !213)
!217 = !DILocation(line: 216, column: 12, scope: !213)
!218 = !DILocation(line: 216, column: 19, scope: !213)
!219 = !DILocation(line: 217, column: 14, scope: !220)
!220 = distinct !DILexicalBlock(scope: !213, file: !20, line: 217, column: 13)
!221 = !DILocation(line: 217, column: 17, scope: !220)
!222 = !DILocation(line: 217, column: 13, scope: !213)
!223 = !DILocation(line: 218, column: 13, scope: !220)
!224 = !DILocation(line: 219, column: 5, scope: !213)
!225 = !DILocation(line: 220, column: 33, scope: !226)
!226 = distinct !DILexicalBlock(scope: !209, file: !20, line: 219, column: 12)
!227 = !DILocation(line: 220, column: 35, scope: !226)
!228 = !DILocation(line: 220, column: 23, scope: !226)
!229 = !DILocation(line: 220, column: 9, scope: !226)
!230 = !DILocation(line: 220, column: 12, scope: !226)
!231 = !DILocation(line: 220, column: 21, scope: !226)
!232 = !DILocation(line: 221, column: 14, scope: !233)
