; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--idctdsp_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--x86--idctdsp_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.IDCTDSPContext = type { void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i16*)*, [64 x i8], i32, i32 }

!903 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!904 = !{!905}
!905 = !DISubrange(count: 64)
!906 = distinct !DIGlobalVariable(name: "idct_sse2_row_perm", scope: !0, file: !898, line: 40, type: !907, isLocal: true, isDefinition: true, variable: [8 x i8]* @idct_sse2_row_perm)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 64, align: 8, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 8)
!910 = !{i32 2, !"Dwarf Version", i32 4}
!911 = !{i32 2, !"Debug Info Version", i32 3}
!912 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!913 = distinct !DISubprogram(name: "ff_init_scantable_permutation_x86", scope: !898, file: !898, line: 42, type: !914, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !918)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !917, !3}
!916 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!918 = !{}
!919 = !DILocalVariable(name: "idct_permutation", arg: 1, scope: !913, file: !898, line: 42, type: !917)
!920 = !DIExpression()
!921 = !DILocation(line: 42, column: 70, scope: !913)
!922 = !DILocalVariable(name: "perm_type", arg: 2, scope: !913, file: !898, line: 43, type: !3)
!923 = !DILocation(line: 43, column: 74, scope: !913)
!924 = !DILocalVariable(name: "i", scope: !913, file: !898, line: 45, type: !916)
!925 = !DILocation(line: 45, column: 9, scope: !913)
!926 = !DILocation(line: 47, column: 13, scope: !913)
!927 = !DILocation(line: 47, column: 5, scope: !913)
!928 = !DILocation(line: 49, column: 16, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !898, line: 49, column: 9)
!930 = distinct !DILexicalBlock(scope: !913, file: !898, line: 47, column: 24)
!931 = !DILocation(line: 49, column: 14, scope: !929)
!932 = !DILocation(line: 49, column: 21, scope: !933)
!933 = !DILexicalBlockFile(scope: !934, file: !898, discriminator: 1)
!934 = distinct !DILexicalBlock(scope: !929, file: !898, line: 49, column: 9)
!935 = !DILocation(line: 49, column: 23, scope: !933)
!936 = !DILocation(line: 49, column: 9, scope: !933)
!937 = !DILocation(line: 50, column: 58, scope: !934)
!938 = !DILocation(line: 50, column: 35, scope: !934)
!939 = !DILocation(line: 50, column: 30, scope: !934)
!940 = !DILocation(line: 50, column: 13, scope: !934)
!941 = !DILocation(line: 50, column: 33, scope: !934)
!942 = !DILocation(line: 49, column: 30, scope: !943)
!943 = !DILexicalBlockFile(scope: !934, file: !898, discriminator: 2)
!944 = !DILocation(line: 49, column: 9, scope: !943)
!945 = distinct !{!945, !946}
!946 = !DILocation(line: 49, column: 9, scope: !930)
!947 = !DILocation(line: 51, column: 9, scope: !930)
!948 = !DILocation(line: 53, column: 16, scope: !949)
!949 = distinct !DILexicalBlock(scope: !930, file: !898, line: 53, column: 9)
!950 = !DILocation(line: 53, column: 14, scope: !949)
!951 = !DILocation(line: 53, column: 21, scope: !952)
!952 = !DILexicalBlockFile(scope: !953, file: !898, discriminator: 1)
!953 = distinct !DILexicalBlock(scope: !949, file: !898, line: 53, column: 9)
!954 = !DILocation(line: 53, column: 23, scope: !952)
!955 = !DILocation(line: 53, column: 9, scope: !952)
!956 = !DILocation(line: 54, column: 36, scope: !953)
!957 = !DILocation(line: 54, column: 38, scope: !953)
!958 = !DILocation(line: 54, column: 67, scope: !953)
!959 = !DILocation(line: 54, column: 69, scope: !953)
!960 = !DILocation(line: 54, column: 48, scope: !953)
!961 = !DILocation(line: 54, column: 46, scope: !953)
!962 = !DILocation(line: 54, column: 35, scope: !953)
!963 = !DILocation(line: 54, column: 30, scope: !953)
!964 = !DILocation(line: 54, column: 13, scope: !953)
!965 = !DILocation(line: 54, column: 33, scope: !953)
!966 = !DILocation(line: 53, column: 30, scope: !967)
!967 = !DILexicalBlockFile(scope: !953, file: !898, discriminator: 2)
!968 = !DILocation(line: 53, column: 9, scope: !967)
!969 = distinct !{!969, !970}
!970 = !DILocation(line: 53, column: 9, scope: !930)
!971 = !DILocation(line: 55, column: 9, scope: !930)
!972 = !DILocation(line: 58, column: 5, scope: !913)
!973 = !DILocation(line: 59, column: 1, scope: !913)
!974 = distinct !DISubprogram(name: "ff_idctdsp_init_x86", scope: !898, file: !898, line: 61, type: !975, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !918)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !977, !1009, !1140}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !4, line: 100, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !4, line: 53, size: 960, align: 64, elements: !980)
!980 = !{!981, !993, !994, !995, !1000, !1004, !1005, !1007, !1008}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !979, file: !4, line: 55, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !985, !989, !990}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !902, line: 37, baseType: !988)
!988 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!989 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !917)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !991, line: 149, baseType: !992)
!991 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!992 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !979, file: !4, line: 58, baseType: !982, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !979, file: !4, line: 61, baseType: !982, size: 64, align: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !979, file: !4, line: 65, baseType: !996, size: 64, align: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !979, file: !4, line: 72, baseType: !1001, size: 64, align: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !917, !990, !999}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !979, file: !4, line: 79, baseType: !1001, size: 64, align: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !979, file: !4, line: 96, baseType: !1006, size: 512, align: 8, offset: 384)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 512, align: 8, elements: !904)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !979, file: !4, line: 97, baseType: !3, size: 32, align: 32, offset: 896)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !979, file: !4, line: 99, baseType: !916, size: 32, align: 32, offset: 928)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !44, line: 3360, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !44, line: 1556, size: 8448, align: 64, elements: !1012)
!1012 = !{!1013, !1058, !1059, !1060, !1324, !1325, !1326, !1327, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1353, !1357, !1358, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1538, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1011, file: !44, line: 1561, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !13, line: 143, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !13, line: 67, size: 640, align: 64, elements: !1018)
!1018 = !{!1019, !1023, !1028, !1032, !1033, !1034, !1035, !1039, !1045, !1047, !1051}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1017, file: !13, line: 72, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1017, file: !13, line: 78, baseType: !1024, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1020, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1017, file: !13, line: 85, baseType: !1029, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !13, line: 85, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1017, file: !13, line: 93, baseType: !916, size: 32, align: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1017, file: !13, line: 99, baseType: !916, size: 32, align: 32, offset: 224)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1017, file: !13, line: 108, baseType: !916, size: 32, align: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1017, file: !13, line: 113, baseType: !1036, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1027, !1027, !1027}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1017, file: !13, line: 123, baseType: !1040, size: 64, align: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1017, file: !13, line: 130, baseType: !1046, size: 32, align: 32, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !13, line: 48, baseType: !12)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1017, file: !13, line: 136, baseType: !1048, size: 64, align: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1046, !1027}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1017, file: !13, line: 142, baseType: !1052, size: 64, align: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!916, !1055, !1027, !1020, !916}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !13, line: 60, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1011, file: !44, line: 1562, baseType: !916, size: 32, align: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1011, file: !44, line: 1564, baseType: !33, size: 32, align: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1011, file: !44, line: 1565, baseType: !1061, size: 64, align: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !44, line: 3468, size: 1984, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1079, !1082, !1085, !1088, !1093, !1094, !1095, !1103, !1104, !1105, !1107, !1111, !1117, !1122, !1126, !1127, !1175, !1295, !1299, !1300, !1304, !1308, !1313, !1317, !1318, !1319}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !44, line: 3475, baseType: !1020, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1063, file: !44, line: 3480, baseType: !1020, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1063, file: !44, line: 3481, baseType: !33, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1063, file: !44, line: 3482, baseType: !43, size: 32, align: 32, offset: 160)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1063, file: !44, line: 3487, baseType: !916, size: 32, align: 32, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1063, file: !44, line: 3488, baseType: !1071, size: 64, align: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1074, line: 61, baseType: !1075)
!1074 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1074, line: 58, size: 64, align: 32, elements: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1075, file: !1074, line: 59, baseType: !916, size: 32, align: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1075, file: !1074, line: 60, baseType: !916, size: 32, align: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1063, file: !44, line: 3489, baseType: !1080, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1063, file: !44, line: 3490, baseType: !1083, size: 64, align: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1063, file: !44, line: 3491, baseType: !1086, size: 64, align: 64, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1063, file: !44, line: 3492, baseType: !1089, size: 64, align: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !902, line: 55, baseType: !1092)
!1092 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1063, file: !44, line: 3493, baseType: !901, size: 8, align: 8, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1063, file: !44, line: 3494, baseType: !1014, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1063, file: !44, line: 3495, baseType: !1096, size: 64, align: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !44, line: 3404, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !44, line: 3401, size: 128, align: 64, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1099, file: !44, line: 3402, baseType: !916, size: 32, align: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1099, file: !44, line: 3403, baseType: !1020, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1063, file: !44, line: 3507, baseType: !1020, size: 64, align: 64, offset: 768)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1063, file: !44, line: 3516, baseType: !916, size: 32, align: 32, offset: 832)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !44, line: 3517, baseType: !1106, size: 64, align: 64, offset: 896)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1063, file: !44, line: 3527, baseType: !1108, size: 64, align: 64, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!916, !1009}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1063, file: !44, line: 3535, baseType: !1112, size: 64, align: 64, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!916, !1009, !1115}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1063, file: !44, line: 3541, baseType: !1118, size: 64, align: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !44, line: 3461, baseType: !1121)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !44, line: 3461, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1063, file: !44, line: 3549, baseType: !1123, size: 64, align: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !1106}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1063, file: !44, line: 3551, baseType: !1108, size: 64, align: 64, offset: 1216)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1063, file: !44, line: 3552, baseType: !1128, size: 64, align: 64, offset: 1280)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!916, !1009, !917, !916, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !44, line: 3920, size: 256, align: 64, elements: !1134)
!1134 = !{!1135, !1138, !1141, !1142, !1143, !1173}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1133, file: !44, line: 3921, baseType: !1136, size: 16, align: 16)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !902, line: 49, baseType: !1137)
!1137 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1133, file: !44, line: 3922, baseType: !1139, size: 32, align: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !902, line: 51, baseType: !1140)
!1140 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1133, file: !44, line: 3923, baseType: !1139, size: 32, align: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1133, file: !44, line: 3924, baseType: !1140, size: 32, align: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1133, file: !44, line: 3925, baseType: !1144, size: 64, align: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !44, line: 3918, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !44, line: 3885, size: 1600, align: 64, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154, !1162, !1166, !1168, !1169, !1171, !1172}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1147, file: !44, line: 3886, baseType: !916, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1147, file: !44, line: 3887, baseType: !916, size: 32, align: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1147, file: !44, line: 3888, baseType: !916, size: 32, align: 32, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1147, file: !44, line: 3889, baseType: !916, size: 32, align: 32, offset: 96)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1147, file: !44, line: 3890, baseType: !916, size: 32, align: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1147, file: !44, line: 3897, baseType: !1155, size: 768, align: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !44, line: 3858, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !44, line: 3853, size: 768, align: 64, elements: !1157)
!1157 = !{!1158, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !44, line: 3855, baseType: !1159, size: 512, align: 64)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 512, align: 64, elements: !908)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1156, file: !44, line: 3857, baseType: !1161, size: 256, align: 32, offset: 512)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 256, align: 32, elements: !908)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !44, line: 3903, baseType: !1163, size: 256, align: 64, offset: 960)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 64, elements: !1164)
!1164 = !{!1165}
!1165 = !DISubrange(count: 4)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1147, file: !44, line: 3904, baseType: !1167, size: 128, align: 32, offset: 1216)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 128, align: 32, elements: !1164)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1147, file: !44, line: 3906, baseType: !720, size: 32, align: 32, offset: 1344)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1147, file: !44, line: 3908, baseType: !1170, size: 64, align: 64, offset: 1408)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1147, file: !44, line: 3915, baseType: !1170, size: 64, align: 64, offset: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1147, file: !44, line: 3917, baseType: !916, size: 32, align: 32, offset: 1536)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1133, file: !44, line: 3926, baseType: !1174, size: 64, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !902, line: 40, baseType: !992)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1063, file: !44, line: 3564, baseType: !1176, size: 64, align: 64, offset: 1344)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!916, !1009, !1179, !1213, !1294}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !44, line: 1499, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !44, line: 1445, size: 704, align: 64, elements: !1182)
!1182 = !{!1183, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1209, !1210, !1211, !1212}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1181, file: !44, line: 1451, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1186, line: 94, baseType: !1187)
!1186 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1186, line: 81, size: 192, align: 64, elements: !1188)
!1188 = !{!1189, !1193, !1194}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1187, file: !1186, line: 82, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1186, line: 73, baseType: !1192)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1186, line: 73, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !1186, line: 89, baseType: !917, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1187, file: !1186, line: 93, baseType: !916, size: 32, align: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1181, file: !44, line: 1461, baseType: !1174, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1181, file: !44, line: 1467, baseType: !1174, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !44, line: 1468, baseType: !917, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !44, line: 1469, baseType: !916, size: 32, align: 32, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1181, file: !44, line: 1470, baseType: !916, size: 32, align: 32, offset: 288)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1181, file: !44, line: 1474, baseType: !916, size: 32, align: 32, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1181, file: !44, line: 1479, baseType: !1202, size: 64, align: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !44, line: 1415, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !44, line: 1411, size: 128, align: 64, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1204, file: !44, line: 1412, baseType: !917, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !44, line: 1413, baseType: !916, size: 32, align: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !44, line: 1414, baseType: !726, size: 32, align: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1181, file: !44, line: 1480, baseType: !916, size: 32, align: 32, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1181, file: !44, line: 1486, baseType: !1174, size: 64, align: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1181, file: !44, line: 1488, baseType: !1174, size: 64, align: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1181, file: !44, line: 1497, baseType: !1174, size: 64, align: 64, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1247, !1249, !1250, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1290, !1291, !1292, !1293}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !767, line: 282, baseType: !1159, size: 512, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1216, file: !767, line: 299, baseType: !1161, size: 256, align: 32, offset: 512)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1216, file: !767, line: 315, baseType: !1221, size: 64, align: 64, offset: 768)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1216, file: !767, line: 326, baseType: !916, size: 32, align: 32, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1216, file: !767, line: 326, baseType: !916, size: 32, align: 32, offset: 864)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1216, file: !767, line: 334, baseType: !916, size: 32, align: 32, offset: 896)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1216, file: !767, line: 341, baseType: !916, size: 32, align: 32, offset: 928)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1216, file: !767, line: 346, baseType: !916, size: 32, align: 32, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1216, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1216, file: !767, line: 356, baseType: !1073, size: 64, align: 32, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1216, file: !767, line: 361, baseType: !1174, size: 64, align: 64, offset: 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1216, file: !767, line: 369, baseType: !1174, size: 64, align: 64, offset: 1152)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1216, file: !767, line: 377, baseType: !1174, size: 64, align: 64, offset: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1216, file: !767, line: 382, baseType: !916, size: 32, align: 32, offset: 1280)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1216, file: !767, line: 386, baseType: !916, size: 32, align: 32, offset: 1312)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1216, file: !767, line: 391, baseType: !916, size: 32, align: 32, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1216, file: !767, line: 396, baseType: !1027, size: 64, align: 64, offset: 1408)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1216, file: !767, line: 403, baseType: !1237, size: 512, align: 64, offset: 1472)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, align: 64, elements: !908)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1216, file: !767, line: 410, baseType: !916, size: 32, align: 32, offset: 1984)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1216, file: !767, line: 415, baseType: !916, size: 32, align: 32, offset: 2016)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1216, file: !767, line: 420, baseType: !916, size: 32, align: 32, offset: 2048)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1216, file: !767, line: 425, baseType: !916, size: 32, align: 32, offset: 2080)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1216, file: !767, line: 435, baseType: !1174, size: 64, align: 64, offset: 2112)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1216, file: !767, line: 440, baseType: !916, size: 32, align: 32, offset: 2176)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1216, file: !767, line: 445, baseType: !1091, size: 64, align: 64, offset: 2240)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1216, file: !767, line: 459, baseType: !1246, size: 512, align: 64, offset: 2304)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 512, align: 64, elements: !908)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1216, file: !767, line: 473, baseType: !1248, size: 64, align: 64, offset: 2816)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1216, file: !767, line: 477, baseType: !916, size: 32, align: 32, offset: 2880)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1216, file: !767, line: 479, baseType: !1251, size: 64, align: 64, offset: 2944)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1264}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !767, line: 203, baseType: !917, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !767, line: 204, baseType: !916, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1254, file: !767, line: 205, baseType: !1260, size: 64, align: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1262, line: 86, baseType: !1263)
!1262 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1262, line: 86, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1254, file: !767, line: 206, baseType: !1184, size: 64, align: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1216, file: !767, line: 480, baseType: !916, size: 32, align: 32, offset: 3008)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1216, file: !767, line: 505, baseType: !916, size: 32, align: 32, offset: 3040)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1216, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1216, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1216, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1216, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1216, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1216, file: !767, line: 532, baseType: !1174, size: 64, align: 64, offset: 3264)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1216, file: !767, line: 539, baseType: !1174, size: 64, align: 64, offset: 3328)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1216, file: !767, line: 547, baseType: !1174, size: 64, align: 64, offset: 3392)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1216, file: !767, line: 554, baseType: !1260, size: 64, align: 64, offset: 3456)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1216, file: !767, line: 563, baseType: !916, size: 32, align: 32, offset: 3520)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1216, file: !767, line: 572, baseType: !916, size: 32, align: 32, offset: 3552)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1216, file: !767, line: 581, baseType: !916, size: 32, align: 32, offset: 3584)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1216, file: !767, line: 588, baseType: !1280, size: 64, align: 64, offset: 3648)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !902, line: 36, baseType: !1282)
!1282 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1216, file: !767, line: 593, baseType: !916, size: 32, align: 32, offset: 3712)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1216, file: !767, line: 596, baseType: !916, size: 32, align: 32, offset: 3744)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1216, file: !767, line: 599, baseType: !1184, size: 64, align: 64, offset: 3776)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1216, file: !767, line: 605, baseType: !1184, size: 64, align: 64, offset: 3840)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1216, file: !767, line: 616, baseType: !1184, size: 64, align: 64, offset: 3904)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1216, file: !767, line: 626, baseType: !1289, size: 64, align: 64, offset: 3968)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !991, line: 216, baseType: !1092)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1216, file: !767, line: 627, baseType: !1289, size: 64, align: 64, offset: 4032)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1216, file: !767, line: 628, baseType: !1289, size: 64, align: 64, offset: 4096)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1216, file: !767, line: 629, baseType: !1289, size: 64, align: 64, offset: 4160)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1216, file: !767, line: 645, baseType: !1184, size: 64, align: 64, offset: 4224)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1063, file: !44, line: 3566, baseType: !1296, size: 64, align: 64, offset: 1408)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!916, !1009, !1027, !1294, !1179}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1063, file: !44, line: 3567, baseType: !1108, size: 64, align: 64, offset: 1472)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1063, file: !44, line: 3576, baseType: !1301, size: 64, align: 64, offset: 1536)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!916, !1009, !1213}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1063, file: !44, line: 3577, baseType: !1305, size: 64, align: 64, offset: 1600)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!916, !1009, !1179}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1063, file: !44, line: 3584, baseType: !1309, size: 64, align: 64, offset: 1664)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!916, !1009, !1312}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1063, file: !44, line: 3589, baseType: !1314, size: 64, align: 64, offset: 1728)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{null, !1009}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1063, file: !44, line: 3594, baseType: !916, size: 32, align: 32, offset: 1792)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1063, file: !44, line: 3600, baseType: !1020, size: 64, align: 64, offset: 1856)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1063, file: !44, line: 3609, baseType: !1320, size: 64, align: 64, offset: 1920)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !44, line: 3609, flags: DIFlagFwdDecl)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1011, file: !44, line: 1566, baseType: !43, size: 32, align: 32, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1011, file: !44, line: 1581, baseType: !1140, size: 32, align: 32, offset: 224)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1011, file: !44, line: 1583, baseType: !1027, size: 64, align: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1011, file: !44, line: 1591, baseType: !1328, size: 64, align: 64, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !44, line: 1532, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1011, file: !44, line: 1598, baseType: !1027, size: 64, align: 64, offset: 384)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1011, file: !44, line: 1606, baseType: !1174, size: 64, align: 64, offset: 448)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1011, file: !44, line: 1614, baseType: !916, size: 32, align: 32, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1011, file: !44, line: 1622, baseType: !916, size: 32, align: 32, offset: 544)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1011, file: !44, line: 1628, baseType: !916, size: 32, align: 32, offset: 576)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1011, file: !44, line: 1636, baseType: !916, size: 32, align: 32, offset: 608)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1011, file: !44, line: 1643, baseType: !916, size: 32, align: 32, offset: 640)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1011, file: !44, line: 1657, baseType: !917, size: 64, align: 64, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1011, file: !44, line: 1658, baseType: !916, size: 32, align: 32, offset: 768)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1011, file: !44, line: 1679, baseType: !1073, size: 64, align: 32, offset: 800)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1011, file: !44, line: 1688, baseType: !916, size: 32, align: 32, offset: 864)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1011, file: !44, line: 1712, baseType: !916, size: 32, align: 32, offset: 896)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1011, file: !44, line: 1729, baseType: !916, size: 32, align: 32, offset: 928)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1011, file: !44, line: 1729, baseType: !916, size: 32, align: 32, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1011, file: !44, line: 1744, baseType: !916, size: 32, align: 32, offset: 992)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1011, file: !44, line: 1744, baseType: !916, size: 32, align: 32, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1011, file: !44, line: 1751, baseType: !916, size: 32, align: 32, offset: 1056)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1011, file: !44, line: 1766, baseType: !503, size: 32, align: 32, offset: 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1011, file: !44, line: 1791, baseType: !1349, size: 64, align: 64, offset: 1152)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{null, !1352, !1213, !1294, !916, !916, !916}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1011, file: !44, line: 1808, baseType: !1354, size: 64, align: 64, offset: 1216)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!503, !1352, !1080}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1011, file: !44, line: 1816, baseType: !916, size: 32, align: 32, offset: 1280)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1011, file: !44, line: 1825, baseType: !1359, size: 32, align: 32, offset: 1312)
!1359 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1011, file: !44, line: 1830, baseType: !916, size: 32, align: 32, offset: 1344)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1011, file: !44, line: 1838, baseType: !1359, size: 32, align: 32, offset: 1376)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1011, file: !44, line: 1846, baseType: !916, size: 32, align: 32, offset: 1408)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1011, file: !44, line: 1851, baseType: !916, size: 32, align: 32, offset: 1440)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1011, file: !44, line: 1861, baseType: !1359, size: 32, align: 32, offset: 1472)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1011, file: !44, line: 1868, baseType: !1359, size: 32, align: 32, offset: 1504)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1011, file: !44, line: 1875, baseType: !1359, size: 32, align: 32, offset: 1536)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1011, file: !44, line: 1882, baseType: !1359, size: 32, align: 32, offset: 1568)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1011, file: !44, line: 1889, baseType: !1359, size: 32, align: 32, offset: 1600)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1011, file: !44, line: 1896, baseType: !1359, size: 32, align: 32, offset: 1632)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1011, file: !44, line: 1903, baseType: !1359, size: 32, align: 32, offset: 1664)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1011, file: !44, line: 1910, baseType: !916, size: 32, align: 32, offset: 1696)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1011, file: !44, line: 1915, baseType: !916, size: 32, align: 32, offset: 1728)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1011, file: !44, line: 1926, baseType: !1294, size: 64, align: 64, offset: 1792)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1011, file: !44, line: 1935, baseType: !1073, size: 64, align: 32, offset: 1856)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1011, file: !44, line: 1942, baseType: !916, size: 32, align: 32, offset: 1920)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1011, file: !44, line: 1948, baseType: !916, size: 32, align: 32, offset: 1952)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1011, file: !44, line: 1954, baseType: !916, size: 32, align: 32, offset: 1984)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1011, file: !44, line: 1960, baseType: !916, size: 32, align: 32, offset: 2016)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1011, file: !44, line: 1984, baseType: !916, size: 32, align: 32, offset: 2048)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1011, file: !44, line: 1991, baseType: !916, size: 32, align: 32, offset: 2080)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1011, file: !44, line: 1996, baseType: !916, size: 32, align: 32, offset: 2112)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1011, file: !44, line: 2004, baseType: !916, size: 32, align: 32, offset: 2144)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1011, file: !44, line: 2011, baseType: !916, size: 32, align: 32, offset: 2176)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1011, file: !44, line: 2018, baseType: !916, size: 32, align: 32, offset: 2208)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1011, file: !44, line: 2027, baseType: !916, size: 32, align: 32, offset: 2240)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1011, file: !44, line: 2034, baseType: !916, size: 32, align: 32, offset: 2272)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1011, file: !44, line: 2044, baseType: !916, size: 32, align: 32, offset: 2304)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1011, file: !44, line: 2054, baseType: !1389, size: 64, align: 64, offset: 2368)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1011, file: !44, line: 2061, baseType: !1389, size: 64, align: 64, offset: 2432)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1011, file: !44, line: 2066, baseType: !916, size: 32, align: 32, offset: 2496)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1011, file: !44, line: 2070, baseType: !916, size: 32, align: 32, offset: 2528)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1011, file: !44, line: 2078, baseType: !916, size: 32, align: 32, offset: 2560)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1011, file: !44, line: 2085, baseType: !916, size: 32, align: 32, offset: 2592)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1011, file: !44, line: 2092, baseType: !916, size: 32, align: 32, offset: 2624)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1011, file: !44, line: 2099, baseType: !916, size: 32, align: 32, offset: 2656)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1011, file: !44, line: 2106, baseType: !916, size: 32, align: 32, offset: 2688)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1011, file: !44, line: 2113, baseType: !916, size: 32, align: 32, offset: 2720)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1011, file: !44, line: 2120, baseType: !916, size: 32, align: 32, offset: 2752)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1011, file: !44, line: 2125, baseType: !916, size: 32, align: 32, offset: 2784)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1011, file: !44, line: 2133, baseType: !916, size: 32, align: 32, offset: 2816)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1011, file: !44, line: 2140, baseType: !916, size: 32, align: 32, offset: 2848)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1011, file: !44, line: 2145, baseType: !916, size: 32, align: 32, offset: 2880)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1011, file: !44, line: 2153, baseType: !916, size: 32, align: 32, offset: 2912)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1011, file: !44, line: 2158, baseType: !916, size: 32, align: 32, offset: 2944)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1011, file: !44, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1011, file: !44, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1011, file: !44, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1011, file: !44, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1011, file: !44, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1011, file: !44, line: 2203, baseType: !916, size: 32, align: 32, offset: 3136)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1011, file: !44, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1011, file: !44, line: 2212, baseType: !916, size: 32, align: 32, offset: 3200)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1011, file: !44, line: 2213, baseType: !916, size: 32, align: 32, offset: 3232)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1011, file: !44, line: 2220, baseType: !703, size: 32, align: 32, offset: 3264)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1011, file: !44, line: 2232, baseType: !916, size: 32, align: 32, offset: 3296)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1011, file: !44, line: 2243, baseType: !916, size: 32, align: 32, offset: 3328)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1011, file: !44, line: 2249, baseType: !916, size: 32, align: 32, offset: 3360)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1011, file: !44, line: 2256, baseType: !916, size: 32, align: 32, offset: 3392)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1011, file: !44, line: 2263, baseType: !1091, size: 64, align: 64, offset: 3456)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1011, file: !44, line: 2270, baseType: !1091, size: 64, align: 64, offset: 3520)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1011, file: !44, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1011, file: !44, line: 2285, baseType: !703, size: 32, align: 32, offset: 3616)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1011, file: !44, line: 2367, baseType: !1425, size: 64, align: 64, offset: 3648)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!916, !1352, !1312, !916}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1011, file: !44, line: 2383, baseType: !916, size: 32, align: 32, offset: 3712)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1011, file: !44, line: 2386, baseType: !1359, size: 32, align: 32, offset: 3744)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1011, file: !44, line: 2387, baseType: !1359, size: 32, align: 32, offset: 3776)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1011, file: !44, line: 2394, baseType: !916, size: 32, align: 32, offset: 3808)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1011, file: !44, line: 2401, baseType: !916, size: 32, align: 32, offset: 3840)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1011, file: !44, line: 2408, baseType: !916, size: 32, align: 32, offset: 3872)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1011, file: !44, line: 2415, baseType: !916, size: 32, align: 32, offset: 3904)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1011, file: !44, line: 2422, baseType: !916, size: 32, align: 32, offset: 3936)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1011, file: !44, line: 2423, baseType: !1437, size: 64, align: 64, offset: 3968)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !44, line: 831, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !44, line: 826, size: 128, align: 32, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1439, file: !44, line: 827, baseType: !916, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1439, file: !44, line: 828, baseType: !916, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1439, file: !44, line: 829, baseType: !916, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1439, file: !44, line: 830, baseType: !1359, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1011, file: !44, line: 2430, baseType: !1174, size: 64, align: 64, offset: 4032)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1011, file: !44, line: 2437, baseType: !1174, size: 64, align: 64, offset: 4096)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1011, file: !44, line: 2444, baseType: !1359, size: 32, align: 32, offset: 4160)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1011, file: !44, line: 2451, baseType: !1359, size: 32, align: 32, offset: 4192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1011, file: !44, line: 2458, baseType: !916, size: 32, align: 32, offset: 4224)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1011, file: !44, line: 2469, baseType: !916, size: 32, align: 32, offset: 4256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1011, file: !44, line: 2475, baseType: !916, size: 32, align: 32, offset: 4288)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1011, file: !44, line: 2481, baseType: !916, size: 32, align: 32, offset: 4320)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1011, file: !44, line: 2485, baseType: !916, size: 32, align: 32, offset: 4352)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1011, file: !44, line: 2489, baseType: !916, size: 32, align: 32, offset: 4384)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1011, file: !44, line: 2493, baseType: !916, size: 32, align: 32, offset: 4416)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1011, file: !44, line: 2501, baseType: !916, size: 32, align: 32, offset: 4448)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1011, file: !44, line: 2506, baseType: !916, size: 32, align: 32, offset: 4480)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1011, file: !44, line: 2510, baseType: !916, size: 32, align: 32, offset: 4512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1011, file: !44, line: 2514, baseType: !1174, size: 64, align: 64, offset: 4544)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1011, file: !44, line: 2528, baseType: !1461, size: 64, align: 64, offset: 4608)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !1352, !1027, !916, !916}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1011, file: !44, line: 2534, baseType: !916, size: 32, align: 32, offset: 4672)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1011, file: !44, line: 2545, baseType: !916, size: 32, align: 32, offset: 4704)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1011, file: !44, line: 2547, baseType: !916, size: 32, align: 32, offset: 4736)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1011, file: !44, line: 2549, baseType: !916, size: 32, align: 32, offset: 4768)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1011, file: !44, line: 2551, baseType: !916, size: 32, align: 32, offset: 4800)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1011, file: !44, line: 2553, baseType: !916, size: 32, align: 32, offset: 4832)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1011, file: !44, line: 2555, baseType: !916, size: 32, align: 32, offset: 4864)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1011, file: !44, line: 2557, baseType: !916, size: 32, align: 32, offset: 4896)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1011, file: !44, line: 2559, baseType: !916, size: 32, align: 32, offset: 4928)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1011, file: !44, line: 2563, baseType: !916, size: 32, align: 32, offset: 4960)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1011, file: !44, line: 2571, baseType: !1170, size: 64, align: 64, offset: 4992)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1011, file: !44, line: 2579, baseType: !1170, size: 64, align: 64, offset: 5056)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1011, file: !44, line: 2586, baseType: !916, size: 32, align: 32, offset: 5120)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1011, file: !44, line: 2615, baseType: !916, size: 32, align: 32, offset: 5152)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1011, file: !44, line: 2627, baseType: !916, size: 32, align: 32, offset: 5184)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1011, file: !44, line: 2637, baseType: !916, size: 32, align: 32, offset: 5216)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1011, file: !44, line: 2681, baseType: !916, size: 32, align: 32, offset: 5248)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1011, file: !44, line: 2709, baseType: !1174, size: 64, align: 64, offset: 5312)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1011, file: !44, line: 2716, baseType: !1483, size: 64, align: 64, offset: 5376)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !44, line: 3636, size: 896, align: 64, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1492, !1493, !1498, !1502, !1503, !1504, !1505, !1511, !1512, !1513, !1514, !1515}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1485, file: !44, line: 3642, baseType: !1020, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1485, file: !44, line: 3649, baseType: !33, size: 32, align: 32, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1485, file: !44, line: 3656, baseType: !43, size: 32, align: 32, offset: 96)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1485, file: !44, line: 3663, baseType: !503, size: 32, align: 32, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1485, file: !44, line: 3669, baseType: !916, size: 32, align: 32, offset: 160)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1485, file: !44, line: 3682, baseType: !1309, size: 64, align: 64, offset: 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1485, file: !44, line: 3698, baseType: !1494, size: 64, align: 64, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!916, !1009, !1497, !1139}
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1485, file: !44, line: 3712, baseType: !1499, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!916, !1009, !916, !1497, !1139}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1485, file: !44, line: 3726, baseType: !1494, size: 64, align: 64, offset: 384)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1485, file: !44, line: 3737, baseType: !1108, size: 64, align: 64, offset: 448)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1485, file: !44, line: 3746, baseType: !916, size: 32, align: 32, offset: 512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1485, file: !44, line: 3757, baseType: !1506, size: 64, align: 64, offset: 576)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !1509}
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !44, line: 3617, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1485, file: !44, line: 3766, baseType: !1108, size: 64, align: 64, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1485, file: !44, line: 3774, baseType: !1108, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1485, file: !44, line: 3780, baseType: !916, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1485, file: !44, line: 3785, baseType: !916, size: 32, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1485, file: !44, line: 3795, baseType: !1516, size: 64, align: 64, offset: 832)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!916, !1009, !1184}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1011, file: !44, line: 2728, baseType: !1027, size: 64, align: 64, offset: 5440)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1011, file: !44, line: 2735, baseType: !1237, size: 512, align: 64, offset: 5504)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1011, file: !44, line: 2742, baseType: !916, size: 32, align: 32, offset: 6016)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1011, file: !44, line: 2755, baseType: !916, size: 32, align: 32, offset: 6048)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1011, file: !44, line: 2776, baseType: !916, size: 32, align: 32, offset: 6080)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1011, file: !44, line: 2783, baseType: !916, size: 32, align: 32, offset: 6112)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1011, file: !44, line: 2791, baseType: !916, size: 32, align: 32, offset: 6144)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1011, file: !44, line: 2802, baseType: !1312, size: 64, align: 64, offset: 6208)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1011, file: !44, line: 2811, baseType: !916, size: 32, align: 32, offset: 6272)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1011, file: !44, line: 2821, baseType: !916, size: 32, align: 32, offset: 6304)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1011, file: !44, line: 2830, baseType: !916, size: 32, align: 32, offset: 6336)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1011, file: !44, line: 2840, baseType: !916, size: 32, align: 32, offset: 6368)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1011, file: !44, line: 2851, baseType: !1532, size: 64, align: 64, offset: 6400)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!916, !1352, !1535, !1027, !1294, !916, !916}
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!916, !1352, !1027}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1011, file: !44, line: 2871, baseType: !1539, size: 64, align: 64, offset: 6464)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!916, !1352, !1542, !1027, !1294, !916}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!916, !1352, !1027, !916, !916}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1011, file: !44, line: 2878, baseType: !916, size: 32, align: 32, offset: 6528)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1011, file: !44, line: 2885, baseType: !916, size: 32, align: 32, offset: 6560)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1011, file: !44, line: 3005, baseType: !916, size: 32, align: 32, offset: 6592)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1011, file: !44, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1011, file: !44, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1011, file: !44, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1011, file: !44, line: 3037, baseType: !917, size: 64, align: 64, offset: 6720)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1011, file: !44, line: 3038, baseType: !916, size: 32, align: 32, offset: 6784)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1011, file: !44, line: 3050, baseType: !1091, size: 64, align: 64, offset: 6848)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1011, file: !44, line: 3065, baseType: !916, size: 32, align: 32, offset: 6912)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1011, file: !44, line: 3083, baseType: !916, size: 32, align: 32, offset: 6944)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1011, file: !44, line: 3092, baseType: !1073, size: 64, align: 32, offset: 6976)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1011, file: !44, line: 3099, baseType: !503, size: 32, align: 32, offset: 7040)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1011, file: !44, line: 3106, baseType: !1073, size: 64, align: 32, offset: 7072)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1011, file: !44, line: 3113, baseType: !1560, size: 64, align: 64, offset: 7168)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1562)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !44, line: 740, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !44, line: 712, size: 384, align: 64, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568, !1569, !1570, !1573}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1563, file: !44, line: 713, baseType: !43, size: 32, align: 32)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1563, file: !44, line: 714, baseType: !33, size: 32, align: 32, offset: 32)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1563, file: !44, line: 720, baseType: !1020, size: 64, align: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1563, file: !44, line: 724, baseType: !1020, size: 64, align: 64, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1563, file: !44, line: 728, baseType: !916, size: 32, align: 32, offset: 192)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1563, file: !44, line: 734, baseType: !1571, size: 64, align: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1563, file: !44, line: 739, baseType: !1574, size: 64, align: 64, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1011, file: !44, line: 3129, baseType: !1174, size: 64, align: 64, offset: 7232)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1011, file: !44, line: 3130, baseType: !1174, size: 64, align: 64, offset: 7296)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1011, file: !44, line: 3131, baseType: !1174, size: 64, align: 64, offset: 7360)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1011, file: !44, line: 3132, baseType: !1174, size: 64, align: 64, offset: 7424)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1011, file: !44, line: 3139, baseType: !1170, size: 64, align: 64, offset: 7488)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1011, file: !44, line: 3147, baseType: !916, size: 32, align: 32, offset: 7552)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1011, file: !44, line: 3165, baseType: !916, size: 32, align: 32, offset: 7584)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1011, file: !44, line: 3172, baseType: !916, size: 32, align: 32, offset: 7616)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1011, file: !44, line: 3180, baseType: !916, size: 32, align: 32, offset: 7648)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1011, file: !44, line: 3191, baseType: !1389, size: 64, align: 64, offset: 7680)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1011, file: !44, line: 3199, baseType: !917, size: 64, align: 64, offset: 7744)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1011, file: !44, line: 3207, baseType: !1170, size: 64, align: 64, offset: 7808)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1011, file: !44, line: 3214, baseType: !1140, size: 32, align: 32, offset: 7872)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1011, file: !44, line: 3224, baseType: !1202, size: 64, align: 64, offset: 7936)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1011, file: !44, line: 3225, baseType: !916, size: 32, align: 32, offset: 8000)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1011, file: !44, line: 3249, baseType: !1184, size: 64, align: 64, offset: 8064)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1011, file: !44, line: 3256, baseType: !916, size: 32, align: 32, offset: 8128)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1011, file: !44, line: 3271, baseType: !916, size: 32, align: 32, offset: 8160)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1011, file: !44, line: 3279, baseType: !1174, size: 64, align: 64, offset: 8192)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1011, file: !44, line: 3301, baseType: !1184, size: 64, align: 64, offset: 8256)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1011, file: !44, line: 3310, baseType: !916, size: 32, align: 32, offset: 8320)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1011, file: !44, line: 3337, baseType: !916, size: 32, align: 32, offset: 8352)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1011, file: !44, line: 3351, baseType: !916, size: 32, align: 32, offset: 8384)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1011, file: !44, line: 3359, baseType: !916, size: 32, align: 32, offset: 8416)
!1600 = !DILocalVariable(name: "c", arg: 1, scope: !974, file: !898, line: 61, type: !977)
!1601 = !DILocation(line: 61, column: 64, scope: !974)
!1602 = !DILocalVariable(name: "avctx", arg: 2, scope: !974, file: !898, line: 61, type: !1009)
!1603 = !DILocation(line: 61, column: 83, scope: !974)
!1604 = !DILocalVariable(name: "high_bit_depth", arg: 3, scope: !974, file: !898, line: 62, type: !1140)
!1605 = !DILocation(line: 62, column: 43, scope: !974)
!1606 = !DILocalVariable(name: "cpu_flags", scope: !974, file: !898, line: 64, type: !916)
!1607 = !DILocation(line: 64, column: 9, scope: !974)
!1608 = !DILocation(line: 64, column: 21, scope: !974)
!1609 = !DILocation(line: 112, column: 14, scope: !1610)
!1610 = distinct !DILexicalBlock(scope: !974, file: !898, line: 112, column: 9)
!1611 = !DILocation(line: 112, column: 21, scope: !1610)
!1612 = !DILocation(line: 112, column: 28, scope: !1610)
!1613 = !DILocation(line: 112, column: 9, scope: !974)
!1614 = !DILocation(line: 125, column: 13, scope: !1615)
!1615 = distinct !DILexicalBlock(scope: !1616, file: !898, line: 125, column: 13)
!1616 = distinct !DILexicalBlock(scope: !1610, file: !898, line: 112, column: 34)
!1617 = !DILocation(line: 125, column: 20, scope: !1615)
!1618 = !DILocation(line: 125, column: 40, scope: !1615)
!1619 = !DILocation(line: 125, column: 46, scope: !1615)
!1620 = !DILocation(line: 126, column: 13, scope: !1615)
!1621 = !DILocation(line: 126, column: 20, scope: !1615)
!1622 = !DILocation(line: 126, column: 29, scope: !1615)
!1623 = !DILocation(line: 126, column: 50, scope: !1615)
!1624 = !DILocation(line: 127, column: 14, scope: !1615)
!1625 = !DILocation(line: 127, column: 21, scope: !1615)
!1626 = !DILocation(line: 127, column: 31, scope: !1615)
!1627 = !DILocation(line: 127, column: 36, scope: !1615)
!1628 = !DILocation(line: 128, column: 14, scope: !1615)
!1629 = !DILocation(line: 128, column: 21, scope: !1615)
!1630 = !DILocation(line: 128, column: 31, scope: !1615)
!1631 = !DILocation(line: 128, column: 38, scope: !1615)
!1632 = !DILocation(line: 129, column: 14, scope: !1615)
!1633 = !DILocation(line: 129, column: 21, scope: !1615)
!1634 = !DILocation(line: 129, column: 31, scope: !1615)
!1635 = !DILocation(line: 125, column: 13, scope: !1636)
!1636 = !DILexicalBlockFile(scope: !1616, file: !898, discriminator: 1)
!1637 = !DILocation(line: 143, column: 9, scope: !1638)
!1638 = distinct !DILexicalBlock(scope: !1615, file: !898, line: 129, column: 38)
!1639 = !DILocation(line: 145, column: 13, scope: !1640)
!1640 = distinct !DILexicalBlock(scope: !1616, file: !898, line: 145, column: 13)
!1641 = !DILocation(line: 145, column: 20, scope: !1640)
!1642 = !DILocation(line: 145, column: 40, scope: !1640)
!1643 = !DILocation(line: 145, column: 46, scope: !1640)
!1644 = !DILocation(line: 146, column: 14, scope: !1640)
!1645 = !DILocation(line: 146, column: 21, scope: !1640)
!1646 = !DILocation(line: 146, column: 31, scope: !1640)
!1647 = !DILocation(line: 146, column: 36, scope: !1640)
!1648 = !DILocation(line: 147, column: 14, scope: !1640)
!1649 = !DILocation(line: 147, column: 21, scope: !1640)
!1650 = !DILocation(line: 147, column: 31, scope: !1640)
!1651 = !DILocation(line: 145, column: 13, scope: !1636)
!1652 = !DILocation(line: 160, column: 9, scope: !1653)
!1653 = distinct !DILexicalBlock(scope: !1640, file: !898, line: 147, column: 38)
!1654 = !DILocation(line: 161, column: 5, scope: !1616)
!1655 = !DILocation(line: 162, column: 1, scope: !974)
