; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct_fixed_32.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct_fixed_32.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, i32*, i32*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, i32*, i32*)*, void (%struct.FFTContext*, i32*, i32*)*, void (%struct.FFTContext*, i32*, i32*)*, void (%struct.FFTContext*, i32*, i32*)*, i32, i32, i32* }
%struct.FFTComplex = type { i32, i32 }

; Function Attrs: cold nounwind optsize uwtable
define i32 @ff_mdct_init_fixed_32(%struct.FFTContext* %s, i32 %nbits, i32 %inverse, double %scale) #0 !dbg !30 {
entry:
  %retval = alloca i32, align 4
  %s.addr = alloca %struct.FFTContext*, align 8
  %nbits.addr = alloca i32, align 4
  %inverse.addr = alloca i32, align 4
  %scale.addr = alloca double, align 8
  %n = alloca i32, align 4
  %n4 = alloca i32, align 4
  %i = alloca i32, align 4
  %alpha = alloca double, align 8
  %theta = alloca double, align 8
  %tstep = alloca i32, align 4
  store %struct.FFTContext* %s, %struct.FFTContext** %s.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.FFTContext** %s.addr, metadata !78, metadata !79), !dbg !80

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mdct_fixed_32.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{!14, !24, !22, !26}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !4, line: 64, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !4, line: 62, size: 64, align: 32, elements: !17)
!17 = !{!18, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !16, file: !4, line: 63, baseType: !19, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !4, line: 52, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !21, line: 196, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !16, file: !4, line: 63, baseType: !19, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 197, baseType: !25)
!25 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!30 = distinct !DISubprogram(name: "ff_mdct_init_fixed_32", scope: !31, file: !31, line: 48, type: !32, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !77)
!31 = !DIFile(filename: "libavcodec/mdct_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!32 = !DISubroutineType(types: !33)
!33 = !{!22, !34, !22, !22, !76}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !4, line: 67, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !37)
!37 = !{!38, !39, !40, !45, !46, !47, !48, !50, !51, !56, !57, !63, !64, !65, !71, !72, !73}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !36, file: !4, line: 89, baseType: !22, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !36, file: !4, line: 90, baseType: !22, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !36, file: !4, line: 91, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 49, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !36, file: !4, line: 92, baseType: !14, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !36, file: !4, line: 93, baseType: !22, size: 32, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !36, file: !4, line: 94, baseType: !22, size: 32, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !36, file: !4, line: 96, baseType: !49, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !36, file: !4, line: 97, baseType: !49, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !36, file: !4, line: 101, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !14}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !36, file: !4, line: 106, baseType: !52, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !36, file: !4, line: 107, baseType: !58, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !55, !49, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !36, file: !4, line: 108, baseType: !58, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !36, file: !4, line: 109, baseType: !58, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !36, file: !4, line: 110, baseType: !66, size: 64, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !55, !69, !61}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 66, baseType: !22)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !36, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !36, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !36, file: !4, line: 113, baseType: !74, size: 64, align: 64, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 51, baseType: !26)
!76 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!77 = !{}
!78 = !DILocalVariable(name: "s", arg: 1, scope: !30, file: !31, line: 48, type: !34)
!79 = !DIExpression()
!80 = !DILocation(line: 48, column: 61, scope: !30)
!81 = !DILocalVariable(name: "nbits", arg: 2, scope: !30, file: !31, line: 48, type: !22)
!82 = !DILocation(line: 48, column: 68, scope: !30)
!83 = !DILocalVariable(name: "inverse", arg: 3, scope: !30, file: !31, line: 48, type: !22)
!84 = !DILocation(line: 48, column: 79, scope: !30)
!85 = !DILocalVariable(name: "scale", arg: 4, scope: !30, file: !31, line: 48, type: !76)
!86 = !DILocation(line: 48, column: 95, scope: !30)
!87 = !DILocalVariable(name: "n", scope: !30, file: !31, line: 50, type: !22)
!88 = !DILocation(line: 50, column: 9, scope: !30)
!89 = !DILocalVariable(name: "n4", scope: !30, file: !31, line: 50, type: !22)
!90 = !DILocation(line: 50, column: 12, scope: !30)
!91 = !DILocalVariable(name: "i", scope: !30, file: !31, line: 50, type: !22)
!92 = !DILocation(line: 50, column: 16, scope: !30)
!93 = !DILocalVariable(name: "alpha", scope: !30, file: !31, line: 51, type: !76)
!94 = !DILocation(line: 51, column: 12, scope: !30)
!95 = !DILocalVariable(name: "theta", scope: !30, file: !31, line: 51, type: !76)
!96 = !DILocation(line: 51, column: 19, scope: !30)
!97 = !DILocalVariable(name: "tstep", scope: !30, file: !31, line: 52, type: !22)
!98 = !DILocation(line: 52, column: 9, scope: !30)
!99 = !DILocation(line: 54, column: 12, scope: !30)
!100 = !DILocation(line: 54, column: 5, scope: !30)
!101 = !DILocation(line: 55, column: 14, scope: !30)
!102 = !DILocation(line: 55, column: 11, scope: !30)
!103 = !DILocation(line: 55, column: 7, scope: !30)
!104 = !DILocation(line: 56, column: 20, scope: !30)
!105 = !DILocation(line: 56, column: 5, scope: !30)
!106 = !DILocation(line: 56, column: 8, scope: !30)
!107 = !DILocation(line: 56, column: 18, scope: !30)
!108 = !DILocation(line: 57, column: 20, scope: !30)
!109 = !DILocation(line: 57, column: 5, scope: !30)
!110 = !DILocation(line: 57, column: 8, scope: !30)
!111 = !DILocation(line: 57, column: 18, scope: !30)
!112 = !DILocation(line: 58, column: 10, scope: !30)
!113 = !DILocation(line: 58, column: 12, scope: !30)
!114 = !DILocation(line: 58, column: 8, scope: !30)
!115 = !DILocation(line: 59, column: 5, scope: !30)
!116 = !DILocation(line: 59, column: 8, scope: !30)
!117 = !DILocation(line: 59, column: 25, scope: !30)
!118 = !DILocation(line: 61, column: 30, scope: !119)
!119 = distinct !DILexicalBlock(scope: !30, file: !31, line: 61, column: 9)
!120 = !DILocation(line: 61, column: 33, scope: !119)
!121 = !DILocation(line: 61, column: 36, scope: !119)
!122 = !DILocation(line: 61, column: 46, scope: !119)
!123 = !DILocation(line: 61, column: 51, scope: !119)
!124 = !DILocation(line: 61, column: 9, scope: !119)
!125 = !DILocation(line: 61, column: 60, scope: !119)
!126 = !DILocation(line: 61, column: 9, scope: !30)
!127 = !DILocation(line: 62, column: 9, scope: !119)
!128 = !DILocation(line: 64, column: 31, scope: !30)
!129 = !DILocation(line: 64, column: 32, scope: !30)
!130 = !DILocation(line: 64, column: 15, scope: !30)
!131 = !DILocation(line: 64, column: 5, scope: !30)
!132 = !DILocation(line: 64, column: 8, scope: !30)
!133 = !DILocation(line: 64, column: 13, scope: !30)
!134 = !DILocation(line: 65, column: 10, scope: !135)
!135 = distinct !DILexicalBlock(scope: !30, file: !31, line: 65, column: 9)
!136 = !DILocation(line: 65, column: 13, scope: !135)
!137 = !DILocation(line: 65, column: 9, scope: !30)
!138 = !DILocation(line: 66, column: 9, scope: !135)
!139 = !DILocation(line: 68, column: 13, scope: !30)
