; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jpegls.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jpegls.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.JLSState = type { i32, i32, i32, [367 x i32], [367 x i32], [365 x i32], [367 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32] }

; Function Attrs: nounwind uwtable
define void @ff_jpegls_init_state(%struct.JLSState* %state) #0 !dbg !6 {
entry:
  %state.addr = alloca %struct.JLSState*, align 8
  %i = alloca i32, align 4
  store %struct.JLSState* %state, %struct.JLSState** %state.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.JLSState** %state.addr, metadata !41, metadata !42), !dbg !43
  call void @llvm.dbg.declare(metadata i32* %i, metadata !44, metadata !42), !dbg !45
  %0 = load %struct.JLSState*, %struct.JLSState** %state.addr, align 8, !dbg !46
  %near = getelementptr inbounds %struct.JLSState, %struct.JLSState* %0, i32 0, i32 13, !dbg !47
  %1 = load i32, i32* %near, align 4, !dbg !47
  %mul = mul nsw i32 %1, 2, !dbg !48
  %add = add nsw i32 %mul, 1, !dbg !49
  %2 = load %struct.JLSState*, %struct.JLSState** %state.addr, align 8, !dbg !50
  %twonear = getelementptr inbounds %struct.JLSState, %struct.JLSState* %2, i32 0, i32 14, !dbg !51
  store i32 %add, i32* %twonear, align 4, !dbg !52

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--jpegls.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!6 = distinct !DISubprogram(name: "ff_jpegls_init_state", scope: !7, file: !7, line: 31, type: !8, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "libavcodec/jpegls.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "JLSState", file: !12, line: 47, baseType: !13)
!12 = !DIFile(filename: "libavcodec/jpegls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JLSState", file: !12, line: 41, size: 47392, align: 32, elements: !14)
!14 = !{!15, !17, !18, !19, !23, !24, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "T1", scope: !13, file: !12, line: 42, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "T2", scope: !13, file: !12, line: 42, baseType: !16, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "T3", scope: !13, file: !12, line: 42, baseType: !16, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !13, file: !12, line: 43, baseType: !20, size: 11744, align: 32, offset: 96)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 11744, align: 32, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 367)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !13, file: !12, line: 43, baseType: !20, size: 11744, align: 32, offset: 11840)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !13, file: !12, line: 43, baseType: !25, size: 11680, align: 32, offset: 23584)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 11680, align: 32, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 365)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !13, file: !12, line: 43, baseType: !20, size: 11744, align: 32, offset: 35264)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32, offset: 47008)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32, offset: 47040)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32, offset: 47072)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "qbpp", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32, offset: 47104)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32, offset: 47136)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32, offset: 47168)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "near", scope: !13, file: !12, line: 45, baseType: !16, size: 32, align: 32, offset: 47200)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "twonear", scope: !13, file: !12, line: 45, baseType: !16, size: 32, align: 32, offset: 47232)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "run_index", scope: !13, file: !12, line: 46, baseType: !38, size: 128, align: 32, offset: 47264)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, align: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 4)
!41 = !DILocalVariable(name: "state", arg: 1, scope: !6, file: !7, line: 31, type: !10)
!42 = !DIExpression()
!43 = !DILocation(line: 31, column: 37, scope: !6)
!44 = !DILocalVariable(name: "i", scope: !6, file: !7, line: 33, type: !16)
!45 = !DILocation(line: 33, column: 9, scope: !6)
!46 = !DILocation(line: 35, column: 22, scope: !6)
!47 = !DILocation(line: 35, column: 29, scope: !6)
!48 = !DILocation(line: 35, column: 34, scope: !6)
!49 = !DILocation(line: 35, column: 38, scope: !6)
!50 = !DILocation(line: 35, column: 5, scope: !6)
!51 = !DILocation(line: 35, column: 12, scope: !6)
!52 = !DILocation(line: 35, column: 20, scope: !6)
!53 = !DILocation(line: 36, column: 21, scope: !6)
!54 = !DILocation(line: 36, column: 28, scope: !6)
!55 = !DILocation(line: 36, column: 37, scope: !6)
!56 = !DILocation(line: 36, column: 44, scope: !6)
!57 = !DILocation(line: 36, column: 35, scope: !6)
!58 = !DILocation(line: 36, column: 52, scope: !6)
!59 = !DILocation(line: 36, column: 59, scope: !6)
!60 = !DILocation(line: 36, column: 66, scope: !6)
!61 = !DILocation(line: 36, column: 57, scope: !6)
!62 = !DILocation(line: 36, column: 74, scope: !6)
!63 = !DILocation(line: 36, column: 5, scope: !6)
!64 = !DILocation(line: 36, column: 12, scope: !6)
!65 = !DILocation(line: 36, column: 18, scope: !6)
!66 = !DILocation(line: 39, column: 10, scope: !67)
!67 = distinct !DILexicalBlock(scope: !6, file: !7, line: 39, column: 5)
!68 = !DILocation(line: 39, column: 17, scope: !67)
!69 = !DILocation(line: 39, column: 22, scope: !67)
!70 = !DILocation(line: 39, column: 33, scope: !71)
!71 = !DILexicalBlockFile(scope: !72, file: !7, discriminator: 1)
!72 = distinct !DILexicalBlock(scope: !67, file: !7, line: 39, column: 5)
!73 = !DILocation(line: 39, column: 40, scope: !71)
!74 = !DILocation(line: 39, column: 30, scope: !71)
!75 = !DILocation(line: 39, column: 48, scope: !71)
!76 = !DILocation(line: 39, column: 55, scope: !71)
!77 = !DILocation(line: 39, column: 46, scope: !71)
!78 = !DILocation(line: 39, column: 5, scope: !71)
!79 = !DILocation(line: 39, column: 5, scope: !80)
!80 = !DILexicalBlockFile(scope: !67, file: !7, discriminator: 2)
!81 = !DILocation(line: 39, column: 62, scope: !82)
!82 = !DILexicalBlockFile(scope: !72, file: !7, discriminator: 3)
!83 = !DILocation(line: 39, column: 69, scope: !82)
!84 = !DILocation(line: 39, column: 73, scope: !82)
!85 = !DILocation(line: 39, column: 5, scope: !82)
!86 = distinct !{!86, !87}
!87 = !DILocation(line: 39, column: 5, scope: !6)
!88 = !DILocation(line: 42, column: 41, scope: !6)
!89 = !DILocation(line: 42, column: 48, scope: !6)
!90 = !DILocation(line: 42, column: 55, scope: !6)
!91 = !DILocation(line: 42, column: 26, scope: !6)
!92 = !DILocation(line: 42, column: 24, scope: !6)
!93 = !DILocation(line: 42, column: 60, scope: !6)
!94 = !DILocation(line: 42, column: 65, scope: !6)
!95 = !DILocation(line: 42, column: 19, scope: !6)
!96 = !DILocation(line: 42, column: 95, scope: !97)
!97 = !DILexicalBlockFile(scope: !6, file: !7, discriminator: 1)
!98 = !DILocation(line: 42, column: 102, scope: !97)
!99 = !DILocation(line: 42, column: 109, scope: !97)
!100 = !DILocation(line: 42, column: 80, scope: !97)
!101 = !DILocation(line: 42, column: 78, scope: !97)
!102 = !DILocation(line: 42, column: 114, scope: !97)
!103 = !DILocation(line: 42, column: 19, scope: !97)
!104 = !DILocation(line: 42, column: 19, scope: !105)
!105 = !DILexicalBlockFile(scope: !6, file: !7, discriminator: 2)
!106 = !DILocation(line: 42, column: 19, scope: !107)
!107 = !DILexicalBlockFile(scope: !6, file: !7, discriminator: 3)
!108 = !DILocation(line: 42, column: 5, scope: !107)
!109 = !DILocation(line: 42, column: 12, scope: !107)
