; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacpsy.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--aacpsy.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFPsyContext = type { %struct.AVCodecContext*, %struct.FFPsyModel*, %struct.FFPsyChannel*, %struct.FFPsyChannelGroup*, i32, i32, i8**, i32*, i32, %struct.anon, i8* }

!824 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!825 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!826 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!827 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!828 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !495, line: 493, size: 32, align: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!832 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!833 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!834 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!835 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!836 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!837 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!838 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!839 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!840 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!842 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!843 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!844 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!845 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!846 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!847 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !495, line: 538, size: 32, align: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WindowSequence", file: !888, line: 75, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/aac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893}
!890 = !DIEnumerator(name: "ONLY_LONG_SEQUENCE", value: 0)
!891 = !DIEnumerator(name: "LONG_START_SEQUENCE", value: 1)
!892 = !DIEnumerator(name: "EIGHT_SHORT_SEQUENCE", value: 2)
!893 = !DIEnumerator(name: "LONG_STOP_SEQUENCE", value: 3)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !895, line: 85, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/aacpsy.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!896 = !{!897, !898, !899}
!897 = !DIEnumerator(name: "PSY_3GPP_AH_NONE", value: 0)
!898 = !DIEnumerator(name: "PSY_3GPP_AH_INACTIVE", value: 1)
!899 = !DIEnumerator(name: "PSY_3GPP_AH_ACTIVE", value: 2)
!900 = !{!901, !902, !903}
!901 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!902 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "AacPsyContext", file: !895, line: 164, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AacPsyContext", file: !895, line: 151, size: 29056, align: 64, elements: !906)
!906 = !{!907, !908, !909, !910, !917, !932, !967}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "chan_bitrate", scope: !905, file: !895, line: 152, baseType: !902, size: 32, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !905, file: !895, line: 153, baseType: !902, size: 32, align: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fill_level", scope: !905, file: !895, line: 154, baseType: !902, size: 32, align: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !905, file: !895, line: 160, baseType: !911, size: 128, align: 32, offset: 96)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !905, file: !895, line: 155, size: 128, align: 32, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !911, file: !895, line: 156, baseType: !901, size: 32, align: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !911, file: !895, line: 157, baseType: !901, size: 32, align: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !911, file: !895, line: 158, baseType: !901, size: 32, align: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "correction", scope: !911, file: !895, line: 159, baseType: !901, size: 32, align: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "psy_coef", scope: !905, file: !895, line: 161, baseType: !918, size: 28672, align: 32, offset: 224)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 28672, align: 32, elements: !930)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "AacPsyCoeffs", file: !895, line: 146, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AacPsyCoeffs", file: !895, line: 140, size: 224, align: 32, elements: !921)
!921 = !{!922, !923, !924, !928, !929}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ath", scope: !920, file: !895, line: 141, baseType: !901, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "barks", scope: !920, file: !895, line: 142, baseType: !901, size: 32, align: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "spread_low", scope: !920, file: !895, line: 143, baseType: !925, size: 64, align: 32, offset: 64)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 64, align: 32, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 2)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "spread_hi", scope: !920, file: !895, line: 144, baseType: !925, size: 64, align: 32, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "min_snr", scope: !920, file: !895, line: 145, baseType: !901, size: 32, align: 32, offset: 192)
!930 = !{!927, !931}
!931 = !DISubrange(count: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !905, file: !895, line: 162, baseType: !933, size: 64, align: 64, offset: 28928)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AacPsyChannel", file: !895, line: 135, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AacPsyChannel", file: !895, line: 123, size: 74720, align: 32, elements: !936)
!936 = !{!937, !953, !954, !955, !956, !960, !961, !962, !966}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !935, file: !895, line: 124, baseType: !938, size: 36864, align: 32)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 36864, align: 32, elements: !951)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AacPsyBand", file: !895, line: 118, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AacPsyBand", file: !895, line: 108, size: 288, align: 32, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !940, file: !895, line: 109, baseType: !901, size: 32, align: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !940, file: !895, line: 110, baseType: !901, size: 32, align: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "thr_quiet", scope: !940, file: !895, line: 111, baseType: !901, size: 32, align: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nz_lines", scope: !940, file: !895, line: 112, baseType: !901, size: 32, align: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "active_lines", scope: !940, file: !895, line: 113, baseType: !901, size: 32, align: 32, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "pe", scope: !940, file: !895, line: 114, baseType: !901, size: 32, align: 32, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pe_const", scope: !940, file: !895, line: 115, baseType: !901, size: 32, align: 32, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "norm_fac", scope: !940, file: !895, line: 116, baseType: !901, size: 32, align: 32, offset: 224)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_holes", scope: !940, file: !895, line: 117, baseType: !902, size: 32, align: 32, offset: 256)
!951 = !{!952}
!952 = !DISubrange(count: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "prev_band", scope: !935, file: !895, line: 125, baseType: !938, size: 36864, align: 32, offset: 36864)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "win_energy", scope: !935, file: !895, line: 127, baseType: !901, size: 32, align: 32, offset: 73728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "iir_state", scope: !935, file: !895, line: 128, baseType: !925, size: 64, align: 32, offset: 73760)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "next_grouping", scope: !935, file: !895, line: 129, baseType: !957, size: 8, align: 8, offset: 73824)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !958, line: 48, baseType: !959)
!958 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!959 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next_window_seq", scope: !935, file: !895, line: 130, baseType: !887, size: 32, align: 32, offset: 73856)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "attack_threshold", scope: !935, file: !895, line: 132, baseType: !901, size: 32, align: 32, offset: 73888)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "prev_energy_subshort", scope: !935, file: !895, line: 133, baseType: !963, size: 768, align: 32, offset: 73920)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 768, align: 32, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 24)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attack", scope: !935, file: !895, line: 134, baseType: !902, size: 32, align: 32, offset: 74688)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !905, file: !895, line: 163, baseType: !901, size: 32, align: 32, offset: 28992)
!968 = !{!969, !1784, !1794, !1798, !1802}
!969 = distinct !DIGlobalVariable(name: "ff_aac_psy_model", scope: !0, file: !895, line: 1018, type: !970, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.FFPsyContext*)*, void (%struct.FFPsyWindowInfo*, %struct.FFPsyContext*, float*, float*, i32, i32)*, void (%struct.FFPsyContext*, i32, float**, %struct.FFPsyWindowInfo*)*, void (%struct.FFPsyContext*)* }* @ff_aac_psy_model)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyModel", file: !972, line: 142, baseType: !973)
!972 = !DIFile(filename: "libavcodec/psymodel.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyModel", file: !972, line: 114, size: 320, align: 64, elements: !974)
!974 = !{!975, !979, !1754, !1773, !1780}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !973, file: !972, line: 115, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !973, file: !972, line: 116, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!902, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFPsyContext", file: !972, line: 109, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFPsyContext", file: !972, line: 89, size: 640, align: 64, elements: !986)
!986 = !{!987, !1712, !1715, !1730, !1742, !1743, !1744, !1745, !1746, !1747, !1753}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !985, file: !972, line: 90, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !991)
!991 = !{!992, !1034, !1035, !1036, !1311, !1312, !1313, !1314, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1467, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1650, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !990, file: !35, line: 1561, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !997)
!997 = !{!998, !999, !1004, !1008, !1009, !1010, !1011, !1015, !1021, !1023, !1027}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !996, file: !4, line: 72, baseType: !976, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !996, file: !4, line: 78, baseType: !1000, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!976, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !996, file: !4, line: 85, baseType: !1005, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !996, file: !4, line: 93, baseType: !902, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !996, file: !4, line: 99, baseType: !902, size: 32, align: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !996, file: !4, line: 108, baseType: !902, size: 32, align: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !996, file: !4, line: 113, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1003, !1003, !1003}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !996, file: !4, line: 123, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !996, file: !4, line: 130, baseType: !1022, size: 32, align: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !996, file: !4, line: 136, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1022, !1003}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !996, file: !4, line: 142, baseType: !1028, size: 64, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!902, !1031, !1003, !976, !902}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !990, file: !35, line: 1562, baseType: !902, size: 32, align: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !990, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !990, file: !35, line: 1565, baseType: !1037, size: 64, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1055, !1058, !1061, !1064, !1069, !1070, !1071, !1079, !1080, !1081, !1083, !1087, !1093, !1104, !1108, !1109, !1161, !1282, !1286, !1287, !1291, !1295, !1300, !1304, !1305, !1306}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !35, line: 3475, baseType: !976, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1039, file: !35, line: 3480, baseType: !976, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1039, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1039, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1039, file: !35, line: 3487, baseType: !902, size: 32, align: 32, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1039, file: !35, line: 3488, baseType: !1047, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1050, line: 61, baseType: !1051)
!1050 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1050, line: 58, size: 64, align: 32, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1051, file: !1050, line: 59, baseType: !902, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1051, file: !1050, line: 60, baseType: !902, size: 32, align: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1039, file: !35, line: 3489, baseType: !1056, size: 64, align: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1039, file: !35, line: 3490, baseType: !1059, size: 64, align: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1039, file: !35, line: 3491, baseType: !1062, size: 64, align: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1039, file: !35, line: 3492, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !958, line: 55, baseType: !1068)
!1068 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1039, file: !35, line: 3493, baseType: !957, size: 8, align: 8, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1039, file: !35, line: 3494, baseType: !993, size: 64, align: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1039, file: !35, line: 3495, baseType: !1072, size: 64, align: 64, offset: 704)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1075, file: !35, line: 3402, baseType: !902, size: 32, align: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1075, file: !35, line: 3403, baseType: !976, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1039, file: !35, line: 3507, baseType: !976, size: 64, align: 64, offset: 768)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1039, file: !35, line: 3516, baseType: !902, size: 32, align: 32, offset: 832)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !35, line: 3517, baseType: !1082, size: 64, align: 64, offset: 896)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1039, file: !35, line: 3527, baseType: !1084, size: 64, align: 64, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!902, !988}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1039, file: !35, line: 3535, baseType: !1088, size: 64, align: 64, offset: 1024)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!902, !988, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1039, file: !35, line: 3541, baseType: !1094, size: 64, align: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1098, line: 223, size: 128, align: 64, elements: !1099)
!1098 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1099 = !{!1100, !1103}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1097, file: !1098, line: 224, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1097, file: !1098, line: 225, baseType: !1101, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1039, file: !35, line: 3549, baseType: !1105, size: 64, align: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{null, !1082}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1039, file: !35, line: 3551, baseType: !1084, size: 64, align: 64, offset: 1216)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1039, file: !35, line: 3552, baseType: !1110, size: 64, align: 64, offset: 1280)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!902, !988, !1113, !902, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1117)
!1117 = !{!1118, !1121, !1124, !1125, !1126, !1158}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1116, file: !35, line: 3921, baseType: !1119, size: 16, align: 16)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !958, line: 49, baseType: !1120)
!1120 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1116, file: !35, line: 3922, baseType: !1122, size: 32, align: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !958, line: 51, baseType: !1123)
!1123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1116, file: !35, line: 3923, baseType: !1122, size: 32, align: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1116, file: !35, line: 3924, baseType: !1123, size: 32, align: 32, offset: 96)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1116, file: !35, line: 3925, baseType: !1127, size: 64, align: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1147, !1151, !1153, !1154, !1156, !1157}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1130, file: !35, line: 3886, baseType: !902, size: 32, align: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1130, file: !35, line: 3887, baseType: !902, size: 32, align: 32, offset: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1130, file: !35, line: 3888, baseType: !902, size: 32, align: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1130, file: !35, line: 3889, baseType: !902, size: 32, align: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1130, file: !35, line: 3890, baseType: !902, size: 32, align: 32, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1130, file: !35, line: 3897, baseType: !1138, size: 768, align: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1140)
!1140 = !{!1141, !1145}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !35, line: 3855, baseType: !1142, size: 512, align: 64)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 512, align: 64, elements: !1143)
!1143 = !{!1144}
!1144 = !DISubrange(count: 8)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1139, file: !35, line: 3857, baseType: !1146, size: 256, align: 32, offset: 512)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 256, align: 32, elements: !1143)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1130, file: !35, line: 3903, baseType: !1148, size: 256, align: 64, offset: 960)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 256, align: 64, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 4)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1130, file: !35, line: 3904, baseType: !1152, size: 128, align: 32, offset: 1216)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, align: 32, elements: !1149)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1130, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1130, file: !35, line: 3908, baseType: !1155, size: 64, align: 64, offset: 1408)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1130, file: !35, line: 3915, baseType: !1155, size: 64, align: 64, offset: 1472)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1130, file: !35, line: 3917, baseType: !902, size: 32, align: 32, offset: 1536)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !35, line: 3926, baseType: !1159, size: 64, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !958, line: 40, baseType: !1160)
!1160 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1039, file: !35, line: 3564, baseType: !1162, size: 64, align: 64, offset: 1344)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!902, !988, !1165, !1199, !1281}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1168)
!1168 = !{!1169, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1195, !1196, !1197, !1198}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1167, file: !35, line: 1451, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1172, line: 94, baseType: !1173)
!1172 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1172, line: 81, size: 192, align: 64, elements: !1174)
!1174 = !{!1175, !1179, !1180}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1173, file: !1172, line: 82, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1172, line: 73, baseType: !1178)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1172, line: 73, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !1172, line: 89, baseType: !1113, size: 64, align: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !1172, line: 93, baseType: !902, size: 32, align: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1167, file: !35, line: 1461, baseType: !1159, size: 64, align: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1167, file: !35, line: 1467, baseType: !1159, size: 64, align: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !35, line: 1468, baseType: !1113, size: 64, align: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !35, line: 1469, baseType: !902, size: 32, align: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1167, file: !35, line: 1470, baseType: !902, size: 32, align: 32, offset: 288)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1167, file: !35, line: 1474, baseType: !902, size: 32, align: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1167, file: !35, line: 1479, baseType: !1188, size: 64, align: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1190, file: !35, line: 1412, baseType: !1113, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1190, file: !35, line: 1413, baseType: !902, size: 32, align: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1190, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1167, file: !35, line: 1480, baseType: !902, size: 32, align: 32, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1167, file: !35, line: 1486, baseType: !1159, size: 64, align: 64, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1167, file: !35, line: 1488, baseType: !1159, size: 64, align: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1167, file: !35, line: 1497, baseType: !1159, size: 64, align: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1233, !1235, !1236, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1269, !1270, !1271, !1272, !1273, !1274, !1277, !1278, !1279, !1280}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !758, line: 282, baseType: !1142, size: 512, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1202, file: !758, line: 299, baseType: !1146, size: 256, align: 32, offset: 512)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1202, file: !758, line: 315, baseType: !1207, size: 64, align: 64, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1202, file: !758, line: 326, baseType: !902, size: 32, align: 32, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1202, file: !758, line: 326, baseType: !902, size: 32, align: 32, offset: 864)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1202, file: !758, line: 334, baseType: !902, size: 32, align: 32, offset: 896)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1202, file: !758, line: 341, baseType: !902, size: 32, align: 32, offset: 928)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1202, file: !758, line: 346, baseType: !902, size: 32, align: 32, offset: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1202, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1202, file: !758, line: 356, baseType: !1049, size: 64, align: 32, offset: 1024)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1202, file: !758, line: 361, baseType: !1159, size: 64, align: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1202, file: !758, line: 369, baseType: !1159, size: 64, align: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1202, file: !758, line: 377, baseType: !1159, size: 64, align: 64, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1202, file: !758, line: 382, baseType: !902, size: 32, align: 32, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1202, file: !758, line: 386, baseType: !902, size: 32, align: 32, offset: 1312)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1202, file: !758, line: 391, baseType: !902, size: 32, align: 32, offset: 1344)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1202, file: !758, line: 396, baseType: !1003, size: 64, align: 64, offset: 1408)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1202, file: !758, line: 403, baseType: !1223, size: 512, align: 64, offset: 1472)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 512, align: 64, elements: !1143)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1202, file: !758, line: 410, baseType: !902, size: 32, align: 32, offset: 1984)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1202, file: !758, line: 415, baseType: !902, size: 32, align: 32, offset: 2016)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1202, file: !758, line: 420, baseType: !902, size: 32, align: 32, offset: 2048)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1202, file: !758, line: 425, baseType: !902, size: 32, align: 32, offset: 2080)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1202, file: !758, line: 435, baseType: !1159, size: 64, align: 64, offset: 2112)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1202, file: !758, line: 440, baseType: !902, size: 32, align: 32, offset: 2176)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1202, file: !758, line: 445, baseType: !1067, size: 64, align: 64, offset: 2240)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1202, file: !758, line: 459, baseType: !1232, size: 512, align: 64, offset: 2304)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 512, align: 64, elements: !1143)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1202, file: !758, line: 473, baseType: !1234, size: 64, align: 64, offset: 2816)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1202, file: !758, line: 477, baseType: !902, size: 32, align: 32, offset: 2880)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1202, file: !758, line: 479, baseType: !1237, size: 64, align: 64, offset: 2944)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1250}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !758, line: 203, baseType: !1113, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !758, line: 204, baseType: !902, size: 32, align: 32, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1240, file: !758, line: 205, baseType: !1246, size: 64, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1248, line: 86, baseType: !1249)
!1248 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1248, line: 86, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1240, file: !758, line: 206, baseType: !1170, size: 64, align: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1202, file: !758, line: 480, baseType: !902, size: 32, align: 32, offset: 3008)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1202, file: !758, line: 505, baseType: !902, size: 32, align: 32, offset: 3040)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1202, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1202, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1202, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1202, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1202, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1202, file: !758, line: 532, baseType: !1159, size: 64, align: 64, offset: 3264)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1202, file: !758, line: 539, baseType: !1159, size: 64, align: 64, offset: 3328)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1202, file: !758, line: 547, baseType: !1159, size: 64, align: 64, offset: 3392)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1202, file: !758, line: 554, baseType: !1246, size: 64, align: 64, offset: 3456)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1202, file: !758, line: 563, baseType: !902, size: 32, align: 32, offset: 3520)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1202, file: !758, line: 572, baseType: !902, size: 32, align: 32, offset: 3552)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1202, file: !758, line: 581, baseType: !902, size: 32, align: 32, offset: 3584)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1202, file: !758, line: 588, baseType: !1266, size: 64, align: 64, offset: 3648)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !958, line: 36, baseType: !1268)
!1268 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1202, file: !758, line: 593, baseType: !902, size: 32, align: 32, offset: 3712)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1202, file: !758, line: 596, baseType: !902, size: 32, align: 32, offset: 3744)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1202, file: !758, line: 599, baseType: !1170, size: 64, align: 64, offset: 3776)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1202, file: !758, line: 605, baseType: !1170, size: 64, align: 64, offset: 3840)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1202, file: !758, line: 616, baseType: !1170, size: 64, align: 64, offset: 3904)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1202, file: !758, line: 626, baseType: !1275, size: 64, align: 64, offset: 3968)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1276, line: 216, baseType: !1068)
!1276 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1202, file: !758, line: 627, baseType: !1275, size: 64, align: 64, offset: 4032)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1202, file: !758, line: 628, baseType: !1275, size: 64, align: 64, offset: 4096)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1202, file: !758, line: 629, baseType: !1275, size: 64, align: 64, offset: 4160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1202, file: !758, line: 645, baseType: !1170, size: 64, align: 64, offset: 4224)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1039, file: !35, line: 3566, baseType: !1283, size: 64, align: 64, offset: 1408)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!902, !988, !1003, !1281, !1165}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1039, file: !35, line: 3567, baseType: !1084, size: 64, align: 64, offset: 1472)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1039, file: !35, line: 3576, baseType: !1288, size: 64, align: 64, offset: 1536)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!902, !988, !1199}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1039, file: !35, line: 3577, baseType: !1292, size: 64, align: 64, offset: 1600)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!902, !988, !1165}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1039, file: !35, line: 3584, baseType: !1296, size: 64, align: 64, offset: 1664)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!902, !988, !1299}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1039, file: !35, line: 3589, baseType: !1301, size: 64, align: 64, offset: 1728)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{null, !988}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1039, file: !35, line: 3594, baseType: !902, size: 32, align: 32, offset: 1792)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1039, file: !35, line: 3600, baseType: !976, size: 64, align: 64, offset: 1856)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1039, file: !35, line: 3609, baseType: !1307, size: 64, align: 64, offset: 1920)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !990, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !990, file: !35, line: 1581, baseType: !1123, size: 32, align: 32, offset: 224)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !990, file: !35, line: 1583, baseType: !1003, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !990, file: !35, line: 1591, baseType: !1315, size: 64, align: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1098, line: 129, size: 1664, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1340, !1341, !1347, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1316, file: !1098, line: 136, baseType: !902, size: 32, align: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1316, file: !1098, line: 151, baseType: !902, size: 32, align: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1316, file: !1098, line: 157, baseType: !902, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1316, file: !1098, line: 159, baseType: !1299, size: 64, align: 64, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1316, file: !1098, line: 161, baseType: !1323, size: 64, align: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1098, line: 117, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1098, line: 100, size: 832, align: 64, elements: !1326)
!1326 = !{!1327, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1325, file: !1098, line: 105, baseType: !1328, size: 256, align: 64)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1329, size: 256, align: 64, elements: !1149)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1172, line: 238, baseType: !1331)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1172, line: 238, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1325, file: !1098, line: 110, baseType: !902, size: 32, align: 32, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1325, file: !1098, line: 111, baseType: !902, size: 32, align: 32, offset: 288)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1325, file: !1098, line: 111, baseType: !902, size: 32, align: 32, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1325, file: !1098, line: 112, baseType: !1146, size: 256, align: 32, offset: 352)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1325, file: !1098, line: 113, baseType: !1152, size: 128, align: 32, offset: 608)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1325, file: !1098, line: 114, baseType: !902, size: 32, align: 32, offset: 736)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1325, file: !1098, line: 115, baseType: !902, size: 32, align: 32, offset: 768)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1325, file: !1098, line: 116, baseType: !902, size: 32, align: 32, offset: 800)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1316, file: !1098, line: 163, baseType: !1003, size: 64, align: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1316, file: !1098, line: 165, baseType: !1342, size: 128, align: 64, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1098, line: 122, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1098, line: 119, size: 128, align: 64, elements: !1344)
!1344 = !{!1345, !1346}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1343, file: !1098, line: 120, baseType: !1165, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1343, file: !1098, line: 121, baseType: !1299, size: 64, align: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1316, file: !1098, line: 166, baseType: !1348, size: 128, align: 64, offset: 448)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1098, line: 127, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1098, line: 124, size: 128, align: 64, elements: !1350)
!1350 = !{!1351, !1424}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1349, file: !1098, line: 125, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1356)
!1356 = !{!1357, !1358, !1382, !1386, !1387, !1421, !1422, !1423}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1355, file: !35, line: 5751, baseType: !993, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1355, file: !35, line: 5756, baseType: !1359, size: 64, align: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1367, !1368, !1369, !1373, !1377, !1381}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1361, file: !35, line: 5797, baseType: !976, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1361, file: !35, line: 5804, baseType: !1365, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1361, file: !35, line: 5815, baseType: !993, size: 64, align: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1361, file: !35, line: 5825, baseType: !902, size: 32, align: 32, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1361, file: !35, line: 5826, baseType: !1370, size: 64, align: 64, offset: 256)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!902, !1353}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1361, file: !35, line: 5827, baseType: !1374, size: 64, align: 64, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!902, !1353, !1165}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1361, file: !35, line: 5828, baseType: !1378, size: 64, align: 64, offset: 384)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1353}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1361, file: !35, line: 5829, baseType: !1378, size: 64, align: 64, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1355, file: !35, line: 5762, baseType: !1383, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1385)
!1385 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1355, file: !35, line: 5768, baseType: !1003, size: 64, align: 64, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1355, file: !35, line: 5775, baseType: !1388, size: 64, align: 64, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1390, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1390, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1390, file: !35, line: 3948, baseType: !1122, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1390, file: !35, line: 3958, baseType: !1113, size: 64, align: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1390, file: !35, line: 3962, baseType: !902, size: 32, align: 32, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1390, file: !35, line: 3968, baseType: !902, size: 32, align: 32, offset: 224)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1390, file: !35, line: 3973, baseType: !1159, size: 64, align: 64, offset: 256)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1390, file: !35, line: 3986, baseType: !902, size: 32, align: 32, offset: 320)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1390, file: !35, line: 3999, baseType: !902, size: 32, align: 32, offset: 352)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1390, file: !35, line: 4004, baseType: !902, size: 32, align: 32, offset: 384)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1390, file: !35, line: 4005, baseType: !902, size: 32, align: 32, offset: 416)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1390, file: !35, line: 4010, baseType: !902, size: 32, align: 32, offset: 448)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1390, file: !35, line: 4011, baseType: !902, size: 32, align: 32, offset: 480)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1390, file: !35, line: 4020, baseType: !1049, size: 64, align: 32, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1390, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1390, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1390, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1390, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1390, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1390, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1390, file: !35, line: 4039, baseType: !902, size: 32, align: 32, offset: 768)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1390, file: !35, line: 4046, baseType: !1067, size: 64, align: 64, offset: 832)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1390, file: !35, line: 4050, baseType: !902, size: 32, align: 32, offset: 896)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1390, file: !35, line: 4054, baseType: !902, size: 32, align: 32, offset: 928)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1390, file: !35, line: 4061, baseType: !902, size: 32, align: 32, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1390, file: !35, line: 4065, baseType: !902, size: 32, align: 32, offset: 992)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1390, file: !35, line: 4073, baseType: !902, size: 32, align: 32, offset: 1024)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1390, file: !35, line: 4080, baseType: !902, size: 32, align: 32, offset: 1056)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1390, file: !35, line: 4084, baseType: !902, size: 32, align: 32, offset: 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1355, file: !35, line: 5781, baseType: !1388, size: 64, align: 64, offset: 320)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1355, file: !35, line: 5787, baseType: !1049, size: 64, align: 32, offset: 384)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1355, file: !35, line: 5793, baseType: !1049, size: 64, align: 32, offset: 448)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1349, file: !1098, line: 126, baseType: !902, size: 32, align: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1316, file: !1098, line: 172, baseType: !1165, size: 64, align: 64, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1316, file: !1098, line: 177, baseType: !1113, size: 64, align: 64, offset: 640)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1316, file: !1098, line: 178, baseType: !1123, size: 32, align: 32, offset: 704)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1316, file: !1098, line: 180, baseType: !1003, size: 64, align: 64, offset: 768)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1316, file: !1098, line: 185, baseType: !902, size: 32, align: 32, offset: 832)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1316, file: !1098, line: 190, baseType: !1003, size: 64, align: 64, offset: 896)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1316, file: !1098, line: 195, baseType: !902, size: 32, align: 32, offset: 960)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1316, file: !1098, line: 200, baseType: !1165, size: 64, align: 64, offset: 1024)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1316, file: !1098, line: 201, baseType: !902, size: 32, align: 32, offset: 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1316, file: !1098, line: 202, baseType: !1299, size: 64, align: 64, offset: 1152)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1316, file: !1098, line: 203, baseType: !902, size: 32, align: 32, offset: 1216)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1316, file: !1098, line: 205, baseType: !902, size: 32, align: 32, offset: 1248)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1316, file: !1098, line: 206, baseType: !902, size: 32, align: 32, offset: 1280)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1316, file: !1098, line: 209, baseType: !1275, size: 64, align: 64, offset: 1344)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1316, file: !1098, line: 212, baseType: !1275, size: 64, align: 64, offset: 1408)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1316, file: !1098, line: 213, baseType: !1299, size: 64, align: 64, offset: 1472)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1316, file: !1098, line: 215, baseType: !902, size: 32, align: 32, offset: 1536)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1316, file: !1098, line: 217, baseType: !902, size: 32, align: 32, offset: 1568)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1316, file: !1098, line: 220, baseType: !902, size: 32, align: 32, offset: 1600)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !990, file: !35, line: 1598, baseType: !1003, size: 64, align: 64, offset: 384)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !990, file: !35, line: 1606, baseType: !1159, size: 64, align: 64, offset: 448)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !990, file: !35, line: 1614, baseType: !902, size: 32, align: 32, offset: 512)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !990, file: !35, line: 1622, baseType: !902, size: 32, align: 32, offset: 544)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !990, file: !35, line: 1628, baseType: !902, size: 32, align: 32, offset: 576)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !990, file: !35, line: 1636, baseType: !902, size: 32, align: 32, offset: 608)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !990, file: !35, line: 1643, baseType: !902, size: 32, align: 32, offset: 640)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !990, file: !35, line: 1657, baseType: !1113, size: 64, align: 64, offset: 704)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !990, file: !35, line: 1658, baseType: !902, size: 32, align: 32, offset: 768)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !990, file: !35, line: 1679, baseType: !1049, size: 64, align: 32, offset: 800)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !990, file: !35, line: 1688, baseType: !902, size: 32, align: 32, offset: 864)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !990, file: !35, line: 1712, baseType: !902, size: 32, align: 32, offset: 896)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !990, file: !35, line: 1729, baseType: !902, size: 32, align: 32, offset: 928)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !990, file: !35, line: 1729, baseType: !902, size: 32, align: 32, offset: 960)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !990, file: !35, line: 1744, baseType: !902, size: 32, align: 32, offset: 992)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !990, file: !35, line: 1744, baseType: !902, size: 32, align: 32, offset: 1024)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !990, file: !35, line: 1751, baseType: !902, size: 32, align: 32, offset: 1056)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !990, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !990, file: !35, line: 1791, baseType: !1463, size: 64, align: 64, offset: 1152)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{null, !1466, !1199, !1281, !902, !902, !902}
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !990, file: !35, line: 1808, baseType: !1468, size: 64, align: 64, offset: 1216)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!494, !1466, !1056}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !990, file: !35, line: 1816, baseType: !902, size: 32, align: 32, offset: 1280)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !990, file: !35, line: 1825, baseType: !901, size: 32, align: 32, offset: 1312)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !990, file: !35, line: 1830, baseType: !902, size: 32, align: 32, offset: 1344)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !990, file: !35, line: 1838, baseType: !901, size: 32, align: 32, offset: 1376)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !990, file: !35, line: 1846, baseType: !902, size: 32, align: 32, offset: 1408)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !990, file: !35, line: 1851, baseType: !902, size: 32, align: 32, offset: 1440)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !990, file: !35, line: 1861, baseType: !901, size: 32, align: 32, offset: 1472)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !990, file: !35, line: 1868, baseType: !901, size: 32, align: 32, offset: 1504)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !990, file: !35, line: 1875, baseType: !901, size: 32, align: 32, offset: 1536)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !990, file: !35, line: 1882, baseType: !901, size: 32, align: 32, offset: 1568)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !990, file: !35, line: 1889, baseType: !901, size: 32, align: 32, offset: 1600)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !990, file: !35, line: 1896, baseType: !901, size: 32, align: 32, offset: 1632)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !990, file: !35, line: 1903, baseType: !901, size: 32, align: 32, offset: 1664)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !990, file: !35, line: 1910, baseType: !902, size: 32, align: 32, offset: 1696)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !990, file: !35, line: 1915, baseType: !902, size: 32, align: 32, offset: 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !990, file: !35, line: 1926, baseType: !1281, size: 64, align: 64, offset: 1792)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !990, file: !35, line: 1935, baseType: !1049, size: 64, align: 32, offset: 1856)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !990, file: !35, line: 1942, baseType: !902, size: 32, align: 32, offset: 1920)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !990, file: !35, line: 1948, baseType: !902, size: 32, align: 32, offset: 1952)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !990, file: !35, line: 1954, baseType: !902, size: 32, align: 32, offset: 1984)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !990, file: !35, line: 1960, baseType: !902, size: 32, align: 32, offset: 2016)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !990, file: !35, line: 1984, baseType: !902, size: 32, align: 32, offset: 2048)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !990, file: !35, line: 1991, baseType: !902, size: 32, align: 32, offset: 2080)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !990, file: !35, line: 1996, baseType: !902, size: 32, align: 32, offset: 2112)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !990, file: !35, line: 2004, baseType: !902, size: 32, align: 32, offset: 2144)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !990, file: !35, line: 2011, baseType: !902, size: 32, align: 32, offset: 2176)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !990, file: !35, line: 2018, baseType: !902, size: 32, align: 32, offset: 2208)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !990, file: !35, line: 2027, baseType: !902, size: 32, align: 32, offset: 2240)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !990, file: !35, line: 2034, baseType: !902, size: 32, align: 32, offset: 2272)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !990, file: !35, line: 2044, baseType: !902, size: 32, align: 32, offset: 2304)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !990, file: !35, line: 2054, baseType: !1502, size: 64, align: 64, offset: 2368)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !990, file: !35, line: 2061, baseType: !1502, size: 64, align: 64, offset: 2432)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !990, file: !35, line: 2066, baseType: !902, size: 32, align: 32, offset: 2496)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !990, file: !35, line: 2070, baseType: !902, size: 32, align: 32, offset: 2528)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !990, file: !35, line: 2078, baseType: !902, size: 32, align: 32, offset: 2560)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !990, file: !35, line: 2085, baseType: !902, size: 32, align: 32, offset: 2592)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !990, file: !35, line: 2092, baseType: !902, size: 32, align: 32, offset: 2624)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !990, file: !35, line: 2099, baseType: !902, size: 32, align: 32, offset: 2656)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !990, file: !35, line: 2106, baseType: !902, size: 32, align: 32, offset: 2688)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !990, file: !35, line: 2113, baseType: !902, size: 32, align: 32, offset: 2720)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !990, file: !35, line: 2120, baseType: !902, size: 32, align: 32, offset: 2752)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !990, file: !35, line: 2125, baseType: !902, size: 32, align: 32, offset: 2784)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !990, file: !35, line: 2133, baseType: !902, size: 32, align: 32, offset: 2816)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !990, file: !35, line: 2140, baseType: !902, size: 32, align: 32, offset: 2848)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !990, file: !35, line: 2145, baseType: !902, size: 32, align: 32, offset: 2880)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !990, file: !35, line: 2153, baseType: !902, size: 32, align: 32, offset: 2912)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !990, file: !35, line: 2158, baseType: !902, size: 32, align: 32, offset: 2944)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !990, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !990, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !990, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !990, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !990, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !990, file: !35, line: 2203, baseType: !902, size: 32, align: 32, offset: 3136)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !990, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !990, file: !35, line: 2212, baseType: !902, size: 32, align: 32, offset: 3200)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !990, file: !35, line: 2213, baseType: !902, size: 32, align: 32, offset: 3232)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !990, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !990, file: !35, line: 2232, baseType: !902, size: 32, align: 32, offset: 3296)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !990, file: !35, line: 2243, baseType: !902, size: 32, align: 32, offset: 3328)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !990, file: !35, line: 2249, baseType: !902, size: 32, align: 32, offset: 3360)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !990, file: !35, line: 2256, baseType: !902, size: 32, align: 32, offset: 3392)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !990, file: !35, line: 2263, baseType: !1067, size: 64, align: 64, offset: 3456)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !990, file: !35, line: 2270, baseType: !1067, size: 64, align: 64, offset: 3520)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !990, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !990, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !990, file: !35, line: 2367, baseType: !1538, size: 64, align: 64, offset: 3648)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!902, !1466, !1299, !902}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !990, file: !35, line: 2383, baseType: !902, size: 32, align: 32, offset: 3712)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !990, file: !35, line: 2386, baseType: !901, size: 32, align: 32, offset: 3744)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !990, file: !35, line: 2387, baseType: !901, size: 32, align: 32, offset: 3776)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !990, file: !35, line: 2394, baseType: !902, size: 32, align: 32, offset: 3808)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !990, file: !35, line: 2401, baseType: !902, size: 32, align: 32, offset: 3840)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !990, file: !35, line: 2408, baseType: !902, size: 32, align: 32, offset: 3872)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !990, file: !35, line: 2415, baseType: !902, size: 32, align: 32, offset: 3904)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !990, file: !35, line: 2422, baseType: !902, size: 32, align: 32, offset: 3936)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !990, file: !35, line: 2423, baseType: !1550, size: 64, align: 64, offset: 3968)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1552)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1552, file: !35, line: 827, baseType: !902, size: 32, align: 32)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1552, file: !35, line: 828, baseType: !902, size: 32, align: 32, offset: 32)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1552, file: !35, line: 829, baseType: !902, size: 32, align: 32, offset: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1552, file: !35, line: 830, baseType: !901, size: 32, align: 32, offset: 96)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !990, file: !35, line: 2430, baseType: !1159, size: 64, align: 64, offset: 4032)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !990, file: !35, line: 2437, baseType: !1159, size: 64, align: 64, offset: 4096)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !990, file: !35, line: 2444, baseType: !901, size: 32, align: 32, offset: 4160)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !990, file: !35, line: 2451, baseType: !901, size: 32, align: 32, offset: 4192)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !990, file: !35, line: 2458, baseType: !902, size: 32, align: 32, offset: 4224)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !990, file: !35, line: 2469, baseType: !902, size: 32, align: 32, offset: 4256)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !990, file: !35, line: 2475, baseType: !902, size: 32, align: 32, offset: 4288)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !990, file: !35, line: 2481, baseType: !902, size: 32, align: 32, offset: 4320)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !990, file: !35, line: 2485, baseType: !902, size: 32, align: 32, offset: 4352)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !990, file: !35, line: 2489, baseType: !902, size: 32, align: 32, offset: 4384)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !990, file: !35, line: 2493, baseType: !902, size: 32, align: 32, offset: 4416)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !990, file: !35, line: 2501, baseType: !902, size: 32, align: 32, offset: 4448)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !990, file: !35, line: 2506, baseType: !902, size: 32, align: 32, offset: 4480)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !990, file: !35, line: 2510, baseType: !902, size: 32, align: 32, offset: 4512)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !990, file: !35, line: 2514, baseType: !1159, size: 64, align: 64, offset: 4544)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !990, file: !35, line: 2528, baseType: !1574, size: 64, align: 64, offset: 4608)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{null, !1466, !1003, !902, !902}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !990, file: !35, line: 2534, baseType: !902, size: 32, align: 32, offset: 4672)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !990, file: !35, line: 2545, baseType: !902, size: 32, align: 32, offset: 4704)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !990, file: !35, line: 2547, baseType: !902, size: 32, align: 32, offset: 4736)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !990, file: !35, line: 2549, baseType: !902, size: 32, align: 32, offset: 4768)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !990, file: !35, line: 2551, baseType: !902, size: 32, align: 32, offset: 4800)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !990, file: !35, line: 2553, baseType: !902, size: 32, align: 32, offset: 4832)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !990, file: !35, line: 2555, baseType: !902, size: 32, align: 32, offset: 4864)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !990, file: !35, line: 2557, baseType: !902, size: 32, align: 32, offset: 4896)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !990, file: !35, line: 2559, baseType: !902, size: 32, align: 32, offset: 4928)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !990, file: !35, line: 2563, baseType: !902, size: 32, align: 32, offset: 4960)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !990, file: !35, line: 2571, baseType: !1155, size: 64, align: 64, offset: 4992)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !990, file: !35, line: 2579, baseType: !1155, size: 64, align: 64, offset: 5056)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !990, file: !35, line: 2586, baseType: !902, size: 32, align: 32, offset: 5120)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !990, file: !35, line: 2615, baseType: !902, size: 32, align: 32, offset: 5152)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !990, file: !35, line: 2627, baseType: !902, size: 32, align: 32, offset: 5184)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !990, file: !35, line: 2637, baseType: !902, size: 32, align: 32, offset: 5216)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !990, file: !35, line: 2681, baseType: !902, size: 32, align: 32, offset: 5248)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !990, file: !35, line: 2709, baseType: !1159, size: 64, align: 64, offset: 5312)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !990, file: !35, line: 2716, baseType: !1596, size: 64, align: 64, offset: 5376)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1606, !1610, !1614, !1615, !1616, !1617, !1623, !1624, !1625, !1626, !1627}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1598, file: !35, line: 3642, baseType: !976, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1598, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1598, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1598, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1598, file: !35, line: 3669, baseType: !902, size: 32, align: 32, offset: 160)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1598, file: !35, line: 3682, baseType: !1296, size: 64, align: 64, offset: 192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1598, file: !35, line: 3698, baseType: !1607, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!902, !988, !1101, !1122}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1598, file: !35, line: 3712, baseType: !1611, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!902, !988, !902, !1101, !1122}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1598, file: !35, line: 3726, baseType: !1607, size: 64, align: 64, offset: 384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1598, file: !35, line: 3737, baseType: !1084, size: 64, align: 64, offset: 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1598, file: !35, line: 3746, baseType: !902, size: 32, align: 32, offset: 512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1598, file: !35, line: 3757, baseType: !1618, size: 64, align: 64, offset: 576)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{null, !1621}
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1598, file: !35, line: 3766, baseType: !1084, size: 64, align: 64, offset: 640)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1598, file: !35, line: 3774, baseType: !1084, size: 64, align: 64, offset: 704)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1598, file: !35, line: 3780, baseType: !902, size: 32, align: 32, offset: 768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1598, file: !35, line: 3785, baseType: !902, size: 32, align: 32, offset: 800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1598, file: !35, line: 3795, baseType: !1628, size: 64, align: 64, offset: 832)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!902, !988, !1170}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !990, file: !35, line: 2728, baseType: !1003, size: 64, align: 64, offset: 5440)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !990, file: !35, line: 2735, baseType: !1223, size: 512, align: 64, offset: 5504)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !990, file: !35, line: 2742, baseType: !902, size: 32, align: 32, offset: 6016)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !990, file: !35, line: 2755, baseType: !902, size: 32, align: 32, offset: 6048)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !990, file: !35, line: 2776, baseType: !902, size: 32, align: 32, offset: 6080)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !990, file: !35, line: 2783, baseType: !902, size: 32, align: 32, offset: 6112)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !990, file: !35, line: 2791, baseType: !902, size: 32, align: 32, offset: 6144)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !990, file: !35, line: 2802, baseType: !1299, size: 64, align: 64, offset: 6208)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !990, file: !35, line: 2811, baseType: !902, size: 32, align: 32, offset: 6272)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !990, file: !35, line: 2821, baseType: !902, size: 32, align: 32, offset: 6304)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !990, file: !35, line: 2830, baseType: !902, size: 32, align: 32, offset: 6336)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !990, file: !35, line: 2840, baseType: !902, size: 32, align: 32, offset: 6368)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !990, file: !35, line: 2851, baseType: !1644, size: 64, align: 64, offset: 6400)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!902, !1466, !1647, !1003, !1281, !902, !902}
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!902, !1466, !1003}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !990, file: !35, line: 2871, baseType: !1651, size: 64, align: 64, offset: 6464)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!902, !1466, !1654, !1003, !1281, !902}
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{!902, !1466, !1003, !902, !902}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !990, file: !35, line: 2878, baseType: !902, size: 32, align: 32, offset: 6528)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !990, file: !35, line: 2885, baseType: !902, size: 32, align: 32, offset: 6560)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !990, file: !35, line: 3005, baseType: !902, size: 32, align: 32, offset: 6592)
