; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flacenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--flacenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CodingMode", file: !910, line: 50, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/flacenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913}
!912 = !DIEnumerator(name: "CODING_MODE_RICE", value: 4)
!913 = !DIEnumerator(name: "CODING_MODE_RICE2", value: 5)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFLPCType", file: !915, line: 43, size: 32, align: 32, elements: !916)
!915 = !DIFile(filename: "libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!916 = !{!917, !918, !919, !920, !921, !922}
!917 = !DIEnumerator(name: "FF_LPC_TYPE_DEFAULT", value: -1)
!918 = !DIEnumerator(name: "FF_LPC_TYPE_NONE", value: 0)
!919 = !DIEnumerator(name: "FF_LPC_TYPE_FIXED", value: 1)
!920 = !DIEnumerator(name: "FF_LPC_TYPE_LEVINSON", value: 2)
!921 = !DIEnumerator(name: "FF_LPC_TYPE_CHOLESKY", value: 3)
!922 = !DIEnumerator(name: "FF_LPC_TYPE_NB", value: 4)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !924, line: 40, size: 32, align: 32, elements: !925)
!924 = !DIFile(filename: "libavcodec/flac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!925 = !{!926, !927, !928, !929}
!926 = !DIEnumerator(name: "FLAC_CHMODE_INDEPENDENT", value: 0)
!927 = !DIEnumerator(name: "FLAC_CHMODE_LEFT_SIDE", value: 1)
!928 = !DIEnumerator(name: "FLAC_CHMODE_RIGHT_SIDE", value: 2)
!929 = !DIEnumerator(name: "FLAC_CHMODE_MID_SIDE", value: 3)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 49, size: 32, align: 32, elements: !932)
!931 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941}
!933 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!934 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!935 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!936 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!937 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!938 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!939 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!940 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!941 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!942 = !{!943, !944, !952, !954, !951, !955, !959, !960}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !946, line: 221, size: 32, align: 8, elements: !947)
!946 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !945, file: !946, line: 221, baseType: !949, size: 32, align: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !950, line: 51, baseType: !951)
!950 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!951 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !953, line: 196, baseType: !954)
!953 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!954 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !950, line: 48, baseType: !958)
!958 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !953, line: 197, baseType: !961)
!961 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!962 = !{!963, !1717, !1718}
!963 = distinct !DIGlobalVariable(name: "ff_flac_encoder", scope: !0, file: !910, line: 1502, type: !964, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_flac_encoder)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !966)
!966 = !{!967, !971, !972, !973, !974, !975, !984, !987, !990, !993, !998, !999, !1072, !1080, !1081, !1082, !1084, !1632, !1638, !1646, !1650, !1651, !1688, !1692, !1696, !1697, !1701, !1705, !1706, !1710, !1711, !1712}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !965, file: !14, line: 3475, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !965, file: !14, line: 3480, baseType: !968, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !965, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !965, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !965, file: !14, line: 3487, baseType: !954, size: 32, align: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !965, file: !14, line: 3488, baseType: !976, size: 64, align: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !979, line: 61, baseType: !980)
!979 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !979, line: 58, size: 64, align: 32, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !980, file: !979, line: 59, baseType: !954, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !980, file: !979, line: 60, baseType: !954, size: 32, align: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !965, file: !14, line: 3489, baseType: !985, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !965, file: !14, line: 3490, baseType: !988, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !965, file: !14, line: 3491, baseType: !991, size: 64, align: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !965, file: !14, line: 3492, baseType: !994, size: 64, align: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !950, line: 55, baseType: !997)
!997 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !965, file: !14, line: 3493, baseType: !957, size: 8, align: 8, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !965, file: !14, line: 3494, baseType: !1000, size: 64, align: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1010, !1031, !1032, !1033, !1034, !1038, !1044, !1046, !1050}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1003, file: !713, line: 72, baseType: !968, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1003, file: !713, line: 78, baseType: !1007, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!968, !943}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1003, file: !713, line: 85, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1027, !1028, !1029, !1030}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !691, line: 247, baseType: !968, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1013, file: !691, line: 253, baseType: !968, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1013, file: !691, line: 259, baseType: !954, size: 32, align: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1013, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1013, file: !691, line: 271, baseType: !1020, size: 64, align: 64, offset: 192)
!1020 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1013, file: !691, line: 265, size: 64, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1025, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1020, file: !691, line: 266, baseType: !960, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1020, file: !691, line: 267, baseType: !1024, size: 64, align: 64)
!1024 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1020, file: !691, line: 268, baseType: !968, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1020, file: !691, line: 270, baseType: !978, size: 64, align: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1013, file: !691, line: 272, baseType: !1024, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1013, file: !691, line: 273, baseType: !1024, size: 64, align: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1013, file: !691, line: 275, baseType: !954, size: 32, align: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1013, file: !691, line: 300, baseType: !968, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1003, file: !713, line: 93, baseType: !954, size: 32, align: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1003, file: !713, line: 99, baseType: !954, size: 32, align: 32, offset: 224)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1003, file: !713, line: 108, baseType: !954, size: 32, align: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1003, file: !713, line: 113, baseType: !1035, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!943, !943, !943}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1003, file: !713, line: 123, baseType: !1039, size: 64, align: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1003, file: !713, line: 130, baseType: !1045, size: 32, align: 32, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1003, file: !713, line: 136, baseType: !1047, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1045, !943}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1003, file: !713, line: 142, baseType: !1051, size: 64, align: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!954, !1054, !943, !968, !954}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1057)
!1057 = !{!1058, !1070, !1071}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1056, file: !691, line: 360, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1062, file: !691, line: 307, baseType: !968, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1062, file: !691, line: 313, baseType: !1024, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1062, file: !691, line: 313, baseType: !1024, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1062, file: !691, line: 318, baseType: !1024, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1062, file: !691, line: 318, baseType: !1024, size: 64, align: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1062, file: !691, line: 323, baseType: !954, size: 32, align: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1056, file: !691, line: 364, baseType: !954, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1056, file: !691, line: 368, baseType: !954, size: 32, align: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !965, file: !14, line: 3495, baseType: !1073, size: 64, align: 64, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1076, file: !14, line: 3402, baseType: !954, size: 32, align: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1076, file: !14, line: 3403, baseType: !968, size: 64, align: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !965, file: !14, line: 3507, baseType: !968, size: 64, align: 64, offset: 768)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !965, file: !14, line: 3516, baseType: !954, size: 32, align: 32, offset: 832)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !965, file: !14, line: 3517, baseType: !1083, size: 64, align: 64, offset: 896)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !965, file: !14, line: 3527, baseType: !1085, size: 64, align: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!954, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1098, !1099, !1100, !1101, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1380, !1384, !1385, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1570, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1090, file: !14, line: 1561, baseType: !1000, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1090, file: !14, line: 1562, baseType: !954, size: 32, align: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1090, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1090, file: !14, line: 1565, baseType: !1096, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1090, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1090, file: !14, line: 1581, baseType: !951, size: 32, align: 32, offset: 224)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1090, file: !14, line: 1583, baseType: !943, size: 64, align: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1090, file: !14, line: 1591, baseType: !1102, size: 64, align: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1104, line: 129, size: 1664, align: 64, elements: !1105)
!1104 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1105 = !{!1106, !1107, !1108, !1109, !1206, !1227, !1228, !1257, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1103, file: !1104, line: 136, baseType: !954, size: 32, align: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1103, file: !1104, line: 151, baseType: !954, size: 32, align: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1103, file: !1104, line: 157, baseType: !954, size: 32, align: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1103, file: !1104, line: 159, baseType: !1110, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1113)
!1113 = !{!1114, !1118, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1158, !1160, !1161, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1194, !1195, !1196, !1197, !1198, !1199, !1202, !1203, !1204, !1205}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !744, line: 282, baseType: !1115, size: 512, align: 64)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 512, align: 64, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 8)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1112, file: !744, line: 299, baseType: !1119, size: 256, align: 32, offset: 512)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 256, align: 32, elements: !1116)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1112, file: !744, line: 315, baseType: !1121, size: 64, align: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1112, file: !744, line: 326, baseType: !954, size: 32, align: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1112, file: !744, line: 326, baseType: !954, size: 32, align: 32, offset: 864)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1112, file: !744, line: 334, baseType: !954, size: 32, align: 32, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1112, file: !744, line: 341, baseType: !954, size: 32, align: 32, offset: 928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1112, file: !744, line: 346, baseType: !954, size: 32, align: 32, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1112, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1112, file: !744, line: 356, baseType: !978, size: 64, align: 32, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1112, file: !744, line: 361, baseType: !960, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1112, file: !744, line: 369, baseType: !960, size: 64, align: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1112, file: !744, line: 377, baseType: !960, size: 64, align: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1112, file: !744, line: 382, baseType: !954, size: 32, align: 32, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1112, file: !744, line: 386, baseType: !954, size: 32, align: 32, offset: 1312)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1112, file: !744, line: 391, baseType: !954, size: 32, align: 32, offset: 1344)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1112, file: !744, line: 396, baseType: !943, size: 64, align: 64, offset: 1408)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1112, file: !744, line: 403, baseType: !1137, size: 512, align: 64, offset: 1472)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 512, align: 64, elements: !1116)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1112, file: !744, line: 410, baseType: !954, size: 32, align: 32, offset: 1984)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1112, file: !744, line: 415, baseType: !954, size: 32, align: 32, offset: 2016)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1112, file: !744, line: 420, baseType: !954, size: 32, align: 32, offset: 2048)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1112, file: !744, line: 425, baseType: !954, size: 32, align: 32, offset: 2080)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1112, file: !744, line: 435, baseType: !960, size: 64, align: 64, offset: 2112)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1112, file: !744, line: 440, baseType: !954, size: 32, align: 32, offset: 2176)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1112, file: !744, line: 445, baseType: !996, size: 64, align: 64, offset: 2240)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1112, file: !744, line: 459, baseType: !1146, size: 512, align: 64, offset: 2304)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 512, align: 64, elements: !1116)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1149, line: 94, baseType: !1150)
!1149 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1149, line: 81, size: 192, align: 64, elements: !1151)
!1151 = !{!1152, !1156, !1157}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1150, file: !1149, line: 82, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1149, line: 73, baseType: !1155)
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1149, line: 73, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1150, file: !1149, line: 89, baseType: !959, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1150, file: !1149, line: 93, baseType: !954, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1112, file: !744, line: 473, baseType: !1159, size: 64, align: 64, offset: 2816)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1112, file: !744, line: 477, baseType: !954, size: 32, align: 32, offset: 2880)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1112, file: !744, line: 479, baseType: !1162, size: 64, align: 64, offset: 2944)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1175}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1165, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1165, file: !744, line: 203, baseType: !959, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1165, file: !744, line: 204, baseType: !954, size: 32, align: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1165, file: !744, line: 205, baseType: !1171, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1173, line: 86, baseType: !1174)
!1173 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1173, line: 86, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1165, file: !744, line: 206, baseType: !1147, size: 64, align: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1112, file: !744, line: 480, baseType: !954, size: 32, align: 32, offset: 3008)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !744, line: 505, baseType: !954, size: 32, align: 32, offset: 3040)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1112, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1112, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1112, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1112, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1112, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1112, file: !744, line: 532, baseType: !960, size: 64, align: 64, offset: 3264)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1112, file: !744, line: 539, baseType: !960, size: 64, align: 64, offset: 3328)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1112, file: !744, line: 547, baseType: !960, size: 64, align: 64, offset: 3392)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1112, file: !744, line: 554, baseType: !1171, size: 64, align: 64, offset: 3456)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1112, file: !744, line: 563, baseType: !954, size: 32, align: 32, offset: 3520)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1112, file: !744, line: 572, baseType: !954, size: 32, align: 32, offset: 3552)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1112, file: !744, line: 581, baseType: !954, size: 32, align: 32, offset: 3584)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1112, file: !744, line: 588, baseType: !1191, size: 64, align: 64, offset: 3648)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !953, line: 194, baseType: !1193)
!1193 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1112, file: !744, line: 593, baseType: !954, size: 32, align: 32, offset: 3712)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1112, file: !744, line: 596, baseType: !954, size: 32, align: 32, offset: 3744)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1112, file: !744, line: 599, baseType: !1147, size: 64, align: 64, offset: 3776)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1112, file: !744, line: 605, baseType: !1147, size: 64, align: 64, offset: 3840)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1112, file: !744, line: 616, baseType: !1147, size: 64, align: 64, offset: 3904)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1112, file: !744, line: 626, baseType: !1200, size: 64, align: 64, offset: 3968)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1201, line: 216, baseType: !997)
!1201 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1112, file: !744, line: 627, baseType: !1200, size: 64, align: 64, offset: 4032)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1112, file: !744, line: 628, baseType: !1200, size: 64, align: 64, offset: 4096)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1112, file: !744, line: 629, baseType: !1200, size: 64, align: 64, offset: 4160)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1112, file: !744, line: 645, baseType: !1147, size: 64, align: 64, offset: 4224)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1103, file: !1104, line: 161, baseType: !1207, size: 64, align: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1104, line: 117, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1104, line: 100, size: 832, align: 64, elements: !1210)
!1210 = !{!1211, !1218, !1219, !1220, !1221, !1222, !1224, !1225, !1226}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1209, file: !1104, line: 105, baseType: !1212, size: 256, align: 64)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 256, align: 64, elements: !1216)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1149, line: 238, baseType: !1215)
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1149, line: 238, flags: DIFlagFwdDecl)
!1216 = !{!1217}
!1217 = !DISubrange(count: 4)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1209, file: !1104, line: 110, baseType: !954, size: 32, align: 32, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1209, file: !1104, line: 111, baseType: !954, size: 32, align: 32, offset: 288)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1209, file: !1104, line: 111, baseType: !954, size: 32, align: 32, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1209, file: !1104, line: 112, baseType: !1119, size: 256, align: 32, offset: 352)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1209, file: !1104, line: 113, baseType: !1223, size: 128, align: 32, offset: 608)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, align: 32, elements: !1216)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1209, file: !1104, line: 114, baseType: !954, size: 32, align: 32, offset: 736)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1209, file: !1104, line: 115, baseType: !954, size: 32, align: 32, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1209, file: !1104, line: 116, baseType: !954, size: 32, align: 32, offset: 800)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1103, file: !1104, line: 163, baseType: !943, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1103, file: !1104, line: 165, baseType: !1229, size: 128, align: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1104, line: 122, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1104, line: 119, size: 128, align: 64, elements: !1231)
!1231 = !{!1232, !1256}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1230, file: !1104, line: 120, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1252, !1253, !1254, !1255}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1235, file: !14, line: 1451, baseType: !1147, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1235, file: !14, line: 1461, baseType: !960, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1235, file: !14, line: 1467, baseType: !960, size: 64, align: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !14, line: 1468, baseType: !959, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !14, line: 1469, baseType: !954, size: 32, align: 32, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1235, file: !14, line: 1470, baseType: !954, size: 32, align: 32, offset: 288)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1235, file: !14, line: 1474, baseType: !954, size: 32, align: 32, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1235, file: !14, line: 1479, baseType: !1245, size: 64, align: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1248)
!1248 = !{!1249, !1250, !1251}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1247, file: !14, line: 1412, baseType: !959, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1247, file: !14, line: 1413, baseType: !954, size: 32, align: 32, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1247, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1235, file: !14, line: 1480, baseType: !954, size: 32, align: 32, offset: 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1235, file: !14, line: 1486, baseType: !960, size: 64, align: 64, offset: 512)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1235, file: !14, line: 1488, baseType: !960, size: 64, align: 64, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1235, file: !14, line: 1497, baseType: !960, size: 64, align: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1230, file: !1104, line: 121, baseType: !1110, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1103, file: !1104, line: 166, baseType: !1258, size: 128, align: 64, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1104, line: 127, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1104, line: 124, size: 128, align: 64, elements: !1260)
!1260 = !{!1261, !1334}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1259, file: !1104, line: 125, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1292, !1296, !1297, !1331, !1332, !1333}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1265, file: !14, line: 5751, baseType: !1000, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1265, file: !14, line: 5756, baseType: !1269, size: 64, align: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1277, !1278, !1279, !1283, !1287, !1291}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1271, file: !14, line: 5797, baseType: !968, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1271, file: !14, line: 5804, baseType: !1275, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1271, file: !14, line: 5815, baseType: !1000, size: 64, align: 64, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1271, file: !14, line: 5825, baseType: !954, size: 32, align: 32, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1271, file: !14, line: 5826, baseType: !1280, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!954, !1263}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1271, file: !14, line: 5827, baseType: !1284, size: 64, align: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!954, !1263, !1233}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1271, file: !14, line: 5828, baseType: !1288, size: 64, align: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !1263}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1271, file: !14, line: 5829, baseType: !1288, size: 64, align: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1265, file: !14, line: 5762, baseType: !1293, size: 64, align: 64, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1295)
!1295 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1265, file: !14, line: 5768, baseType: !943, size: 64, align: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1265, file: !14, line: 5775, baseType: !1298, size: 64, align: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1300, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1300, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1300, file: !14, line: 3948, baseType: !949, size: 32, align: 32, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1300, file: !14, line: 3958, baseType: !959, size: 64, align: 64, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1300, file: !14, line: 3962, baseType: !954, size: 32, align: 32, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1300, file: !14, line: 3968, baseType: !954, size: 32, align: 32, offset: 224)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1300, file: !14, line: 3973, baseType: !960, size: 64, align: 64, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1300, file: !14, line: 3986, baseType: !954, size: 32, align: 32, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1300, file: !14, line: 3999, baseType: !954, size: 32, align: 32, offset: 352)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1300, file: !14, line: 4004, baseType: !954, size: 32, align: 32, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1300, file: !14, line: 4005, baseType: !954, size: 32, align: 32, offset: 416)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1300, file: !14, line: 4010, baseType: !954, size: 32, align: 32, offset: 448)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1300, file: !14, line: 4011, baseType: !954, size: 32, align: 32, offset: 480)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1300, file: !14, line: 4020, baseType: !978, size: 64, align: 32, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1300, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1300, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1300, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1300, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1300, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1300, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1300, file: !14, line: 4039, baseType: !954, size: 32, align: 32, offset: 768)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1300, file: !14, line: 4046, baseType: !996, size: 64, align: 64, offset: 832)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1300, file: !14, line: 4050, baseType: !954, size: 32, align: 32, offset: 896)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1300, file: !14, line: 4054, baseType: !954, size: 32, align: 32, offset: 928)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1300, file: !14, line: 4061, baseType: !954, size: 32, align: 32, offset: 960)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1300, file: !14, line: 4065, baseType: !954, size: 32, align: 32, offset: 992)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1300, file: !14, line: 4073, baseType: !954, size: 32, align: 32, offset: 1024)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1300, file: !14, line: 4080, baseType: !954, size: 32, align: 32, offset: 1056)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1300, file: !14, line: 4084, baseType: !954, size: 32, align: 32, offset: 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1265, file: !14, line: 5781, baseType: !1298, size: 64, align: 64, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1265, file: !14, line: 5787, baseType: !978, size: 64, align: 32, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1265, file: !14, line: 5793, baseType: !978, size: 64, align: 32, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1259, file: !1104, line: 126, baseType: !954, size: 32, align: 32, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1103, file: !1104, line: 172, baseType: !1233, size: 64, align: 64, offset: 576)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1103, file: !1104, line: 177, baseType: !959, size: 64, align: 64, offset: 640)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1103, file: !1104, line: 178, baseType: !951, size: 32, align: 32, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1103, file: !1104, line: 180, baseType: !943, size: 64, align: 64, offset: 768)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1103, file: !1104, line: 185, baseType: !954, size: 32, align: 32, offset: 832)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1103, file: !1104, line: 190, baseType: !943, size: 64, align: 64, offset: 896)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1103, file: !1104, line: 195, baseType: !954, size: 32, align: 32, offset: 960)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1103, file: !1104, line: 200, baseType: !1233, size: 64, align: 64, offset: 1024)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1103, file: !1104, line: 201, baseType: !954, size: 32, align: 32, offset: 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1103, file: !1104, line: 202, baseType: !1110, size: 64, align: 64, offset: 1152)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1103, file: !1104, line: 203, baseType: !954, size: 32, align: 32, offset: 1216)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1103, file: !1104, line: 205, baseType: !954, size: 32, align: 32, offset: 1248)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1103, file: !1104, line: 206, baseType: !954, size: 32, align: 32, offset: 1280)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1103, file: !1104, line: 209, baseType: !1200, size: 64, align: 64, offset: 1344)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1103, file: !1104, line: 212, baseType: !1200, size: 64, align: 64, offset: 1408)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1103, file: !1104, line: 213, baseType: !1110, size: 64, align: 64, offset: 1472)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1103, file: !1104, line: 215, baseType: !954, size: 32, align: 32, offset: 1536)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1103, file: !1104, line: 217, baseType: !954, size: 32, align: 32, offset: 1568)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1103, file: !1104, line: 220, baseType: !954, size: 32, align: 32, offset: 1600)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1090, file: !14, line: 1598, baseType: !943, size: 64, align: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1090, file: !14, line: 1606, baseType: !960, size: 64, align: 64, offset: 448)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1090, file: !14, line: 1614, baseType: !954, size: 32, align: 32, offset: 512)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1090, file: !14, line: 1622, baseType: !954, size: 32, align: 32, offset: 544)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1090, file: !14, line: 1628, baseType: !954, size: 32, align: 32, offset: 576)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1090, file: !14, line: 1636, baseType: !954, size: 32, align: 32, offset: 608)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1090, file: !14, line: 1643, baseType: !954, size: 32, align: 32, offset: 640)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1090, file: !14, line: 1657, baseType: !959, size: 64, align: 64, offset: 704)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1090, file: !14, line: 1658, baseType: !954, size: 32, align: 32, offset: 768)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1090, file: !14, line: 1679, baseType: !978, size: 64, align: 32, offset: 800)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1090, file: !14, line: 1688, baseType: !954, size: 32, align: 32, offset: 864)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1090, file: !14, line: 1712, baseType: !954, size: 32, align: 32, offset: 896)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1090, file: !14, line: 1729, baseType: !954, size: 32, align: 32, offset: 928)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1090, file: !14, line: 1729, baseType: !954, size: 32, align: 32, offset: 960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1090, file: !14, line: 1744, baseType: !954, size: 32, align: 32, offset: 992)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1090, file: !14, line: 1744, baseType: !954, size: 32, align: 32, offset: 1024)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1090, file: !14, line: 1751, baseType: !954, size: 32, align: 32, offset: 1056)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1090, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1090, file: !14, line: 1791, baseType: !1373, size: 64, align: 64, offset: 1152)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{null, !1376, !1377, !1379, !954, !954, !954}
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1090, file: !14, line: 1808, baseType: !1381, size: 64, align: 64, offset: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!473, !1376, !985}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1090, file: !14, line: 1816, baseType: !954, size: 32, align: 32, offset: 1280)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1090, file: !14, line: 1825, baseType: !1386, size: 32, align: 32, offset: 1312)
!1386 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1090, file: !14, line: 1830, baseType: !954, size: 32, align: 32, offset: 1344)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1090, file: !14, line: 1838, baseType: !1386, size: 32, align: 32, offset: 1376)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1090, file: !14, line: 1846, baseType: !954, size: 32, align: 32, offset: 1408)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1090, file: !14, line: 1851, baseType: !954, size: 32, align: 32, offset: 1440)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1090, file: !14, line: 1861, baseType: !1386, size: 32, align: 32, offset: 1472)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1090, file: !14, line: 1868, baseType: !1386, size: 32, align: 32, offset: 1504)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1090, file: !14, line: 1875, baseType: !1386, size: 32, align: 32, offset: 1536)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1090, file: !14, line: 1882, baseType: !1386, size: 32, align: 32, offset: 1568)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1090, file: !14, line: 1889, baseType: !1386, size: 32, align: 32, offset: 1600)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1090, file: !14, line: 1896, baseType: !1386, size: 32, align: 32, offset: 1632)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1090, file: !14, line: 1903, baseType: !1386, size: 32, align: 32, offset: 1664)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1090, file: !14, line: 1910, baseType: !954, size: 32, align: 32, offset: 1696)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1090, file: !14, line: 1915, baseType: !954, size: 32, align: 32, offset: 1728)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1090, file: !14, line: 1926, baseType: !1379, size: 64, align: 64, offset: 1792)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1090, file: !14, line: 1935, baseType: !978, size: 64, align: 32, offset: 1856)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1090, file: !14, line: 1942, baseType: !954, size: 32, align: 32, offset: 1920)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1090, file: !14, line: 1948, baseType: !954, size: 32, align: 32, offset: 1952)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1090, file: !14, line: 1954, baseType: !954, size: 32, align: 32, offset: 1984)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1090, file: !14, line: 1960, baseType: !954, size: 32, align: 32, offset: 2016)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1090, file: !14, line: 1984, baseType: !954, size: 32, align: 32, offset: 2048)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1090, file: !14, line: 1991, baseType: !954, size: 32, align: 32, offset: 2080)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1090, file: !14, line: 1996, baseType: !954, size: 32, align: 32, offset: 2112)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1090, file: !14, line: 2004, baseType: !954, size: 32, align: 32, offset: 2144)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1090, file: !14, line: 2011, baseType: !954, size: 32, align: 32, offset: 2176)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1090, file: !14, line: 2018, baseType: !954, size: 32, align: 32, offset: 2208)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1090, file: !14, line: 2027, baseType: !954, size: 32, align: 32, offset: 2240)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1090, file: !14, line: 2034, baseType: !954, size: 32, align: 32, offset: 2272)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1090, file: !14, line: 2044, baseType: !954, size: 32, align: 32, offset: 2304)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1090, file: !14, line: 2054, baseType: !1416, size: 64, align: 64, offset: 2368)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !950, line: 49, baseType: !1418)
!1418 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1090, file: !14, line: 2061, baseType: !1416, size: 64, align: 64, offset: 2432)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1090, file: !14, line: 2066, baseType: !954, size: 32, align: 32, offset: 2496)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1090, file: !14, line: 2070, baseType: !954, size: 32, align: 32, offset: 2528)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1090, file: !14, line: 2078, baseType: !954, size: 32, align: 32, offset: 2560)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1090, file: !14, line: 2085, baseType: !954, size: 32, align: 32, offset: 2592)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1090, file: !14, line: 2092, baseType: !954, size: 32, align: 32, offset: 2624)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1090, file: !14, line: 2099, baseType: !954, size: 32, align: 32, offset: 2656)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1090, file: !14, line: 2106, baseType: !954, size: 32, align: 32, offset: 2688)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1090, file: !14, line: 2113, baseType: !954, size: 32, align: 32, offset: 2720)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1090, file: !14, line: 2120, baseType: !954, size: 32, align: 32, offset: 2752)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1090, file: !14, line: 2125, baseType: !954, size: 32, align: 32, offset: 2784)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1090, file: !14, line: 2133, baseType: !954, size: 32, align: 32, offset: 2816)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1090, file: !14, line: 2140, baseType: !954, size: 32, align: 32, offset: 2848)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1090, file: !14, line: 2145, baseType: !954, size: 32, align: 32, offset: 2880)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1090, file: !14, line: 2153, baseType: !954, size: 32, align: 32, offset: 2912)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1090, file: !14, line: 2158, baseType: !954, size: 32, align: 32, offset: 2944)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1090, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1090, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1090, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1090, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1090, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1090, file: !14, line: 2203, baseType: !954, size: 32, align: 32, offset: 3136)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1090, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1090, file: !14, line: 2212, baseType: !954, size: 32, align: 32, offset: 3200)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1090, file: !14, line: 2213, baseType: !954, size: 32, align: 32, offset: 3232)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1090, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1090, file: !14, line: 2232, baseType: !954, size: 32, align: 32, offset: 3296)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1090, file: !14, line: 2243, baseType: !954, size: 32, align: 32, offset: 3328)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1090, file: !14, line: 2249, baseType: !954, size: 32, align: 32, offset: 3360)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1090, file: !14, line: 2256, baseType: !954, size: 32, align: 32, offset: 3392)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1090, file: !14, line: 2263, baseType: !996, size: 64, align: 64, offset: 3456)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1090, file: !14, line: 2270, baseType: !996, size: 64, align: 64, offset: 3520)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1090, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1090, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1090, file: !14, line: 2367, baseType: !1454, size: 64, align: 64, offset: 3648)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!954, !1376, !1110, !954}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1090, file: !14, line: 2383, baseType: !954, size: 32, align: 32, offset: 3712)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1090, file: !14, line: 2386, baseType: !1386, size: 32, align: 32, offset: 3744)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1090, file: !14, line: 2387, baseType: !1386, size: 32, align: 32, offset: 3776)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1090, file: !14, line: 2394, baseType: !954, size: 32, align: 32, offset: 3808)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1090, file: !14, line: 2401, baseType: !954, size: 32, align: 32, offset: 3840)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1090, file: !14, line: 2408, baseType: !954, size: 32, align: 32, offset: 3872)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1090, file: !14, line: 2415, baseType: !954, size: 32, align: 32, offset: 3904)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1090, file: !14, line: 2422, baseType: !954, size: 32, align: 32, offset: 3936)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1090, file: !14, line: 2423, baseType: !1466, size: 64, align: 64, offset: 3968)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1468, file: !14, line: 827, baseType: !954, size: 32, align: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1468, file: !14, line: 828, baseType: !954, size: 32, align: 32, offset: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1468, file: !14, line: 829, baseType: !954, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1468, file: !14, line: 830, baseType: !1386, size: 32, align: 32, offset: 96)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1090, file: !14, line: 2430, baseType: !960, size: 64, align: 64, offset: 4032)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1090, file: !14, line: 2437, baseType: !960, size: 64, align: 64, offset: 4096)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1090, file: !14, line: 2444, baseType: !1386, size: 32, align: 32, offset: 4160)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1090, file: !14, line: 2451, baseType: !1386, size: 32, align: 32, offset: 4192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1090, file: !14, line: 2458, baseType: !954, size: 32, align: 32, offset: 4224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1090, file: !14, line: 2469, baseType: !954, size: 32, align: 32, offset: 4256)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1090, file: !14, line: 2475, baseType: !954, size: 32, align: 32, offset: 4288)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1090, file: !14, line: 2481, baseType: !954, size: 32, align: 32, offset: 4320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1090, file: !14, line: 2485, baseType: !954, size: 32, align: 32, offset: 4352)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1090, file: !14, line: 2489, baseType: !954, size: 32, align: 32, offset: 4384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1090, file: !14, line: 2493, baseType: !954, size: 32, align: 32, offset: 4416)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1090, file: !14, line: 2501, baseType: !954, size: 32, align: 32, offset: 4448)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1090, file: !14, line: 2506, baseType: !954, size: 32, align: 32, offset: 4480)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1090, file: !14, line: 2510, baseType: !954, size: 32, align: 32, offset: 4512)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1090, file: !14, line: 2514, baseType: !960, size: 64, align: 64, offset: 4544)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1090, file: !14, line: 2528, baseType: !1490, size: 64, align: 64, offset: 4608)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{null, !1376, !943, !954, !954}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1090, file: !14, line: 2534, baseType: !954, size: 32, align: 32, offset: 4672)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1090, file: !14, line: 2545, baseType: !954, size: 32, align: 32, offset: 4704)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1090, file: !14, line: 2547, baseType: !954, size: 32, align: 32, offset: 4736)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1090, file: !14, line: 2549, baseType: !954, size: 32, align: 32, offset: 4768)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1090, file: !14, line: 2551, baseType: !954, size: 32, align: 32, offset: 4800)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1090, file: !14, line: 2553, baseType: !954, size: 32, align: 32, offset: 4832)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1090, file: !14, line: 2555, baseType: !954, size: 32, align: 32, offset: 4864)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1090, file: !14, line: 2557, baseType: !954, size: 32, align: 32, offset: 4896)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1090, file: !14, line: 2559, baseType: !954, size: 32, align: 32, offset: 4928)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1090, file: !14, line: 2563, baseType: !954, size: 32, align: 32, offset: 4960)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1090, file: !14, line: 2571, baseType: !1504, size: 64, align: 64, offset: 4992)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1090, file: !14, line: 2579, baseType: !1504, size: 64, align: 64, offset: 5056)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1090, file: !14, line: 2586, baseType: !954, size: 32, align: 32, offset: 5120)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1090, file: !14, line: 2615, baseType: !954, size: 32, align: 32, offset: 5152)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1090, file: !14, line: 2627, baseType: !954, size: 32, align: 32, offset: 5184)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1090, file: !14, line: 2637, baseType: !954, size: 32, align: 32, offset: 5216)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1090, file: !14, line: 2681, baseType: !954, size: 32, align: 32, offset: 5248)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1090, file: !14, line: 2709, baseType: !960, size: 64, align: 64, offset: 5312)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1090, file: !14, line: 2716, baseType: !1513, size: 64, align: 64, offset: 5376)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520, !1521, !1522, !1526, !1530, !1534, !1535, !1536, !1537, !1543, !1544, !1545, !1546, !1547}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1515, file: !14, line: 3642, baseType: !968, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1515, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1515, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1515, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1515, file: !14, line: 3669, baseType: !954, size: 32, align: 32, offset: 160)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1515, file: !14, line: 3682, baseType: !1523, size: 64, align: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!954, !1088, !1110}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1515, file: !14, line: 3698, baseType: !1527, size: 64, align: 64, offset: 256)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{!954, !1088, !955, !949}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1515, file: !14, line: 3712, baseType: !1531, size: 64, align: 64, offset: 320)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!954, !1088, !954, !955, !949}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1515, file: !14, line: 3726, baseType: !1527, size: 64, align: 64, offset: 384)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1515, file: !14, line: 3737, baseType: !1085, size: 64, align: 64, offset: 448)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1515, file: !14, line: 3746, baseType: !954, size: 32, align: 32, offset: 512)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1515, file: !14, line: 3757, baseType: !1538, size: 64, align: 64, offset: 576)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{null, !1541}
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1515, file: !14, line: 3766, baseType: !1085, size: 64, align: 64, offset: 640)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1515, file: !14, line: 3774, baseType: !1085, size: 64, align: 64, offset: 704)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1515, file: !14, line: 3780, baseType: !954, size: 32, align: 32, offset: 768)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1515, file: !14, line: 3785, baseType: !954, size: 32, align: 32, offset: 800)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1515, file: !14, line: 3795, baseType: !1548, size: 64, align: 64, offset: 832)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!954, !1088, !1147}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1090, file: !14, line: 2728, baseType: !943, size: 64, align: 64, offset: 5440)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1090, file: !14, line: 2735, baseType: !1137, size: 512, align: 64, offset: 5504)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1090, file: !14, line: 2742, baseType: !954, size: 32, align: 32, offset: 6016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1090, file: !14, line: 2755, baseType: !954, size: 32, align: 32, offset: 6048)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1090, file: !14, line: 2776, baseType: !954, size: 32, align: 32, offset: 6080)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1090, file: !14, line: 2783, baseType: !954, size: 32, align: 32, offset: 6112)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1090, file: !14, line: 2791, baseType: !954, size: 32, align: 32, offset: 6144)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1090, file: !14, line: 2802, baseType: !1110, size: 64, align: 64, offset: 6208)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1090, file: !14, line: 2811, baseType: !954, size: 32, align: 32, offset: 6272)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1090, file: !14, line: 2821, baseType: !954, size: 32, align: 32, offset: 6304)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1090, file: !14, line: 2830, baseType: !954, size: 32, align: 32, offset: 6336)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1090, file: !14, line: 2840, baseType: !954, size: 32, align: 32, offset: 6368)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1090, file: !14, line: 2851, baseType: !1564, size: 64, align: 64, offset: 6400)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!954, !1376, !1567, !943, !1379, !954, !954}
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!954, !1376, !943}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1090, file: !14, line: 2871, baseType: !1571, size: 64, align: 64, offset: 6464)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!954, !1376, !1574, !943, !1379, !954}
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!954, !1376, !943, !954, !954}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1090, file: !14, line: 2878, baseType: !954, size: 32, align: 32, offset: 6528)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1090, file: !14, line: 2885, baseType: !954, size: 32, align: 32, offset: 6560)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1090, file: !14, line: 3005, baseType: !954, size: 32, align: 32, offset: 6592)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1090, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1090, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1090, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1090, file: !14, line: 3037, baseType: !959, size: 64, align: 64, offset: 6720)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1090, file: !14, line: 3038, baseType: !954, size: 32, align: 32, offset: 6784)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1090, file: !14, line: 3050, baseType: !996, size: 64, align: 64, offset: 6848)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1090, file: !14, line: 3065, baseType: !954, size: 32, align: 32, offset: 6912)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1090, file: !14, line: 3083, baseType: !954, size: 32, align: 32, offset: 6944)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1090, file: !14, line: 3092, baseType: !978, size: 64, align: 32, offset: 6976)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1090, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1090, file: !14, line: 3106, baseType: !978, size: 64, align: 32, offset: 7072)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1090, file: !14, line: 3113, baseType: !1592, size: 64, align: 64, offset: 7168)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1605}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1595, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1595, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !14, line: 720, baseType: !968, size: 64, align: 64, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1595, file: !14, line: 724, baseType: !968, size: 64, align: 64, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1595, file: !14, line: 728, baseType: !954, size: 32, align: 32, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1595, file: !14, line: 734, baseType: !1603, size: 64, align: 64, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1595, file: !14, line: 739, baseType: !1606, size: 64, align: 64, offset: 320)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1090, file: !14, line: 3129, baseType: !960, size: 64, align: 64, offset: 7232)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1090, file: !14, line: 3130, baseType: !960, size: 64, align: 64, offset: 7296)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1090, file: !14, line: 3131, baseType: !960, size: 64, align: 64, offset: 7360)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1090, file: !14, line: 3132, baseType: !960, size: 64, align: 64, offset: 7424)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1090, file: !14, line: 3139, baseType: !1504, size: 64, align: 64, offset: 7488)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1090, file: !14, line: 3147, baseType: !954, size: 32, align: 32, offset: 7552)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1090, file: !14, line: 3165, baseType: !954, size: 32, align: 32, offset: 7584)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1090, file: !14, line: 3172, baseType: !954, size: 32, align: 32, offset: 7616)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1090, file: !14, line: 3180, baseType: !954, size: 32, align: 32, offset: 7648)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1090, file: !14, line: 3191, baseType: !1416, size: 64, align: 64, offset: 7680)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1090, file: !14, line: 3199, baseType: !959, size: 64, align: 64, offset: 7744)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1090, file: !14, line: 3207, baseType: !1504, size: 64, align: 64, offset: 7808)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1090, file: !14, line: 3214, baseType: !951, size: 32, align: 32, offset: 7872)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1090, file: !14, line: 3224, baseType: !1245, size: 64, align: 64, offset: 7936)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1090, file: !14, line: 3225, baseType: !954, size: 32, align: 32, offset: 8000)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1090, file: !14, line: 3249, baseType: !1147, size: 64, align: 64, offset: 8064)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1090, file: !14, line: 3256, baseType: !954, size: 32, align: 32, offset: 8128)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1090, file: !14, line: 3271, baseType: !954, size: 32, align: 32, offset: 8160)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1090, file: !14, line: 3279, baseType: !960, size: 64, align: 64, offset: 8192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1090, file: !14, line: 3301, baseType: !1147, size: 64, align: 64, offset: 8256)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1090, file: !14, line: 3310, baseType: !954, size: 32, align: 32, offset: 8320)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1090, file: !14, line: 3337, baseType: !954, size: 32, align: 32, offset: 8352)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1090, file: !14, line: 3351, baseType: !954, size: 32, align: 32, offset: 8384)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1090, file: !14, line: 3359, baseType: !954, size: 32, align: 32, offset: 8416)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !965, file: !14, line: 3535, baseType: !1633, size: 64, align: 64, offset: 1024)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!954, !1088, !1636}
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !965, file: !14, line: 3541, baseType: !1639, size: 64, align: 64, offset: 1088)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1641)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1104, line: 223, size: 128, align: 64, elements: !1643)
!1643 = !{!1644, !1645}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1642, file: !1104, line: 224, baseType: !955, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1642, file: !1104, line: 225, baseType: !955, size: 64, align: 64, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !965, file: !14, line: 3549, baseType: !1647, size: 64, align: 64, offset: 1152)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1083}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !965, file: !14, line: 3551, baseType: !1085, size: 64, align: 64, offset: 1216)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !965, file: !14, line: 3552, baseType: !1652, size: 64, align: 64, offset: 1280)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!954, !1088, !959, !954, !1655}
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662, !1663, !1687}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1657, file: !14, line: 3921, baseType: !1417, size: 16, align: 16)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1657, file: !14, line: 3922, baseType: !949, size: 32, align: 32, offset: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1657, file: !14, line: 3923, baseType: !949, size: 32, align: 32, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1657, file: !14, line: 3924, baseType: !951, size: 32, align: 32, offset: 96)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1657, file: !14, line: 3925, baseType: !1664, size: 64, align: 64, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1668)
!1668 = !{!1669, !1670, !1671, !1672, !1673, !1674, !1680, !1682, !1683, !1684, !1685, !1686}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1667, file: !14, line: 3886, baseType: !954, size: 32, align: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1667, file: !14, line: 3887, baseType: !954, size: 32, align: 32, offset: 32)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1667, file: !14, line: 3888, baseType: !954, size: 32, align: 32, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1667, file: !14, line: 3889, baseType: !954, size: 32, align: 32, offset: 96)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1667, file: !14, line: 3890, baseType: !954, size: 32, align: 32, offset: 128)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1667, file: !14, line: 3897, baseType: !1675, size: 768, align: 64, offset: 192)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1677)
!1677 = !{!1678, !1679}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1676, file: !14, line: 3855, baseType: !1115, size: 512, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1676, file: !14, line: 3857, baseType: !1119, size: 256, align: 32, offset: 512)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1667, file: !14, line: 3903, baseType: !1681, size: 256, align: 64, offset: 960)
!1681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 256, align: 64, elements: !1216)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1667, file: !14, line: 3904, baseType: !1223, size: 128, align: 32, offset: 1216)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1667, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1667, file: !14, line: 3908, baseType: !1504, size: 64, align: 64, offset: 1408)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1667, file: !14, line: 3915, baseType: !1504, size: 64, align: 64, offset: 1472)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1667, file: !14, line: 3917, baseType: !954, size: 32, align: 32, offset: 1536)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1657, file: !14, line: 3926, baseType: !960, size: 64, align: 64, offset: 192)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !965, file: !14, line: 3564, baseType: !1689, size: 64, align: 64, offset: 1344)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!954, !1088, !1233, !1377, !1379}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !965, file: !14, line: 3566, baseType: !1693, size: 64, align: 64, offset: 1408)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!954, !1088, !943, !1379, !1233}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !965, file: !14, line: 3567, baseType: !1085, size: 64, align: 64, offset: 1472)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !965, file: !14, line: 3576, baseType: !1698, size: 64, align: 64, offset: 1536)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
