; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mss2.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--mss2.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !902, line: 37, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameCodingMode", file: !926, line: 148, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/vc1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = !{!928, !929, !930}
!928 = !DIEnumerator(name: "PROGRESSIVE", value: 0)
!929 = !DIEnumerator(name: "ILACE_FRAME", value: 1)
!930 = !DIEnumerator(name: "ILACE_FIELD", value: 2)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Profile", file: !932, line: 48, size: 32, align: 32, elements: !933)
!932 = !DIFile(filename: "libavcodec/vc1_common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!933 = !{!934, !935, !936, !937}
!934 = !DIEnumerator(name: "PROFILE_SIMPLE", value: 0)
!935 = !DIEnumerator(name: "PROFILE_MAIN", value: 1)
!936 = !DIEnumerator(name: "PROFILE_COMPLEX", value: 2)
!937 = !DIEnumerator(name: "PROFILE_ADVANCED", value: 3)
!938 = !{!939, !940, !941, !950, !951, !952, !956, !954, !947, !962}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !944, line: 222, size: 16, align: 8, elements: !945)
!944 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !943, file: !944, line: 222, baseType: !947, size: 16, align: 16)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !948, line: 49, baseType: !949)
!948 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!949 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !948, line: 48, baseType: !955)
!955 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !944, line: 221, size: 32, align: 8, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !944, line: 221, baseType: !961, size: 32, align: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !948, line: 51, baseType: !940)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!963 = !{!964}
!964 = distinct !DIGlobalVariable(name: "ff_mss2_decoder", scope: !0, file: !965, line: 851, type: !966, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mss2_decoder)
!965 = !DIFile(filename: "libavcodec/mss2.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !968)
!968 = !{!969, !973, !974, !975, !976, !977, !986, !989, !992, !995, !1000, !1001, !1077, !1085, !1086, !1087, !1089, !2529, !2535, !2543, !2547, !2548, !2585, !2589, !2593, !2594, !2598, !2602, !2603, !2607, !2608, !2609}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !14, line: 3475, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !967, file: !14, line: 3480, baseType: !970, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !967, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !967, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !967, file: !14, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !967, file: !14, line: 3488, baseType: !978, size: 64, align: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !981, line: 61, baseType: !982)
!981 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !981, line: 58, size: 64, align: 32, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !982, file: !981, line: 59, baseType: !939, size: 32, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !982, file: !981, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !967, file: !14, line: 3489, baseType: !987, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !967, file: !14, line: 3490, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !967, file: !14, line: 3491, baseType: !993, size: 64, align: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !967, file: !14, line: 3492, baseType: !996, size: 64, align: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !948, line: 55, baseType: !999)
!999 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !967, file: !14, line: 3493, baseType: !954, size: 8, align: 8, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !967, file: !14, line: 3494, baseType: !1002, size: 64, align: 64, offset: 640)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1012, !1036, !1037, !1038, !1039, !1043, !1049, !1051, !1055}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1005, file: !713, line: 72, baseType: !970, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1005, file: !713, line: 78, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!970, !950}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1005, file: !713, line: 85, baseType: !1013, size: 64, align: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1032, !1033, !1034, !1035}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !691, line: 247, baseType: !970, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1015, file: !691, line: 253, baseType: !970, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1015, file: !691, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1015, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1015, file: !691, line: 271, baseType: !1022, size: 64, align: 64, offset: 192)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1015, file: !691, line: 265, size: 64, align: 64, elements: !1023)
!1023 = !{!1024, !1028, !1030, !1031}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1022, file: !691, line: 266, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1026, line: 197, baseType: !1027)
!1026 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1027 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1022, file: !691, line: 267, baseType: !1029, size: 64, align: 64)
!1029 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1022, file: !691, line: 268, baseType: !970, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1022, file: !691, line: 270, baseType: !980, size: 64, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1015, file: !691, line: 272, baseType: !1029, size: 64, align: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1015, file: !691, line: 273, baseType: !1029, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !691, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1015, file: !691, line: 300, baseType: !970, size: 64, align: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1005, file: !713, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1005, file: !713, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1005, file: !713, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1005, file: !713, line: 113, baseType: !1040, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!950, !950, !950}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1005, file: !713, line: 123, baseType: !1044, size: 64, align: 64, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1047, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1005, file: !713, line: 130, baseType: !1050, size: 32, align: 32, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1005, file: !713, line: 136, baseType: !1052, size: 64, align: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1050, !950}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1005, file: !713, line: 142, baseType: !1056, size: 64, align: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!939, !1059, !950, !970, !939}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1075, !1076}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1061, file: !691, line: 360, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1067, file: !691, line: 307, baseType: !970, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1067, file: !691, line: 313, baseType: !1029, size: 64, align: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1067, file: !691, line: 313, baseType: !1029, size: 64, align: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1067, file: !691, line: 318, baseType: !1029, size: 64, align: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1067, file: !691, line: 318, baseType: !1029, size: 64, align: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1067, file: !691, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1061, file: !691, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1061, file: !691, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !967, file: !14, line: 3495, baseType: !1078, size: 64, align: 64, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1081, file: !14, line: 3402, baseType: !939, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !14, line: 3403, baseType: !970, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !967, file: !14, line: 3507, baseType: !970, size: 64, align: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !967, file: !14, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !14, line: 3517, baseType: !1088, size: 64, align: 64, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !967, file: !14, line: 3527, baseType: !1090, size: 64, align: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!939, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1103, !1104, !1105, !1106, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1385, !1389, !1390, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2467, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1095, file: !14, line: 1561, baseType: !1002, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1095, file: !14, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1095, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1095, file: !14, line: 1565, baseType: !1101, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1095, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1095, file: !14, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1095, file: !14, line: 1583, baseType: !950, size: 64, align: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1095, file: !14, line: 1591, baseType: !1107, size: 64, align: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1109, line: 129, size: 1664, align: 64, elements: !1110)
!1109 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1110 = !{!1111, !1112, !1113, !1114, !1211, !1232, !1233, !1262, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1108, file: !1109, line: 136, baseType: !939, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1108, file: !1109, line: 151, baseType: !939, size: 32, align: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1108, file: !1109, line: 157, baseType: !939, size: 32, align: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1108, file: !1109, line: 159, baseType: !1115, size: 64, align: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1118)
!1118 = !{!1119, !1123, !1125, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1163, !1165, !1166, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1199, !1200, !1201, !1202, !1203, !1204, !1207, !1208, !1209, !1210}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1117, file: !744, line: 282, baseType: !1120, size: 512, align: 64)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 512, align: 64, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 8)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1117, file: !744, line: 299, baseType: !1124, size: 256, align: 32, offset: 512)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1121)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1117, file: !744, line: 315, baseType: !1126, size: 64, align: 64, offset: 768)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1117, file: !744, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1117, file: !744, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1117, file: !744, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1117, file: !744, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1117, file: !744, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1117, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1117, file: !744, line: 356, baseType: !980, size: 64, align: 32, offset: 1024)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1117, file: !744, line: 361, baseType: !1025, size: 64, align: 64, offset: 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1117, file: !744, line: 369, baseType: !1025, size: 64, align: 64, offset: 1152)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1117, file: !744, line: 377, baseType: !1025, size: 64, align: 64, offset: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1117, file: !744, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1117, file: !744, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1117, file: !744, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1117, file: !744, line: 396, baseType: !950, size: 64, align: 64, offset: 1408)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1117, file: !744, line: 403, baseType: !1142, size: 512, align: 64, offset: 1472)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 512, align: 64, elements: !1121)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1117, file: !744, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1117, file: !744, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1117, file: !744, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1117, file: !744, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1117, file: !744, line: 435, baseType: !1025, size: 64, align: 64, offset: 2112)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1117, file: !744, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1117, file: !744, line: 445, baseType: !998, size: 64, align: 64, offset: 2240)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1117, file: !744, line: 459, baseType: !1151, size: 512, align: 64, offset: 2304)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 512, align: 64, elements: !1121)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1154, line: 94, baseType: !1155)
!1154 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1154, line: 81, size: 192, align: 64, elements: !1156)
!1156 = !{!1157, !1161, !1162}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1155, file: !1154, line: 82, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1154, line: 73, baseType: !1160)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1154, line: 73, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1155, file: !1154, line: 89, baseType: !962, size: 64, align: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1155, file: !1154, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1117, file: !744, line: 473, baseType: !1164, size: 64, align: 64, offset: 2816)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1117, file: !744, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1117, file: !744, line: 479, baseType: !1167, size: 64, align: 64, offset: 2944)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1180}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1170, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1170, file: !744, line: 203, baseType: !962, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1170, file: !744, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1170, file: !744, line: 205, baseType: !1176, size: 64, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1178, line: 86, baseType: !1179)
!1178 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1178, line: 86, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1170, file: !744, line: 206, baseType: !1152, size: 64, align: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1117, file: !744, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1117, file: !744, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1117, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1117, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1117, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1117, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1117, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1117, file: !744, line: 532, baseType: !1025, size: 64, align: 64, offset: 3264)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1117, file: !744, line: 539, baseType: !1025, size: 64, align: 64, offset: 3328)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1117, file: !744, line: 547, baseType: !1025, size: 64, align: 64, offset: 3392)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1117, file: !744, line: 554, baseType: !1176, size: 64, align: 64, offset: 3456)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1117, file: !744, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1117, file: !744, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1117, file: !744, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1117, file: !744, line: 588, baseType: !1196, size: 64, align: 64, offset: 3648)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1026, line: 194, baseType: !1198)
!1198 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1117, file: !744, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1117, file: !744, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1117, file: !744, line: 599, baseType: !1152, size: 64, align: 64, offset: 3776)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1117, file: !744, line: 605, baseType: !1152, size: 64, align: 64, offset: 3840)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1117, file: !744, line: 616, baseType: !1152, size: 64, align: 64, offset: 3904)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1117, file: !744, line: 626, baseType: !1205, size: 64, align: 64, offset: 3968)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1206, line: 216, baseType: !999)
!1206 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1117, file: !744, line: 627, baseType: !1205, size: 64, align: 64, offset: 4032)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1117, file: !744, line: 628, baseType: !1205, size: 64, align: 64, offset: 4096)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1117, file: !744, line: 629, baseType: !1205, size: 64, align: 64, offset: 4160)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1117, file: !744, line: 645, baseType: !1152, size: 64, align: 64, offset: 4224)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1108, file: !1109, line: 161, baseType: !1212, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1109, line: 117, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1109, line: 100, size: 832, align: 64, elements: !1215)
!1215 = !{!1216, !1223, !1224, !1225, !1226, !1227, !1229, !1230, !1231}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1214, file: !1109, line: 105, baseType: !1217, size: 256, align: 64)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1218, size: 256, align: 64, elements: !1221)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1154, line: 238, baseType: !1220)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1154, line: 238, flags: DIFlagFwdDecl)
!1221 = !{!1222}
!1222 = !DISubrange(count: 4)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1214, file: !1109, line: 110, baseType: !939, size: 32, align: 32, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1214, file: !1109, line: 111, baseType: !939, size: 32, align: 32, offset: 288)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1214, file: !1109, line: 111, baseType: !939, size: 32, align: 32, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1214, file: !1109, line: 112, baseType: !1124, size: 256, align: 32, offset: 352)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1214, file: !1109, line: 113, baseType: !1228, size: 128, align: 32, offset: 608)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1221)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1214, file: !1109, line: 114, baseType: !939, size: 32, align: 32, offset: 736)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1214, file: !1109, line: 115, baseType: !939, size: 32, align: 32, offset: 768)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1214, file: !1109, line: 116, baseType: !939, size: 32, align: 32, offset: 800)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1108, file: !1109, line: 163, baseType: !950, size: 64, align: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1108, file: !1109, line: 165, baseType: !1234, size: 128, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1109, line: 122, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1109, line: 119, size: 128, align: 64, elements: !1236)
!1236 = !{!1237, !1261}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1235, file: !1109, line: 120, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1257, !1258, !1259, !1260}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1240, file: !14, line: 1451, baseType: !1152, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1240, file: !14, line: 1461, baseType: !1025, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1240, file: !14, line: 1467, baseType: !1025, size: 64, align: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !14, line: 1468, baseType: !962, size: 64, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !14, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1240, file: !14, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1240, file: !14, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1240, file: !14, line: 1479, baseType: !1250, size: 64, align: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !14, line: 1412, baseType: !962, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1252, file: !14, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1252, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1240, file: !14, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1240, file: !14, line: 1486, baseType: !1025, size: 64, align: 64, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1240, file: !14, line: 1488, baseType: !1025, size: 64, align: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1240, file: !14, line: 1497, baseType: !1025, size: 64, align: 64, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1235, file: !1109, line: 121, baseType: !1115, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1108, file: !1109, line: 166, baseType: !1263, size: 128, align: 64, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1109, line: 127, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1109, line: 124, size: 128, align: 64, elements: !1265)
!1265 = !{!1266, !1339}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1264, file: !1109, line: 125, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1297, !1301, !1302, !1336, !1337, !1338}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1270, file: !14, line: 5751, baseType: !1002, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1270, file: !14, line: 5756, baseType: !1274, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1282, !1283, !1284, !1288, !1292, !1296}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !14, line: 5797, baseType: !970, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1276, file: !14, line: 5804, baseType: !1280, size: 64, align: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1276, file: !14, line: 5815, baseType: !1002, size: 64, align: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1276, file: !14, line: 5825, baseType: !939, size: 32, align: 32, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1276, file: !14, line: 5826, baseType: !1285, size: 64, align: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!939, !1268}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1276, file: !14, line: 5827, baseType: !1289, size: 64, align: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!939, !1268, !1238}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1276, file: !14, line: 5828, baseType: !1293, size: 64, align: 64, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{null, !1268}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1276, file: !14, line: 5829, baseType: !1293, size: 64, align: 64, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1270, file: !14, line: 5762, baseType: !1298, size: 64, align: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1300)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1270, file: !14, line: 5768, baseType: !950, size: 64, align: 64, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1270, file: !14, line: 5775, baseType: !1303, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1305, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1305, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1305, file: !14, line: 3948, baseType: !961, size: 32, align: 32, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1305, file: !14, line: 3958, baseType: !962, size: 64, align: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1305, file: !14, line: 3962, baseType: !939, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1305, file: !14, line: 3968, baseType: !939, size: 32, align: 32, offset: 224)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1305, file: !14, line: 3973, baseType: !1025, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1305, file: !14, line: 3986, baseType: !939, size: 32, align: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1305, file: !14, line: 3999, baseType: !939, size: 32, align: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1305, file: !14, line: 4004, baseType: !939, size: 32, align: 32, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1305, file: !14, line: 4005, baseType: !939, size: 32, align: 32, offset: 416)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1305, file: !14, line: 4010, baseType: !939, size: 32, align: 32, offset: 448)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1305, file: !14, line: 4011, baseType: !939, size: 32, align: 32, offset: 480)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1305, file: !14, line: 4020, baseType: !980, size: 64, align: 32, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1305, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1305, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1305, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1305, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1305, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1305, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1305, file: !14, line: 4039, baseType: !939, size: 32, align: 32, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1305, file: !14, line: 4046, baseType: !998, size: 64, align: 64, offset: 832)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1305, file: !14, line: 4050, baseType: !939, size: 32, align: 32, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1305, file: !14, line: 4054, baseType: !939, size: 32, align: 32, offset: 928)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1305, file: !14, line: 4061, baseType: !939, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1305, file: !14, line: 4065, baseType: !939, size: 32, align: 32, offset: 992)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1305, file: !14, line: 4073, baseType: !939, size: 32, align: 32, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1305, file: !14, line: 4080, baseType: !939, size: 32, align: 32, offset: 1056)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1305, file: !14, line: 4084, baseType: !939, size: 32, align: 32, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1270, file: !14, line: 5781, baseType: !1303, size: 64, align: 64, offset: 320)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1270, file: !14, line: 5787, baseType: !980, size: 64, align: 32, offset: 384)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1270, file: !14, line: 5793, baseType: !980, size: 64, align: 32, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1264, file: !1109, line: 126, baseType: !939, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1108, file: !1109, line: 172, baseType: !1238, size: 64, align: 64, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1108, file: !1109, line: 177, baseType: !962, size: 64, align: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1108, file: !1109, line: 178, baseType: !940, size: 32, align: 32, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1108, file: !1109, line: 180, baseType: !950, size: 64, align: 64, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1108, file: !1109, line: 185, baseType: !939, size: 32, align: 32, offset: 832)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1108, file: !1109, line: 190, baseType: !950, size: 64, align: 64, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1108, file: !1109, line: 195, baseType: !939, size: 32, align: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1108, file: !1109, line: 200, baseType: !1238, size: 64, align: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1108, file: !1109, line: 201, baseType: !939, size: 32, align: 32, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1108, file: !1109, line: 202, baseType: !1115, size: 64, align: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1108, file: !1109, line: 203, baseType: !939, size: 32, align: 32, offset: 1216)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1108, file: !1109, line: 205, baseType: !939, size: 32, align: 32, offset: 1248)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1108, file: !1109, line: 206, baseType: !939, size: 32, align: 32, offset: 1280)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1108, file: !1109, line: 209, baseType: !1205, size: 64, align: 64, offset: 1344)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1108, file: !1109, line: 212, baseType: !1205, size: 64, align: 64, offset: 1408)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1108, file: !1109, line: 213, baseType: !1115, size: 64, align: 64, offset: 1472)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1108, file: !1109, line: 215, baseType: !939, size: 32, align: 32, offset: 1536)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1108, file: !1109, line: 217, baseType: !939, size: 32, align: 32, offset: 1568)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1108, file: !1109, line: 220, baseType: !939, size: 32, align: 32, offset: 1600)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1095, file: !14, line: 1598, baseType: !950, size: 64, align: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1095, file: !14, line: 1606, baseType: !1025, size: 64, align: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1095, file: !14, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1095, file: !14, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1095, file: !14, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1095, file: !14, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1095, file: !14, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1095, file: !14, line: 1657, baseType: !962, size: 64, align: 64, offset: 704)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1095, file: !14, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1095, file: !14, line: 1679, baseType: !980, size: 64, align: 32, offset: 800)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1095, file: !14, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1095, file: !14, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1095, file: !14, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1095, file: !14, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1095, file: !14, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1095, file: !14, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1095, file: !14, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1095, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1095, file: !14, line: 1791, baseType: !1378, size: 64, align: 64, offset: 1152)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1381, !1382, !1384, !939, !939, !939}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1095, file: !14, line: 1808, baseType: !1386, size: 64, align: 64, offset: 1216)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!473, !1381, !987}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1095, file: !14, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1095, file: !14, line: 1825, baseType: !1391, size: 32, align: 32, offset: 1312)
!1391 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1095, file: !14, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1095, file: !14, line: 1838, baseType: !1391, size: 32, align: 32, offset: 1376)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1095, file: !14, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1095, file: !14, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1095, file: !14, line: 1861, baseType: !1391, size: 32, align: 32, offset: 1472)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1095, file: !14, line: 1868, baseType: !1391, size: 32, align: 32, offset: 1504)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1095, file: !14, line: 1875, baseType: !1391, size: 32, align: 32, offset: 1536)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1095, file: !14, line: 1882, baseType: !1391, size: 32, align: 32, offset: 1568)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1095, file: !14, line: 1889, baseType: !1391, size: 32, align: 32, offset: 1600)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1095, file: !14, line: 1896, baseType: !1391, size: 32, align: 32, offset: 1632)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1095, file: !14, line: 1903, baseType: !1391, size: 32, align: 32, offset: 1664)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1095, file: !14, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1095, file: !14, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1095, file: !14, line: 1926, baseType: !1384, size: 64, align: 64, offset: 1792)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1095, file: !14, line: 1935, baseType: !980, size: 64, align: 32, offset: 1856)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1095, file: !14, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1095, file: !14, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1095, file: !14, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1095, file: !14, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1095, file: !14, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1095, file: !14, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1095, file: !14, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1095, file: !14, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1095, file: !14, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1095, file: !14, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1095, file: !14, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1095, file: !14, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1095, file: !14, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1095, file: !14, line: 2054, baseType: !951, size: 64, align: 64, offset: 2368)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1095, file: !14, line: 2061, baseType: !951, size: 64, align: 64, offset: 2432)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1095, file: !14, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1095, file: !14, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1095, file: !14, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1095, file: !14, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1095, file: !14, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1095, file: !14, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1095, file: !14, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1095, file: !14, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1095, file: !14, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1095, file: !14, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1095, file: !14, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1095, file: !14, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1095, file: !14, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1095, file: !14, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1095, file: !14, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1095, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1095, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1095, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1095, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1095, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1095, file: !14, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1095, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1095, file: !14, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1095, file: !14, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1095, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1095, file: !14, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1095, file: !14, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1095, file: !14, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1095, file: !14, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1095, file: !14, line: 2263, baseType: !998, size: 64, align: 64, offset: 3456)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1095, file: !14, line: 2270, baseType: !998, size: 64, align: 64, offset: 3520)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1095, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1095, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1095, file: !14, line: 2367, baseType: !1456, size: 64, align: 64, offset: 3648)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!939, !1381, !1115, !939}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1095, file: !14, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1095, file: !14, line: 2386, baseType: !1391, size: 32, align: 32, offset: 3744)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1095, file: !14, line: 2387, baseType: !1391, size: 32, align: 32, offset: 3776)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1095, file: !14, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1095, file: !14, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1095, file: !14, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1095, file: !14, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1095, file: !14, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1095, file: !14, line: 2423, baseType: !1468, size: 64, align: 64, offset: 3968)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1470, file: !14, line: 827, baseType: !939, size: 32, align: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1470, file: !14, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1470, file: !14, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1470, file: !14, line: 830, baseType: !1391, size: 32, align: 32, offset: 96)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1095, file: !14, line: 2430, baseType: !1025, size: 64, align: 64, offset: 4032)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1095, file: !14, line: 2437, baseType: !1025, size: 64, align: 64, offset: 4096)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1095, file: !14, line: 2444, baseType: !1391, size: 32, align: 32, offset: 4160)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1095, file: !14, line: 2451, baseType: !1391, size: 32, align: 32, offset: 4192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1095, file: !14, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1095, file: !14, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1095, file: !14, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1095, file: !14, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1095, file: !14, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1095, file: !14, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1095, file: !14, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1095, file: !14, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1095, file: !14, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1095, file: !14, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1095, file: !14, line: 2514, baseType: !1025, size: 64, align: 64, offset: 4544)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1095, file: !14, line: 2528, baseType: !1492, size: 64, align: 64, offset: 4608)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !1381, !950, !939, !939}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1095, file: !14, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1095, file: !14, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1095, file: !14, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1095, file: !14, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1095, file: !14, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1095, file: !14, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1095, file: !14, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1095, file: !14, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1095, file: !14, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1095, file: !14, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1095, file: !14, line: 2571, baseType: !1506, size: 64, align: 64, offset: 4992)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1095, file: !14, line: 2579, baseType: !1506, size: 64, align: 64, offset: 5056)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1095, file: !14, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1095, file: !14, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1095, file: !14, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1095, file: !14, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1095, file: !14, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1095, file: !14, line: 2709, baseType: !1025, size: 64, align: 64, offset: 5312)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1095, file: !14, line: 2716, baseType: !1515, size: 64, align: 64, offset: 5376)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1518)
!1518 = !{!1519, !1520, !1521, !1522, !1523, !1524, !1528, !1532, !1536, !1537, !1538, !1539, !2440, !2441, !2442, !2443, !2444}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1517, file: !14, line: 3642, baseType: !970, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1517, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1517, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1517, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1517, file: !14, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1517, file: !14, line: 3682, baseType: !1525, size: 64, align: 64, offset: 192)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!939, !1093, !1115}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1517, file: !14, line: 3698, baseType: !1529, size: 64, align: 64, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!939, !1093, !952, !961}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1517, file: !14, line: 3712, baseType: !1533, size: 64, align: 64, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!939, !1093, !939, !952, !961}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1517, file: !14, line: 3726, baseType: !1529, size: 64, align: 64, offset: 384)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1517, file: !14, line: 3737, baseType: !1090, size: 64, align: 64, offset: 448)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1517, file: !14, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1517, file: !14, line: 3757, baseType: !1540, size: 64, align: 64, offset: 576)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{null, !1543}
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1545, line: 81, size: 86208, align: 64, elements: !1546)
!1545 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1546 = !{!1547, !1549, !1550, !1551, !1552, !1556, !1557, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1604, !1605, !1660, !1662, !1663, !1664, !1665, !1666, !1677, !1678, !1679, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1695, !1697, !1699, !1700, !1701, !1702, !1703, !1704, !1709, !1711, !1712, !1713, !1714, !1715, !1716, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1743, !1744, !1745, !1746, !1762, !1769, !1781, !1797, !1819, !1859, !1872, !1899, !1914, !1928, !1941, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1962, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1975, !1977, !1978, !1979, !1980, !1981, !1982, !1985, !1987, !1989, !1990, !1993, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2060, !2061, !2063, !2064, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2086, !2087, !2088, !2091, !2092, !2093, !2094, !2096, !2098, !2099, !2100, !2101, !2102, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2184, !2185, !2186, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2315, !2316, !2317, !2318, !2322, !2323, !2327, !2331, !2335, !2336, !2341, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2356, !2357, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2375, !2376, !2377, !2427, !2428, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1544, file: !1545, line: 82, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1544, file: !1545, line: 84, baseType: !939, size: 32, align: 32, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1544, file: !1545, line: 84, baseType: !939, size: 32, align: 32, offset: 96)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1544, file: !1545, line: 85, baseType: !939, size: 32, align: 32, offset: 128)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1544, file: !1545, line: 86, baseType: !1553, size: 384, align: 32, offset: 160)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 384, align: 32, elements: !1554)
!1554 = !{!1555}
!1555 = !DISubrange(count: 12)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1544, file: !1545, line: 87, baseType: !939, size: 32, align: 32, offset: 544)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1544, file: !1545, line: 90, baseType: !1558, size: 1088, align: 64, offset: 576)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1560)
!1560 = !{!1561, !1562, !1566}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1559, file: !902, line: 32, baseType: !952, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1559, file: !902, line: 33, baseType: !1563, size: 512, align: 8, offset: 64)
!1563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 512, align: 8, elements: !1564)
!1564 = !{!1565}
!1565 = !DISubrange(count: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1559, file: !902, line: 34, baseType: !1563, size: 512, align: 8, offset: 576)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1544, file: !1545, line: 91, baseType: !1558, size: 1088, align: 64, offset: 1664)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1544, file: !1545, line: 92, baseType: !1558, size: 1088, align: 64, offset: 2752)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1544, file: !1545, line: 93, baseType: !1558, size: 1088, align: 64, offset: 3840)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1544, file: !1545, line: 98, baseType: !1381, size: 64, align: 64, offset: 4928)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1544, file: !1545, line: 100, baseType: !939, size: 32, align: 32, offset: 4992)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1544, file: !1545, line: 100, baseType: !939, size: 32, align: 32, offset: 5024)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1544, file: !1545, line: 101, baseType: !939, size: 32, align: 32, offset: 5056)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1544, file: !1545, line: 102, baseType: !939, size: 32, align: 32, offset: 5088)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1544, file: !1545, line: 103, baseType: !1025, size: 64, align: 64, offset: 5120)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1544, file: !1545, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1544, file: !1545, line: 105, baseType: !939, size: 32, align: 32, offset: 5216)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1544, file: !1545, line: 106, baseType: !939, size: 32, align: 32, offset: 5248)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1544, file: !1545, line: 109, baseType: !939, size: 32, align: 32, offset: 5280)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1544, file: !1545, line: 110, baseType: !939, size: 32, align: 32, offset: 5312)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1544, file: !1545, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1544, file: !1545, line: 113, baseType: !939, size: 32, align: 32, offset: 5376)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1544, file: !1545, line: 114, baseType: !939, size: 32, align: 32, offset: 5408)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1544, file: !1545, line: 115, baseType: !939, size: 32, align: 32, offset: 5440)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1544, file: !1545, line: 116, baseType: !939, size: 32, align: 32, offset: 5472)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1544, file: !1545, line: 117, baseType: !939, size: 32, align: 32, offset: 5504)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1544, file: !1545, line: 118, baseType: !939, size: 32, align: 32, offset: 5536)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1544, file: !1545, line: 119, baseType: !939, size: 32, align: 32, offset: 5568)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1544, file: !1545, line: 120, baseType: !939, size: 32, align: 32, offset: 5600)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1544, file: !1545, line: 124, baseType: !939, size: 32, align: 32, offset: 5632)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1544, file: !1545, line: 125, baseType: !939, size: 32, align: 32, offset: 5664)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1544, file: !1545, line: 126, baseType: !939, size: 32, align: 32, offset: 5696)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1544, file: !1545, line: 127, baseType: !939, size: 32, align: 32, offset: 5728)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1544, file: !1545, line: 128, baseType: !939, size: 32, align: 32, offset: 5760)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1544, file: !1545, line: 129, baseType: !939, size: 32, align: 32, offset: 5792)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1544, file: !1545, line: 129, baseType: !939, size: 32, align: 32, offset: 5824)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1544, file: !1545, line: 130, baseType: !939, size: 32, align: 32, offset: 5856)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1544, file: !1545, line: 131, baseType: !939, size: 32, align: 32, offset: 5888)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1544, file: !1545, line: 132, baseType: !939, size: 32, align: 32, offset: 5920)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1544, file: !1545, line: 132, baseType: !939, size: 32, align: 32, offset: 5952)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1544, file: !1545, line: 133, baseType: !939, size: 32, align: 32, offset: 5984)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1544, file: !1545, line: 134, baseType: !1603, size: 64, align: 64, offset: 6016)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1206, line: 149, baseType: !1027)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1544, file: !1545, line: 135, baseType: !1603, size: 64, align: 64, offset: 6080)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1544, file: !1545, line: 136, baseType: !1606, size: 64, align: 64, offset: 6144)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1608, line: 91, baseType: !1609)
!1608 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1608, line: 45, size: 2624, align: 64, elements: !1610)
!1610 = !{!1611, !1613, !1624, !1625, !1626, !1628, !1634, !1635, !1637, !1638, !1639, !1640, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1609, file: !1608, line: 46, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1609, file: !1608, line: 47, baseType: !1614, size: 256, align: 64, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1615, line: 40, baseType: !1616)
!1615 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1615, line: 34, size: 256, align: 64, elements: !1617)
!1617 = !{!1618, !1619, !1623}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1616, file: !1615, line: 35, baseType: !1115, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1616, file: !1615, line: 36, baseType: !1620, size: 128, align: 64, offset: 64)
!1620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 128, align: 64, elements: !1621)
!1621 = !{!1622}
!1622 = !DISubrange(count: 2)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1616, file: !1615, line: 39, baseType: !1152, size: 64, align: 64, offset: 192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1609, file: !1608, line: 49, baseType: !1152, size: 64, align: 64, offset: 320)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1609, file: !1608, line: 50, baseType: !1196, size: 64, align: 64, offset: 384)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1609, file: !1608, line: 52, baseType: !1627, size: 128, align: 64, offset: 448)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 128, align: 64, elements: !1621)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1609, file: !1608, line: 53, baseType: !1629, size: 128, align: 64, offset: 576)
!1629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1630, size: 128, align: 64, elements: !1621)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1632, size: 32, align: 16, elements: !1621)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1026, line: 195, baseType: !1633)
!1633 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1609, file: !1608, line: 55, baseType: !1152, size: 64, align: 64, offset: 704)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1609, file: !1608, line: 56, baseType: !1636, size: 64, align: 64, offset: 768)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1609, file: !1608, line: 58, baseType: !1152, size: 64, align: 64, offset: 832)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1609, file: !1608, line: 59, baseType: !962, size: 64, align: 64, offset: 896)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1609, file: !1608, line: 61, baseType: !1627, size: 128, align: 64, offset: 960)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1609, file: !1608, line: 62, baseType: !1641, size: 128, align: 64, offset: 1088)
!1641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 128, align: 64, elements: !1621)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1609, file: !1608, line: 64, baseType: !1152, size: 64, align: 64, offset: 1216)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1609, file: !1608, line: 65, baseType: !951, size: 64, align: 64, offset: 1280)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1609, file: !1608, line: 67, baseType: !1152, size: 64, align: 64, offset: 1344)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1609, file: !1608, line: 68, baseType: !951, size: 64, align: 64, offset: 1408)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1609, file: !1608, line: 70, baseType: !939, size: 32, align: 32, offset: 1472)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1609, file: !1608, line: 71, baseType: !939, size: 32, align: 32, offset: 1504)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1609, file: !1608, line: 73, baseType: !1152, size: 64, align: 64, offset: 1536)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1609, file: !1608, line: 74, baseType: !962, size: 64, align: 64, offset: 1600)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1609, file: !1608, line: 76, baseType: !1152, size: 64, align: 64, offset: 1664)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1609, file: !1608, line: 77, baseType: !950, size: 64, align: 64, offset: 1728)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1609, file: !1608, line: 79, baseType: !939, size: 32, align: 32, offset: 1792)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1609, file: !1608, line: 81, baseType: !1025, size: 64, align: 64, offset: 1856)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1609, file: !1608, line: 82, baseType: !1025, size: 64, align: 64, offset: 1920)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1609, file: !1608, line: 84, baseType: !939, size: 32, align: 32, offset: 1984)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1609, file: !1608, line: 85, baseType: !939, size: 32, align: 32, offset: 2016)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1609, file: !1608, line: 87, baseType: !939, size: 32, align: 32, offset: 2048)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1609, file: !1608, line: 88, baseType: !939, size: 32, align: 32, offset: 2080)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1609, file: !1608, line: 90, baseType: !1142, size: 512, align: 64, offset: 2112)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1544, file: !1545, line: 137, baseType: !1661, size: 64, align: 64, offset: 6208)
