; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--qdm2.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--qdm2.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDFTransformType", file: !898, line: 71, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!899 = !{!900, !901, !902, !903}
!900 = !DIEnumerator(name: "DFT_R2C", value: 0)
!901 = !DIEnumerator(name: "IDFT_C2R", value: 1)
!902 = !DIEnumerator(name: "IDFT_R2C", value: 2)
!903 = !DIEnumerator(name: "DFT_C2R", value: 3)
!904 = !{!905, !906, !907, !910, !911, !912, !913, !919, !925, !928, !930}
!905 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!906 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !908, line: 55, baseType: !909)
!908 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!909 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!910 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !908, line: 38, baseType: !905)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !916, line: 220, size: 64, align: 8, elements: !917)
!916 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !915, file: !916, line: 220, baseType: !907, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !916, line: 221, size: 32, align: 8, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !916, line: 221, baseType: !924, size: 32, align: 32)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !908, line: 51, baseType: !906)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !908, line: 37, baseType: !927)
!927 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !908, line: 49, baseType: !929)
!929 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !898, line: 35, baseType: !910)
!932 = !{!933, !1658, !1663, !1669, !1674, !1686, !1691, !1693, !1694, !1698, !1700, !1701, !1705, !1706, !1707, !1711, !1713, !1714, !1718, !1720, !1721, !1725, !1726, !1727, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1749, !1750, !1754, !1758, !1760, !1761, !1762, !1766, !1768, !1772, !1774, !1778, !1780, !1784, !1788, !1792, !1797, !1800, !1804, !1808, !1809, !1810, !1813, !1817, !1822, !1826, !1828, !1831, !1833, !1835, !1837, !1841, !1845, !1848}
!933 = distinct !DIGlobalVariable(name: "ff_qdm2_decoder", scope: !0, file: !934, line: 1859, type: !935, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_qdm2_decoder)
!934 = !DIFile(filename: "libavcodec/qdm2.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !937)
!937 = !{!938, !942, !943, !944, !945, !946, !955, !958, !961, !964, !967, !970, !1011, !1019, !1020, !1021, !1023, !1573, !1579, !1587, !1591, !1592, !1629, !1633, !1637, !1638, !1642, !1646, !1647, !1651, !1652, !1653}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !14, line: 3475, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !936, file: !14, line: 3480, baseType: !939, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !936, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !936, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !936, file: !14, line: 3487, baseType: !905, size: 32, align: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !936, file: !14, line: 3488, baseType: !947, size: 64, align: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !950, line: 61, baseType: !951)
!950 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !950, line: 58, size: 64, align: 32, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !951, file: !950, line: 59, baseType: !905, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !951, file: !950, line: 60, baseType: !905, size: 32, align: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !936, file: !14, line: 3489, baseType: !956, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !936, file: !14, line: 3490, baseType: !959, size: 64, align: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !936, file: !14, line: 3491, baseType: !962, size: 64, align: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !936, file: !14, line: 3492, baseType: !965, size: 64, align: 64, offset: 512)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !936, file: !14, line: 3493, baseType: !968, size: 8, align: 8, offset: 576)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !908, line: 48, baseType: !969)
!969 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !936, file: !14, line: 3494, baseType: !971, size: 64, align: 64, offset: 640)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !975)
!975 = !{!976, !977, !981, !985, !986, !987, !988, !992, !998, !1000, !1004}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !974, file: !691, line: 72, baseType: !939, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !974, file: !691, line: 78, baseType: !978, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!939, !912}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !974, file: !691, line: 85, baseType: !982, size: 64, align: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !974, file: !691, line: 93, baseType: !905, size: 32, align: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !974, file: !691, line: 99, baseType: !905, size: 32, align: 32, offset: 224)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !974, file: !691, line: 108, baseType: !905, size: 32, align: 32, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !974, file: !691, line: 113, baseType: !989, size: 64, align: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!912, !912, !912}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !974, file: !691, line: 123, baseType: !993, size: 64, align: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!996, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !974, file: !691, line: 130, baseType: !999, size: 32, align: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !974, file: !691, line: 136, baseType: !1001, size: 64, align: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!999, !912}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !974, file: !691, line: 142, baseType: !1005, size: 64, align: 64, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!905, !1008, !912, !939, !905}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !936, file: !14, line: 3495, baseType: !1012, size: 64, align: 64, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1015, file: !14, line: 3402, baseType: !905, size: 32, align: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !14, line: 3403, baseType: !939, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !936, file: !14, line: 3507, baseType: !939, size: 64, align: 64, offset: 768)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !936, file: !14, line: 3516, baseType: !905, size: 32, align: 32, offset: 832)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !14, line: 3517, baseType: !1022, size: 64, align: 64, offset: 896)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !936, file: !14, line: 3527, baseType: !1024, size: 64, align: 64, offset: 960)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!905, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1037, !1038, !1039, !1040, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1322, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1511, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1029, file: !14, line: 1561, baseType: !971, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1029, file: !14, line: 1562, baseType: !905, size: 32, align: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1029, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1029, file: !14, line: 1565, baseType: !1035, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1029, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1029, file: !14, line: 1581, baseType: !906, size: 32, align: 32, offset: 224)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1029, file: !14, line: 1583, baseType: !912, size: 64, align: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1029, file: !14, line: 1591, baseType: !1041, size: 64, align: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1043, line: 129, size: 1664, align: 64, elements: !1044)
!1043 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1044 = !{!1045, !1046, !1047, !1048, !1148, !1169, !1170, !1199, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1042, file: !1043, line: 136, baseType: !905, size: 32, align: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1042, file: !1043, line: 151, baseType: !905, size: 32, align: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1042, file: !1043, line: 157, baseType: !905, size: 32, align: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1042, file: !1043, line: 159, baseType: !1049, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1052)
!1052 = !{!1053, !1058, !1060, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1100, !1102, !1103, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1136, !1137, !1138, !1139, !1140, !1141, !1144, !1145, !1146, !1147}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !722, line: 282, baseType: !1054, size: 512, align: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, align: 64, elements: !1056)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1056 = !{!1057}
!1057 = !DISubrange(count: 8)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1051, file: !722, line: 299, baseType: !1059, size: 256, align: 32, offset: 512)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 256, align: 32, elements: !1056)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1051, file: !722, line: 315, baseType: !1061, size: 64, align: 64, offset: 768)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1051, file: !722, line: 326, baseType: !905, size: 32, align: 32, offset: 832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1051, file: !722, line: 326, baseType: !905, size: 32, align: 32, offset: 864)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1051, file: !722, line: 334, baseType: !905, size: 32, align: 32, offset: 896)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1051, file: !722, line: 341, baseType: !905, size: 32, align: 32, offset: 928)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1051, file: !722, line: 346, baseType: !905, size: 32, align: 32, offset: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1051, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1051, file: !722, line: 356, baseType: !949, size: 64, align: 32, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1051, file: !722, line: 361, baseType: !1070, size: 64, align: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !908, line: 40, baseType: !1071)
!1071 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1051, file: !722, line: 369, baseType: !1070, size: 64, align: 64, offset: 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1051, file: !722, line: 377, baseType: !1070, size: 64, align: 64, offset: 1216)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1051, file: !722, line: 382, baseType: !905, size: 32, align: 32, offset: 1280)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1051, file: !722, line: 386, baseType: !905, size: 32, align: 32, offset: 1312)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1051, file: !722, line: 391, baseType: !905, size: 32, align: 32, offset: 1344)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1051, file: !722, line: 396, baseType: !912, size: 64, align: 64, offset: 1408)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1051, file: !722, line: 403, baseType: !1079, size: 512, align: 64, offset: 1472)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 512, align: 64, elements: !1056)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1051, file: !722, line: 410, baseType: !905, size: 32, align: 32, offset: 1984)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1051, file: !722, line: 415, baseType: !905, size: 32, align: 32, offset: 2016)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1051, file: !722, line: 420, baseType: !905, size: 32, align: 32, offset: 2048)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1051, file: !722, line: 425, baseType: !905, size: 32, align: 32, offset: 2080)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1051, file: !722, line: 435, baseType: !1070, size: 64, align: 64, offset: 2112)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1051, file: !722, line: 440, baseType: !905, size: 32, align: 32, offset: 2176)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1051, file: !722, line: 445, baseType: !907, size: 64, align: 64, offset: 2240)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1051, file: !722, line: 459, baseType: !1088, size: 512, align: 64, offset: 2304)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1056)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1091, line: 94, baseType: !1092)
!1091 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1091, line: 81, size: 192, align: 64, elements: !1093)
!1093 = !{!1094, !1098, !1099}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1092, file: !1091, line: 82, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1091, line: 73, baseType: !1097)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1091, line: 73, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !1091, line: 89, baseType: !1055, size: 64, align: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !1091, line: 93, baseType: !905, size: 32, align: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1051, file: !722, line: 473, baseType: !1101, size: 64, align: 64, offset: 2816)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1051, file: !722, line: 477, baseType: !905, size: 32, align: 32, offset: 2880)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1051, file: !722, line: 479, baseType: !1104, size: 64, align: 64, offset: 2944)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1117}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1107, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !722, line: 203, baseType: !1055, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !722, line: 204, baseType: !905, size: 32, align: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1107, file: !722, line: 205, baseType: !1113, size: 64, align: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1115, line: 86, baseType: !1116)
!1115 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1115, line: 86, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1107, file: !722, line: 206, baseType: !1089, size: 64, align: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1051, file: !722, line: 480, baseType: !905, size: 32, align: 32, offset: 3008)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1051, file: !722, line: 505, baseType: !905, size: 32, align: 32, offset: 3040)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1051, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1051, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1051, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1051, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1051, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1051, file: !722, line: 532, baseType: !1070, size: 64, align: 64, offset: 3264)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1051, file: !722, line: 539, baseType: !1070, size: 64, align: 64, offset: 3328)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1051, file: !722, line: 547, baseType: !1070, size: 64, align: 64, offset: 3392)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1051, file: !722, line: 554, baseType: !1113, size: 64, align: 64, offset: 3456)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1051, file: !722, line: 563, baseType: !905, size: 32, align: 32, offset: 3520)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1051, file: !722, line: 572, baseType: !905, size: 32, align: 32, offset: 3552)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1051, file: !722, line: 581, baseType: !905, size: 32, align: 32, offset: 3584)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1051, file: !722, line: 588, baseType: !1133, size: 64, align: 64, offset: 3648)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !908, line: 36, baseType: !1135)
!1135 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1051, file: !722, line: 593, baseType: !905, size: 32, align: 32, offset: 3712)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1051, file: !722, line: 596, baseType: !905, size: 32, align: 32, offset: 3744)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1051, file: !722, line: 599, baseType: !1089, size: 64, align: 64, offset: 3776)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1051, file: !722, line: 605, baseType: !1089, size: 64, align: 64, offset: 3840)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1051, file: !722, line: 616, baseType: !1089, size: 64, align: 64, offset: 3904)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1051, file: !722, line: 626, baseType: !1142, size: 64, align: 64, offset: 3968)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1143, line: 216, baseType: !909)
!1143 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1051, file: !722, line: 627, baseType: !1142, size: 64, align: 64, offset: 4032)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1051, file: !722, line: 628, baseType: !1142, size: 64, align: 64, offset: 4096)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1051, file: !722, line: 629, baseType: !1142, size: 64, align: 64, offset: 4160)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1051, file: !722, line: 645, baseType: !1089, size: 64, align: 64, offset: 4224)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1042, file: !1043, line: 161, baseType: !1149, size: 64, align: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1043, line: 117, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1043, line: 100, size: 832, align: 64, elements: !1152)
!1152 = !{!1153, !1160, !1161, !1162, !1163, !1164, !1166, !1167, !1168}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1151, file: !1043, line: 105, baseType: !1154, size: 256, align: 64)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 256, align: 64, elements: !1158)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1091, line: 238, baseType: !1157)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1091, line: 238, flags: DIFlagFwdDecl)
!1158 = !{!1159}
!1159 = !DISubrange(count: 4)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1151, file: !1043, line: 110, baseType: !905, size: 32, align: 32, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1151, file: !1043, line: 111, baseType: !905, size: 32, align: 32, offset: 288)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1151, file: !1043, line: 111, baseType: !905, size: 32, align: 32, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1151, file: !1043, line: 112, baseType: !1059, size: 256, align: 32, offset: 352)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1151, file: !1043, line: 113, baseType: !1165, size: 128, align: 32, offset: 608)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 128, align: 32, elements: !1158)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1151, file: !1043, line: 114, baseType: !905, size: 32, align: 32, offset: 736)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1151, file: !1043, line: 115, baseType: !905, size: 32, align: 32, offset: 768)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1151, file: !1043, line: 116, baseType: !905, size: 32, align: 32, offset: 800)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1042, file: !1043, line: 163, baseType: !912, size: 64, align: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1042, file: !1043, line: 165, baseType: !1171, size: 128, align: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1043, line: 122, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1043, line: 119, size: 128, align: 64, elements: !1173)
!1173 = !{!1174, !1198}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1172, file: !1043, line: 120, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1194, !1195, !1196, !1197}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1177, file: !14, line: 1451, baseType: !1089, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1177, file: !14, line: 1461, baseType: !1070, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1177, file: !14, line: 1467, baseType: !1070, size: 64, align: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !14, line: 1468, baseType: !1055, size: 64, align: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !14, line: 1469, baseType: !905, size: 32, align: 32, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1177, file: !14, line: 1470, baseType: !905, size: 32, align: 32, offset: 288)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !14, line: 1474, baseType: !905, size: 32, align: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1177, file: !14, line: 1479, baseType: !1187, size: 64, align: 64, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1189, file: !14, line: 1412, baseType: !1055, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1189, file: !14, line: 1413, baseType: !905, size: 32, align: 32, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1189, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1177, file: !14, line: 1480, baseType: !905, size: 32, align: 32, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1177, file: !14, line: 1486, baseType: !1070, size: 64, align: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1177, file: !14, line: 1488, baseType: !1070, size: 64, align: 64, offset: 576)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1177, file: !14, line: 1497, baseType: !1070, size: 64, align: 64, offset: 640)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1172, file: !1043, line: 121, baseType: !1049, size: 64, align: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1042, file: !1043, line: 166, baseType: !1200, size: 128, align: 64, offset: 448)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1043, line: 127, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1043, line: 124, size: 128, align: 64, elements: !1202)
!1202 = !{!1203, !1276}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1201, file: !1043, line: 125, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1208)
!1208 = !{!1209, !1210, !1234, !1238, !1239, !1273, !1274, !1275}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1207, file: !14, line: 5751, baseType: !971, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1207, file: !14, line: 5756, baseType: !1211, size: 64, align: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1219, !1220, !1221, !1225, !1229, !1233}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1213, file: !14, line: 5797, baseType: !939, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1213, file: !14, line: 5804, baseType: !1217, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1213, file: !14, line: 5815, baseType: !971, size: 64, align: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1213, file: !14, line: 5825, baseType: !905, size: 32, align: 32, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1213, file: !14, line: 5826, baseType: !1222, size: 64, align: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!905, !1205}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1213, file: !14, line: 5827, baseType: !1226, size: 64, align: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!905, !1205, !1175}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1213, file: !14, line: 5828, baseType: !1230, size: 64, align: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{null, !1205}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1213, file: !14, line: 5829, baseType: !1230, size: 64, align: 64, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1207, file: !14, line: 5762, baseType: !1235, size: 64, align: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1237)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1207, file: !14, line: 5768, baseType: !912, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1207, file: !14, line: 5775, baseType: !1240, size: 64, align: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1242, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1242, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1242, file: !14, line: 3948, baseType: !924, size: 32, align: 32, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1242, file: !14, line: 3958, baseType: !1055, size: 64, align: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1242, file: !14, line: 3962, baseType: !905, size: 32, align: 32, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1242, file: !14, line: 3968, baseType: !905, size: 32, align: 32, offset: 224)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1242, file: !14, line: 3973, baseType: !1070, size: 64, align: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1242, file: !14, line: 3986, baseType: !905, size: 32, align: 32, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1242, file: !14, line: 3999, baseType: !905, size: 32, align: 32, offset: 352)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1242, file: !14, line: 4004, baseType: !905, size: 32, align: 32, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1242, file: !14, line: 4005, baseType: !905, size: 32, align: 32, offset: 416)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1242, file: !14, line: 4010, baseType: !905, size: 32, align: 32, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1242, file: !14, line: 4011, baseType: !905, size: 32, align: 32, offset: 480)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1242, file: !14, line: 4020, baseType: !949, size: 64, align: 32, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1242, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1242, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1242, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1242, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1242, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1242, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1242, file: !14, line: 4039, baseType: !905, size: 32, align: 32, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1242, file: !14, line: 4046, baseType: !907, size: 64, align: 64, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1242, file: !14, line: 4050, baseType: !905, size: 32, align: 32, offset: 896)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1242, file: !14, line: 4054, baseType: !905, size: 32, align: 32, offset: 928)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1242, file: !14, line: 4061, baseType: !905, size: 32, align: 32, offset: 960)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1242, file: !14, line: 4065, baseType: !905, size: 32, align: 32, offset: 992)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1242, file: !14, line: 4073, baseType: !905, size: 32, align: 32, offset: 1024)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1242, file: !14, line: 4080, baseType: !905, size: 32, align: 32, offset: 1056)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1242, file: !14, line: 4084, baseType: !905, size: 32, align: 32, offset: 1088)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1207, file: !14, line: 5781, baseType: !1240, size: 64, align: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1207, file: !14, line: 5787, baseType: !949, size: 64, align: 32, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1207, file: !14, line: 5793, baseType: !949, size: 64, align: 32, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1201, file: !1043, line: 126, baseType: !905, size: 32, align: 32, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1042, file: !1043, line: 172, baseType: !1175, size: 64, align: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1042, file: !1043, line: 177, baseType: !1055, size: 64, align: 64, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1042, file: !1043, line: 178, baseType: !906, size: 32, align: 32, offset: 704)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1042, file: !1043, line: 180, baseType: !912, size: 64, align: 64, offset: 768)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1042, file: !1043, line: 185, baseType: !905, size: 32, align: 32, offset: 832)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1042, file: !1043, line: 190, baseType: !912, size: 64, align: 64, offset: 896)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1042, file: !1043, line: 195, baseType: !905, size: 32, align: 32, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1042, file: !1043, line: 200, baseType: !1175, size: 64, align: 64, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1042, file: !1043, line: 201, baseType: !905, size: 32, align: 32, offset: 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1042, file: !1043, line: 202, baseType: !1049, size: 64, align: 64, offset: 1152)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1042, file: !1043, line: 203, baseType: !905, size: 32, align: 32, offset: 1216)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1042, file: !1043, line: 205, baseType: !905, size: 32, align: 32, offset: 1248)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1042, file: !1043, line: 206, baseType: !905, size: 32, align: 32, offset: 1280)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1042, file: !1043, line: 209, baseType: !1142, size: 64, align: 64, offset: 1344)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1042, file: !1043, line: 212, baseType: !1142, size: 64, align: 64, offset: 1408)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1042, file: !1043, line: 213, baseType: !1049, size: 64, align: 64, offset: 1472)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1042, file: !1043, line: 215, baseType: !905, size: 32, align: 32, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1042, file: !1043, line: 217, baseType: !905, size: 32, align: 32, offset: 1568)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1042, file: !1043, line: 220, baseType: !905, size: 32, align: 32, offset: 1600)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1029, file: !14, line: 1598, baseType: !912, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1029, file: !14, line: 1606, baseType: !1070, size: 64, align: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1029, file: !14, line: 1614, baseType: !905, size: 32, align: 32, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1029, file: !14, line: 1622, baseType: !905, size: 32, align: 32, offset: 544)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1029, file: !14, line: 1628, baseType: !905, size: 32, align: 32, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1029, file: !14, line: 1636, baseType: !905, size: 32, align: 32, offset: 608)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1029, file: !14, line: 1643, baseType: !905, size: 32, align: 32, offset: 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1029, file: !14, line: 1657, baseType: !1055, size: 64, align: 64, offset: 704)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1029, file: !14, line: 1658, baseType: !905, size: 32, align: 32, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1029, file: !14, line: 1679, baseType: !949, size: 64, align: 32, offset: 800)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1029, file: !14, line: 1688, baseType: !905, size: 32, align: 32, offset: 864)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1029, file: !14, line: 1712, baseType: !905, size: 32, align: 32, offset: 896)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1029, file: !14, line: 1729, baseType: !905, size: 32, align: 32, offset: 928)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1029, file: !14, line: 1729, baseType: !905, size: 32, align: 32, offset: 960)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1029, file: !14, line: 1744, baseType: !905, size: 32, align: 32, offset: 992)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1029, file: !14, line: 1744, baseType: !905, size: 32, align: 32, offset: 1024)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1029, file: !14, line: 1751, baseType: !905, size: 32, align: 32, offset: 1056)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1029, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1029, file: !14, line: 1791, baseType: !1315, size: 64, align: 64, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1318, !1319, !1321, !905, !905, !905}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1029, file: !14, line: 1808, baseType: !1323, size: 64, align: 64, offset: 1216)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!473, !1318, !956}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1029, file: !14, line: 1816, baseType: !905, size: 32, align: 32, offset: 1280)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1029, file: !14, line: 1825, baseType: !910, size: 32, align: 32, offset: 1312)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1029, file: !14, line: 1830, baseType: !905, size: 32, align: 32, offset: 1344)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1029, file: !14, line: 1838, baseType: !910, size: 32, align: 32, offset: 1376)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1029, file: !14, line: 1846, baseType: !905, size: 32, align: 32, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1029, file: !14, line: 1851, baseType: !905, size: 32, align: 32, offset: 1440)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1029, file: !14, line: 1861, baseType: !910, size: 32, align: 32, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1029, file: !14, line: 1868, baseType: !910, size: 32, align: 32, offset: 1504)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1029, file: !14, line: 1875, baseType: !910, size: 32, align: 32, offset: 1536)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1029, file: !14, line: 1882, baseType: !910, size: 32, align: 32, offset: 1568)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1029, file: !14, line: 1889, baseType: !910, size: 32, align: 32, offset: 1600)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1029, file: !14, line: 1896, baseType: !910, size: 32, align: 32, offset: 1632)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1029, file: !14, line: 1903, baseType: !910, size: 32, align: 32, offset: 1664)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1029, file: !14, line: 1910, baseType: !905, size: 32, align: 32, offset: 1696)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1029, file: !14, line: 1915, baseType: !905, size: 32, align: 32, offset: 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1029, file: !14, line: 1926, baseType: !1321, size: 64, align: 64, offset: 1792)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1029, file: !14, line: 1935, baseType: !949, size: 64, align: 32, offset: 1856)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1029, file: !14, line: 1942, baseType: !905, size: 32, align: 32, offset: 1920)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1029, file: !14, line: 1948, baseType: !905, size: 32, align: 32, offset: 1952)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1029, file: !14, line: 1954, baseType: !905, size: 32, align: 32, offset: 1984)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1029, file: !14, line: 1960, baseType: !905, size: 32, align: 32, offset: 2016)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1029, file: !14, line: 1984, baseType: !905, size: 32, align: 32, offset: 2048)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1029, file: !14, line: 1991, baseType: !905, size: 32, align: 32, offset: 2080)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1029, file: !14, line: 1996, baseType: !905, size: 32, align: 32, offset: 2112)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1029, file: !14, line: 2004, baseType: !905, size: 32, align: 32, offset: 2144)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1029, file: !14, line: 2011, baseType: !905, size: 32, align: 32, offset: 2176)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1029, file: !14, line: 2018, baseType: !905, size: 32, align: 32, offset: 2208)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1029, file: !14, line: 2027, baseType: !905, size: 32, align: 32, offset: 2240)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1029, file: !14, line: 2034, baseType: !905, size: 32, align: 32, offset: 2272)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1029, file: !14, line: 2044, baseType: !905, size: 32, align: 32, offset: 2304)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1029, file: !14, line: 2054, baseType: !1357, size: 64, align: 64, offset: 2368)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1029, file: !14, line: 2061, baseType: !1357, size: 64, align: 64, offset: 2432)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1029, file: !14, line: 2066, baseType: !905, size: 32, align: 32, offset: 2496)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1029, file: !14, line: 2070, baseType: !905, size: 32, align: 32, offset: 2528)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1029, file: !14, line: 2078, baseType: !905, size: 32, align: 32, offset: 2560)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1029, file: !14, line: 2085, baseType: !905, size: 32, align: 32, offset: 2592)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1029, file: !14, line: 2092, baseType: !905, size: 32, align: 32, offset: 2624)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1029, file: !14, line: 2099, baseType: !905, size: 32, align: 32, offset: 2656)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1029, file: !14, line: 2106, baseType: !905, size: 32, align: 32, offset: 2688)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1029, file: !14, line: 2113, baseType: !905, size: 32, align: 32, offset: 2720)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1029, file: !14, line: 2120, baseType: !905, size: 32, align: 32, offset: 2752)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1029, file: !14, line: 2125, baseType: !905, size: 32, align: 32, offset: 2784)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1029, file: !14, line: 2133, baseType: !905, size: 32, align: 32, offset: 2816)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1029, file: !14, line: 2140, baseType: !905, size: 32, align: 32, offset: 2848)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1029, file: !14, line: 2145, baseType: !905, size: 32, align: 32, offset: 2880)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1029, file: !14, line: 2153, baseType: !905, size: 32, align: 32, offset: 2912)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1029, file: !14, line: 2158, baseType: !905, size: 32, align: 32, offset: 2944)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1029, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1029, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1029, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1029, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1029, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1029, file: !14, line: 2203, baseType: !905, size: 32, align: 32, offset: 3136)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1029, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1029, file: !14, line: 2212, baseType: !905, size: 32, align: 32, offset: 3200)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1029, file: !14, line: 2213, baseType: !905, size: 32, align: 32, offset: 3232)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1029, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1029, file: !14, line: 2232, baseType: !905, size: 32, align: 32, offset: 3296)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1029, file: !14, line: 2243, baseType: !905, size: 32, align: 32, offset: 3328)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1029, file: !14, line: 2249, baseType: !905, size: 32, align: 32, offset: 3360)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1029, file: !14, line: 2256, baseType: !905, size: 32, align: 32, offset: 3392)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1029, file: !14, line: 2263, baseType: !907, size: 64, align: 64, offset: 3456)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1029, file: !14, line: 2270, baseType: !907, size: 64, align: 64, offset: 3520)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1029, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1029, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1029, file: !14, line: 2367, baseType: !1393, size: 64, align: 64, offset: 3648)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!905, !1318, !1049, !905}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1029, file: !14, line: 2383, baseType: !905, size: 32, align: 32, offset: 3712)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1029, file: !14, line: 2386, baseType: !910, size: 32, align: 32, offset: 3744)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1029, file: !14, line: 2387, baseType: !910, size: 32, align: 32, offset: 3776)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1029, file: !14, line: 2394, baseType: !905, size: 32, align: 32, offset: 3808)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1029, file: !14, line: 2401, baseType: !905, size: 32, align: 32, offset: 3840)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1029, file: !14, line: 2408, baseType: !905, size: 32, align: 32, offset: 3872)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1029, file: !14, line: 2415, baseType: !905, size: 32, align: 32, offset: 3904)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1029, file: !14, line: 2422, baseType: !905, size: 32, align: 32, offset: 3936)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1029, file: !14, line: 2423, baseType: !1405, size: 64, align: 64, offset: 3968)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1407, file: !14, line: 827, baseType: !905, size: 32, align: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1407, file: !14, line: 828, baseType: !905, size: 32, align: 32, offset: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1407, file: !14, line: 829, baseType: !905, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1407, file: !14, line: 830, baseType: !910, size: 32, align: 32, offset: 96)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1029, file: !14, line: 2430, baseType: !1070, size: 64, align: 64, offset: 4032)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1029, file: !14, line: 2437, baseType: !1070, size: 64, align: 64, offset: 4096)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1029, file: !14, line: 2444, baseType: !910, size: 32, align: 32, offset: 4160)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1029, file: !14, line: 2451, baseType: !910, size: 32, align: 32, offset: 4192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1029, file: !14, line: 2458, baseType: !905, size: 32, align: 32, offset: 4224)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1029, file: !14, line: 2469, baseType: !905, size: 32, align: 32, offset: 4256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1029, file: !14, line: 2475, baseType: !905, size: 32, align: 32, offset: 4288)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1029, file: !14, line: 2481, baseType: !905, size: 32, align: 32, offset: 4320)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1029, file: !14, line: 2485, baseType: !905, size: 32, align: 32, offset: 4352)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1029, file: !14, line: 2489, baseType: !905, size: 32, align: 32, offset: 4384)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1029, file: !14, line: 2493, baseType: !905, size: 32, align: 32, offset: 4416)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1029, file: !14, line: 2501, baseType: !905, size: 32, align: 32, offset: 4448)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1029, file: !14, line: 2506, baseType: !905, size: 32, align: 32, offset: 4480)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1029, file: !14, line: 2510, baseType: !905, size: 32, align: 32, offset: 4512)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1029, file: !14, line: 2514, baseType: !1070, size: 64, align: 64, offset: 4544)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1029, file: !14, line: 2528, baseType: !1429, size: 64, align: 64, offset: 4608)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{null, !1318, !912, !905, !905}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1029, file: !14, line: 2534, baseType: !905, size: 32, align: 32, offset: 4672)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1029, file: !14, line: 2545, baseType: !905, size: 32, align: 32, offset: 4704)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1029, file: !14, line: 2547, baseType: !905, size: 32, align: 32, offset: 4736)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1029, file: !14, line: 2549, baseType: !905, size: 32, align: 32, offset: 4768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1029, file: !14, line: 2551, baseType: !905, size: 32, align: 32, offset: 4800)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1029, file: !14, line: 2553, baseType: !905, size: 32, align: 32, offset: 4832)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1029, file: !14, line: 2555, baseType: !905, size: 32, align: 32, offset: 4864)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1029, file: !14, line: 2557, baseType: !905, size: 32, align: 32, offset: 4896)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1029, file: !14, line: 2559, baseType: !905, size: 32, align: 32, offset: 4928)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1029, file: !14, line: 2563, baseType: !905, size: 32, align: 32, offset: 4960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1029, file: !14, line: 2571, baseType: !1443, size: 64, align: 64, offset: 4992)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1029, file: !14, line: 2579, baseType: !1443, size: 64, align: 64, offset: 5056)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1029, file: !14, line: 2586, baseType: !905, size: 32, align: 32, offset: 5120)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1029, file: !14, line: 2615, baseType: !905, size: 32, align: 32, offset: 5152)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1029, file: !14, line: 2627, baseType: !905, size: 32, align: 32, offset: 5184)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1029, file: !14, line: 2637, baseType: !905, size: 32, align: 32, offset: 5216)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1029, file: !14, line: 2681, baseType: !905, size: 32, align: 32, offset: 5248)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1029, file: !14, line: 2709, baseType: !1070, size: 64, align: 64, offset: 5312)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1029, file: !14, line: 2716, baseType: !1452, size: 64, align: 64, offset: 5376)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1465, !1471, !1475, !1476, !1477, !1478, !1484, !1485, !1486, !1487, !1488}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1454, file: !14, line: 3642, baseType: !939, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1454, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1454, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1454, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1454, file: !14, line: 3669, baseType: !905, size: 32, align: 32, offset: 160)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1454, file: !14, line: 3682, baseType: !1462, size: 64, align: 64, offset: 192)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{!905, !1027, !1049}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1454, file: !14, line: 3698, baseType: !1466, size: 64, align: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!905, !1027, !1469, !924}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1454, file: !14, line: 3712, baseType: !1472, size: 64, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!905, !1027, !905, !1469, !924}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1454, file: !14, line: 3726, baseType: !1466, size: 64, align: 64, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1454, file: !14, line: 3737, baseType: !1024, size: 64, align: 64, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1454, file: !14, line: 3746, baseType: !905, size: 32, align: 32, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1454, file: !14, line: 3757, baseType: !1479, size: 64, align: 64, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1482}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1454, file: !14, line: 3766, baseType: !1024, size: 64, align: 64, offset: 640)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1454, file: !14, line: 3774, baseType: !1024, size: 64, align: 64, offset: 704)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1454, file: !14, line: 3780, baseType: !905, size: 32, align: 32, offset: 768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1454, file: !14, line: 3785, baseType: !905, size: 32, align: 32, offset: 800)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1454, file: !14, line: 3795, baseType: !1489, size: 64, align: 64, offset: 832)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!905, !1027, !1089}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1029, file: !14, line: 2728, baseType: !912, size: 64, align: 64, offset: 5440)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1029, file: !14, line: 2735, baseType: !1079, size: 512, align: 64, offset: 5504)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1029, file: !14, line: 2742, baseType: !905, size: 32, align: 32, offset: 6016)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1029, file: !14, line: 2755, baseType: !905, size: 32, align: 32, offset: 6048)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1029, file: !14, line: 2776, baseType: !905, size: 32, align: 32, offset: 6080)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1029, file: !14, line: 2783, baseType: !905, size: 32, align: 32, offset: 6112)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1029, file: !14, line: 2791, baseType: !905, size: 32, align: 32, offset: 6144)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1029, file: !14, line: 2802, baseType: !1049, size: 64, align: 64, offset: 6208)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1029, file: !14, line: 2811, baseType: !905, size: 32, align: 32, offset: 6272)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1029, file: !14, line: 2821, baseType: !905, size: 32, align: 32, offset: 6304)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1029, file: !14, line: 2830, baseType: !905, size: 32, align: 32, offset: 6336)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1029, file: !14, line: 2840, baseType: !905, size: 32, align: 32, offset: 6368)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1029, file: !14, line: 2851, baseType: !1505, size: 64, align: 64, offset: 6400)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!905, !1318, !1508, !912, !1321, !905, !905}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!905, !1318, !912}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1029, file: !14, line: 2871, baseType: !1512, size: 64, align: 64, offset: 6464)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!905, !1318, !1515, !912, !1321, !905}
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!905, !1318, !912, !905, !905}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1029, file: !14, line: 2878, baseType: !905, size: 32, align: 32, offset: 6528)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1029, file: !14, line: 2885, baseType: !905, size: 32, align: 32, offset: 6560)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1029, file: !14, line: 3005, baseType: !905, size: 32, align: 32, offset: 6592)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1029, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1029, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1029, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1029, file: !14, line: 3037, baseType: !1055, size: 64, align: 64, offset: 6720)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1029, file: !14, line: 3038, baseType: !905, size: 32, align: 32, offset: 6784)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1029, file: !14, line: 3050, baseType: !907, size: 64, align: 64, offset: 6848)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1029, file: !14, line: 3065, baseType: !905, size: 32, align: 32, offset: 6912)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1029, file: !14, line: 3083, baseType: !905, size: 32, align: 32, offset: 6944)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1029, file: !14, line: 3092, baseType: !949, size: 64, align: 32, offset: 6976)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1029, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1029, file: !14, line: 3106, baseType: !949, size: 64, align: 32, offset: 7072)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1029, file: !14, line: 3113, baseType: !1533, size: 64, align: 64, offset: 7168)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1535)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1536)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1537)
!1537 = !{!1538, !1539, !1540, !1541, !1542, !1543, !1546}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1536, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1536, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1536, file: !14, line: 720, baseType: !939, size: 64, align: 64, offset: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1536, file: !14, line: 724, baseType: !939, size: 64, align: 64, offset: 128)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1536, file: !14, line: 728, baseType: !905, size: 32, align: 32, offset: 192)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1536, file: !14, line: 734, baseType: !1544, size: 64, align: 64, offset: 256)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1536, file: !14, line: 739, baseType: !1547, size: 64, align: 64, offset: 320)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1029, file: !14, line: 3129, baseType: !1070, size: 64, align: 64, offset: 7232)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1029, file: !14, line: 3130, baseType: !1070, size: 64, align: 64, offset: 7296)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1029, file: !14, line: 3131, baseType: !1070, size: 64, align: 64, offset: 7360)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1029, file: !14, line: 3132, baseType: !1070, size: 64, align: 64, offset: 7424)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1029, file: !14, line: 3139, baseType: !1443, size: 64, align: 64, offset: 7488)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1029, file: !14, line: 3147, baseType: !905, size: 32, align: 32, offset: 7552)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1029, file: !14, line: 3165, baseType: !905, size: 32, align: 32, offset: 7584)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1029, file: !14, line: 3172, baseType: !905, size: 32, align: 32, offset: 7616)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1029, file: !14, line: 3180, baseType: !905, size: 32, align: 32, offset: 7648)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1029, file: !14, line: 3191, baseType: !1357, size: 64, align: 64, offset: 7680)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1029, file: !14, line: 3199, baseType: !1055, size: 64, align: 64, offset: 7744)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1029, file: !14, line: 3207, baseType: !1443, size: 64, align: 64, offset: 7808)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1029, file: !14, line: 3214, baseType: !906, size: 32, align: 32, offset: 7872)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1029, file: !14, line: 3224, baseType: !1187, size: 64, align: 64, offset: 7936)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1029, file: !14, line: 3225, baseType: !905, size: 32, align: 32, offset: 8000)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1029, file: !14, line: 3249, baseType: !1089, size: 64, align: 64, offset: 8064)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1029, file: !14, line: 3256, baseType: !905, size: 32, align: 32, offset: 8128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1029, file: !14, line: 3271, baseType: !905, size: 32, align: 32, offset: 8160)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1029, file: !14, line: 3279, baseType: !1070, size: 64, align: 64, offset: 8192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1029, file: !14, line: 3301, baseType: !1089, size: 64, align: 64, offset: 8256)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1029, file: !14, line: 3310, baseType: !905, size: 32, align: 32, offset: 8320)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1029, file: !14, line: 3337, baseType: !905, size: 32, align: 32, offset: 8352)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1029, file: !14, line: 3351, baseType: !905, size: 32, align: 32, offset: 8384)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1029, file: !14, line: 3359, baseType: !905, size: 32, align: 32, offset: 8416)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !936, file: !14, line: 3535, baseType: !1574, size: 64, align: 64, offset: 1024)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!905, !1027, !1577}
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !936, file: !14, line: 3541, baseType: !1580, size: 64, align: 64, offset: 1088)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1582)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1043, line: 223, size: 128, align: 64, elements: !1584)
!1584 = !{!1585, !1586}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1583, file: !1043, line: 224, baseType: !1469, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1583, file: !1043, line: 225, baseType: !1469, size: 64, align: 64, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !936, file: !14, line: 3549, baseType: !1588, size: 64, align: 64, offset: 1152)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1022}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !936, file: !14, line: 3551, baseType: !1024, size: 64, align: 64, offset: 1216)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !936, file: !14, line: 3552, baseType: !1593, size: 64, align: 64, offset: 1280)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!905, !1027, !1055, !905, !1596}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1628}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1598, file: !14, line: 3921, baseType: !928, size: 16, align: 16)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1598, file: !14, line: 3922, baseType: !924, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1598, file: !14, line: 3923, baseType: !924, size: 32, align: 32, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1598, file: !14, line: 3924, baseType: !906, size: 32, align: 32, offset: 96)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1598, file: !14, line: 3925, baseType: !1605, size: 64, align: 64, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1613, !1614, !1615, !1621, !1623, !1624, !1625, !1626, !1627}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1608, file: !14, line: 3886, baseType: !905, size: 32, align: 32)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1608, file: !14, line: 3887, baseType: !905, size: 32, align: 32, offset: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1608, file: !14, line: 3888, baseType: !905, size: 32, align: 32, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1608, file: !14, line: 3889, baseType: !905, size: 32, align: 32, offset: 96)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1608, file: !14, line: 3890, baseType: !905, size: 32, align: 32, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1608, file: !14, line: 3897, baseType: !1616, size: 768, align: 64, offset: 192)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1618)
!1618 = !{!1619, !1620}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1617, file: !14, line: 3855, baseType: !1054, size: 512, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1617, file: !14, line: 3857, baseType: !1059, size: 256, align: 32, offset: 512)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1608, file: !14, line: 3903, baseType: !1622, size: 256, align: 64, offset: 960)
!1622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 256, align: 64, elements: !1158)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1608, file: !14, line: 3904, baseType: !1165, size: 128, align: 32, offset: 1216)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1608, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1608, file: !14, line: 3908, baseType: !1443, size: 64, align: 64, offset: 1408)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1608, file: !14, line: 3915, baseType: !1443, size: 64, align: 64, offset: 1472)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1608, file: !14, line: 3917, baseType: !905, size: 32, align: 32, offset: 1536)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1598, file: !14, line: 3926, baseType: !1070, size: 64, align: 64, offset: 192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !936, file: !14, line: 3564, baseType: !1630, size: 64, align: 64, offset: 1344)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!905, !1027, !1175, !1319, !1321}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !936, file: !14, line: 3566, baseType: !1634, size: 64, align: 64, offset: 1408)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!905, !1027, !912, !1321, !1175}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !936, file: !14, line: 3567, baseType: !1024, size: 64, align: 64, offset: 1472)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !936, file: !14, line: 3576, baseType: !1639, size: 64, align: 64, offset: 1536)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!905, !1027, !1319}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !936, file: !14, line: 3577, baseType: !1643, size: 64, align: 64, offset: 1600)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!905, !1027, !1175}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !936, file: !14, line: 3584, baseType: !1462, size: 64, align: 64, offset: 1664)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !936, file: !14, line: 3589, baseType: !1648, size: 64, align: 64, offset: 1728)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1027}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !936, file: !14, line: 3594, baseType: !905, size: 32, align: 32, offset: 1792)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !936, file: !14, line: 3600, baseType: !939, size: 64, align: 64, offset: 1856)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !936, file: !14, line: 3609, baseType: !1654, size: 64, align: 64, offset: 1920)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1657)
!1657 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1658 = distinct !DIGlobalVariable(name: "done", scope: !1659, file: !934, line: 1589, type: !905, isLocal: true, isDefinition: true, variable: i32* @qdm2_init_static_data.done)
!1659 = distinct !DISubprogram(name: "qdm2_init_static_data", scope: !934, file: !934, line: 1588, type: !1660, isLocal: true, isDefinition: true, scopeLine: 1588, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1662)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{null}
!1662 = !{}
!1663 = distinct !DIGlobalVariable(name: "qdm2_vlc_offs", scope: !0, file: !1664, line: 112, type: !1665, isLocal: true, isDefinition: true, variable: [18 x i16]* @qdm2_vlc_offs)
!1664 = !DIFile(filename: "libavcodec/qdm2_tablegen.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1666, size: 288, align: 16, elements: !1667)
!1666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!1667 = !{!1668}
!1668 = !DISubrange(count: 18)
!1669 = distinct !DIGlobalVariable(name: "qdm2_table", scope: !0, file: !1664, line: 116, type: !1670, isLocal: true, isDefinition: true, variable: [3838 x [2 x i16]]* @qdm2_table)
!1670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 122816, align: 16, elements: !1671)
!1671 = !{!1672, !1673}
!1672 = !DISubrange(count: 3838)
!1673 = !DISubrange(count: 2)
!1674 = distinct !DIGlobalVariable(name: "vlc_tab_level", scope: !0, file: !1664, line: 98, type: !1675, isLocal: true, isDefinition: true, variable: %struct.VLC* @vlc_tab_level)
