; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--textdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--textdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!843 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851}
!846 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!847 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!848 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!849 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!850 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!851 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!854 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!855 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!856 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!857 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!858 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!859 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!860 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!861 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872}
!866 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!867 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!868 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!869 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!870 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!871 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!872 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!875 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!876 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!877 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!878 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!879 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!880 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!881 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!882 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!883 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!884 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!885 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!886 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!887 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!888 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!889 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!890 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!891 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!892 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!893 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!894 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!895 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!896 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!897 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!898 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!899 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!900 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!901 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!902 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !{!910}
!910 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!911 = !{!912, !1547, !1548, !1549, !1550, !1551, !1552, !1558, !1559, !1560, !1561}
!912 = distinct !DIGlobalVariable(name: "ff_text_decoder", scope: !0, file: !913, line: 84, type: !914, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_text_decoder)
!913 = !DIFile(filename: "libavcodec/textdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !916)
!916 = !{!917, !921, !922, !923, !924, !926, !935, !938, !941, !944, !950, !953, !1029, !1037, !1038, !1039, !1041, !1446, !1452, !1457, !1461, !1462, !1502, !1522, !1526, !1527, !1531, !1535, !1536, !1540, !1541, !1542}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !915, file: !14, line: 3475, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !915, file: !14, line: 3480, baseType: !918, size: 64, align: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !915, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !915, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !915, file: !14, line: 3487, baseType: !925, size: 32, align: 32, offset: 192)
!925 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !915, file: !14, line: 3488, baseType: !927, size: 64, align: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !930, line: 61, baseType: !931)
!930 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !930, line: 58, size: 64, align: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !931, file: !930, line: 59, baseType: !925, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !931, file: !930, line: 60, baseType: !925, size: 32, align: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !915, file: !14, line: 3489, baseType: !936, size: 64, align: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !915, file: !14, line: 3490, baseType: !939, size: 64, align: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !915, file: !14, line: 3491, baseType: !942, size: 64, align: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !915, file: !14, line: 3492, baseType: !945, size: 64, align: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !948, line: 55, baseType: !949)
!948 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!949 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !915, file: !14, line: 3493, baseType: !951, size: 8, align: 8, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !948, line: 48, baseType: !952)
!952 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !915, file: !14, line: 3494, baseType: !954, size: 64, align: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !958)
!958 = !{!959, !960, !965, !988, !989, !990, !991, !995, !1001, !1003, !1007}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !957, file: !713, line: 72, baseType: !918, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !957, file: !713, line: 78, baseType: !961, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!918, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !957, file: !713, line: 85, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !984, !985, !986, !987}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !691, line: 247, baseType: !918, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !968, file: !691, line: 253, baseType: !918, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !968, file: !691, line: 259, baseType: !925, size: 32, align: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !968, file: !691, line: 271, baseType: !975, size: 64, align: 64, offset: 192)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !691, line: 265, size: 64, align: 64, elements: !976)
!976 = !{!977, !980, !982, !983}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !975, file: !691, line: 266, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !948, line: 40, baseType: !979)
!979 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !975, file: !691, line: 267, baseType: !981, size: 64, align: 64)
!981 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !975, file: !691, line: 268, baseType: !918, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !975, file: !691, line: 270, baseType: !929, size: 64, align: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !968, file: !691, line: 272, baseType: !981, size: 64, align: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !968, file: !691, line: 273, baseType: !981, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !691, line: 275, baseType: !925, size: 32, align: 32, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !968, file: !691, line: 300, baseType: !918, size: 64, align: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !957, file: !713, line: 93, baseType: !925, size: 32, align: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !957, file: !713, line: 99, baseType: !925, size: 32, align: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !957, file: !713, line: 108, baseType: !925, size: 32, align: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !957, file: !713, line: 113, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!964, !964, !964}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !957, file: !713, line: 123, baseType: !996, size: 64, align: 64, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!999, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !957, file: !713, line: 130, baseType: !1002, size: 32, align: 32, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !957, file: !713, line: 136, baseType: !1004, size: 64, align: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1002, !964}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !957, file: !713, line: 142, baseType: !1008, size: 64, align: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!925, !1011, !964, !918, !925}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1014)
!1014 = !{!1015, !1027, !1028}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1013, file: !691, line: 360, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1019, file: !691, line: 307, baseType: !918, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1019, file: !691, line: 313, baseType: !981, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1019, file: !691, line: 313, baseType: !981, size: 64, align: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1019, file: !691, line: 318, baseType: !981, size: 64, align: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1019, file: !691, line: 318, baseType: !981, size: 64, align: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1019, file: !691, line: 323, baseType: !925, size: 32, align: 32, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1013, file: !691, line: 364, baseType: !925, size: 32, align: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1013, file: !691, line: 368, baseType: !925, size: 32, align: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !915, file: !14, line: 3495, baseType: !1030, size: 64, align: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1033, file: !14, line: 3402, baseType: !925, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1033, file: !14, line: 3403, baseType: !918, size: 64, align: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !915, file: !14, line: 3507, baseType: !918, size: 64, align: 64, offset: 768)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !915, file: !14, line: 3516, baseType: !925, size: 32, align: 32, offset: 832)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !915, file: !14, line: 3517, baseType: !1040, size: 64, align: 64, offset: 896)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !915, file: !14, line: 3527, baseType: !1042, size: 64, align: 64, offset: 960)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!925, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1055, !1056, !1057, !1058, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1183, !1187, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1377, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1047, file: !14, line: 1561, baseType: !954, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1047, file: !14, line: 1562, baseType: !925, size: 32, align: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1047, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1047, file: !14, line: 1565, baseType: !1053, size: 64, align: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1047, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1047, file: !14, line: 1581, baseType: !910, size: 32, align: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1047, file: !14, line: 1583, baseType: !964, size: 64, align: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1047, file: !14, line: 1591, baseType: !1059, size: 64, align: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1047, file: !14, line: 1598, baseType: !964, size: 64, align: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1047, file: !14, line: 1606, baseType: !978, size: 64, align: 64, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1047, file: !14, line: 1614, baseType: !925, size: 32, align: 32, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1047, file: !14, line: 1622, baseType: !925, size: 32, align: 32, offset: 544)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1047, file: !14, line: 1628, baseType: !925, size: 32, align: 32, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1047, file: !14, line: 1636, baseType: !925, size: 32, align: 32, offset: 608)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1047, file: !14, line: 1643, baseType: !925, size: 32, align: 32, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1047, file: !14, line: 1657, baseType: !1069, size: 64, align: 64, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1047, file: !14, line: 1658, baseType: !925, size: 32, align: 32, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1047, file: !14, line: 1679, baseType: !929, size: 64, align: 32, offset: 800)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1047, file: !14, line: 1688, baseType: !925, size: 32, align: 32, offset: 864)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1047, file: !14, line: 1712, baseType: !925, size: 32, align: 32, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1047, file: !14, line: 1729, baseType: !925, size: 32, align: 32, offset: 928)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1047, file: !14, line: 1729, baseType: !925, size: 32, align: 32, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1047, file: !14, line: 1744, baseType: !925, size: 32, align: 32, offset: 992)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1047, file: !14, line: 1744, baseType: !925, size: 32, align: 32, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1047, file: !14, line: 1751, baseType: !925, size: 32, align: 32, offset: 1056)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1047, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1047, file: !14, line: 1791, baseType: !1081, size: 64, align: 64, offset: 1152)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !1084, !1085, !1182, !925, !925, !925}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1089)
!1089 = !{!1090, !1094, !1096, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1134, !1136, !1137, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1170, !1171, !1172, !1173, !1174, !1175, !1178, !1179, !1180, !1181}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1088, file: !744, line: 282, baseType: !1091, size: 512, align: 64)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 512, align: 64, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 8)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1088, file: !744, line: 299, baseType: !1095, size: 256, align: 32, offset: 512)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 256, align: 32, elements: !1092)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1088, file: !744, line: 315, baseType: !1097, size: 64, align: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1088, file: !744, line: 326, baseType: !925, size: 32, align: 32, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1088, file: !744, line: 326, baseType: !925, size: 32, align: 32, offset: 864)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1088, file: !744, line: 334, baseType: !925, size: 32, align: 32, offset: 896)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1088, file: !744, line: 341, baseType: !925, size: 32, align: 32, offset: 928)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1088, file: !744, line: 346, baseType: !925, size: 32, align: 32, offset: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1088, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1088, file: !744, line: 356, baseType: !929, size: 64, align: 32, offset: 1024)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1088, file: !744, line: 361, baseType: !978, size: 64, align: 64, offset: 1088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1088, file: !744, line: 369, baseType: !978, size: 64, align: 64, offset: 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1088, file: !744, line: 377, baseType: !978, size: 64, align: 64, offset: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1088, file: !744, line: 382, baseType: !925, size: 32, align: 32, offset: 1280)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1088, file: !744, line: 386, baseType: !925, size: 32, align: 32, offset: 1312)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1088, file: !744, line: 391, baseType: !925, size: 32, align: 32, offset: 1344)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1088, file: !744, line: 396, baseType: !964, size: 64, align: 64, offset: 1408)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1088, file: !744, line: 403, baseType: !1113, size: 512, align: 64, offset: 1472)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, align: 64, elements: !1092)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1088, file: !744, line: 410, baseType: !925, size: 32, align: 32, offset: 1984)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1088, file: !744, line: 415, baseType: !925, size: 32, align: 32, offset: 2016)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1088, file: !744, line: 420, baseType: !925, size: 32, align: 32, offset: 2048)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1088, file: !744, line: 425, baseType: !925, size: 32, align: 32, offset: 2080)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1088, file: !744, line: 435, baseType: !978, size: 64, align: 64, offset: 2112)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1088, file: !744, line: 440, baseType: !925, size: 32, align: 32, offset: 2176)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1088, file: !744, line: 445, baseType: !947, size: 64, align: 64, offset: 2240)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1088, file: !744, line: 459, baseType: !1122, size: 512, align: 64, offset: 2304)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 512, align: 64, elements: !1092)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1125, line: 94, baseType: !1126)
!1125 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1125, line: 81, size: 192, align: 64, elements: !1127)
!1127 = !{!1128, !1132, !1133}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1126, file: !1125, line: 82, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1125, line: 73, baseType: !1131)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1125, line: 73, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !1125, line: 89, baseType: !1069, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !1125, line: 93, baseType: !925, size: 32, align: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1088, file: !744, line: 473, baseType: !1135, size: 64, align: 64, offset: 2816)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1088, file: !744, line: 477, baseType: !925, size: 32, align: 32, offset: 2880)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1088, file: !744, line: 479, baseType: !1138, size: 64, align: 64, offset: 2944)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1151}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !744, line: 203, baseType: !1069, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !744, line: 204, baseType: !925, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1141, file: !744, line: 205, baseType: !1147, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1149, line: 86, baseType: !1150)
!1149 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1149, line: 86, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1141, file: !744, line: 206, baseType: !1123, size: 64, align: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1088, file: !744, line: 480, baseType: !925, size: 32, align: 32, offset: 3008)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !744, line: 505, baseType: !925, size: 32, align: 32, offset: 3040)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1088, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1088, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1088, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1088, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1088, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1088, file: !744, line: 532, baseType: !978, size: 64, align: 64, offset: 3264)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1088, file: !744, line: 539, baseType: !978, size: 64, align: 64, offset: 3328)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1088, file: !744, line: 547, baseType: !978, size: 64, align: 64, offset: 3392)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1088, file: !744, line: 554, baseType: !1147, size: 64, align: 64, offset: 3456)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1088, file: !744, line: 563, baseType: !925, size: 32, align: 32, offset: 3520)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1088, file: !744, line: 572, baseType: !925, size: 32, align: 32, offset: 3552)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1088, file: !744, line: 581, baseType: !925, size: 32, align: 32, offset: 3584)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1088, file: !744, line: 588, baseType: !1167, size: 64, align: 64, offset: 3648)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !948, line: 36, baseType: !1169)
!1169 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1088, file: !744, line: 593, baseType: !925, size: 32, align: 32, offset: 3712)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1088, file: !744, line: 596, baseType: !925, size: 32, align: 32, offset: 3744)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1088, file: !744, line: 599, baseType: !1123, size: 64, align: 64, offset: 3776)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1088, file: !744, line: 605, baseType: !1123, size: 64, align: 64, offset: 3840)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1088, file: !744, line: 616, baseType: !1123, size: 64, align: 64, offset: 3904)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1088, file: !744, line: 626, baseType: !1176, size: 64, align: 64, offset: 3968)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1177, line: 216, baseType: !949)
!1177 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1088, file: !744, line: 627, baseType: !1176, size: 64, align: 64, offset: 4032)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1088, file: !744, line: 628, baseType: !1176, size: 64, align: 64, offset: 4096)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1088, file: !744, line: 629, baseType: !1176, size: 64, align: 64, offset: 4160)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1088, file: !744, line: 645, baseType: !1123, size: 64, align: 64, offset: 4224)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1047, file: !14, line: 1808, baseType: !1184, size: 64, align: 64, offset: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!473, !1084, !936}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1047, file: !14, line: 1816, baseType: !925, size: 32, align: 32, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1047, file: !14, line: 1825, baseType: !1189, size: 32, align: 32, offset: 1312)
!1189 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1047, file: !14, line: 1830, baseType: !925, size: 32, align: 32, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1047, file: !14, line: 1838, baseType: !1189, size: 32, align: 32, offset: 1376)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1047, file: !14, line: 1846, baseType: !925, size: 32, align: 32, offset: 1408)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1047, file: !14, line: 1851, baseType: !925, size: 32, align: 32, offset: 1440)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1047, file: !14, line: 1861, baseType: !1189, size: 32, align: 32, offset: 1472)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1047, file: !14, line: 1868, baseType: !1189, size: 32, align: 32, offset: 1504)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1047, file: !14, line: 1875, baseType: !1189, size: 32, align: 32, offset: 1536)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1047, file: !14, line: 1882, baseType: !1189, size: 32, align: 32, offset: 1568)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1047, file: !14, line: 1889, baseType: !1189, size: 32, align: 32, offset: 1600)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1047, file: !14, line: 1896, baseType: !1189, size: 32, align: 32, offset: 1632)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1047, file: !14, line: 1903, baseType: !1189, size: 32, align: 32, offset: 1664)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1047, file: !14, line: 1910, baseType: !925, size: 32, align: 32, offset: 1696)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1047, file: !14, line: 1915, baseType: !925, size: 32, align: 32, offset: 1728)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1047, file: !14, line: 1926, baseType: !1182, size: 64, align: 64, offset: 1792)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1047, file: !14, line: 1935, baseType: !929, size: 64, align: 32, offset: 1856)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1047, file: !14, line: 1942, baseType: !925, size: 32, align: 32, offset: 1920)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1047, file: !14, line: 1948, baseType: !925, size: 32, align: 32, offset: 1952)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1047, file: !14, line: 1954, baseType: !925, size: 32, align: 32, offset: 1984)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1047, file: !14, line: 1960, baseType: !925, size: 32, align: 32, offset: 2016)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1047, file: !14, line: 1984, baseType: !925, size: 32, align: 32, offset: 2048)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1047, file: !14, line: 1991, baseType: !925, size: 32, align: 32, offset: 2080)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1047, file: !14, line: 1996, baseType: !925, size: 32, align: 32, offset: 2112)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1047, file: !14, line: 2004, baseType: !925, size: 32, align: 32, offset: 2144)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1047, file: !14, line: 2011, baseType: !925, size: 32, align: 32, offset: 2176)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1047, file: !14, line: 2018, baseType: !925, size: 32, align: 32, offset: 2208)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1047, file: !14, line: 2027, baseType: !925, size: 32, align: 32, offset: 2240)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1047, file: !14, line: 2034, baseType: !925, size: 32, align: 32, offset: 2272)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1047, file: !14, line: 2044, baseType: !925, size: 32, align: 32, offset: 2304)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1047, file: !14, line: 2054, baseType: !1219, size: 64, align: 64, offset: 2368)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !948, line: 49, baseType: !1221)
!1221 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1047, file: !14, line: 2061, baseType: !1219, size: 64, align: 64, offset: 2432)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1047, file: !14, line: 2066, baseType: !925, size: 32, align: 32, offset: 2496)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1047, file: !14, line: 2070, baseType: !925, size: 32, align: 32, offset: 2528)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1047, file: !14, line: 2078, baseType: !925, size: 32, align: 32, offset: 2560)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1047, file: !14, line: 2085, baseType: !925, size: 32, align: 32, offset: 2592)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1047, file: !14, line: 2092, baseType: !925, size: 32, align: 32, offset: 2624)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1047, file: !14, line: 2099, baseType: !925, size: 32, align: 32, offset: 2656)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1047, file: !14, line: 2106, baseType: !925, size: 32, align: 32, offset: 2688)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1047, file: !14, line: 2113, baseType: !925, size: 32, align: 32, offset: 2720)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1047, file: !14, line: 2120, baseType: !925, size: 32, align: 32, offset: 2752)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1047, file: !14, line: 2125, baseType: !925, size: 32, align: 32, offset: 2784)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1047, file: !14, line: 2133, baseType: !925, size: 32, align: 32, offset: 2816)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1047, file: !14, line: 2140, baseType: !925, size: 32, align: 32, offset: 2848)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1047, file: !14, line: 2145, baseType: !925, size: 32, align: 32, offset: 2880)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1047, file: !14, line: 2153, baseType: !925, size: 32, align: 32, offset: 2912)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1047, file: !14, line: 2158, baseType: !925, size: 32, align: 32, offset: 2944)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1047, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1047, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1047, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1047, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1047, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1047, file: !14, line: 2203, baseType: !925, size: 32, align: 32, offset: 3136)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1047, file: !14, line: 2209, baseType: !844, size: 32, align: 32, offset: 3168)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1047, file: !14, line: 2212, baseType: !925, size: 32, align: 32, offset: 3200)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1047, file: !14, line: 2213, baseType: !925, size: 32, align: 32, offset: 3232)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1047, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1047, file: !14, line: 2232, baseType: !925, size: 32, align: 32, offset: 3296)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1047, file: !14, line: 2243, baseType: !925, size: 32, align: 32, offset: 3328)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1047, file: !14, line: 2249, baseType: !925, size: 32, align: 32, offset: 3360)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1047, file: !14, line: 2256, baseType: !925, size: 32, align: 32, offset: 3392)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1047, file: !14, line: 2263, baseType: !947, size: 64, align: 64, offset: 3456)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1047, file: !14, line: 2270, baseType: !947, size: 64, align: 64, offset: 3520)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1047, file: !14, line: 2277, baseType: !852, size: 32, align: 32, offset: 3584)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1047, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1047, file: !14, line: 2367, baseType: !1257, size: 64, align: 64, offset: 3648)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!925, !1084, !1260, !925}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1047, file: !14, line: 2383, baseType: !925, size: 32, align: 32, offset: 3712)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1047, file: !14, line: 2386, baseType: !1189, size: 32, align: 32, offset: 3744)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1047, file: !14, line: 2387, baseType: !1189, size: 32, align: 32, offset: 3776)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1047, file: !14, line: 2394, baseType: !925, size: 32, align: 32, offset: 3808)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1047, file: !14, line: 2401, baseType: !925, size: 32, align: 32, offset: 3840)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1047, file: !14, line: 2408, baseType: !925, size: 32, align: 32, offset: 3872)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1047, file: !14, line: 2415, baseType: !925, size: 32, align: 32, offset: 3904)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1047, file: !14, line: 2422, baseType: !925, size: 32, align: 32, offset: 3936)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1047, file: !14, line: 2423, baseType: !1270, size: 64, align: 64, offset: 3968)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1272, file: !14, line: 827, baseType: !925, size: 32, align: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1272, file: !14, line: 828, baseType: !925, size: 32, align: 32, offset: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1272, file: !14, line: 829, baseType: !925, size: 32, align: 32, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1272, file: !14, line: 830, baseType: !1189, size: 32, align: 32, offset: 96)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1047, file: !14, line: 2430, baseType: !978, size: 64, align: 64, offset: 4032)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1047, file: !14, line: 2437, baseType: !978, size: 64, align: 64, offset: 4096)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1047, file: !14, line: 2444, baseType: !1189, size: 32, align: 32, offset: 4160)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1047, file: !14, line: 2451, baseType: !1189, size: 32, align: 32, offset: 4192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1047, file: !14, line: 2458, baseType: !925, size: 32, align: 32, offset: 4224)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1047, file: !14, line: 2469, baseType: !925, size: 32, align: 32, offset: 4256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1047, file: !14, line: 2475, baseType: !925, size: 32, align: 32, offset: 4288)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1047, file: !14, line: 2481, baseType: !925, size: 32, align: 32, offset: 4320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1047, file: !14, line: 2485, baseType: !925, size: 32, align: 32, offset: 4352)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1047, file: !14, line: 2489, baseType: !925, size: 32, align: 32, offset: 4384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1047, file: !14, line: 2493, baseType: !925, size: 32, align: 32, offset: 4416)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1047, file: !14, line: 2501, baseType: !925, size: 32, align: 32, offset: 4448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1047, file: !14, line: 2506, baseType: !925, size: 32, align: 32, offset: 4480)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1047, file: !14, line: 2510, baseType: !925, size: 32, align: 32, offset: 4512)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1047, file: !14, line: 2514, baseType: !978, size: 64, align: 64, offset: 4544)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1047, file: !14, line: 2528, baseType: !1294, size: 64, align: 64, offset: 4608)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{null, !1084, !964, !925, !925}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1047, file: !14, line: 2534, baseType: !925, size: 32, align: 32, offset: 4672)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1047, file: !14, line: 2545, baseType: !925, size: 32, align: 32, offset: 4704)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1047, file: !14, line: 2547, baseType: !925, size: 32, align: 32, offset: 4736)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1047, file: !14, line: 2549, baseType: !925, size: 32, align: 32, offset: 4768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1047, file: !14, line: 2551, baseType: !925, size: 32, align: 32, offset: 4800)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1047, file: !14, line: 2553, baseType: !925, size: 32, align: 32, offset: 4832)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1047, file: !14, line: 2555, baseType: !925, size: 32, align: 32, offset: 4864)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1047, file: !14, line: 2557, baseType: !925, size: 32, align: 32, offset: 4896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1047, file: !14, line: 2559, baseType: !925, size: 32, align: 32, offset: 4928)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1047, file: !14, line: 2563, baseType: !925, size: 32, align: 32, offset: 4960)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1047, file: !14, line: 2571, baseType: !1308, size: 64, align: 64, offset: 4992)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1047, file: !14, line: 2579, baseType: !1308, size: 64, align: 64, offset: 5056)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1047, file: !14, line: 2586, baseType: !925, size: 32, align: 32, offset: 5120)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1047, file: !14, line: 2615, baseType: !925, size: 32, align: 32, offset: 5152)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1047, file: !14, line: 2627, baseType: !925, size: 32, align: 32, offset: 5184)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1047, file: !14, line: 2637, baseType: !925, size: 32, align: 32, offset: 5216)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1047, file: !14, line: 2681, baseType: !925, size: 32, align: 32, offset: 5248)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1047, file: !14, line: 2709, baseType: !978, size: 64, align: 64, offset: 5312)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1047, file: !14, line: 2716, baseType: !1317, size: 64, align: 64, offset: 5376)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1330, !1337, !1341, !1342, !1343, !1344, !1350, !1351, !1352, !1353, !1354}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1319, file: !14, line: 3642, baseType: !918, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1319, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1319, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1319, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1319, file: !14, line: 3669, baseType: !925, size: 32, align: 32, offset: 160)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1319, file: !14, line: 3682, baseType: !1327, size: 64, align: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!925, !1045, !1260}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1319, file: !14, line: 3698, baseType: !1331, size: 64, align: 64, offset: 256)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!925, !1045, !1334, !1336}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !948, line: 51, baseType: !910)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1319, file: !14, line: 3712, baseType: !1338, size: 64, align: 64, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!925, !1045, !925, !1334, !1336}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1319, file: !14, line: 3726, baseType: !1331, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1319, file: !14, line: 3737, baseType: !1042, size: 64, align: 64, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1319, file: !14, line: 3746, baseType: !925, size: 32, align: 32, offset: 512)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1319, file: !14, line: 3757, baseType: !1345, size: 64, align: 64, offset: 576)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{null, !1348}
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1319, file: !14, line: 3766, baseType: !1042, size: 64, align: 64, offset: 640)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1319, file: !14, line: 3774, baseType: !1042, size: 64, align: 64, offset: 704)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1319, file: !14, line: 3780, baseType: !925, size: 32, align: 32, offset: 768)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1319, file: !14, line: 3785, baseType: !925, size: 32, align: 32, offset: 800)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1319, file: !14, line: 3795, baseType: !1355, size: 64, align: 64, offset: 832)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!925, !1045, !1123}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1047, file: !14, line: 2728, baseType: !964, size: 64, align: 64, offset: 5440)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1047, file: !14, line: 2735, baseType: !1113, size: 512, align: 64, offset: 5504)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1047, file: !14, line: 2742, baseType: !925, size: 32, align: 32, offset: 6016)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1047, file: !14, line: 2755, baseType: !925, size: 32, align: 32, offset: 6048)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1047, file: !14, line: 2776, baseType: !925, size: 32, align: 32, offset: 6080)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1047, file: !14, line: 2783, baseType: !925, size: 32, align: 32, offset: 6112)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1047, file: !14, line: 2791, baseType: !925, size: 32, align: 32, offset: 6144)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1047, file: !14, line: 2802, baseType: !1260, size: 64, align: 64, offset: 6208)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1047, file: !14, line: 2811, baseType: !925, size: 32, align: 32, offset: 6272)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1047, file: !14, line: 2821, baseType: !925, size: 32, align: 32, offset: 6304)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1047, file: !14, line: 2830, baseType: !925, size: 32, align: 32, offset: 6336)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1047, file: !14, line: 2840, baseType: !925, size: 32, align: 32, offset: 6368)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1047, file: !14, line: 2851, baseType: !1371, size: 64, align: 64, offset: 6400)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!925, !1084, !1374, !964, !1182, !925, !925}
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!925, !1084, !964}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1047, file: !14, line: 2871, baseType: !1378, size: 64, align: 64, offset: 6464)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!925, !1084, !1381, !964, !1182, !925}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!925, !1084, !964, !925, !925}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1047, file: !14, line: 2878, baseType: !925, size: 32, align: 32, offset: 6528)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1047, file: !14, line: 2885, baseType: !925, size: 32, align: 32, offset: 6560)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1047, file: !14, line: 3005, baseType: !925, size: 32, align: 32, offset: 6592)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1047, file: !14, line: 3013, baseType: !864, size: 32, align: 32, offset: 6624)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1047, file: !14, line: 3020, baseType: !864, size: 32, align: 32, offset: 6656)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1047, file: !14, line: 3027, baseType: !864, size: 32, align: 32, offset: 6688)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1047, file: !14, line: 3037, baseType: !1069, size: 64, align: 64, offset: 6720)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1047, file: !14, line: 3038, baseType: !925, size: 32, align: 32, offset: 6784)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1047, file: !14, line: 3050, baseType: !947, size: 64, align: 64, offset: 6848)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1047, file: !14, line: 3065, baseType: !925, size: 32, align: 32, offset: 6912)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1047, file: !14, line: 3083, baseType: !925, size: 32, align: 32, offset: 6944)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1047, file: !14, line: 3092, baseType: !929, size: 64, align: 32, offset: 6976)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1047, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1047, file: !14, line: 3106, baseType: !929, size: 64, align: 32, offset: 7072)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1047, file: !14, line: 3113, baseType: !1399, size: 64, align: 64, offset: 7168)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1403)
!1403 = !{!1404, !1405, !1406, !1407, !1408, !1409, !1412}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1402, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1402, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1402, file: !14, line: 720, baseType: !918, size: 64, align: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1402, file: !14, line: 724, baseType: !918, size: 64, align: 64, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1402, file: !14, line: 728, baseType: !925, size: 32, align: 32, offset: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1402, file: !14, line: 734, baseType: !1410, size: 64, align: 64, offset: 256)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1402, file: !14, line: 739, baseType: !1413, size: 64, align: 64, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1047, file: !14, line: 3129, baseType: !978, size: 64, align: 64, offset: 7232)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1047, file: !14, line: 3130, baseType: !978, size: 64, align: 64, offset: 7296)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1047, file: !14, line: 3131, baseType: !978, size: 64, align: 64, offset: 7360)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1047, file: !14, line: 3132, baseType: !978, size: 64, align: 64, offset: 7424)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1047, file: !14, line: 3139, baseType: !1308, size: 64, align: 64, offset: 7488)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1047, file: !14, line: 3147, baseType: !925, size: 32, align: 32, offset: 7552)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1047, file: !14, line: 3165, baseType: !925, size: 32, align: 32, offset: 7584)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1047, file: !14, line: 3172, baseType: !925, size: 32, align: 32, offset: 7616)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1047, file: !14, line: 3180, baseType: !925, size: 32, align: 32, offset: 7648)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1047, file: !14, line: 3191, baseType: !1219, size: 64, align: 64, offset: 7680)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1047, file: !14, line: 3199, baseType: !1069, size: 64, align: 64, offset: 7744)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1047, file: !14, line: 3207, baseType: !1308, size: 64, align: 64, offset: 7808)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1047, file: !14, line: 3214, baseType: !910, size: 32, align: 32, offset: 7872)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1047, file: !14, line: 3224, baseType: !1429, size: 64, align: 64, offset: 7936)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1435}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1431, file: !14, line: 1412, baseType: !1069, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1431, file: !14, line: 1413, baseType: !925, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1431, file: !14, line: 1414, baseType: !873, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1047, file: !14, line: 3225, baseType: !925, size: 32, align: 32, offset: 8000)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1047, file: !14, line: 3249, baseType: !1123, size: 64, align: 64, offset: 8064)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1047, file: !14, line: 3256, baseType: !925, size: 32, align: 32, offset: 8128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1047, file: !14, line: 3271, baseType: !925, size: 32, align: 32, offset: 8160)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1047, file: !14, line: 3279, baseType: !978, size: 64, align: 64, offset: 8192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1047, file: !14, line: 3301, baseType: !1123, size: 64, align: 64, offset: 8256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1047, file: !14, line: 3310, baseType: !925, size: 32, align: 32, offset: 8320)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1047, file: !14, line: 3337, baseType: !925, size: 32, align: 32, offset: 8352)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1047, file: !14, line: 3351, baseType: !925, size: 32, align: 32, offset: 8384)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1047, file: !14, line: 3359, baseType: !925, size: 32, align: 32, offset: 8416)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !915, file: !14, line: 3535, baseType: !1447, size: 64, align: 64, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!925, !1045, !1450}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !915, file: !14, line: 3541, baseType: !1453, size: 64, align: 64, offset: 1088)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1455)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1456)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !915, file: !14, line: 3549, baseType: !1458, size: 64, align: 64, offset: 1152)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !1040}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !915, file: !14, line: 3551, baseType: !1042, size: 64, align: 64, offset: 1216)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !915, file: !14, line: 3552, baseType: !1463, size: 64, align: 64, offset: 1280)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!925, !1045, !1069, !925, !1466}
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473, !1474, !1501}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1468, file: !14, line: 3921, baseType: !1220, size: 16, align: 16)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1468, file: !14, line: 3922, baseType: !1336, size: 32, align: 32, offset: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1468, file: !14, line: 3923, baseType: !1336, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1468, file: !14, line: 3924, baseType: !910, size: 32, align: 32, offset: 96)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1468, file: !14, line: 3925, baseType: !1475, size: 64, align: 64, offset: 128)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1479)
!1479 = !{!1480, !1481, !1482, !1483, !1484, !1485, !1491, !1495, !1497, !1498, !1499, !1500}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1478, file: !14, line: 3886, baseType: !925, size: 32, align: 32)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1478, file: !14, line: 3887, baseType: !925, size: 32, align: 32, offset: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1478, file: !14, line: 3888, baseType: !925, size: 32, align: 32, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1478, file: !14, line: 3889, baseType: !925, size: 32, align: 32, offset: 96)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1478, file: !14, line: 3890, baseType: !925, size: 32, align: 32, offset: 128)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1478, file: !14, line: 3897, baseType: !1486, size: 768, align: 64, offset: 192)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1488)
!1488 = !{!1489, !1490}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1487, file: !14, line: 3855, baseType: !1091, size: 512, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1487, file: !14, line: 3857, baseType: !1095, size: 256, align: 32, offset: 512)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1478, file: !14, line: 3903, baseType: !1492, size: 256, align: 64, offset: 960)
!1492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 256, align: 64, elements: !1493)
!1493 = !{!1494}
!1494 = !DISubrange(count: 4)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1478, file: !14, line: 3904, baseType: !1496, size: 128, align: 32, offset: 1216)
!1496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 128, align: 32, elements: !1493)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1478, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1478, file: !14, line: 3908, baseType: !1308, size: 64, align: 64, offset: 1408)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1478, file: !14, line: 3915, baseType: !1308, size: 64, align: 64, offset: 1472)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1478, file: !14, line: 3917, baseType: !925, size: 32, align: 32, offset: 1536)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1468, file: !14, line: 3926, baseType: !978, size: 64, align: 64, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !915, file: !14, line: 3564, baseType: !1503, size: 64, align: 64, offset: 1344)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!925, !1045, !1506, !1085, !1182}
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1508)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1509)
!1509 = !{!1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1508, file: !14, line: 1451, baseType: !1123, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1508, file: !14, line: 1461, baseType: !978, size: 64, align: 64, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1508, file: !14, line: 1467, baseType: !978, size: 64, align: 64, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1508, file: !14, line: 1468, baseType: !1069, size: 64, align: 64, offset: 192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1508, file: !14, line: 1469, baseType: !925, size: 32, align: 32, offset: 256)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1508, file: !14, line: 1470, baseType: !925, size: 32, align: 32, offset: 288)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1508, file: !14, line: 1474, baseType: !925, size: 32, align: 32, offset: 320)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1508, file: !14, line: 1479, baseType: !1429, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1508, file: !14, line: 1480, baseType: !925, size: 32, align: 32, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1508, file: !14, line: 1486, baseType: !978, size: 64, align: 64, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1508, file: !14, line: 1488, baseType: !978, size: 64, align: 64, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1508, file: !14, line: 1497, baseType: !978, size: 64, align: 64, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !915, file: !14, line: 3566, baseType: !1523, size: 64, align: 64, offset: 1408)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!925, !1045, !964, !1182, !1506}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !915, file: !14, line: 3567, baseType: !1042, size: 64, align: 64, offset: 1472)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !915, file: !14, line: 3576, baseType: !1528, size: 64, align: 64, offset: 1536)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!925, !1045, !1085}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !915, file: !14, line: 3577, baseType: !1532, size: 64, align: 64, offset: 1600)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!925, !1045, !1506}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !915, file: !14, line: 3584, baseType: !1327, size: 64, align: 64, offset: 1664)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !915, file: !14, line: 3589, baseType: !1537, size: 64, align: 64, offset: 1728)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{null, !1045}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !915, file: !14, line: 3594, baseType: !925, size: 32, align: 32, offset: 1792)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !915, file: !14, line: 3600, baseType: !918, size: 64, align: 64, offset: 1856)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !915, file: !14, line: 3609, baseType: !1543, size: 64, align: 64, offset: 1920)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1546)
!1546 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1547 = distinct !DIGlobalVariable(name: "ff_vplayer_decoder", scope: !0, file: !913, line: 110, type: !914, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_vplayer_decoder)
!1548 = distinct !DIGlobalVariable(name: "ff_stl_decoder", scope: !0, file: !913, line: 127, type: !914, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_stl_decoder)
!1549 = distinct !DIGlobalVariable(name: "ff_pjs_decoder", scope: !0, file: !913, line: 144, type: !914, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_pjs_decoder)
!1550 = distinct !DIGlobalVariable(name: "ff_subviewer1_decoder", scope: !0, file: !913, line: 161, type: !914, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_subviewer1_decoder)
!1551 = distinct !DIGlobalVariable(name: "text_decoder_class", scope: !0, file: !913, line: 82, type: !955, isLocal: true, isDefinition: true, variable: %struct.AVClass* @text_decoder_class)
!1552 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !913, line: 40, type: !1553, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @options)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1554, size: 1024, align: 64, elements: !1556)
!1554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1555)
!1555 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !691, line: 301, baseType: !968)
!1556 = !{!1557}
!1557 = !DISubrange(count: 2)
!1558 = distinct !DIGlobalVariable(name: "vplayer_decoder_class", scope: !0, file: !913, line: 108, type: !955, isLocal: true, isDefinition: true, variable: %struct.AVClass* @vplayer_decoder_class)
!1559 = distinct !DIGlobalVariable(name: "stl_decoder_class", scope: !0, file: !913, line: 125, type: !955, isLocal: true, isDefinition: true, variable: %struct.AVClass* @stl_decoder_class)
!1560 = distinct !DIGlobalVariable(name: "pjs_decoder_class", scope: !0, file: !913, line: 142, type: !955, isLocal: true, isDefinition: true, variable: %struct.AVClass* @pjs_decoder_class)
!1561 = distinct !DIGlobalVariable(name: "subviewer1_decoder_class", scope: !0, file: !913, line: 159, type: !955, isLocal: true, isDefinition: true, variable: %struct.AVClass* @subviewer1_decoder_class)
!1562 = !{i32 2, !"Dwarf Version", i32 4}
!1563 = !{i32 2, !"Debug Info Version", i32 3}
!1564 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1565 = distinct !DISubprogram(name: "text_decode_frame", scope: !913, file: !913, line: 45, type: !1524, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1566)
!1566 = !{}
!1567 = !DILocalVariable(name: "avctx", arg: 1, scope: !1565, file: !913, line: 45, type: !1045)
!1568 = !DIExpression()
!1569 = !DILocation(line: 45, column: 46, scope: !1565)
!1570 = !DILocalVariable(name: "data", arg: 2, scope: !1565, file: !913, line: 45, type: !964)
!1571 = !DILocation(line: 45, column: 59, scope: !1565)
!1572 = !DILocalVariable(name: "got_sub_ptr", arg: 3, scope: !1565, file: !913, line: 46, type: !1182)
!1573 = !DILocation(line: 46, column: 35, scope: !1565)
!1574 = !DILocalVariable(name: "avpkt", arg: 4, scope: !1565, file: !913, line: 46, type: !1506)
!1575 = !DILocation(line: 46, column: 58, scope: !1565)
!1576 = !DILocalVariable(name: "ret", scope: !1565, file: !913, line: 48, type: !925)
!1577 = !DILocation(line: 48, column: 9, scope: !1565)
!1578 = !DILocalVariable(name: "buf", scope: !1565, file: !913, line: 49, type: !1579)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1580, line: 82, baseType: !1581)
!1580 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1580, line: 82, size: 8192, align: 64, elements: !1582)
!1582 = !{!1583, !1584, !1585, !1586, !1587, !1591}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1581, file: !1580, line: 82, baseType: !1308, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1581, file: !1580, line: 82, baseType: !910, size: 32, align: 32, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1581, file: !1580, line: 82, baseType: !910, size: 32, align: 32, offset: 96)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1581, file: !1580, line: 82, baseType: !910, size: 32, align: 32, offset: 128)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1581, file: !1580, line: 82, baseType: !1588, size: 8, align: 8, offset: 160)
!1588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 8, align: 8, elements: !1589)
!1589 = !{!1590}
!1590 = !DISubrange(count: 1)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1581, file: !1580, line: 82, baseType: !1592, size: 8000, align: 8, offset: 168)
!1592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 8000, align: 8, elements: !1593)
!1593 = !{!1594}
!1594 = !DISubrange(count: 1000)
!1595 = !DILocation(line: 49, column: 14, scope: !1565)
!1596 = !DILocalVariable(name: "sub", scope: !1565, file: !913, line: 50, type: !1597)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1468)
!1599 = !DILocation(line: 50, column: 17, scope: !1565)
!1600 = !DILocation(line: 50, column: 23, scope: !1565)
!1601 = !DILocalVariable(name: "ptr", scope: !1565, file: !913, line: 51, type: !918)
!1602 = !DILocation(line: 51, column: 17, scope: !1565)
!1603 = !DILocation(line: 51, column: 23, scope: !1565)
!1604 = !DILocation(line: 51, column: 30, scope: !1565)
!1605 = !DILocalVariable(name: "text", scope: !1565, file: !913, line: 52, type: !1606)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextContext", file: !913, line: 36, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !913, line: 31, size: 192, align: 64, elements: !1609)
!1609 = !{!1610, !1612, !1613, !1614}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1608, file: !913, line: 32, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "linebreaks", scope: !1608, file: !913, line: 33, baseType: !918, size: 64, align: 64, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "keep_ass_markup", scope: !1608, file: !913, line: 34, baseType: !925, size: 32, align: 32, offset: 128)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1608, file: !913, line: 35, baseType: !925, size: 32, align: 32, offset: 160)
!1615 = !DILocation(line: 52, column: 18, scope: !1565)
!1616 = !DILocation(line: 52, column: 25, scope: !1565)
!1617 = !DILocation(line: 52, column: 32, scope: !1565)
!1618 = !DILocation(line: 54, column: 5, scope: !1565)
!1619 = !DILocation(line: 55, column: 9, scope: !1620)
!1620 = distinct !DILexicalBlock(scope: !1565, file: !913, line: 55, column: 9)
!1621 = !DILocation(line: 55, column: 13, scope: !1620)
!1622 = !DILocation(line: 55, column: 16, scope: !1623)
!1623 = !DILexicalBlockFile(scope: !1620, file: !913, discriminator: 1)
!1624 = !DILocation(line: 55, column: 23, scope: !1623)
!1625 = !DILocation(line: 55, column: 28, scope: !1623)
!1626 = !DILocation(line: 55, column: 32, scope: !1623)
!1627 = !DILocation(line: 55, column: 36, scope: !1628)
!1628 = !DILexicalBlockFile(scope: !1620, file: !913, discriminator: 2)
!1629 = !DILocation(line: 55, column: 35, scope: !1628)
!1630 = !DILocation(line: 55, column: 9, scope: !1628)
!1631 = !DILocation(line: 56, column: 40, scope: !1632)
!1632 = distinct !DILexicalBlock(scope: !1620, file: !913, line: 55, column: 41)
!1633 = !DILocation(line: 56, column: 45, scope: !1632)
!1634 = !DILocation(line: 56, column: 52, scope: !1632)
!1635 = !DILocation(line: 56, column: 58, scope: !1632)
!1636 = !DILocation(line: 56, column: 64, scope: !1632)
!1637 = !DILocation(line: 56, column: 76, scope: !1632)
!1638 = !DILocation(line: 56, column: 82, scope: !1632)
!1639 = !DILocation(line: 56, column: 9, scope: !1632)
!1640 = !DILocation(line: 57, column: 31, scope: !1632)
!1641 = !DILocation(line: 57, column: 40, scope: !1632)
!1642 = !DILocation(line: 57, column: 45, scope: !1632)
!1643 = !DILocation(line: 57, column: 51, scope: !1632)
!1644 = !DILocation(line: 57, column: 60, scope: !1632)
!1645 = !DILocation(line: 57, column: 15, scope: !1632)
!1646 = !DILocation(line: 57, column: 13, scope: !1632)
!1647 = !DILocation(line: 58, column: 5, scope: !1632)
!1648 = !DILocation(line: 59, column: 5, scope: !1565)
!1649 = !DILocation(line: 60, column: 9, scope: !1650)
!1650 = distinct !DILexicalBlock(scope: !1565, file: !913, line: 60, column: 9)
!1651 = !DILocation(line: 60, column: 13, scope: !1650)
!1652 = !DILocation(line: 60, column: 9, scope: !1565)
!1653 = !DILocation(line: 61, column: 16, scope: !1650)
!1654 = !DILocation(line: 61, column: 9, scope: !1650)
!1655 = !DILocation(line: 62, column: 20, scope: !1565)
!1656 = !DILocation(line: 62, column: 25, scope: !1565)
!1657 = !DILocation(line: 62, column: 35, scope: !1565)
!1658 = !DILocation(line: 62, column: 6, scope: !1565)
!1659 = !DILocation(line: 62, column: 18, scope: !1565)
!1660 = !DILocation(line: 63, column: 12, scope: !1565)
!1661 = !DILocation(line: 63, column: 19, scope: !1565)
!1662 = !DILocation(line: 63, column: 5, scope: !1565)
!1663 = !DILocation(line: 64, column: 1, scope: !1565)
!1664 = distinct !DISubprogram(name: "text_flush", scope: !913, file: !913, line: 66, type: !1538, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1566)
!1665 = !DILocalVariable(name: "avctx", arg: 1, scope: !1664, file: !913, line: 66, type: !1045)
!1666 = !DILocation(line: 66, column: 40, scope: !1664)
!1667 = !DILocalVariable(name: "text", scope: !1664, file: !913, line: 68, type: !1606)
!1668 = !DILocation(line: 68, column: 18, scope: !1664)
!1669 = !DILocation(line: 68, column: 25, scope: !1664)
!1670 = !DILocation(line: 68, column: 32, scope: !1664)
!1671 = !DILocation(line: 69, column: 11, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1664, file: !913, line: 69, column: 9)
!1673 = !DILocation(line: 69, column: 18, scope: !1672)
!1674 = !DILocation(line: 69, column: 25, scope: !1672)
!1675 = !DILocation(line: 69, column: 9, scope: !1664)
!1676 = !DILocation(line: 70, column: 9, scope: !1672)
