; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--ac3.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AC3BitAllocParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@ff_ac3_band_start_tab = constant [51 x i8] c"\00\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A\1B\1C\1F\22%(+.17=CIOUamy\85\9D\B5\CD\E5\FD", align 16
@ff_ac3_bin_to_band_tab = constant [253 x i8] c"\00\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A\1B\1C\1C\1C\1D\1D\1D\1E\1E\1E\1F\1F\1F   !!!\22\22\22######$$$$$$%%%%%%&&&&&&''''''(((((())))))))))))************++++++++++++,,,,,,,,,,,,------------------------........................////////////////////////000000000000000000000000111111111111111111111111", align 16
@ff_ac3_log_add_tab = external constant [260 x i8], align 16
@ff_ac3_hearing_threshold_tab = external constant [50 x [3 x i16]], align 16

; Function Attrs: nounwind uwtable
define void @ff_ac3_bit_alloc_calc_psd(i8* %exp, i32 %start, i32 %end, i16* %psd, i16* %band_psd) #0 !dbg !30 {
entry:
  %exp.addr = alloca i8*, align 8
  %start.addr = alloca i32, align 4
  %end.addr = alloca i32, align 4
  %psd.addr = alloca i16*, align 8
  %band_psd.addr = alloca i16*, align 8

!97 = !DILocation(line: 107, column: 25, scope: !88)
!98 = !DILocation(line: 107, column: 60, scope: !88)
!99 = !DILocation(line: 107, column: 57, scope: !88)
!100 = !DILocation(line: 107, column: 68, scope: !101)
!101 = !DILexicalBlockFile(scope: !88, file: !15, discriminator: 1)
!102 = !DILocation(line: 107, column: 25, scope: !101)
!103 = !DILocation(line: 107, column: 98, scope: !104)
!104 = !DILexicalBlockFile(scope: !88, file: !15, discriminator: 2)
!105 = !DILocation(line: 107, column: 102, scope: !104)
!106 = !DILocation(line: 107, column: 76, scope: !104)
!107 = !DILocation(line: 107, column: 75, scope: !104)
!108 = !DILocation(line: 107, column: 25, scope: !104)
!109 = !DILocation(line: 107, column: 25, scope: !110)
!110 = !DILexicalBlockFile(scope: !88, file: !15, discriminator: 3)
!111 = !DILocation(line: 107, column: 13, scope: !110)
!112 = !DILocation(line: 108, column: 9, scope: !88)
!113 = !DILocation(line: 108, column: 16, scope: !114)
!114 = !DILexicalBlockFile(scope: !115, file: !15, discriminator: 1)
!115 = distinct !DILexicalBlock(scope: !116, file: !15, line: 108, column: 9)
!116 = distinct !DILexicalBlock(scope: !88, file: !15, line: 108, column: 9)
!117 = !DILocation(line: 108, column: 22, scope: !114)
!118 = !DILocation(line: 108, column: 20, scope: !114)
!119 = !DILocation(line: 108, column: 9, scope: !114)
!120 = !DILocalVariable(name: "max", scope: !121, file: !15, line: 109, type: !11)
!121 = distinct !DILexicalBlock(scope: !115, file: !15, line: 108, column: 39)
!122 = !DILocation(line: 109, column: 17, scope: !121)
!123 = !DILocation(line: 109, column: 25, scope: !121)
!124 = !DILocation(line: 109, column: 35, scope: !121)
!125 = !DILocation(line: 109, column: 31, scope: !121)
!126 = !DILocation(line: 109, column: 30, scope: !121)
!127 = !DILocation(line: 109, column: 28, scope: !121)
!128 = !DILocation(line: 109, column: 24, scope: !121)
!129 = !DILocation(line: 109, column: 44, scope: !130)
!130 = !DILexicalBlockFile(scope: !121, file: !15, discriminator: 1)
!131 = !DILocation(line: 109, column: 24, scope: !130)
!132 = !DILocation(line: 109, column: 54, scope: !133)
!133 = !DILexicalBlockFile(scope: !121, file: !15, discriminator: 2)
!134 = !DILocation(line: 109, column: 50, scope: !133)
!135 = !DILocation(line: 109, column: 49, scope: !133)
!136 = !DILocation(line: 109, column: 24, scope: !133)
!137 = !DILocation(line: 109, column: 24, scope: !138)
!138 = !DILexicalBlockFile(scope: !121, file: !15, discriminator: 3)
!139 = !DILocation(line: 109, column: 17, scope: !138)
!140 = !DILocalVariable(name: "adr", scope: !121, file: !15, line: 111, type: !11)
!141 = !DILocation(line: 111, column: 17, scope: !121)
!142 = !DILocation(line: 111, column: 25, scope: !121)
!143 = !DILocation(line: 111, column: 33, scope: !121)
!144 = !DILocation(line: 111, column: 41, scope: !121)
!145 = !DILocation(line: 111, column: 37, scope: !121)
!146 = !DILocation(line: 111, column: 35, scope: !121)
!147 = !DILocation(line: 111, column: 46, scope: !121)
!148 = !DILocation(line: 111, column: 51, scope: !121)
!149 = !DILocation(line: 111, column: 29, scope: !121)
!150 = !DILocation(line: 111, column: 58, scope: !121)
!151 = !DILocation(line: 111, column: 24, scope: !121)
!152 = !DILocation(line: 111, column: 24, scope: !130)
!153 = !DILocation(line: 111, column: 77, scope: !133)
!154 = !DILocation(line: 111, column: 85, scope: !133)
!155 = !DILocation(line: 111, column: 93, scope: !133)
!156 = !DILocation(line: 111, column: 89, scope: !133)
!157 = !DILocation(line: 111, column: 87, scope: !133)
!158 = !DILocation(line: 111, column: 98, scope: !133)
!159 = !DILocation(line: 111, column: 103, scope: !133)
!160 = !DILocation(line: 111, column: 81, scope: !133)
!161 = !DILocation(line: 111, column: 24, scope: !133)
!162 = !DILocation(line: 111, column: 24, scope: !138)
!163 = !DILocation(line: 111, column: 17, scope: !138)
!164 = !DILocation(line: 112, column: 17, scope: !121)
!165 = !DILocation(line: 112, column: 42, scope: !121)
!166 = !DILocation(line: 112, column: 23, scope: !121)
!167 = !DILocation(line: 112, column: 21, scope: !121)
!168 = !DILocation(line: 112, column: 15, scope: !121)
!169 = !DILocation(line: 113, column: 9, scope: !121)
!170 = !DILocation(line: 108, column: 35, scope: !171)
!171 = !DILexicalBlockFile(scope: !115, file: !15, discriminator: 2)
!172 = !DILocation(line: 108, column: 9, scope: !171)
!173 = distinct !{!173, !112}
!174 = !DILocation(line: 114, column: 28, scope: !88)
!175 = !DILocation(line: 114, column: 22, scope: !88)
!176 = !DILocation(line: 114, column: 9, scope: !88)
!177 = !DILocation(line: 114, column: 26, scope: !88)
!178 = !DILocation(line: 115, column: 5, scope: !88)
!179 = !DILocation(line: 115, column: 14, scope: !180)
!180 = !DILexicalBlockFile(scope: !30, file: !15, discriminator: 1)
!181 = !DILocation(line: 115, column: 42, scope: !180)
!182 = !DILocation(line: 115, column: 20, scope: !180)
!183 = !DILocation(line: 115, column: 18, scope: !180)
!184 = !DILocation(line: 115, column: 5, scope: !180)
!185 = !DILocation(line: 116, column: 1, scope: !30)
!186 = distinct !DISubprogram(name: "ff_ac3_bit_alloc_calc_mask", scope: !15, file: !15, line: 118, type: !187, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !39)
!187 = !DISubroutineType(types: !188)
!188 = !{!11, !189, !36, !11, !11, !11, !11, !11, !11, !202, !202, !202, !36}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AC3BitAllocParameters", file: !4, line: 171, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AC3BitAllocParameters", file: !4, line: 166, size: 288, align: 32, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sr_code", scope: !191, file: !4, line: 167, baseType: !11, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sr_shift", scope: !191, file: !4, line: 168, baseType: !11, size: 32, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "slow_gain", scope: !191, file: !4, line: 169, baseType: !11, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "slow_decay", scope: !191, file: !4, line: 169, baseType: !11, size: 32, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fast_decay", scope: !191, file: !4, line: 169, baseType: !11, size: 32, align: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "db_per_bit", scope: !191, file: !4, line: 169, baseType: !11, size: 32, align: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "floor", scope: !191, file: !4, line: 169, baseType: !11, size: 32, align: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cpl_fast_leak", scope: !191, file: !4, line: 170, baseType: !11, size: 32, align: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cpl_slow_leak", scope: !191, file: !4, line: 170, baseType: !11, size: 32, align: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!203 = !DILocalVariable(name: "s", arg: 1, scope: !186, file: !15, line: 118, type: !189)
!204 = !DILocation(line: 118, column: 55, scope: !186)
!205 = !DILocalVariable(name: "band_psd", arg: 2, scope: !186, file: !15, line: 118, type: !36)
!206 = !DILocation(line: 118, column: 67, scope: !186)
!207 = !DILocalVariable(name: "start", arg: 3, scope: !186, file: !15, line: 119, type: !11)
!208 = !DILocation(line: 119, column: 36, scope: !186)
!209 = !DILocalVariable(name: "end", arg: 4, scope: !186, file: !15, line: 119, type: !11)
!210 = !DILocation(line: 119, column: 47, scope: !186)
!211 = !DILocalVariable(name: "fast_gain", arg: 5, scope: !186, file: !15, line: 119, type: !11)
!212 = !DILocation(line: 119, column: 56, scope: !186)
!213 = !DILocalVariable(name: "is_lfe", arg: 6, scope: !186, file: !15, line: 119, type: !11)
!214 = !DILocation(line: 119, column: 71, scope: !186)
!215 = !DILocalVariable(name: "dba_mode", arg: 7, scope: !186, file: !15, line: 120, type: !11)
!216 = !DILocation(line: 120, column: 36, scope: !186)
!217 = !DILocalVariable(name: "dba_nsegs", arg: 8, scope: !186, file: !15, line: 120, type: !11)
!218 = !DILocation(line: 120, column: 50, scope: !186)
!219 = !DILocalVariable(name: "dba_offsets", arg: 9, scope: !186, file: !15, line: 120, type: !202)
!220 = !DILocation(line: 120, column: 70, scope: !186)
!221 = !DILocalVariable(name: "dba_lengths", arg: 10, scope: !186, file: !15, line: 121, type: !202)
!222 = !DILocation(line: 121, column: 41, scope: !186)
!223 = !DILocalVariable(name: "dba_values", arg: 11, scope: !186, file: !15, line: 121, type: !202)
!224 = !DILocation(line: 121, column: 63, scope: !186)
!225 = !DILocalVariable(name: "mask", arg: 12, scope: !186, file: !15, line: 122, type: !36)
!226 = !DILocation(line: 122, column: 41, scope: !186)
!227 = !DILocalVariable(name: "excite", scope: !186, file: !15, line: 124, type: !228)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 800, align: 16, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 50)
!231 = !DILocation(line: 124, column: 13, scope: !186)
!232 = !DILocalVariable(name: "band", scope: !186, file: !15, line: 125, type: !11)
!233 = !DILocation(line: 125, column: 9, scope: !186)
!234 = !DILocalVariable(name: "band_start", scope: !186, file: !15, line: 126, type: !11)
!235 = !DILocation(line: 126, column: 9, scope: !186)
!236 = !DILocalVariable(name: "band_end", scope: !186, file: !15, line: 126, type: !11)
!237 = !DILocation(line: 126, column: 21, scope: !186)
!238 = !DILocalVariable(name: "begin", scope: !186, file: !15, line: 126, type: !11)
!239 = !DILocation(line: 126, column: 31, scope: !186)
!240 = !DILocalVariable(name: "end1", scope: !186, file: !15, line: 126, type: !11)
!241 = !DILocation(line: 126, column: 38, scope: !186)
!242 = !DILocalVariable(name: "lowcomp", scope: !186, file: !15, line: 127, type: !11)
!243 = !DILocation(line: 127, column: 9, scope: !186)
!244 = !DILocalVariable(name: "fastleak", scope: !186, file: !15, line: 127, type: !11)
!245 = !DILocation(line: 127, column: 18, scope: !186)
!246 = !DILocalVariable(name: "slowleak", scope: !186, file: !15, line: 127, type: !11)
!247 = !DILocation(line: 127, column: 28, scope: !186)
!248 = !DILocation(line: 129, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !186, file: !15, line: 129, column: 9)
!250 = !DILocation(line: 129, column: 13, scope: !249)
!251 = !DILocation(line: 129, column: 9, scope: !186)
!252 = !DILocation(line: 130, column: 9, scope: !249)
!253 = !DILocation(line: 133, column: 41, scope: !186)
!254 = !DILocation(line: 133, column: 18, scope: !186)
!255 = !DILocation(line: 133, column: 16, scope: !186)
!256 = !DILocation(line: 134, column: 39, scope: !186)
