; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--on2avc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--on2avc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!837 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!838 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!839 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!840 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!841 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!842 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!843 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!844 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!845 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!846 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!847 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!848 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!849 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!850 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!851 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "WindowTypes", file: !898, line: 36, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/on2avc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907}
!900 = !DIEnumerator(name: "WINDOW_TYPE_LONG", value: 0)
!901 = !DIEnumerator(name: "WINDOW_TYPE_LONG_STOP", value: 1)
!902 = !DIEnumerator(name: "WINDOW_TYPE_LONG_START", value: 2)
!903 = !DIEnumerator(name: "WINDOW_TYPE_8SHORT", value: 3)
!904 = !DIEnumerator(name: "WINDOW_TYPE_EXT4", value: 4)
!905 = !DIEnumerator(name: "WINDOW_TYPE_EXT5", value: 5)
!906 = !DIEnumerator(name: "WINDOW_TYPE_EXT6", value: 6)
!907 = !DIEnumerator(name: "WINDOW_TYPE_EXT7", value: 7)
!908 = !{!909, !910, !911, !920, !928, !930, !931, !932}
!909 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!910 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !913, line: 39, baseType: !914)
!913 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !913, line: 37, size: 64, align: 32, elements: !915)
!915 = !{!916, !919}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !914, file: !913, line: 38, baseType: !917, size: 32, align: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !913, line: 35, baseType: !918)
!918 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !914, file: !913, line: 38, baseType: !917, size: 32, align: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !923, line: 221, size: 32, align: 8, elements: !924)
!923 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !922, file: !923, line: 221, baseType: !926, size: 32, align: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !910)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !929)
!929 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !923, line: 222, size: 16, align: 8, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !934, file: !923, line: 222, baseType: !937, size: 16, align: 16)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !938)
!938 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!939 = !{!940}
!940 = distinct !DIGlobalVariable(name: "ff_on2avc_decoder", scope: !0, file: !898, line: 1011, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_on2avc_decoder)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !943)
!943 = !{!944, !948, !949, !950, !951, !952, !961, !964, !967, !970, !975, !976, !1017, !1025, !1026, !1027, !1029, !1579, !1585, !1593, !1597, !1598, !1635, !1639, !1643, !1644, !1648, !1652, !1653, !1657, !1658, !1659}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !14, line: 3475, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !942, file: !14, line: 3480, baseType: !945, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !942, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !942, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !942, file: !14, line: 3487, baseType: !909, size: 32, align: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !942, file: !14, line: 3488, baseType: !953, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !956, line: 61, baseType: !957)
!956 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !956, line: 58, size: 64, align: 32, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !957, file: !956, line: 59, baseType: !909, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !957, file: !956, line: 60, baseType: !909, size: 32, align: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !942, file: !14, line: 3489, baseType: !962, size: 64, align: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !942, file: !14, line: 3490, baseType: !965, size: 64, align: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !942, file: !14, line: 3491, baseType: !968, size: 64, align: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !942, file: !14, line: 3492, baseType: !971, size: 64, align: 64, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !974)
!974 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !942, file: !14, line: 3493, baseType: !928, size: 8, align: 8, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !942, file: !14, line: 3494, baseType: !977, size: 64, align: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !981)
!981 = !{!982, !983, !987, !991, !992, !993, !994, !998, !1004, !1006, !1010}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !980, file: !691, line: 72, baseType: !945, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !980, file: !691, line: 78, baseType: !984, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!945, !930}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !980, file: !691, line: 85, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !980, file: !691, line: 93, baseType: !909, size: 32, align: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !980, file: !691, line: 99, baseType: !909, size: 32, align: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !980, file: !691, line: 108, baseType: !909, size: 32, align: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !980, file: !691, line: 113, baseType: !995, size: 64, align: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!930, !930, !930}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !980, file: !691, line: 123, baseType: !999, size: 64, align: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!1002, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !980, file: !691, line: 130, baseType: !1005, size: 32, align: 32, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !980, file: !691, line: 136, baseType: !1007, size: 64, align: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1005, !930}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !980, file: !691, line: 142, baseType: !1011, size: 64, align: 64, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!909, !1014, !930, !945, !909}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !942, file: !14, line: 3495, baseType: !1018, size: 64, align: 64, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1021, file: !14, line: 3402, baseType: !909, size: 32, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1021, file: !14, line: 3403, baseType: !945, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !942, file: !14, line: 3507, baseType: !945, size: 64, align: 64, offset: 768)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !942, file: !14, line: 3516, baseType: !909, size: 32, align: 32, offset: 832)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !14, line: 3517, baseType: !1028, size: 64, align: 64, offset: 896)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !942, file: !14, line: 3527, baseType: !1030, size: 64, align: 64, offset: 960)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!909, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1043, !1044, !1045, !1046, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1328, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1517, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1035, file: !14, line: 1561, baseType: !977, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1035, file: !14, line: 1562, baseType: !909, size: 32, align: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1035, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1035, file: !14, line: 1565, baseType: !1041, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1035, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1035, file: !14, line: 1581, baseType: !910, size: 32, align: 32, offset: 224)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1035, file: !14, line: 1583, baseType: !930, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1035, file: !14, line: 1591, baseType: !1047, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1049, line: 129, size: 1664, align: 64, elements: !1050)
!1049 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1050 = !{!1051, !1052, !1053, !1054, !1154, !1175, !1176, !1205, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1048, file: !1049, line: 136, baseType: !909, size: 32, align: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1048, file: !1049, line: 151, baseType: !909, size: 32, align: 32, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1048, file: !1049, line: 157, baseType: !909, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1048, file: !1049, line: 159, baseType: !1055, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1058)
!1058 = !{!1059, !1064, !1066, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1106, !1108, !1109, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1142, !1143, !1144, !1145, !1146, !1147, !1150, !1151, !1152, !1153}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1057, file: !722, line: 282, baseType: !1060, size: 512, align: 64)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 512, align: 64, elements: !1062)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1062 = !{!1063}
!1063 = !DISubrange(count: 8)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1057, file: !722, line: 299, baseType: !1065, size: 256, align: 32, offset: 512)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 256, align: 32, elements: !1062)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1057, file: !722, line: 315, baseType: !1067, size: 64, align: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1057, file: !722, line: 326, baseType: !909, size: 32, align: 32, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1057, file: !722, line: 326, baseType: !909, size: 32, align: 32, offset: 864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1057, file: !722, line: 334, baseType: !909, size: 32, align: 32, offset: 896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1057, file: !722, line: 341, baseType: !909, size: 32, align: 32, offset: 928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1057, file: !722, line: 346, baseType: !909, size: 32, align: 32, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1057, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1057, file: !722, line: 356, baseType: !955, size: 64, align: 32, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1057, file: !722, line: 361, baseType: !1076, size: 64, align: 64, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !1077)
!1077 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1057, file: !722, line: 369, baseType: !1076, size: 64, align: 64, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1057, file: !722, line: 377, baseType: !1076, size: 64, align: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1057, file: !722, line: 382, baseType: !909, size: 32, align: 32, offset: 1280)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1057, file: !722, line: 386, baseType: !909, size: 32, align: 32, offset: 1312)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1057, file: !722, line: 391, baseType: !909, size: 32, align: 32, offset: 1344)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1057, file: !722, line: 396, baseType: !930, size: 64, align: 64, offset: 1408)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1057, file: !722, line: 403, baseType: !1085, size: 512, align: 64, offset: 1472)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 64, elements: !1062)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1057, file: !722, line: 410, baseType: !909, size: 32, align: 32, offset: 1984)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1057, file: !722, line: 415, baseType: !909, size: 32, align: 32, offset: 2016)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1057, file: !722, line: 420, baseType: !909, size: 32, align: 32, offset: 2048)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1057, file: !722, line: 425, baseType: !909, size: 32, align: 32, offset: 2080)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1057, file: !722, line: 435, baseType: !1076, size: 64, align: 64, offset: 2112)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1057, file: !722, line: 440, baseType: !909, size: 32, align: 32, offset: 2176)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1057, file: !722, line: 445, baseType: !973, size: 64, align: 64, offset: 2240)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1057, file: !722, line: 459, baseType: !1094, size: 512, align: 64, offset: 2304)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 512, align: 64, elements: !1062)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1097, line: 94, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1097, line: 81, size: 192, align: 64, elements: !1099)
!1099 = !{!1100, !1104, !1105}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1098, file: !1097, line: 82, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1097, line: 73, baseType: !1103)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1097, line: 73, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !1097, line: 89, baseType: !1061, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !1097, line: 93, baseType: !909, size: 32, align: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1057, file: !722, line: 473, baseType: !1107, size: 64, align: 64, offset: 2816)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1057, file: !722, line: 477, baseType: !909, size: 32, align: 32, offset: 2880)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1057, file: !722, line: 479, baseType: !1110, size: 64, align: 64, offset: 2944)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1123}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1113, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !722, line: 203, baseType: !1061, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !722, line: 204, baseType: !909, size: 32, align: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1113, file: !722, line: 205, baseType: !1119, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1121, line: 86, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1121, line: 86, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1113, file: !722, line: 206, baseType: !1095, size: 64, align: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1057, file: !722, line: 480, baseType: !909, size: 32, align: 32, offset: 3008)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !722, line: 505, baseType: !909, size: 32, align: 32, offset: 3040)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1057, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1057, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1057, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1057, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1057, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1057, file: !722, line: 532, baseType: !1076, size: 64, align: 64, offset: 3264)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1057, file: !722, line: 539, baseType: !1076, size: 64, align: 64, offset: 3328)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1057, file: !722, line: 547, baseType: !1076, size: 64, align: 64, offset: 3392)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1057, file: !722, line: 554, baseType: !1119, size: 64, align: 64, offset: 3456)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1057, file: !722, line: 563, baseType: !909, size: 32, align: 32, offset: 3520)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1057, file: !722, line: 572, baseType: !909, size: 32, align: 32, offset: 3552)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1057, file: !722, line: 581, baseType: !909, size: 32, align: 32, offset: 3584)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1057, file: !722, line: 588, baseType: !1139, size: 64, align: 64, offset: 3648)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1141)
!1141 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1057, file: !722, line: 593, baseType: !909, size: 32, align: 32, offset: 3712)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1057, file: !722, line: 596, baseType: !909, size: 32, align: 32, offset: 3744)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1057, file: !722, line: 599, baseType: !1095, size: 64, align: 64, offset: 3776)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1057, file: !722, line: 605, baseType: !1095, size: 64, align: 64, offset: 3840)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1057, file: !722, line: 616, baseType: !1095, size: 64, align: 64, offset: 3904)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1057, file: !722, line: 626, baseType: !1148, size: 64, align: 64, offset: 3968)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1149, line: 216, baseType: !974)
!1149 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1057, file: !722, line: 627, baseType: !1148, size: 64, align: 64, offset: 4032)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1057, file: !722, line: 628, baseType: !1148, size: 64, align: 64, offset: 4096)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1057, file: !722, line: 629, baseType: !1148, size: 64, align: 64, offset: 4160)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1057, file: !722, line: 645, baseType: !1095, size: 64, align: 64, offset: 4224)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1048, file: !1049, line: 161, baseType: !1155, size: 64, align: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1049, line: 117, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1049, line: 100, size: 832, align: 64, elements: !1158)
!1158 = !{!1159, !1166, !1167, !1168, !1169, !1170, !1172, !1173, !1174}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1157, file: !1049, line: 105, baseType: !1160, size: 256, align: 64)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 256, align: 64, elements: !1164)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1097, line: 238, baseType: !1163)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1097, line: 238, flags: DIFlagFwdDecl)
!1164 = !{!1165}
!1165 = !DISubrange(count: 4)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1157, file: !1049, line: 110, baseType: !909, size: 32, align: 32, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1157, file: !1049, line: 111, baseType: !909, size: 32, align: 32, offset: 288)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1157, file: !1049, line: 111, baseType: !909, size: 32, align: 32, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1157, file: !1049, line: 112, baseType: !1065, size: 256, align: 32, offset: 352)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1157, file: !1049, line: 113, baseType: !1171, size: 128, align: 32, offset: 608)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, align: 32, elements: !1164)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1157, file: !1049, line: 114, baseType: !909, size: 32, align: 32, offset: 736)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1157, file: !1049, line: 115, baseType: !909, size: 32, align: 32, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1157, file: !1049, line: 116, baseType: !909, size: 32, align: 32, offset: 800)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1048, file: !1049, line: 163, baseType: !930, size: 64, align: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1048, file: !1049, line: 165, baseType: !1177, size: 128, align: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1049, line: 122, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1049, line: 119, size: 128, align: 64, elements: !1179)
!1179 = !{!1180, !1204}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1178, file: !1049, line: 120, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1200, !1201, !1202, !1203}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1183, file: !14, line: 1451, baseType: !1095, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1183, file: !14, line: 1461, baseType: !1076, size: 64, align: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1183, file: !14, line: 1467, baseType: !1076, size: 64, align: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !14, line: 1468, baseType: !1061, size: 64, align: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1183, file: !14, line: 1469, baseType: !909, size: 32, align: 32, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1183, file: !14, line: 1470, baseType: !909, size: 32, align: 32, offset: 288)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1183, file: !14, line: 1474, baseType: !909, size: 32, align: 32, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1183, file: !14, line: 1479, baseType: !1193, size: 64, align: 64, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1196)
!1196 = !{!1197, !1198, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1195, file: !14, line: 1412, baseType: !1061, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1195, file: !14, line: 1413, baseType: !909, size: 32, align: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1195, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1183, file: !14, line: 1480, baseType: !909, size: 32, align: 32, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1183, file: !14, line: 1486, baseType: !1076, size: 64, align: 64, offset: 512)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1183, file: !14, line: 1488, baseType: !1076, size: 64, align: 64, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1183, file: !14, line: 1497, baseType: !1076, size: 64, align: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1178, file: !1049, line: 121, baseType: !1055, size: 64, align: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1048, file: !1049, line: 166, baseType: !1206, size: 128, align: 64, offset: 448)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1049, line: 127, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1049, line: 124, size: 128, align: 64, elements: !1208)
!1208 = !{!1209, !1282}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1207, file: !1049, line: 125, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1240, !1244, !1245, !1279, !1280, !1281}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1213, file: !14, line: 5751, baseType: !977, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1213, file: !14, line: 5756, baseType: !1217, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1220)
!1220 = !{!1221, !1222, !1225, !1226, !1227, !1231, !1235, !1239}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1219, file: !14, line: 5797, baseType: !945, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1219, file: !14, line: 5804, baseType: !1223, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1219, file: !14, line: 5815, baseType: !977, size: 64, align: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1219, file: !14, line: 5825, baseType: !909, size: 32, align: 32, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1219, file: !14, line: 5826, baseType: !1228, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!909, !1211}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1219, file: !14, line: 5827, baseType: !1232, size: 64, align: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!909, !1211, !1181}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1219, file: !14, line: 5828, baseType: !1236, size: 64, align: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !1211}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1219, file: !14, line: 5829, baseType: !1236, size: 64, align: 64, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1213, file: !14, line: 5762, baseType: !1241, size: 64, align: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1243)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1213, file: !14, line: 5768, baseType: !930, size: 64, align: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1213, file: !14, line: 5775, baseType: !1246, size: 64, align: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1248, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1248, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1248, file: !14, line: 3948, baseType: !926, size: 32, align: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1248, file: !14, line: 3958, baseType: !1061, size: 64, align: 64, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1248, file: !14, line: 3962, baseType: !909, size: 32, align: 32, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1248, file: !14, line: 3968, baseType: !909, size: 32, align: 32, offset: 224)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1248, file: !14, line: 3973, baseType: !1076, size: 64, align: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1248, file: !14, line: 3986, baseType: !909, size: 32, align: 32, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1248, file: !14, line: 3999, baseType: !909, size: 32, align: 32, offset: 352)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1248, file: !14, line: 4004, baseType: !909, size: 32, align: 32, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1248, file: !14, line: 4005, baseType: !909, size: 32, align: 32, offset: 416)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1248, file: !14, line: 4010, baseType: !909, size: 32, align: 32, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1248, file: !14, line: 4011, baseType: !909, size: 32, align: 32, offset: 480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1248, file: !14, line: 4020, baseType: !955, size: 64, align: 32, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1248, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1248, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1248, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1248, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1248, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1248, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1248, file: !14, line: 4039, baseType: !909, size: 32, align: 32, offset: 768)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1248, file: !14, line: 4046, baseType: !973, size: 64, align: 64, offset: 832)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1248, file: !14, line: 4050, baseType: !909, size: 32, align: 32, offset: 896)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1248, file: !14, line: 4054, baseType: !909, size: 32, align: 32, offset: 928)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1248, file: !14, line: 4061, baseType: !909, size: 32, align: 32, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1248, file: !14, line: 4065, baseType: !909, size: 32, align: 32, offset: 992)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1248, file: !14, line: 4073, baseType: !909, size: 32, align: 32, offset: 1024)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1248, file: !14, line: 4080, baseType: !909, size: 32, align: 32, offset: 1056)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1248, file: !14, line: 4084, baseType: !909, size: 32, align: 32, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1213, file: !14, line: 5781, baseType: !1246, size: 64, align: 64, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1213, file: !14, line: 5787, baseType: !955, size: 64, align: 32, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1213, file: !14, line: 5793, baseType: !955, size: 64, align: 32, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1207, file: !1049, line: 126, baseType: !909, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1048, file: !1049, line: 172, baseType: !1181, size: 64, align: 64, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1048, file: !1049, line: 177, baseType: !1061, size: 64, align: 64, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1048, file: !1049, line: 178, baseType: !910, size: 32, align: 32, offset: 704)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1048, file: !1049, line: 180, baseType: !930, size: 64, align: 64, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1048, file: !1049, line: 185, baseType: !909, size: 32, align: 32, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1048, file: !1049, line: 190, baseType: !930, size: 64, align: 64, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1048, file: !1049, line: 195, baseType: !909, size: 32, align: 32, offset: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1048, file: !1049, line: 200, baseType: !1181, size: 64, align: 64, offset: 1024)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1048, file: !1049, line: 201, baseType: !909, size: 32, align: 32, offset: 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1048, file: !1049, line: 202, baseType: !1055, size: 64, align: 64, offset: 1152)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1048, file: !1049, line: 203, baseType: !909, size: 32, align: 32, offset: 1216)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1048, file: !1049, line: 205, baseType: !909, size: 32, align: 32, offset: 1248)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1048, file: !1049, line: 206, baseType: !909, size: 32, align: 32, offset: 1280)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1048, file: !1049, line: 209, baseType: !1148, size: 64, align: 64, offset: 1344)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1048, file: !1049, line: 212, baseType: !1148, size: 64, align: 64, offset: 1408)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1048, file: !1049, line: 213, baseType: !1055, size: 64, align: 64, offset: 1472)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1048, file: !1049, line: 215, baseType: !909, size: 32, align: 32, offset: 1536)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1048, file: !1049, line: 217, baseType: !909, size: 32, align: 32, offset: 1568)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1048, file: !1049, line: 220, baseType: !909, size: 32, align: 32, offset: 1600)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1035, file: !14, line: 1598, baseType: !930, size: 64, align: 64, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1035, file: !14, line: 1606, baseType: !1076, size: 64, align: 64, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1035, file: !14, line: 1614, baseType: !909, size: 32, align: 32, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1035, file: !14, line: 1622, baseType: !909, size: 32, align: 32, offset: 544)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1035, file: !14, line: 1628, baseType: !909, size: 32, align: 32, offset: 576)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !14, line: 1636, baseType: !909, size: 32, align: 32, offset: 608)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1035, file: !14, line: 1643, baseType: !909, size: 32, align: 32, offset: 640)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1035, file: !14, line: 1657, baseType: !1061, size: 64, align: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1035, file: !14, line: 1658, baseType: !909, size: 32, align: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1035, file: !14, line: 1679, baseType: !955, size: 64, align: 32, offset: 800)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1035, file: !14, line: 1688, baseType: !909, size: 32, align: 32, offset: 864)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1035, file: !14, line: 1712, baseType: !909, size: 32, align: 32, offset: 896)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1035, file: !14, line: 1729, baseType: !909, size: 32, align: 32, offset: 928)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1035, file: !14, line: 1729, baseType: !909, size: 32, align: 32, offset: 960)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1035, file: !14, line: 1744, baseType: !909, size: 32, align: 32, offset: 992)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1035, file: !14, line: 1744, baseType: !909, size: 32, align: 32, offset: 1024)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1035, file: !14, line: 1751, baseType: !909, size: 32, align: 32, offset: 1056)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1035, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1035, file: !14, line: 1791, baseType: !1321, size: 64, align: 64, offset: 1152)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{null, !1324, !1325, !1327, !909, !909, !909}
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1035, file: !14, line: 1808, baseType: !1329, size: 64, align: 64, offset: 1216)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!473, !1324, !962}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1035, file: !14, line: 1816, baseType: !909, size: 32, align: 32, offset: 1280)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1035, file: !14, line: 1825, baseType: !918, size: 32, align: 32, offset: 1312)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1035, file: !14, line: 1830, baseType: !909, size: 32, align: 32, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1035, file: !14, line: 1838, baseType: !918, size: 32, align: 32, offset: 1376)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1035, file: !14, line: 1846, baseType: !909, size: 32, align: 32, offset: 1408)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1035, file: !14, line: 1851, baseType: !909, size: 32, align: 32, offset: 1440)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1035, file: !14, line: 1861, baseType: !918, size: 32, align: 32, offset: 1472)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1035, file: !14, line: 1868, baseType: !918, size: 32, align: 32, offset: 1504)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1035, file: !14, line: 1875, baseType: !918, size: 32, align: 32, offset: 1536)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1035, file: !14, line: 1882, baseType: !918, size: 32, align: 32, offset: 1568)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1035, file: !14, line: 1889, baseType: !918, size: 32, align: 32, offset: 1600)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1035, file: !14, line: 1896, baseType: !918, size: 32, align: 32, offset: 1632)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1035, file: !14, line: 1903, baseType: !918, size: 32, align: 32, offset: 1664)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1035, file: !14, line: 1910, baseType: !909, size: 32, align: 32, offset: 1696)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1035, file: !14, line: 1915, baseType: !909, size: 32, align: 32, offset: 1728)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1035, file: !14, line: 1926, baseType: !1327, size: 64, align: 64, offset: 1792)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1035, file: !14, line: 1935, baseType: !955, size: 64, align: 32, offset: 1856)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1035, file: !14, line: 1942, baseType: !909, size: 32, align: 32, offset: 1920)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1035, file: !14, line: 1948, baseType: !909, size: 32, align: 32, offset: 1952)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1035, file: !14, line: 1954, baseType: !909, size: 32, align: 32, offset: 1984)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1035, file: !14, line: 1960, baseType: !909, size: 32, align: 32, offset: 2016)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1035, file: !14, line: 1984, baseType: !909, size: 32, align: 32, offset: 2048)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1035, file: !14, line: 1991, baseType: !909, size: 32, align: 32, offset: 2080)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1035, file: !14, line: 1996, baseType: !909, size: 32, align: 32, offset: 2112)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1035, file: !14, line: 2004, baseType: !909, size: 32, align: 32, offset: 2144)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1035, file: !14, line: 2011, baseType: !909, size: 32, align: 32, offset: 2176)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1035, file: !14, line: 2018, baseType: !909, size: 32, align: 32, offset: 2208)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1035, file: !14, line: 2027, baseType: !909, size: 32, align: 32, offset: 2240)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1035, file: !14, line: 2034, baseType: !909, size: 32, align: 32, offset: 2272)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1035, file: !14, line: 2044, baseType: !909, size: 32, align: 32, offset: 2304)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1035, file: !14, line: 2054, baseType: !1363, size: 64, align: 64, offset: 2368)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1035, file: !14, line: 2061, baseType: !1363, size: 64, align: 64, offset: 2432)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1035, file: !14, line: 2066, baseType: !909, size: 32, align: 32, offset: 2496)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1035, file: !14, line: 2070, baseType: !909, size: 32, align: 32, offset: 2528)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1035, file: !14, line: 2078, baseType: !909, size: 32, align: 32, offset: 2560)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1035, file: !14, line: 2085, baseType: !909, size: 32, align: 32, offset: 2592)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1035, file: !14, line: 2092, baseType: !909, size: 32, align: 32, offset: 2624)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1035, file: !14, line: 2099, baseType: !909, size: 32, align: 32, offset: 2656)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1035, file: !14, line: 2106, baseType: !909, size: 32, align: 32, offset: 2688)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1035, file: !14, line: 2113, baseType: !909, size: 32, align: 32, offset: 2720)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1035, file: !14, line: 2120, baseType: !909, size: 32, align: 32, offset: 2752)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1035, file: !14, line: 2125, baseType: !909, size: 32, align: 32, offset: 2784)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1035, file: !14, line: 2133, baseType: !909, size: 32, align: 32, offset: 2816)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1035, file: !14, line: 2140, baseType: !909, size: 32, align: 32, offset: 2848)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1035, file: !14, line: 2145, baseType: !909, size: 32, align: 32, offset: 2880)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1035, file: !14, line: 2153, baseType: !909, size: 32, align: 32, offset: 2912)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1035, file: !14, line: 2158, baseType: !909, size: 32, align: 32, offset: 2944)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1035, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1035, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1035, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1035, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1035, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1035, file: !14, line: 2203, baseType: !909, size: 32, align: 32, offset: 3136)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1035, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1035, file: !14, line: 2212, baseType: !909, size: 32, align: 32, offset: 3200)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1035, file: !14, line: 2213, baseType: !909, size: 32, align: 32, offset: 3232)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1035, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1035, file: !14, line: 2232, baseType: !909, size: 32, align: 32, offset: 3296)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1035, file: !14, line: 2243, baseType: !909, size: 32, align: 32, offset: 3328)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1035, file: !14, line: 2249, baseType: !909, size: 32, align: 32, offset: 3360)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1035, file: !14, line: 2256, baseType: !909, size: 32, align: 32, offset: 3392)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1035, file: !14, line: 2263, baseType: !973, size: 64, align: 64, offset: 3456)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1035, file: !14, line: 2270, baseType: !973, size: 64, align: 64, offset: 3520)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1035, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1035, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1035, file: !14, line: 2367, baseType: !1399, size: 64, align: 64, offset: 3648)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!909, !1324, !1055, !909}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1035, file: !14, line: 2383, baseType: !909, size: 32, align: 32, offset: 3712)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1035, file: !14, line: 2386, baseType: !918, size: 32, align: 32, offset: 3744)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1035, file: !14, line: 2387, baseType: !918, size: 32, align: 32, offset: 3776)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1035, file: !14, line: 2394, baseType: !909, size: 32, align: 32, offset: 3808)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1035, file: !14, line: 2401, baseType: !909, size: 32, align: 32, offset: 3840)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1035, file: !14, line: 2408, baseType: !909, size: 32, align: 32, offset: 3872)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1035, file: !14, line: 2415, baseType: !909, size: 32, align: 32, offset: 3904)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1035, file: !14, line: 2422, baseType: !909, size: 32, align: 32, offset: 3936)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1035, file: !14, line: 2423, baseType: !1411, size: 64, align: 64, offset: 3968)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1413, file: !14, line: 827, baseType: !909, size: 32, align: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1413, file: !14, line: 828, baseType: !909, size: 32, align: 32, offset: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1413, file: !14, line: 829, baseType: !909, size: 32, align: 32, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1413, file: !14, line: 830, baseType: !918, size: 32, align: 32, offset: 96)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1035, file: !14, line: 2430, baseType: !1076, size: 64, align: 64, offset: 4032)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1035, file: !14, line: 2437, baseType: !1076, size: 64, align: 64, offset: 4096)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1035, file: !14, line: 2444, baseType: !918, size: 32, align: 32, offset: 4160)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1035, file: !14, line: 2451, baseType: !918, size: 32, align: 32, offset: 4192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1035, file: !14, line: 2458, baseType: !909, size: 32, align: 32, offset: 4224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1035, file: !14, line: 2469, baseType: !909, size: 32, align: 32, offset: 4256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1035, file: !14, line: 2475, baseType: !909, size: 32, align: 32, offset: 4288)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1035, file: !14, line: 2481, baseType: !909, size: 32, align: 32, offset: 4320)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1035, file: !14, line: 2485, baseType: !909, size: 32, align: 32, offset: 4352)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1035, file: !14, line: 2489, baseType: !909, size: 32, align: 32, offset: 4384)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1035, file: !14, line: 2493, baseType: !909, size: 32, align: 32, offset: 4416)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1035, file: !14, line: 2501, baseType: !909, size: 32, align: 32, offset: 4448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1035, file: !14, line: 2506, baseType: !909, size: 32, align: 32, offset: 4480)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1035, file: !14, line: 2510, baseType: !909, size: 32, align: 32, offset: 4512)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1035, file: !14, line: 2514, baseType: !1076, size: 64, align: 64, offset: 4544)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1035, file: !14, line: 2528, baseType: !1435, size: 64, align: 64, offset: 4608)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{null, !1324, !930, !909, !909}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1035, file: !14, line: 2534, baseType: !909, size: 32, align: 32, offset: 4672)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1035, file: !14, line: 2545, baseType: !909, size: 32, align: 32, offset: 4704)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1035, file: !14, line: 2547, baseType: !909, size: 32, align: 32, offset: 4736)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1035, file: !14, line: 2549, baseType: !909, size: 32, align: 32, offset: 4768)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1035, file: !14, line: 2551, baseType: !909, size: 32, align: 32, offset: 4800)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1035, file: !14, line: 2553, baseType: !909, size: 32, align: 32, offset: 4832)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1035, file: !14, line: 2555, baseType: !909, size: 32, align: 32, offset: 4864)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1035, file: !14, line: 2557, baseType: !909, size: 32, align: 32, offset: 4896)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1035, file: !14, line: 2559, baseType: !909, size: 32, align: 32, offset: 4928)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1035, file: !14, line: 2563, baseType: !909, size: 32, align: 32, offset: 4960)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1035, file: !14, line: 2571, baseType: !1449, size: 64, align: 64, offset: 4992)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1035, file: !14, line: 2579, baseType: !1449, size: 64, align: 64, offset: 5056)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1035, file: !14, line: 2586, baseType: !909, size: 32, align: 32, offset: 5120)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1035, file: !14, line: 2615, baseType: !909, size: 32, align: 32, offset: 5152)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1035, file: !14, line: 2627, baseType: !909, size: 32, align: 32, offset: 5184)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1035, file: !14, line: 2637, baseType: !909, size: 32, align: 32, offset: 5216)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1035, file: !14, line: 2681, baseType: !909, size: 32, align: 32, offset: 5248)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1035, file: !14, line: 2709, baseType: !1076, size: 64, align: 64, offset: 5312)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1035, file: !14, line: 2716, baseType: !1458, size: 64, align: 64, offset: 5376)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1461)
!1461 = !{!1462, !1463, !1464, !1465, !1466, !1467, !1471, !1477, !1481, !1482, !1483, !1484, !1490, !1491, !1492, !1493, !1494}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1460, file: !14, line: 3642, baseType: !945, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1460, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1460, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1460, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1460, file: !14, line: 3669, baseType: !909, size: 32, align: 32, offset: 160)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1460, file: !14, line: 3682, baseType: !1468, size: 64, align: 64, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!909, !1033, !1055}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1460, file: !14, line: 3698, baseType: !1472, size: 64, align: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!909, !1033, !1475, !926}
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1460, file: !14, line: 3712, baseType: !1478, size: 64, align: 64, offset: 320)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!909, !1033, !909, !1475, !926}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1460, file: !14, line: 3726, baseType: !1472, size: 64, align: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1460, file: !14, line: 3737, baseType: !1030, size: 64, align: 64, offset: 448)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1460, file: !14, line: 3746, baseType: !909, size: 32, align: 32, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1460, file: !14, line: 3757, baseType: !1485, size: 64, align: 64, offset: 576)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1488}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1460, file: !14, line: 3766, baseType: !1030, size: 64, align: 64, offset: 640)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1460, file: !14, line: 3774, baseType: !1030, size: 64, align: 64, offset: 704)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1460, file: !14, line: 3780, baseType: !909, size: 32, align: 32, offset: 768)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1460, file: !14, line: 3785, baseType: !909, size: 32, align: 32, offset: 800)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1460, file: !14, line: 3795, baseType: !1495, size: 64, align: 64, offset: 832)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!909, !1033, !1095}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1035, file: !14, line: 2728, baseType: !930, size: 64, align: 64, offset: 5440)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1035, file: !14, line: 2735, baseType: !1085, size: 512, align: 64, offset: 5504)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1035, file: !14, line: 2742, baseType: !909, size: 32, align: 32, offset: 6016)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1035, file: !14, line: 2755, baseType: !909, size: 32, align: 32, offset: 6048)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1035, file: !14, line: 2776, baseType: !909, size: 32, align: 32, offset: 6080)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1035, file: !14, line: 2783, baseType: !909, size: 32, align: 32, offset: 6112)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1035, file: !14, line: 2791, baseType: !909, size: 32, align: 32, offset: 6144)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1035, file: !14, line: 2802, baseType: !1055, size: 64, align: 64, offset: 6208)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1035, file: !14, line: 2811, baseType: !909, size: 32, align: 32, offset: 6272)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1035, file: !14, line: 2821, baseType: !909, size: 32, align: 32, offset: 6304)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1035, file: !14, line: 2830, baseType: !909, size: 32, align: 32, offset: 6336)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1035, file: !14, line: 2840, baseType: !909, size: 32, align: 32, offset: 6368)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1035, file: !14, line: 2851, baseType: !1511, size: 64, align: 64, offset: 6400)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{!909, !1324, !1514, !930, !1327, !909, !909}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!909, !1324, !930}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1035, file: !14, line: 2871, baseType: !1518, size: 64, align: 64, offset: 6464)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!909, !1324, !1521, !930, !1327, !909}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!909, !1324, !930, !909, !909}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1035, file: !14, line: 2878, baseType: !909, size: 32, align: 32, offset: 6528)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1035, file: !14, line: 2885, baseType: !909, size: 32, align: 32, offset: 6560)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1035, file: !14, line: 3005, baseType: !909, size: 32, align: 32, offset: 6592)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1035, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1035, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1035, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1035, file: !14, line: 3037, baseType: !1061, size: 64, align: 64, offset: 6720)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1035, file: !14, line: 3038, baseType: !909, size: 32, align: 32, offset: 6784)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1035, file: !14, line: 3050, baseType: !973, size: 64, align: 64, offset: 6848)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1035, file: !14, line: 3065, baseType: !909, size: 32, align: 32, offset: 6912)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1035, file: !14, line: 3083, baseType: !909, size: 32, align: 32, offset: 6944)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1035, file: !14, line: 3092, baseType: !955, size: 64, align: 32, offset: 6976)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1035, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1035, file: !14, line: 3106, baseType: !955, size: 64, align: 32, offset: 7072)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1035, file: !14, line: 3113, baseType: !1539, size: 64, align: 64, offset: 7168)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1541)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1542)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1547, !1548, !1549, !1552}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1542, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1542, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1542, file: !14, line: 720, baseType: !945, size: 64, align: 64, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1542, file: !14, line: 724, baseType: !945, size: 64, align: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1542, file: !14, line: 728, baseType: !909, size: 32, align: 32, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1542, file: !14, line: 734, baseType: !1550, size: 64, align: 64, offset: 256)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1542, file: !14, line: 739, baseType: !1553, size: 64, align: 64, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1035, file: !14, line: 3129, baseType: !1076, size: 64, align: 64, offset: 7232)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1035, file: !14, line: 3130, baseType: !1076, size: 64, align: 64, offset: 7296)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1035, file: !14, line: 3131, baseType: !1076, size: 64, align: 64, offset: 7360)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1035, file: !14, line: 3132, baseType: !1076, size: 64, align: 64, offset: 7424)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1035, file: !14, line: 3139, baseType: !1449, size: 64, align: 64, offset: 7488)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1035, file: !14, line: 3147, baseType: !909, size: 32, align: 32, offset: 7552)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1035, file: !14, line: 3165, baseType: !909, size: 32, align: 32, offset: 7584)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1035, file: !14, line: 3172, baseType: !909, size: 32, align: 32, offset: 7616)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1035, file: !14, line: 3180, baseType: !909, size: 32, align: 32, offset: 7648)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1035, file: !14, line: 3191, baseType: !1363, size: 64, align: 64, offset: 7680)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1035, file: !14, line: 3199, baseType: !1061, size: 64, align: 64, offset: 7744)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1035, file: !14, line: 3207, baseType: !1449, size: 64, align: 64, offset: 7808)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1035, file: !14, line: 3214, baseType: !910, size: 32, align: 32, offset: 7872)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1035, file: !14, line: 3224, baseType: !1193, size: 64, align: 64, offset: 7936)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1035, file: !14, line: 3225, baseType: !909, size: 32, align: 32, offset: 8000)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1035, file: !14, line: 3249, baseType: !1095, size: 64, align: 64, offset: 8064)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1035, file: !14, line: 3256, baseType: !909, size: 32, align: 32, offset: 8128)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1035, file: !14, line: 3271, baseType: !909, size: 32, align: 32, offset: 8160)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1035, file: !14, line: 3279, baseType: !1076, size: 64, align: 64, offset: 8192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1035, file: !14, line: 3301, baseType: !1095, size: 64, align: 64, offset: 8256)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1035, file: !14, line: 3310, baseType: !909, size: 32, align: 32, offset: 8320)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1035, file: !14, line: 3337, baseType: !909, size: 32, align: 32, offset: 8352)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1035, file: !14, line: 3351, baseType: !909, size: 32, align: 32, offset: 8384)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1035, file: !14, line: 3359, baseType: !909, size: 32, align: 32, offset: 8416)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !942, file: !14, line: 3535, baseType: !1580, size: 64, align: 64, offset: 1024)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DISubroutineType(types: !1582)
!1582 = !{!909, !1033, !1583}
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !942, file: !14, line: 3541, baseType: !1586, size: 64, align: 64, offset: 1088)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1588)
!1588 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1589)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1049, line: 223, size: 128, align: 64, elements: !1590)
!1590 = !{!1591, !1592}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1589, file: !1049, line: 224, baseType: !1475, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1589, file: !1049, line: 225, baseType: !1475, size: 64, align: 64, offset: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !942, file: !14, line: 3549, baseType: !1594, size: 64, align: 64, offset: 1152)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{null, !1028}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !942, file: !14, line: 3551, baseType: !1030, size: 64, align: 64, offset: 1216)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !942, file: !14, line: 3552, baseType: !1599, size: 64, align: 64, offset: 1280)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!909, !1033, !1061, !909, !1602}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609, !1610, !1634}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1604, file: !14, line: 3921, baseType: !937, size: 16, align: 16)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1604, file: !14, line: 3922, baseType: !926, size: 32, align: 32, offset: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1604, file: !14, line: 3923, baseType: !926, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1604, file: !14, line: 3924, baseType: !910, size: 32, align: 32, offset: 96)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1604, file: !14, line: 3925, baseType: !1611, size: 64, align: 64, offset: 128)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619, !1620, !1621, !1627, !1629, !1630, !1631, !1632, !1633}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1614, file: !14, line: 3886, baseType: !909, size: 32, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1614, file: !14, line: 3887, baseType: !909, size: 32, align: 32, offset: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1614, file: !14, line: 3888, baseType: !909, size: 32, align: 32, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1614, file: !14, line: 3889, baseType: !909, size: 32, align: 32, offset: 96)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1614, file: !14, line: 3890, baseType: !909, size: 32, align: 32, offset: 128)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1614, file: !14, line: 3897, baseType: !1622, size: 768, align: 64, offset: 192)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1624)
!1624 = !{!1625, !1626}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1623, file: !14, line: 3855, baseType: !1060, size: 512, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1623, file: !14, line: 3857, baseType: !1065, size: 256, align: 32, offset: 512)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1614, file: !14, line: 3903, baseType: !1628, size: 256, align: 64, offset: 960)
!1628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 256, align: 64, elements: !1164)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1614, file: !14, line: 3904, baseType: !1171, size: 128, align: 32, offset: 1216)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1614, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1614, file: !14, line: 3908, baseType: !1449, size: 64, align: 64, offset: 1408)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1614, file: !14, line: 3915, baseType: !1449, size: 64, align: 64, offset: 1472)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1614, file: !14, line: 3917, baseType: !909, size: 32, align: 32, offset: 1536)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1604, file: !14, line: 3926, baseType: !1076, size: 64, align: 64, offset: 192)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !942, file: !14, line: 3564, baseType: !1636, size: 64, align: 64, offset: 1344)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!909, !1033, !1181, !1325, !1327}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !942, file: !14, line: 3566, baseType: !1640, size: 64, align: 64, offset: 1408)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!909, !1033, !930, !1327, !1181}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !942, file: !14, line: 3567, baseType: !1030, size: 64, align: 64, offset: 1472)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !942, file: !14, line: 3576, baseType: !1645, size: 64, align: 64, offset: 1536)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!909, !1033, !1325}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !942, file: !14, line: 3577, baseType: !1649, size: 64, align: 64, offset: 1600)
