; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--j2kenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--j2kenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DWTType", file: !910, line: 36, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/jpeg2000dwt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FF_DWT97", value: 0)
!913 = !DIEnumerator(name: "FF_DWT53", value: 1)
!914 = !DIEnumerator(name: "FF_DWT97_INT", value: 2)
!915 = !DIEnumerator(name: "FF_DWT_NB", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Jpeg2000Quantsty", file: !917, line: 64, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/jpeg2000.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!918 = !{!919, !920, !921}
!919 = !DIEnumerator(name: "JPEG2000_QSTY_NONE", value: 0)
!920 = !DIEnumerator(name: "JPEG2000_QSTY_SI", value: 1)
!921 = !DIEnumerator(name: "JPEG2000_QSTY_SE", value: 2)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Jpeg2000Markers", file: !917, line: 38, size: 32, align: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!924 = !DIEnumerator(name: "JPEG2000_SOC", value: 65359)
!925 = !DIEnumerator(name: "JPEG2000_SIZ", value: 65361)
!926 = !DIEnumerator(name: "JPEG2000_COD", value: 65362)
!927 = !DIEnumerator(name: "JPEG2000_COC", value: 65363)
!928 = !DIEnumerator(name: "JPEG2000_TLM", value: 65365)
!929 = !DIEnumerator(name: "JPEG2000_PLM", value: 65367)
!930 = !DIEnumerator(name: "JPEG2000_PLT", value: 65368)
!931 = !DIEnumerator(name: "JPEG2000_QCD", value: 65372)
!932 = !DIEnumerator(name: "JPEG2000_QCC", value: 65373)
!933 = !DIEnumerator(name: "JPEG2000_RGN", value: 65374)
!934 = !DIEnumerator(name: "JPEG2000_POC", value: 65375)
!935 = !DIEnumerator(name: "JPEG2000_PPM", value: 65376)
!936 = !DIEnumerator(name: "JPEG2000_PPT", value: 65377)
!937 = !DIEnumerator(name: "JPEG2000_CRG", value: 65379)
!938 = !DIEnumerator(name: "JPEG2000_COM", value: 65380)
!939 = !DIEnumerator(name: "JPEG2000_SOT", value: 65424)
!940 = !DIEnumerator(name: "JPEG2000_SOP", value: 65425)
!941 = !DIEnumerator(name: "JPEG2000_EPH", value: 65426)
!942 = !DIEnumerator(name: "JPEG2000_SOD", value: 65427)
!943 = !DIEnumerator(name: "JPEG2000_EOC", value: 65497)
!944 = !{!945, !948, !949, !953, !960, !966}
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!947 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !952)
!952 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !955, line: 221, size: 32, align: 8, elements: !956)
!955 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !954, file: !955, line: 221, baseType: !958, size: 32, align: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !959)
!959 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !955, line: 222, size: 16, align: 8, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !961, file: !955, line: 222, baseType: !964, size: 16, align: 16)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !965)
!965 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!967 = !{!968, !1722, !1723, !1729, !1733, !1734, !1735, !1736, !1741}
!968 = distinct !DIGlobalVariable(name: "ff_jpeg2000_encoder", scope: !0, file: !969, line: 1244, type: !970, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_jpeg2000_encoder)
!969 = !DIFile(filename: "libavcodec/j2kenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !972)
!972 = !{!973, !977, !978, !979, !980, !982, !991, !994, !997, !1000, !1005, !1006, !1079, !1087, !1088, !1089, !1091, !1637, !1643, !1651, !1655, !1656, !1693, !1697, !1701, !1702, !1706, !1710, !1711, !1715, !1716, !1717}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !971, file: !14, line: 3475, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !971, file: !14, line: 3480, baseType: !974, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !971, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !971, file: !14, line: 3487, baseType: !981, size: 32, align: 32, offset: 192)
!981 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !971, file: !14, line: 3488, baseType: !983, size: 64, align: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !986, line: 61, baseType: !987)
!986 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !986, line: 58, size: 64, align: 32, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !987, file: !986, line: 59, baseType: !981, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !987, file: !986, line: 60, baseType: !981, size: 32, align: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !971, file: !14, line: 3489, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !971, file: !14, line: 3490, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !971, file: !14, line: 3491, baseType: !998, size: 64, align: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !971, file: !14, line: 3492, baseType: !1001, size: 64, align: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !1004)
!1004 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !971, file: !14, line: 3493, baseType: !951, size: 8, align: 8, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !971, file: !14, line: 3494, baseType: !1007, size: 64, align: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1017, !1038, !1039, !1040, !1041, !1045, !1051, !1053, !1057}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1010, file: !713, line: 72, baseType: !974, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1010, file: !713, line: 78, baseType: !1014, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!974, !948}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1010, file: !713, line: 85, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1034, !1035, !1036, !1037}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !691, line: 247, baseType: !974, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1020, file: !691, line: 253, baseType: !974, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1020, file: !691, line: 259, baseType: !981, size: 32, align: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1020, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1020, file: !691, line: 271, baseType: !1027, size: 64, align: 64, offset: 192)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !691, line: 265, size: 64, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1032, !1033}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1027, file: !691, line: 266, baseType: !945, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1027, file: !691, line: 267, baseType: !1031, size: 64, align: 64)
!1031 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1027, file: !691, line: 268, baseType: !974, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1027, file: !691, line: 270, baseType: !985, size: 64, align: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1020, file: !691, line: 272, baseType: !1031, size: 64, align: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1020, file: !691, line: 273, baseType: !1031, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !691, line: 275, baseType: !981, size: 32, align: 32, offset: 384)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1020, file: !691, line: 300, baseType: !974, size: 64, align: 64, offset: 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1010, file: !713, line: 93, baseType: !981, size: 32, align: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1010, file: !713, line: 99, baseType: !981, size: 32, align: 32, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1010, file: !713, line: 108, baseType: !981, size: 32, align: 32, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1010, file: !713, line: 113, baseType: !1042, size: 64, align: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!948, !948, !948}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1010, file: !713, line: 123, baseType: !1046, size: 64, align: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1049, !1049}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1010, file: !713, line: 130, baseType: !1052, size: 32, align: 32, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1010, file: !713, line: 136, baseType: !1054, size: 64, align: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1052, !948}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1010, file: !713, line: 142, baseType: !1058, size: 64, align: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!981, !1061, !948, !974, !981}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1064)
!1064 = !{!1065, !1077, !1078}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1063, file: !691, line: 360, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1069, file: !691, line: 307, baseType: !974, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1069, file: !691, line: 313, baseType: !1031, size: 64, align: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1069, file: !691, line: 313, baseType: !1031, size: 64, align: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1069, file: !691, line: 318, baseType: !1031, size: 64, align: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1069, file: !691, line: 318, baseType: !1031, size: 64, align: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1069, file: !691, line: 323, baseType: !981, size: 32, align: 32, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1063, file: !691, line: 364, baseType: !981, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1063, file: !691, line: 368, baseType: !981, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !971, file: !14, line: 3495, baseType: !1080, size: 64, align: 64, offset: 704)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1083, file: !14, line: 3402, baseType: !981, size: 32, align: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1083, file: !14, line: 3403, baseType: !974, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !971, file: !14, line: 3507, baseType: !974, size: 64, align: 64, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !971, file: !14, line: 3516, baseType: !981, size: 32, align: 32, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !971, file: !14, line: 3517, baseType: !1090, size: 64, align: 64, offset: 896)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !971, file: !14, line: 3527, baseType: !1092, size: 64, align: 64, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!981, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1105, !1106, !1107, !1108, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1387, !1391, !1392, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1575, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1097, file: !14, line: 1561, baseType: !1007, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1097, file: !14, line: 1562, baseType: !981, size: 32, align: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1097, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1097, file: !14, line: 1565, baseType: !1103, size: 64, align: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1097, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1097, file: !14, line: 1581, baseType: !959, size: 32, align: 32, offset: 224)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1097, file: !14, line: 1583, baseType: !948, size: 64, align: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1097, file: !14, line: 1591, baseType: !1109, size: 64, align: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1111, line: 129, size: 1664, align: 64, elements: !1112)
!1111 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1112 = !{!1113, !1114, !1115, !1116, !1213, !1234, !1235, !1264, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1110, file: !1111, line: 136, baseType: !981, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1110, file: !1111, line: 151, baseType: !981, size: 32, align: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1110, file: !1111, line: 157, baseType: !981, size: 32, align: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1110, file: !1111, line: 159, baseType: !1117, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1120)
!1120 = !{!1121, !1125, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1165, !1167, !1168, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1201, !1202, !1203, !1204, !1205, !1206, !1209, !1210, !1211, !1212}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !744, line: 282, baseType: !1122, size: 512, align: 64)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 512, align: 64, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 8)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1119, file: !744, line: 299, baseType: !1126, size: 256, align: 32, offset: 512)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 256, align: 32, elements: !1123)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1119, file: !744, line: 315, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1119, file: !744, line: 326, baseType: !981, size: 32, align: 32, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1119, file: !744, line: 326, baseType: !981, size: 32, align: 32, offset: 864)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1119, file: !744, line: 334, baseType: !981, size: 32, align: 32, offset: 896)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1119, file: !744, line: 341, baseType: !981, size: 32, align: 32, offset: 928)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1119, file: !744, line: 346, baseType: !981, size: 32, align: 32, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1119, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1119, file: !744, line: 356, baseType: !985, size: 64, align: 32, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1119, file: !744, line: 361, baseType: !945, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1119, file: !744, line: 369, baseType: !945, size: 64, align: 64, offset: 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1119, file: !744, line: 377, baseType: !945, size: 64, align: 64, offset: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1119, file: !744, line: 382, baseType: !981, size: 32, align: 32, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1119, file: !744, line: 386, baseType: !981, size: 32, align: 32, offset: 1312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1119, file: !744, line: 391, baseType: !981, size: 32, align: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1119, file: !744, line: 396, baseType: !948, size: 64, align: 64, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1119, file: !744, line: 403, baseType: !1144, size: 512, align: 64, offset: 1472)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 512, align: 64, elements: !1123)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1119, file: !744, line: 410, baseType: !981, size: 32, align: 32, offset: 1984)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1119, file: !744, line: 415, baseType: !981, size: 32, align: 32, offset: 2016)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1119, file: !744, line: 420, baseType: !981, size: 32, align: 32, offset: 2048)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1119, file: !744, line: 425, baseType: !981, size: 32, align: 32, offset: 2080)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1119, file: !744, line: 435, baseType: !945, size: 64, align: 64, offset: 2112)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1119, file: !744, line: 440, baseType: !981, size: 32, align: 32, offset: 2176)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1119, file: !744, line: 445, baseType: !1003, size: 64, align: 64, offset: 2240)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1119, file: !744, line: 459, baseType: !1153, size: 512, align: 64, offset: 2304)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 512, align: 64, elements: !1123)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1156, line: 94, baseType: !1157)
!1156 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1156, line: 81, size: 192, align: 64, elements: !1158)
!1158 = !{!1159, !1163, !1164}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1157, file: !1156, line: 82, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1156, line: 73, baseType: !1162)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1156, line: 73, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1157, file: !1156, line: 89, baseType: !966, size: 64, align: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !1156, line: 93, baseType: !981, size: 32, align: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1119, file: !744, line: 473, baseType: !1166, size: 64, align: 64, offset: 2816)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1119, file: !744, line: 477, baseType: !981, size: 32, align: 32, offset: 2880)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1119, file: !744, line: 479, baseType: !1169, size: 64, align: 64, offset: 2944)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1182}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1172, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !744, line: 203, baseType: !966, size: 64, align: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !744, line: 204, baseType: !981, size: 32, align: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1172, file: !744, line: 205, baseType: !1178, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1180, line: 86, baseType: !1181)
!1180 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1180, line: 86, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1172, file: !744, line: 206, baseType: !1154, size: 64, align: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1119, file: !744, line: 480, baseType: !981, size: 32, align: 32, offset: 3008)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !744, line: 505, baseType: !981, size: 32, align: 32, offset: 3040)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1119, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1119, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1119, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1119, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1119, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1119, file: !744, line: 532, baseType: !945, size: 64, align: 64, offset: 3264)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1119, file: !744, line: 539, baseType: !945, size: 64, align: 64, offset: 3328)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1119, file: !744, line: 547, baseType: !945, size: 64, align: 64, offset: 3392)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1119, file: !744, line: 554, baseType: !1178, size: 64, align: 64, offset: 3456)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1119, file: !744, line: 563, baseType: !981, size: 32, align: 32, offset: 3520)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1119, file: !744, line: 572, baseType: !981, size: 32, align: 32, offset: 3552)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1119, file: !744, line: 581, baseType: !981, size: 32, align: 32, offset: 3584)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1119, file: !744, line: 588, baseType: !1198, size: 64, align: 64, offset: 3648)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1200)
!1200 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1119, file: !744, line: 593, baseType: !981, size: 32, align: 32, offset: 3712)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1119, file: !744, line: 596, baseType: !981, size: 32, align: 32, offset: 3744)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1119, file: !744, line: 599, baseType: !1154, size: 64, align: 64, offset: 3776)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1119, file: !744, line: 605, baseType: !1154, size: 64, align: 64, offset: 3840)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1119, file: !744, line: 616, baseType: !1154, size: 64, align: 64, offset: 3904)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1119, file: !744, line: 626, baseType: !1207, size: 64, align: 64, offset: 3968)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1208, line: 216, baseType: !1004)
!1208 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1119, file: !744, line: 627, baseType: !1207, size: 64, align: 64, offset: 4032)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1119, file: !744, line: 628, baseType: !1207, size: 64, align: 64, offset: 4096)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1119, file: !744, line: 629, baseType: !1207, size: 64, align: 64, offset: 4160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1119, file: !744, line: 645, baseType: !1154, size: 64, align: 64, offset: 4224)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1110, file: !1111, line: 161, baseType: !1214, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1111, line: 117, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1111, line: 100, size: 832, align: 64, elements: !1217)
!1217 = !{!1218, !1225, !1226, !1227, !1228, !1229, !1231, !1232, !1233}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1216, file: !1111, line: 105, baseType: !1219, size: 256, align: 64)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 256, align: 64, elements: !1223)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1156, line: 238, baseType: !1222)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1156, line: 238, flags: DIFlagFwdDecl)
!1223 = !{!1224}
!1224 = !DISubrange(count: 4)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1216, file: !1111, line: 110, baseType: !981, size: 32, align: 32, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1216, file: !1111, line: 111, baseType: !981, size: 32, align: 32, offset: 288)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1216, file: !1111, line: 111, baseType: !981, size: 32, align: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1216, file: !1111, line: 112, baseType: !1126, size: 256, align: 32, offset: 352)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1216, file: !1111, line: 113, baseType: !1230, size: 128, align: 32, offset: 608)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 128, align: 32, elements: !1223)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1216, file: !1111, line: 114, baseType: !981, size: 32, align: 32, offset: 736)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1216, file: !1111, line: 115, baseType: !981, size: 32, align: 32, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1216, file: !1111, line: 116, baseType: !981, size: 32, align: 32, offset: 800)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1110, file: !1111, line: 163, baseType: !948, size: 64, align: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1110, file: !1111, line: 165, baseType: !1236, size: 128, align: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1111, line: 122, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1111, line: 119, size: 128, align: 64, elements: !1238)
!1238 = !{!1239, !1263}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1237, file: !1111, line: 120, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1259, !1260, !1261, !1262}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1242, file: !14, line: 1451, baseType: !1154, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1242, file: !14, line: 1461, baseType: !945, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1242, file: !14, line: 1467, baseType: !945, size: 64, align: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1242, file: !14, line: 1468, baseType: !966, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1242, file: !14, line: 1469, baseType: !981, size: 32, align: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1242, file: !14, line: 1470, baseType: !981, size: 32, align: 32, offset: 288)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1242, file: !14, line: 1474, baseType: !981, size: 32, align: 32, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1242, file: !14, line: 1479, baseType: !1252, size: 64, align: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !14, line: 1412, baseType: !966, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !14, line: 1413, baseType: !981, size: 32, align: 32, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1242, file: !14, line: 1480, baseType: !981, size: 32, align: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1242, file: !14, line: 1486, baseType: !945, size: 64, align: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1242, file: !14, line: 1488, baseType: !945, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1242, file: !14, line: 1497, baseType: !945, size: 64, align: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1237, file: !1111, line: 121, baseType: !1117, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1110, file: !1111, line: 166, baseType: !1265, size: 128, align: 64, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1111, line: 127, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1111, line: 124, size: 128, align: 64, elements: !1267)
!1267 = !{!1268, !1341}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1266, file: !1111, line: 125, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1299, !1303, !1304, !1338, !1339, !1340}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1272, file: !14, line: 5751, baseType: !1007, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1272, file: !14, line: 5756, baseType: !1276, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1284, !1285, !1286, !1290, !1294, !1298}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !14, line: 5797, baseType: !974, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1278, file: !14, line: 5804, baseType: !1282, size: 64, align: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1278, file: !14, line: 5815, baseType: !1007, size: 64, align: 64, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1278, file: !14, line: 5825, baseType: !981, size: 32, align: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1278, file: !14, line: 5826, baseType: !1287, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!981, !1270}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1278, file: !14, line: 5827, baseType: !1291, size: 64, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!981, !1270, !1240}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1278, file: !14, line: 5828, baseType: !1295, size: 64, align: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !1270}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1278, file: !14, line: 5829, baseType: !1295, size: 64, align: 64, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1272, file: !14, line: 5762, baseType: !1300, size: 64, align: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1302)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1272, file: !14, line: 5768, baseType: !948, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1272, file: !14, line: 5775, baseType: !1305, size: 64, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1307, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1307, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1307, file: !14, line: 3948, baseType: !958, size: 32, align: 32, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1307, file: !14, line: 3958, baseType: !966, size: 64, align: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1307, file: !14, line: 3962, baseType: !981, size: 32, align: 32, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1307, file: !14, line: 3968, baseType: !981, size: 32, align: 32, offset: 224)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1307, file: !14, line: 3973, baseType: !945, size: 64, align: 64, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1307, file: !14, line: 3986, baseType: !981, size: 32, align: 32, offset: 320)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1307, file: !14, line: 3999, baseType: !981, size: 32, align: 32, offset: 352)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1307, file: !14, line: 4004, baseType: !981, size: 32, align: 32, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1307, file: !14, line: 4005, baseType: !981, size: 32, align: 32, offset: 416)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1307, file: !14, line: 4010, baseType: !981, size: 32, align: 32, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1307, file: !14, line: 4011, baseType: !981, size: 32, align: 32, offset: 480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1307, file: !14, line: 4020, baseType: !985, size: 64, align: 32, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1307, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1307, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1307, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1307, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1307, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1307, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1307, file: !14, line: 4039, baseType: !981, size: 32, align: 32, offset: 768)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1307, file: !14, line: 4046, baseType: !1003, size: 64, align: 64, offset: 832)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1307, file: !14, line: 4050, baseType: !981, size: 32, align: 32, offset: 896)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1307, file: !14, line: 4054, baseType: !981, size: 32, align: 32, offset: 928)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1307, file: !14, line: 4061, baseType: !981, size: 32, align: 32, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1307, file: !14, line: 4065, baseType: !981, size: 32, align: 32, offset: 992)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1307, file: !14, line: 4073, baseType: !981, size: 32, align: 32, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1307, file: !14, line: 4080, baseType: !981, size: 32, align: 32, offset: 1056)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1307, file: !14, line: 4084, baseType: !981, size: 32, align: 32, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1272, file: !14, line: 5781, baseType: !1305, size: 64, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1272, file: !14, line: 5787, baseType: !985, size: 64, align: 32, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1272, file: !14, line: 5793, baseType: !985, size: 64, align: 32, offset: 448)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1266, file: !1111, line: 126, baseType: !981, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1110, file: !1111, line: 172, baseType: !1240, size: 64, align: 64, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1110, file: !1111, line: 177, baseType: !966, size: 64, align: 64, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1110, file: !1111, line: 178, baseType: !959, size: 32, align: 32, offset: 704)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1110, file: !1111, line: 180, baseType: !948, size: 64, align: 64, offset: 768)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1110, file: !1111, line: 185, baseType: !981, size: 32, align: 32, offset: 832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1110, file: !1111, line: 190, baseType: !948, size: 64, align: 64, offset: 896)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1110, file: !1111, line: 195, baseType: !981, size: 32, align: 32, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1110, file: !1111, line: 200, baseType: !1240, size: 64, align: 64, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1110, file: !1111, line: 201, baseType: !981, size: 32, align: 32, offset: 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1110, file: !1111, line: 202, baseType: !1117, size: 64, align: 64, offset: 1152)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1110, file: !1111, line: 203, baseType: !981, size: 32, align: 32, offset: 1216)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1110, file: !1111, line: 205, baseType: !981, size: 32, align: 32, offset: 1248)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1110, file: !1111, line: 206, baseType: !981, size: 32, align: 32, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1110, file: !1111, line: 209, baseType: !1207, size: 64, align: 64, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1110, file: !1111, line: 212, baseType: !1207, size: 64, align: 64, offset: 1408)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1110, file: !1111, line: 213, baseType: !1117, size: 64, align: 64, offset: 1472)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1110, file: !1111, line: 215, baseType: !981, size: 32, align: 32, offset: 1536)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1110, file: !1111, line: 217, baseType: !981, size: 32, align: 32, offset: 1568)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1110, file: !1111, line: 220, baseType: !981, size: 32, align: 32, offset: 1600)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1097, file: !14, line: 1598, baseType: !948, size: 64, align: 64, offset: 384)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1097, file: !14, line: 1606, baseType: !945, size: 64, align: 64, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1097, file: !14, line: 1614, baseType: !981, size: 32, align: 32, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1097, file: !14, line: 1622, baseType: !981, size: 32, align: 32, offset: 544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1097, file: !14, line: 1628, baseType: !981, size: 32, align: 32, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1097, file: !14, line: 1636, baseType: !981, size: 32, align: 32, offset: 608)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1097, file: !14, line: 1643, baseType: !981, size: 32, align: 32, offset: 640)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1097, file: !14, line: 1657, baseType: !966, size: 64, align: 64, offset: 704)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1097, file: !14, line: 1658, baseType: !981, size: 32, align: 32, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1097, file: !14, line: 1679, baseType: !985, size: 64, align: 32, offset: 800)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1097, file: !14, line: 1688, baseType: !981, size: 32, align: 32, offset: 864)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1097, file: !14, line: 1712, baseType: !981, size: 32, align: 32, offset: 896)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1097, file: !14, line: 1729, baseType: !981, size: 32, align: 32, offset: 928)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1097, file: !14, line: 1729, baseType: !981, size: 32, align: 32, offset: 960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1097, file: !14, line: 1744, baseType: !981, size: 32, align: 32, offset: 992)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1097, file: !14, line: 1744, baseType: !981, size: 32, align: 32, offset: 1024)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1097, file: !14, line: 1751, baseType: !981, size: 32, align: 32, offset: 1056)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1097, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1097, file: !14, line: 1791, baseType: !1380, size: 64, align: 64, offset: 1152)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{null, !1383, !1384, !1386, !981, !981, !981}
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1118)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1097, file: !14, line: 1808, baseType: !1388, size: 64, align: 64, offset: 1216)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!473, !1383, !992}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1097, file: !14, line: 1816, baseType: !981, size: 32, align: 32, offset: 1280)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1097, file: !14, line: 1825, baseType: !1393, size: 32, align: 32, offset: 1312)
!1393 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1097, file: !14, line: 1830, baseType: !981, size: 32, align: 32, offset: 1344)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1097, file: !14, line: 1838, baseType: !1393, size: 32, align: 32, offset: 1376)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1097, file: !14, line: 1846, baseType: !981, size: 32, align: 32, offset: 1408)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1097, file: !14, line: 1851, baseType: !981, size: 32, align: 32, offset: 1440)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1097, file: !14, line: 1861, baseType: !1393, size: 32, align: 32, offset: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1097, file: !14, line: 1868, baseType: !1393, size: 32, align: 32, offset: 1504)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1097, file: !14, line: 1875, baseType: !1393, size: 32, align: 32, offset: 1536)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1097, file: !14, line: 1882, baseType: !1393, size: 32, align: 32, offset: 1568)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1097, file: !14, line: 1889, baseType: !1393, size: 32, align: 32, offset: 1600)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1097, file: !14, line: 1896, baseType: !1393, size: 32, align: 32, offset: 1632)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1097, file: !14, line: 1903, baseType: !1393, size: 32, align: 32, offset: 1664)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1097, file: !14, line: 1910, baseType: !981, size: 32, align: 32, offset: 1696)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1097, file: !14, line: 1915, baseType: !981, size: 32, align: 32, offset: 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1097, file: !14, line: 1926, baseType: !1386, size: 64, align: 64, offset: 1792)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1097, file: !14, line: 1935, baseType: !985, size: 64, align: 32, offset: 1856)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1097, file: !14, line: 1942, baseType: !981, size: 32, align: 32, offset: 1920)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1097, file: !14, line: 1948, baseType: !981, size: 32, align: 32, offset: 1952)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1097, file: !14, line: 1954, baseType: !981, size: 32, align: 32, offset: 1984)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1097, file: !14, line: 1960, baseType: !981, size: 32, align: 32, offset: 2016)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1097, file: !14, line: 1984, baseType: !981, size: 32, align: 32, offset: 2048)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1097, file: !14, line: 1991, baseType: !981, size: 32, align: 32, offset: 2080)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1097, file: !14, line: 1996, baseType: !981, size: 32, align: 32, offset: 2112)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1097, file: !14, line: 2004, baseType: !981, size: 32, align: 32, offset: 2144)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1097, file: !14, line: 2011, baseType: !981, size: 32, align: 32, offset: 2176)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1097, file: !14, line: 2018, baseType: !981, size: 32, align: 32, offset: 2208)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1097, file: !14, line: 2027, baseType: !981, size: 32, align: 32, offset: 2240)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1097, file: !14, line: 2034, baseType: !981, size: 32, align: 32, offset: 2272)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1097, file: !14, line: 2044, baseType: !981, size: 32, align: 32, offset: 2304)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1097, file: !14, line: 2054, baseType: !1423, size: 64, align: 64, offset: 2368)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1097, file: !14, line: 2061, baseType: !1423, size: 64, align: 64, offset: 2432)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1097, file: !14, line: 2066, baseType: !981, size: 32, align: 32, offset: 2496)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1097, file: !14, line: 2070, baseType: !981, size: 32, align: 32, offset: 2528)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1097, file: !14, line: 2078, baseType: !981, size: 32, align: 32, offset: 2560)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1097, file: !14, line: 2085, baseType: !981, size: 32, align: 32, offset: 2592)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1097, file: !14, line: 2092, baseType: !981, size: 32, align: 32, offset: 2624)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1097, file: !14, line: 2099, baseType: !981, size: 32, align: 32, offset: 2656)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1097, file: !14, line: 2106, baseType: !981, size: 32, align: 32, offset: 2688)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1097, file: !14, line: 2113, baseType: !981, size: 32, align: 32, offset: 2720)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1097, file: !14, line: 2120, baseType: !981, size: 32, align: 32, offset: 2752)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1097, file: !14, line: 2125, baseType: !981, size: 32, align: 32, offset: 2784)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1097, file: !14, line: 2133, baseType: !981, size: 32, align: 32, offset: 2816)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1097, file: !14, line: 2140, baseType: !981, size: 32, align: 32, offset: 2848)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1097, file: !14, line: 2145, baseType: !981, size: 32, align: 32, offset: 2880)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1097, file: !14, line: 2153, baseType: !981, size: 32, align: 32, offset: 2912)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1097, file: !14, line: 2158, baseType: !981, size: 32, align: 32, offset: 2944)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1097, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1097, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1097, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1097, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1097, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1097, file: !14, line: 2203, baseType: !981, size: 32, align: 32, offset: 3136)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1097, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1097, file: !14, line: 2212, baseType: !981, size: 32, align: 32, offset: 3200)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1097, file: !14, line: 2213, baseType: !981, size: 32, align: 32, offset: 3232)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1097, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1097, file: !14, line: 2232, baseType: !981, size: 32, align: 32, offset: 3296)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1097, file: !14, line: 2243, baseType: !981, size: 32, align: 32, offset: 3328)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1097, file: !14, line: 2249, baseType: !981, size: 32, align: 32, offset: 3360)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1097, file: !14, line: 2256, baseType: !981, size: 32, align: 32, offset: 3392)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1097, file: !14, line: 2263, baseType: !1003, size: 64, align: 64, offset: 3456)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1097, file: !14, line: 2270, baseType: !1003, size: 64, align: 64, offset: 3520)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1097, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1097, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1097, file: !14, line: 2367, baseType: !1459, size: 64, align: 64, offset: 3648)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!981, !1383, !1117, !981}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1097, file: !14, line: 2383, baseType: !981, size: 32, align: 32, offset: 3712)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1097, file: !14, line: 2386, baseType: !1393, size: 32, align: 32, offset: 3744)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1097, file: !14, line: 2387, baseType: !1393, size: 32, align: 32, offset: 3776)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1097, file: !14, line: 2394, baseType: !981, size: 32, align: 32, offset: 3808)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1097, file: !14, line: 2401, baseType: !981, size: 32, align: 32, offset: 3840)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1097, file: !14, line: 2408, baseType: !981, size: 32, align: 32, offset: 3872)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1097, file: !14, line: 2415, baseType: !981, size: 32, align: 32, offset: 3904)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1097, file: !14, line: 2422, baseType: !981, size: 32, align: 32, offset: 3936)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1097, file: !14, line: 2423, baseType: !1471, size: 64, align: 64, offset: 3968)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1473, file: !14, line: 827, baseType: !981, size: 32, align: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1473, file: !14, line: 828, baseType: !981, size: 32, align: 32, offset: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1473, file: !14, line: 829, baseType: !981, size: 32, align: 32, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1473, file: !14, line: 830, baseType: !1393, size: 32, align: 32, offset: 96)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1097, file: !14, line: 2430, baseType: !945, size: 64, align: 64, offset: 4032)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1097, file: !14, line: 2437, baseType: !945, size: 64, align: 64, offset: 4096)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1097, file: !14, line: 2444, baseType: !1393, size: 32, align: 32, offset: 4160)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1097, file: !14, line: 2451, baseType: !1393, size: 32, align: 32, offset: 4192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1097, file: !14, line: 2458, baseType: !981, size: 32, align: 32, offset: 4224)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1097, file: !14, line: 2469, baseType: !981, size: 32, align: 32, offset: 4256)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1097, file: !14, line: 2475, baseType: !981, size: 32, align: 32, offset: 4288)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1097, file: !14, line: 2481, baseType: !981, size: 32, align: 32, offset: 4320)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1097, file: !14, line: 2485, baseType: !981, size: 32, align: 32, offset: 4352)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1097, file: !14, line: 2489, baseType: !981, size: 32, align: 32, offset: 4384)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1097, file: !14, line: 2493, baseType: !981, size: 32, align: 32, offset: 4416)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1097, file: !14, line: 2501, baseType: !981, size: 32, align: 32, offset: 4448)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1097, file: !14, line: 2506, baseType: !981, size: 32, align: 32, offset: 4480)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1097, file: !14, line: 2510, baseType: !981, size: 32, align: 32, offset: 4512)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1097, file: !14, line: 2514, baseType: !945, size: 64, align: 64, offset: 4544)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1097, file: !14, line: 2528, baseType: !1495, size: 64, align: 64, offset: 4608)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{null, !1383, !948, !981, !981}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1097, file: !14, line: 2534, baseType: !981, size: 32, align: 32, offset: 4672)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1097, file: !14, line: 2545, baseType: !981, size: 32, align: 32, offset: 4704)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1097, file: !14, line: 2547, baseType: !981, size: 32, align: 32, offset: 4736)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1097, file: !14, line: 2549, baseType: !981, size: 32, align: 32, offset: 4768)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1097, file: !14, line: 2551, baseType: !981, size: 32, align: 32, offset: 4800)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1097, file: !14, line: 2553, baseType: !981, size: 32, align: 32, offset: 4832)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1097, file: !14, line: 2555, baseType: !981, size: 32, align: 32, offset: 4864)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1097, file: !14, line: 2557, baseType: !981, size: 32, align: 32, offset: 4896)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1097, file: !14, line: 2559, baseType: !981, size: 32, align: 32, offset: 4928)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1097, file: !14, line: 2563, baseType: !981, size: 32, align: 32, offset: 4960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1097, file: !14, line: 2571, baseType: !1509, size: 64, align: 64, offset: 4992)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1097, file: !14, line: 2579, baseType: !1509, size: 64, align: 64, offset: 5056)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1097, file: !14, line: 2586, baseType: !981, size: 32, align: 32, offset: 5120)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1097, file: !14, line: 2615, baseType: !981, size: 32, align: 32, offset: 5152)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1097, file: !14, line: 2627, baseType: !981, size: 32, align: 32, offset: 5184)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1097, file: !14, line: 2637, baseType: !981, size: 32, align: 32, offset: 5216)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1097, file: !14, line: 2681, baseType: !981, size: 32, align: 32, offset: 5248)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1097, file: !14, line: 2709, baseType: !945, size: 64, align: 64, offset: 5312)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1097, file: !14, line: 2716, baseType: !1518, size: 64, align: 64, offset: 5376)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1521)
!1521 = !{!1522, !1523, !1524, !1525, !1526, !1527, !1531, !1535, !1539, !1540, !1541, !1542, !1548, !1549, !1550, !1551, !1552}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1520, file: !14, line: 3642, baseType: !974, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1520, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1520, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1520, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1520, file: !14, line: 3669, baseType: !981, size: 32, align: 32, offset: 160)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1520, file: !14, line: 3682, baseType: !1528, size: 64, align: 64, offset: 192)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!981, !1095, !1117}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1520, file: !14, line: 3698, baseType: !1532, size: 64, align: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!981, !1095, !949, !958}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1520, file: !14, line: 3712, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!981, !1095, !981, !949, !958}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1520, file: !14, line: 3726, baseType: !1532, size: 64, align: 64, offset: 384)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1520, file: !14, line: 3737, baseType: !1092, size: 64, align: 64, offset: 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1520, file: !14, line: 3746, baseType: !981, size: 32, align: 32, offset: 512)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1520, file: !14, line: 3757, baseType: !1543, size: 64, align: 64, offset: 576)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{null, !1546}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1520, file: !14, line: 3766, baseType: !1092, size: 64, align: 64, offset: 640)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1520, file: !14, line: 3774, baseType: !1092, size: 64, align: 64, offset: 704)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1520, file: !14, line: 3780, baseType: !981, size: 32, align: 32, offset: 768)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1520, file: !14, line: 3785, baseType: !981, size: 32, align: 32, offset: 800)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1520, file: !14, line: 3795, baseType: !1553, size: 64, align: 64, offset: 832)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!981, !1095, !1154}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1097, file: !14, line: 2728, baseType: !948, size: 64, align: 64, offset: 5440)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1097, file: !14, line: 2735, baseType: !1144, size: 512, align: 64, offset: 5504)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1097, file: !14, line: 2742, baseType: !981, size: 32, align: 32, offset: 6016)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1097, file: !14, line: 2755, baseType: !981, size: 32, align: 32, offset: 6048)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1097, file: !14, line: 2776, baseType: !981, size: 32, align: 32, offset: 6080)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1097, file: !14, line: 2783, baseType: !981, size: 32, align: 32, offset: 6112)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1097, file: !14, line: 2791, baseType: !981, size: 32, align: 32, offset: 6144)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1097, file: !14, line: 2802, baseType: !1117, size: 64, align: 64, offset: 6208)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1097, file: !14, line: 2811, baseType: !981, size: 32, align: 32, offset: 6272)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1097, file: !14, line: 2821, baseType: !981, size: 32, align: 32, offset: 6304)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1097, file: !14, line: 2830, baseType: !981, size: 32, align: 32, offset: 6336)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1097, file: !14, line: 2840, baseType: !981, size: 32, align: 32, offset: 6368)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1097, file: !14, line: 2851, baseType: !1569, size: 64, align: 64, offset: 6400)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!981, !1383, !1572, !948, !1386, !981, !981}
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!981, !1383, !948}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1097, file: !14, line: 2871, baseType: !1576, size: 64, align: 64, offset: 6464)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!981, !1383, !1579, !948, !1386, !981}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!981, !1383, !948, !981, !981}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1097, file: !14, line: 2878, baseType: !981, size: 32, align: 32, offset: 6528)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1097, file: !14, line: 2885, baseType: !981, size: 32, align: 32, offset: 6560)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1097, file: !14, line: 3005, baseType: !981, size: 32, align: 32, offset: 6592)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1097, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1097, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1097, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1097, file: !14, line: 3037, baseType: !966, size: 64, align: 64, offset: 6720)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1097, file: !14, line: 3038, baseType: !981, size: 32, align: 32, offset: 6784)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1097, file: !14, line: 3050, baseType: !1003, size: 64, align: 64, offset: 6848)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1097, file: !14, line: 3065, baseType: !981, size: 32, align: 32, offset: 6912)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1097, file: !14, line: 3083, baseType: !981, size: 32, align: 32, offset: 6944)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1097, file: !14, line: 3092, baseType: !985, size: 64, align: 32, offset: 6976)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1097, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1097, file: !14, line: 3106, baseType: !985, size: 64, align: 32, offset: 7072)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1097, file: !14, line: 3113, baseType: !1597, size: 64, align: 64, offset: 7168)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1599)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1605, !1606, !1607, !1610}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1600, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1600, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1600, file: !14, line: 720, baseType: !974, size: 64, align: 64, offset: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1600, file: !14, line: 724, baseType: !974, size: 64, align: 64, offset: 128)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1600, file: !14, line: 728, baseType: !981, size: 32, align: 32, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1600, file: !14, line: 734, baseType: !1608, size: 64, align: 64, offset: 256)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1600, file: !14, line: 739, baseType: !1611, size: 64, align: 64, offset: 320)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1097, file: !14, line: 3129, baseType: !945, size: 64, align: 64, offset: 7232)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1097, file: !14, line: 3130, baseType: !945, size: 64, align: 64, offset: 7296)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1097, file: !14, line: 3131, baseType: !945, size: 64, align: 64, offset: 7360)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1097, file: !14, line: 3132, baseType: !945, size: 64, align: 64, offset: 7424)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1097, file: !14, line: 3139, baseType: !1509, size: 64, align: 64, offset: 7488)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1097, file: !14, line: 3147, baseType: !981, size: 32, align: 32, offset: 7552)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1097, file: !14, line: 3165, baseType: !981, size: 32, align: 32, offset: 7584)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1097, file: !14, line: 3172, baseType: !981, size: 32, align: 32, offset: 7616)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1097, file: !14, line: 3180, baseType: !981, size: 32, align: 32, offset: 7648)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1097, file: !14, line: 3191, baseType: !1423, size: 64, align: 64, offset: 7680)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1097, file: !14, line: 3199, baseType: !966, size: 64, align: 64, offset: 7744)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1097, file: !14, line: 3207, baseType: !1509, size: 64, align: 64, offset: 7808)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1097, file: !14, line: 3214, baseType: !959, size: 32, align: 32, offset: 7872)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1097, file: !14, line: 3224, baseType: !1252, size: 64, align: 64, offset: 7936)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1097, file: !14, line: 3225, baseType: !981, size: 32, align: 32, offset: 8000)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1097, file: !14, line: 3249, baseType: !1154, size: 64, align: 64, offset: 8064)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1097, file: !14, line: 3256, baseType: !981, size: 32, align: 32, offset: 8128)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1097, file: !14, line: 3271, baseType: !981, size: 32, align: 32, offset: 8160)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1097, file: !14, line: 3279, baseType: !945, size: 64, align: 64, offset: 8192)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1097, file: !14, line: 3301, baseType: !1154, size: 64, align: 64, offset: 8256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1097, file: !14, line: 3310, baseType: !981, size: 32, align: 32, offset: 8320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1097, file: !14, line: 3337, baseType: !981, size: 32, align: 32, offset: 8352)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1097, file: !14, line: 3351, baseType: !981, size: 32, align: 32, offset: 8384)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1097, file: !14, line: 3359, baseType: !981, size: 32, align: 32, offset: 8416)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !971, file: !14, line: 3535, baseType: !1638, size: 64, align: 64, offset: 1024)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{!981, !1095, !1641}
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !971, file: !14, line: 3541, baseType: !1644, size: 64, align: 64, offset: 1088)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1646)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1111, line: 223, size: 128, align: 64, elements: !1648)
!1648 = !{!1649, !1650}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1647, file: !1111, line: 224, baseType: !949, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1647, file: !1111, line: 225, baseType: !949, size: 64, align: 64, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !971, file: !14, line: 3549, baseType: !1652, size: 64, align: 64, offset: 1152)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1090}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !971, file: !14, line: 3551, baseType: !1092, size: 64, align: 64, offset: 1216)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !971, file: !14, line: 3552, baseType: !1657, size: 64, align: 64, offset: 1280)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!981, !1095, !966, !981, !1660}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1663)
!1663 = !{!1664, !1665, !1666, !1667, !1668, !1692}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1662, file: !14, line: 3921, baseType: !964, size: 16, align: 16)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1662, file: !14, line: 3922, baseType: !958, size: 32, align: 32, offset: 32)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1662, file: !14, line: 3923, baseType: !958, size: 32, align: 32, offset: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1662, file: !14, line: 3924, baseType: !959, size: 32, align: 32, offset: 96)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1662, file: !14, line: 3925, baseType: !1669, size: 64, align: 64, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1685, !1687, !1688, !1689, !1690, !1691}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1672, file: !14, line: 3886, baseType: !981, size: 32, align: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1672, file: !14, line: 3887, baseType: !981, size: 32, align: 32, offset: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1672, file: !14, line: 3888, baseType: !981, size: 32, align: 32, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1672, file: !14, line: 3889, baseType: !981, size: 32, align: 32, offset: 96)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1672, file: !14, line: 3890, baseType: !981, size: 32, align: 32, offset: 128)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1672, file: !14, line: 3897, baseType: !1680, size: 768, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1681)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1682)
!1682 = !{!1683, !1684}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1681, file: !14, line: 3855, baseType: !1122, size: 512, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1681, file: !14, line: 3857, baseType: !1126, size: 256, align: 32, offset: 512)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1672, file: !14, line: 3903, baseType: !1686, size: 256, align: 64, offset: 960)
!1686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 256, align: 64, elements: !1223)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1672, file: !14, line: 3904, baseType: !1230, size: 128, align: 32, offset: 1216)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1672, file: !14, line: 3908, baseType: !1509, size: 64, align: 64, offset: 1408)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1672, file: !14, line: 3915, baseType: !1509, size: 64, align: 64, offset: 1472)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1672, file: !14, line: 3917, baseType: !981, size: 32, align: 32, offset: 1536)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1662, file: !14, line: 3926, baseType: !945, size: 64, align: 64, offset: 192)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !971, file: !14, line: 3564, baseType: !1694, size: 64, align: 64, offset: 1344)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!981, !1095, !1240, !1384, !1386}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !971, file: !14, line: 3566, baseType: !1698, size: 64, align: 64, offset: 1408)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!981, !1095, !948, !1386, !1240}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !971, file: !14, line: 3567, baseType: !1092, size: 64, align: 64, offset: 1472)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !971, file: !14, line: 3576, baseType: !1703, size: 64, align: 64, offset: 1536)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!981, !1095, !1384}
