; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--bethsoftvideo.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--bethsoftvideo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BethsoftVidBlockType", file: !888, line: 25, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/bethsoftvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIEnumerator(name: "PALETTE_BLOCK", value: 2)
!891 = !DIEnumerator(name: "FIRST_AUDIO_BLOCK", value: 124)
!892 = !DIEnumerator(name: "AUDIO_BLOCK", value: 125)
!893 = !DIEnumerator(name: "VIDEO_I_FRAME", value: 3)
!894 = !DIEnumerator(name: "VIDEO_P_FRAME", value: 1)
!895 = !DIEnumerator(name: "VIDEO_YOFF_P_FRAME", value: 4)
!896 = !DIEnumerator(name: "EOF_BLOCK", value: 20)
!897 = !{!898, !899, !900, !901, !904, !908}
!898 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!899 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !903, line: 51, baseType: !899)
!903 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !903, line: 48, baseType: !907)
!907 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !911, line: 222, size: 16, align: 8, elements: !912)
!911 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !910, file: !911, line: 222, baseType: !914, size: 16, align: 16)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !903, line: 49, baseType: !915)
!915 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!916 = !{!917}
!917 = distinct !DIGlobalVariable(name: "ff_bethsoftvid_decoder", scope: !0, file: !918, line: 156, type: !919, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_bethsoftvid_decoder)
!918 = !DIFile(filename: "libavcodec/bethsoftvideo.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !921)
!921 = !{!922, !926, !927, !928, !929, !930, !939, !942, !945, !948, !953, !954, !995, !1003, !1004, !1005, !1007, !1556, !1562, !1570, !1574, !1575, !1612, !1616, !1620, !1621, !1625, !1629, !1630, !1634, !1635, !1636}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !14, line: 3475, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !920, file: !14, line: 3480, baseType: !923, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !920, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !920, file: !14, line: 3487, baseType: !898, size: 32, align: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !920, file: !14, line: 3488, baseType: !931, size: 64, align: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !934, line: 61, baseType: !935)
!934 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !934, line: 58, size: 64, align: 32, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !935, file: !934, line: 59, baseType: !898, size: 32, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !935, file: !934, line: 60, baseType: !898, size: 32, align: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !920, file: !14, line: 3489, baseType: !940, size: 64, align: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !920, file: !14, line: 3490, baseType: !943, size: 64, align: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !920, file: !14, line: 3491, baseType: !946, size: 64, align: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !920, file: !14, line: 3492, baseType: !949, size: 64, align: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !903, line: 55, baseType: !952)
!952 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !920, file: !14, line: 3493, baseType: !906, size: 8, align: 8, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !920, file: !14, line: 3494, baseType: !955, size: 64, align: 64, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !959)
!959 = !{!960, !961, !965, !969, !970, !971, !972, !976, !982, !984, !988}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !958, file: !691, line: 72, baseType: !923, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !958, file: !691, line: 78, baseType: !962, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!923, !900}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !958, file: !691, line: 85, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !958, file: !691, line: 93, baseType: !898, size: 32, align: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !958, file: !691, line: 99, baseType: !898, size: 32, align: 32, offset: 224)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !958, file: !691, line: 108, baseType: !898, size: 32, align: 32, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !958, file: !691, line: 113, baseType: !973, size: 64, align: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!900, !900, !900}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !958, file: !691, line: 123, baseType: !977, size: 64, align: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!980, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !958, file: !691, line: 130, baseType: !983, size: 32, align: 32, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !958, file: !691, line: 136, baseType: !985, size: 64, align: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!983, !900}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !958, file: !691, line: 142, baseType: !989, size: 64, align: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!898, !992, !900, !923, !898}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !920, file: !14, line: 3495, baseType: !996, size: 64, align: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !999, file: !14, line: 3402, baseType: !898, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !14, line: 3403, baseType: !923, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !920, file: !14, line: 3507, baseType: !923, size: 64, align: 64, offset: 768)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !920, file: !14, line: 3516, baseType: !898, size: 32, align: 32, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !14, line: 3517, baseType: !1006, size: 64, align: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !920, file: !14, line: 3527, baseType: !1008, size: 64, align: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!898, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1021, !1022, !1023, !1024, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1306, !1310, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1494, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1013, file: !14, line: 1561, baseType: !955, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1013, file: !14, line: 1562, baseType: !898, size: 32, align: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1013, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1013, file: !14, line: 1565, baseType: !1019, size: 64, align: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1013, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1013, file: !14, line: 1581, baseType: !899, size: 32, align: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1013, file: !14, line: 1583, baseType: !900, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1013, file: !14, line: 1591, baseType: !1025, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1027, line: 129, size: 1664, align: 64, elements: !1028)
!1027 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1028 = !{!1029, !1030, !1031, !1032, !1132, !1153, !1154, !1183, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1026, file: !1027, line: 136, baseType: !898, size: 32, align: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1026, file: !1027, line: 151, baseType: !898, size: 32, align: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1026, file: !1027, line: 157, baseType: !898, size: 32, align: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1026, file: !1027, line: 159, baseType: !1033, size: 64, align: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1036)
!1036 = !{!1037, !1042, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1084, !1086, !1087, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1120, !1121, !1122, !1123, !1124, !1125, !1128, !1129, !1130, !1131}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1035, file: !722, line: 282, baseType: !1038, size: 512, align: 64)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 64, elements: !1040)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!1040 = !{!1041}
!1041 = !DISubrange(count: 8)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1035, file: !722, line: 299, baseType: !1043, size: 256, align: 32, offset: 512)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, align: 32, elements: !1040)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1035, file: !722, line: 315, baseType: !1045, size: 64, align: 64, offset: 768)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1035, file: !722, line: 326, baseType: !898, size: 32, align: 32, offset: 832)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1035, file: !722, line: 326, baseType: !898, size: 32, align: 32, offset: 864)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1035, file: !722, line: 334, baseType: !898, size: 32, align: 32, offset: 896)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1035, file: !722, line: 341, baseType: !898, size: 32, align: 32, offset: 928)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1035, file: !722, line: 346, baseType: !898, size: 32, align: 32, offset: 960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1035, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1035, file: !722, line: 356, baseType: !933, size: 64, align: 32, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1035, file: !722, line: 361, baseType: !1054, size: 64, align: 64, offset: 1088)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !903, line: 40, baseType: !1055)
!1055 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1035, file: !722, line: 369, baseType: !1054, size: 64, align: 64, offset: 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1035, file: !722, line: 377, baseType: !1054, size: 64, align: 64, offset: 1216)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1035, file: !722, line: 382, baseType: !898, size: 32, align: 32, offset: 1280)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1035, file: !722, line: 386, baseType: !898, size: 32, align: 32, offset: 1312)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1035, file: !722, line: 391, baseType: !898, size: 32, align: 32, offset: 1344)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1035, file: !722, line: 396, baseType: !900, size: 64, align: 64, offset: 1408)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1035, file: !722, line: 403, baseType: !1063, size: 512, align: 64, offset: 1472)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 512, align: 64, elements: !1040)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1035, file: !722, line: 410, baseType: !898, size: 32, align: 32, offset: 1984)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1035, file: !722, line: 415, baseType: !898, size: 32, align: 32, offset: 2016)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1035, file: !722, line: 420, baseType: !898, size: 32, align: 32, offset: 2048)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1035, file: !722, line: 425, baseType: !898, size: 32, align: 32, offset: 2080)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1035, file: !722, line: 435, baseType: !1054, size: 64, align: 64, offset: 2112)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1035, file: !722, line: 440, baseType: !898, size: 32, align: 32, offset: 2176)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1035, file: !722, line: 445, baseType: !951, size: 64, align: 64, offset: 2240)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1035, file: !722, line: 459, baseType: !1072, size: 512, align: 64, offset: 2304)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 512, align: 64, elements: !1040)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1075, line: 94, baseType: !1076)
!1075 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1075, line: 81, size: 192, align: 64, elements: !1077)
!1077 = !{!1078, !1082, !1083}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1076, file: !1075, line: 82, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1075, line: 73, baseType: !1081)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1075, line: 73, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1076, file: !1075, line: 89, baseType: !1039, size: 64, align: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !1075, line: 93, baseType: !898, size: 32, align: 32, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1035, file: !722, line: 473, baseType: !1085, size: 64, align: 64, offset: 2816)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1035, file: !722, line: 477, baseType: !898, size: 32, align: 32, offset: 2880)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1035, file: !722, line: 479, baseType: !1088, size: 64, align: 64, offset: 2944)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096, !1101}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1091, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1091, file: !722, line: 203, baseType: !1039, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1091, file: !722, line: 204, baseType: !898, size: 32, align: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1091, file: !722, line: 205, baseType: !1097, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1099, line: 86, baseType: !1100)
!1099 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1099, line: 86, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1091, file: !722, line: 206, baseType: !1073, size: 64, align: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1035, file: !722, line: 480, baseType: !898, size: 32, align: 32, offset: 3008)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !722, line: 505, baseType: !898, size: 32, align: 32, offset: 3040)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1035, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1035, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1035, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1035, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1035, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1035, file: !722, line: 532, baseType: !1054, size: 64, align: 64, offset: 3264)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1035, file: !722, line: 539, baseType: !1054, size: 64, align: 64, offset: 3328)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1035, file: !722, line: 547, baseType: !1054, size: 64, align: 64, offset: 3392)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1035, file: !722, line: 554, baseType: !1097, size: 64, align: 64, offset: 3456)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1035, file: !722, line: 563, baseType: !898, size: 32, align: 32, offset: 3520)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1035, file: !722, line: 572, baseType: !898, size: 32, align: 32, offset: 3552)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1035, file: !722, line: 581, baseType: !898, size: 32, align: 32, offset: 3584)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1035, file: !722, line: 588, baseType: !1117, size: 64, align: 64, offset: 3648)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !903, line: 36, baseType: !1119)
!1119 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1035, file: !722, line: 593, baseType: !898, size: 32, align: 32, offset: 3712)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1035, file: !722, line: 596, baseType: !898, size: 32, align: 32, offset: 3744)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1035, file: !722, line: 599, baseType: !1073, size: 64, align: 64, offset: 3776)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1035, file: !722, line: 605, baseType: !1073, size: 64, align: 64, offset: 3840)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1035, file: !722, line: 616, baseType: !1073, size: 64, align: 64, offset: 3904)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1035, file: !722, line: 626, baseType: !1126, size: 64, align: 64, offset: 3968)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 216, baseType: !952)
!1127 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1035, file: !722, line: 627, baseType: !1126, size: 64, align: 64, offset: 4032)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1035, file: !722, line: 628, baseType: !1126, size: 64, align: 64, offset: 4096)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1035, file: !722, line: 629, baseType: !1126, size: 64, align: 64, offset: 4160)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1035, file: !722, line: 645, baseType: !1073, size: 64, align: 64, offset: 4224)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1026, file: !1027, line: 161, baseType: !1133, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1027, line: 117, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1027, line: 100, size: 832, align: 64, elements: !1136)
!1136 = !{!1137, !1144, !1145, !1146, !1147, !1148, !1150, !1151, !1152}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1135, file: !1027, line: 105, baseType: !1138, size: 256, align: 64)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, align: 64, elements: !1142)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1075, line: 238, baseType: !1141)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1075, line: 238, flags: DIFlagFwdDecl)
!1142 = !{!1143}
!1143 = !DISubrange(count: 4)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1135, file: !1027, line: 110, baseType: !898, size: 32, align: 32, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1135, file: !1027, line: 111, baseType: !898, size: 32, align: 32, offset: 288)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1135, file: !1027, line: 111, baseType: !898, size: 32, align: 32, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1135, file: !1027, line: 112, baseType: !1043, size: 256, align: 32, offset: 352)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1135, file: !1027, line: 113, baseType: !1149, size: 128, align: 32, offset: 608)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 128, align: 32, elements: !1142)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1135, file: !1027, line: 114, baseType: !898, size: 32, align: 32, offset: 736)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1135, file: !1027, line: 115, baseType: !898, size: 32, align: 32, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1135, file: !1027, line: 116, baseType: !898, size: 32, align: 32, offset: 800)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1026, file: !1027, line: 163, baseType: !900, size: 64, align: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1026, file: !1027, line: 165, baseType: !1155, size: 128, align: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1027, line: 122, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1027, line: 119, size: 128, align: 64, elements: !1157)
!1157 = !{!1158, !1182}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1156, file: !1027, line: 120, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1178, !1179, !1180, !1181}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1161, file: !14, line: 1451, baseType: !1073, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1161, file: !14, line: 1461, baseType: !1054, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1161, file: !14, line: 1467, baseType: !1054, size: 64, align: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !14, line: 1468, baseType: !1039, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !14, line: 1469, baseType: !898, size: 32, align: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1161, file: !14, line: 1470, baseType: !898, size: 32, align: 32, offset: 288)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !14, line: 1474, baseType: !898, size: 32, align: 32, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1161, file: !14, line: 1479, baseType: !1171, size: 64, align: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !14, line: 1412, baseType: !1039, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !14, line: 1413, baseType: !898, size: 32, align: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1161, file: !14, line: 1480, baseType: !898, size: 32, align: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1161, file: !14, line: 1486, baseType: !1054, size: 64, align: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1161, file: !14, line: 1488, baseType: !1054, size: 64, align: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1161, file: !14, line: 1497, baseType: !1054, size: 64, align: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1156, file: !1027, line: 121, baseType: !1033, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1026, file: !1027, line: 166, baseType: !1184, size: 128, align: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1027, line: 127, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1027, line: 124, size: 128, align: 64, elements: !1186)
!1186 = !{!1187, !1260}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1185, file: !1027, line: 125, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1218, !1222, !1223, !1257, !1258, !1259}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1191, file: !14, line: 5751, baseType: !955, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1191, file: !14, line: 5756, baseType: !1195, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1203, !1204, !1205, !1209, !1213, !1217}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1197, file: !14, line: 5797, baseType: !923, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1197, file: !14, line: 5804, baseType: !1201, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1197, file: !14, line: 5815, baseType: !955, size: 64, align: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1197, file: !14, line: 5825, baseType: !898, size: 32, align: 32, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1197, file: !14, line: 5826, baseType: !1206, size: 64, align: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!898, !1189}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1197, file: !14, line: 5827, baseType: !1210, size: 64, align: 64, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!898, !1189, !1159}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1197, file: !14, line: 5828, baseType: !1214, size: 64, align: 64, offset: 384)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{null, !1189}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1197, file: !14, line: 5829, baseType: !1214, size: 64, align: 64, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1191, file: !14, line: 5762, baseType: !1219, size: 64, align: 64, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1221)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1191, file: !14, line: 5768, baseType: !900, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1191, file: !14, line: 5775, baseType: !1224, size: 64, align: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1226, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1226, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1226, file: !14, line: 3948, baseType: !902, size: 32, align: 32, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1226, file: !14, line: 3958, baseType: !1039, size: 64, align: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1226, file: !14, line: 3962, baseType: !898, size: 32, align: 32, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1226, file: !14, line: 3968, baseType: !898, size: 32, align: 32, offset: 224)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1226, file: !14, line: 3973, baseType: !1054, size: 64, align: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1226, file: !14, line: 3986, baseType: !898, size: 32, align: 32, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1226, file: !14, line: 3999, baseType: !898, size: 32, align: 32, offset: 352)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1226, file: !14, line: 4004, baseType: !898, size: 32, align: 32, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1226, file: !14, line: 4005, baseType: !898, size: 32, align: 32, offset: 416)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1226, file: !14, line: 4010, baseType: !898, size: 32, align: 32, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1226, file: !14, line: 4011, baseType: !898, size: 32, align: 32, offset: 480)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1226, file: !14, line: 4020, baseType: !933, size: 64, align: 32, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1226, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1226, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1226, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1226, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1226, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1226, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1226, file: !14, line: 4039, baseType: !898, size: 32, align: 32, offset: 768)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1226, file: !14, line: 4046, baseType: !951, size: 64, align: 64, offset: 832)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1226, file: !14, line: 4050, baseType: !898, size: 32, align: 32, offset: 896)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1226, file: !14, line: 4054, baseType: !898, size: 32, align: 32, offset: 928)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1226, file: !14, line: 4061, baseType: !898, size: 32, align: 32, offset: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1226, file: !14, line: 4065, baseType: !898, size: 32, align: 32, offset: 992)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1226, file: !14, line: 4073, baseType: !898, size: 32, align: 32, offset: 1024)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1226, file: !14, line: 4080, baseType: !898, size: 32, align: 32, offset: 1056)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1226, file: !14, line: 4084, baseType: !898, size: 32, align: 32, offset: 1088)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1191, file: !14, line: 5781, baseType: !1224, size: 64, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1191, file: !14, line: 5787, baseType: !933, size: 64, align: 32, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1191, file: !14, line: 5793, baseType: !933, size: 64, align: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1185, file: !1027, line: 126, baseType: !898, size: 32, align: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1026, file: !1027, line: 172, baseType: !1159, size: 64, align: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1026, file: !1027, line: 177, baseType: !1039, size: 64, align: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1026, file: !1027, line: 178, baseType: !899, size: 32, align: 32, offset: 704)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1026, file: !1027, line: 180, baseType: !900, size: 64, align: 64, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1026, file: !1027, line: 185, baseType: !898, size: 32, align: 32, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1026, file: !1027, line: 190, baseType: !900, size: 64, align: 64, offset: 896)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1026, file: !1027, line: 195, baseType: !898, size: 32, align: 32, offset: 960)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1026, file: !1027, line: 200, baseType: !1159, size: 64, align: 64, offset: 1024)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1026, file: !1027, line: 201, baseType: !898, size: 32, align: 32, offset: 1088)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1026, file: !1027, line: 202, baseType: !1033, size: 64, align: 64, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1026, file: !1027, line: 203, baseType: !898, size: 32, align: 32, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1026, file: !1027, line: 205, baseType: !898, size: 32, align: 32, offset: 1248)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1026, file: !1027, line: 206, baseType: !898, size: 32, align: 32, offset: 1280)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1026, file: !1027, line: 209, baseType: !1126, size: 64, align: 64, offset: 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1026, file: !1027, line: 212, baseType: !1126, size: 64, align: 64, offset: 1408)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1026, file: !1027, line: 213, baseType: !1033, size: 64, align: 64, offset: 1472)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1026, file: !1027, line: 215, baseType: !898, size: 32, align: 32, offset: 1536)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1026, file: !1027, line: 217, baseType: !898, size: 32, align: 32, offset: 1568)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1026, file: !1027, line: 220, baseType: !898, size: 32, align: 32, offset: 1600)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1013, file: !14, line: 1598, baseType: !900, size: 64, align: 64, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1013, file: !14, line: 1606, baseType: !1054, size: 64, align: 64, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1013, file: !14, line: 1614, baseType: !898, size: 32, align: 32, offset: 512)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1013, file: !14, line: 1622, baseType: !898, size: 32, align: 32, offset: 544)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1013, file: !14, line: 1628, baseType: !898, size: 32, align: 32, offset: 576)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1013, file: !14, line: 1636, baseType: !898, size: 32, align: 32, offset: 608)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1013, file: !14, line: 1643, baseType: !898, size: 32, align: 32, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1013, file: !14, line: 1657, baseType: !1039, size: 64, align: 64, offset: 704)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1013, file: !14, line: 1658, baseType: !898, size: 32, align: 32, offset: 768)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1013, file: !14, line: 1679, baseType: !933, size: 64, align: 32, offset: 800)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1013, file: !14, line: 1688, baseType: !898, size: 32, align: 32, offset: 864)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1013, file: !14, line: 1712, baseType: !898, size: 32, align: 32, offset: 896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1013, file: !14, line: 1729, baseType: !898, size: 32, align: 32, offset: 928)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1013, file: !14, line: 1729, baseType: !898, size: 32, align: 32, offset: 960)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1013, file: !14, line: 1744, baseType: !898, size: 32, align: 32, offset: 992)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1013, file: !14, line: 1744, baseType: !898, size: 32, align: 32, offset: 1024)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1013, file: !14, line: 1751, baseType: !898, size: 32, align: 32, offset: 1056)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1013, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1013, file: !14, line: 1791, baseType: !1299, size: 64, align: 64, offset: 1152)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{null, !1302, !1303, !1305, !898, !898, !898}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1013, file: !14, line: 1808, baseType: !1307, size: 64, align: 64, offset: 1216)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!473, !1302, !940}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1013, file: !14, line: 1816, baseType: !898, size: 32, align: 32, offset: 1280)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1013, file: !14, line: 1825, baseType: !1312, size: 32, align: 32, offset: 1312)
!1312 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1013, file: !14, line: 1830, baseType: !898, size: 32, align: 32, offset: 1344)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1013, file: !14, line: 1838, baseType: !1312, size: 32, align: 32, offset: 1376)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1013, file: !14, line: 1846, baseType: !898, size: 32, align: 32, offset: 1408)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1013, file: !14, line: 1851, baseType: !898, size: 32, align: 32, offset: 1440)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1013, file: !14, line: 1861, baseType: !1312, size: 32, align: 32, offset: 1472)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1013, file: !14, line: 1868, baseType: !1312, size: 32, align: 32, offset: 1504)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1013, file: !14, line: 1875, baseType: !1312, size: 32, align: 32, offset: 1536)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1013, file: !14, line: 1882, baseType: !1312, size: 32, align: 32, offset: 1568)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1013, file: !14, line: 1889, baseType: !1312, size: 32, align: 32, offset: 1600)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1013, file: !14, line: 1896, baseType: !1312, size: 32, align: 32, offset: 1632)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1013, file: !14, line: 1903, baseType: !1312, size: 32, align: 32, offset: 1664)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1013, file: !14, line: 1910, baseType: !898, size: 32, align: 32, offset: 1696)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1013, file: !14, line: 1915, baseType: !898, size: 32, align: 32, offset: 1728)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1013, file: !14, line: 1926, baseType: !1305, size: 64, align: 64, offset: 1792)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1013, file: !14, line: 1935, baseType: !933, size: 64, align: 32, offset: 1856)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1013, file: !14, line: 1942, baseType: !898, size: 32, align: 32, offset: 1920)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1013, file: !14, line: 1948, baseType: !898, size: 32, align: 32, offset: 1952)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1013, file: !14, line: 1954, baseType: !898, size: 32, align: 32, offset: 1984)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1013, file: !14, line: 1960, baseType: !898, size: 32, align: 32, offset: 2016)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1013, file: !14, line: 1984, baseType: !898, size: 32, align: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1013, file: !14, line: 1991, baseType: !898, size: 32, align: 32, offset: 2080)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1013, file: !14, line: 1996, baseType: !898, size: 32, align: 32, offset: 2112)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1013, file: !14, line: 2004, baseType: !898, size: 32, align: 32, offset: 2144)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1013, file: !14, line: 2011, baseType: !898, size: 32, align: 32, offset: 2176)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1013, file: !14, line: 2018, baseType: !898, size: 32, align: 32, offset: 2208)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1013, file: !14, line: 2027, baseType: !898, size: 32, align: 32, offset: 2240)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1013, file: !14, line: 2034, baseType: !898, size: 32, align: 32, offset: 2272)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1013, file: !14, line: 2044, baseType: !898, size: 32, align: 32, offset: 2304)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1013, file: !14, line: 2054, baseType: !1342, size: 64, align: 64, offset: 2368)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1013, file: !14, line: 2061, baseType: !1342, size: 64, align: 64, offset: 2432)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1013, file: !14, line: 2066, baseType: !898, size: 32, align: 32, offset: 2496)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1013, file: !14, line: 2070, baseType: !898, size: 32, align: 32, offset: 2528)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1013, file: !14, line: 2078, baseType: !898, size: 32, align: 32, offset: 2560)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1013, file: !14, line: 2085, baseType: !898, size: 32, align: 32, offset: 2592)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1013, file: !14, line: 2092, baseType: !898, size: 32, align: 32, offset: 2624)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1013, file: !14, line: 2099, baseType: !898, size: 32, align: 32, offset: 2656)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1013, file: !14, line: 2106, baseType: !898, size: 32, align: 32, offset: 2688)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1013, file: !14, line: 2113, baseType: !898, size: 32, align: 32, offset: 2720)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1013, file: !14, line: 2120, baseType: !898, size: 32, align: 32, offset: 2752)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1013, file: !14, line: 2125, baseType: !898, size: 32, align: 32, offset: 2784)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1013, file: !14, line: 2133, baseType: !898, size: 32, align: 32, offset: 2816)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1013, file: !14, line: 2140, baseType: !898, size: 32, align: 32, offset: 2848)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1013, file: !14, line: 2145, baseType: !898, size: 32, align: 32, offset: 2880)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1013, file: !14, line: 2153, baseType: !898, size: 32, align: 32, offset: 2912)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1013, file: !14, line: 2158, baseType: !898, size: 32, align: 32, offset: 2944)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1013, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1013, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1013, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1013, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1013, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1013, file: !14, line: 2203, baseType: !898, size: 32, align: 32, offset: 3136)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1013, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1013, file: !14, line: 2212, baseType: !898, size: 32, align: 32, offset: 3200)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1013, file: !14, line: 2213, baseType: !898, size: 32, align: 32, offset: 3232)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1013, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1013, file: !14, line: 2232, baseType: !898, size: 32, align: 32, offset: 3296)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1013, file: !14, line: 2243, baseType: !898, size: 32, align: 32, offset: 3328)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1013, file: !14, line: 2249, baseType: !898, size: 32, align: 32, offset: 3360)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1013, file: !14, line: 2256, baseType: !898, size: 32, align: 32, offset: 3392)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1013, file: !14, line: 2263, baseType: !951, size: 64, align: 64, offset: 3456)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1013, file: !14, line: 2270, baseType: !951, size: 64, align: 64, offset: 3520)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1013, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1013, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1013, file: !14, line: 2367, baseType: !1378, size: 64, align: 64, offset: 3648)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!898, !1302, !1033, !898}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1013, file: !14, line: 2383, baseType: !898, size: 32, align: 32, offset: 3712)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1013, file: !14, line: 2386, baseType: !1312, size: 32, align: 32, offset: 3744)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1013, file: !14, line: 2387, baseType: !1312, size: 32, align: 32, offset: 3776)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1013, file: !14, line: 2394, baseType: !898, size: 32, align: 32, offset: 3808)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1013, file: !14, line: 2401, baseType: !898, size: 32, align: 32, offset: 3840)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1013, file: !14, line: 2408, baseType: !898, size: 32, align: 32, offset: 3872)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1013, file: !14, line: 2415, baseType: !898, size: 32, align: 32, offset: 3904)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1013, file: !14, line: 2422, baseType: !898, size: 32, align: 32, offset: 3936)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1013, file: !14, line: 2423, baseType: !1390, size: 64, align: 64, offset: 3968)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1392, file: !14, line: 827, baseType: !898, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1392, file: !14, line: 828, baseType: !898, size: 32, align: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1392, file: !14, line: 829, baseType: !898, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1392, file: !14, line: 830, baseType: !1312, size: 32, align: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1013, file: !14, line: 2430, baseType: !1054, size: 64, align: 64, offset: 4032)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1013, file: !14, line: 2437, baseType: !1054, size: 64, align: 64, offset: 4096)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1013, file: !14, line: 2444, baseType: !1312, size: 32, align: 32, offset: 4160)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1013, file: !14, line: 2451, baseType: !1312, size: 32, align: 32, offset: 4192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1013, file: !14, line: 2458, baseType: !898, size: 32, align: 32, offset: 4224)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1013, file: !14, line: 2469, baseType: !898, size: 32, align: 32, offset: 4256)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1013, file: !14, line: 2475, baseType: !898, size: 32, align: 32, offset: 4288)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1013, file: !14, line: 2481, baseType: !898, size: 32, align: 32, offset: 4320)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1013, file: !14, line: 2485, baseType: !898, size: 32, align: 32, offset: 4352)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1013, file: !14, line: 2489, baseType: !898, size: 32, align: 32, offset: 4384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1013, file: !14, line: 2493, baseType: !898, size: 32, align: 32, offset: 4416)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1013, file: !14, line: 2501, baseType: !898, size: 32, align: 32, offset: 4448)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1013, file: !14, line: 2506, baseType: !898, size: 32, align: 32, offset: 4480)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1013, file: !14, line: 2510, baseType: !898, size: 32, align: 32, offset: 4512)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1013, file: !14, line: 2514, baseType: !1054, size: 64, align: 64, offset: 4544)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1013, file: !14, line: 2528, baseType: !1414, size: 64, align: 64, offset: 4608)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1302, !900, !898, !898}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1013, file: !14, line: 2534, baseType: !898, size: 32, align: 32, offset: 4672)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1013, file: !14, line: 2545, baseType: !898, size: 32, align: 32, offset: 4704)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1013, file: !14, line: 2547, baseType: !898, size: 32, align: 32, offset: 4736)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1013, file: !14, line: 2549, baseType: !898, size: 32, align: 32, offset: 4768)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1013, file: !14, line: 2551, baseType: !898, size: 32, align: 32, offset: 4800)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1013, file: !14, line: 2553, baseType: !898, size: 32, align: 32, offset: 4832)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1013, file: !14, line: 2555, baseType: !898, size: 32, align: 32, offset: 4864)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1013, file: !14, line: 2557, baseType: !898, size: 32, align: 32, offset: 4896)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1013, file: !14, line: 2559, baseType: !898, size: 32, align: 32, offset: 4928)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1013, file: !14, line: 2563, baseType: !898, size: 32, align: 32, offset: 4960)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1013, file: !14, line: 2571, baseType: !1428, size: 64, align: 64, offset: 4992)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1013, file: !14, line: 2579, baseType: !1428, size: 64, align: 64, offset: 5056)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1013, file: !14, line: 2586, baseType: !898, size: 32, align: 32, offset: 5120)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1013, file: !14, line: 2615, baseType: !898, size: 32, align: 32, offset: 5152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1013, file: !14, line: 2627, baseType: !898, size: 32, align: 32, offset: 5184)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1013, file: !14, line: 2637, baseType: !898, size: 32, align: 32, offset: 5216)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1013, file: !14, line: 2681, baseType: !898, size: 32, align: 32, offset: 5248)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1013, file: !14, line: 2709, baseType: !1054, size: 64, align: 64, offset: 5312)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1013, file: !14, line: 2716, baseType: !1437, size: 64, align: 64, offset: 5376)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1446, !1450, !1454, !1458, !1459, !1460, !1461, !1467, !1468, !1469, !1470, !1471}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1439, file: !14, line: 3642, baseType: !923, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1439, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1439, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1439, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1439, file: !14, line: 3669, baseType: !898, size: 32, align: 32, offset: 160)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1439, file: !14, line: 3682, baseType: !1447, size: 64, align: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!898, !1011, !1033}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1439, file: !14, line: 3698, baseType: !1451, size: 64, align: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!898, !1011, !904, !902}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1439, file: !14, line: 3712, baseType: !1455, size: 64, align: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!898, !1011, !898, !904, !902}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1439, file: !14, line: 3726, baseType: !1451, size: 64, align: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1439, file: !14, line: 3737, baseType: !1008, size: 64, align: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1439, file: !14, line: 3746, baseType: !898, size: 32, align: 32, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1439, file: !14, line: 3757, baseType: !1462, size: 64, align: 64, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1465}
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1439, file: !14, line: 3766, baseType: !1008, size: 64, align: 64, offset: 640)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1439, file: !14, line: 3774, baseType: !1008, size: 64, align: 64, offset: 704)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1439, file: !14, line: 3780, baseType: !898, size: 32, align: 32, offset: 768)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1439, file: !14, line: 3785, baseType: !898, size: 32, align: 32, offset: 800)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1439, file: !14, line: 3795, baseType: !1472, size: 64, align: 64, offset: 832)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!898, !1011, !1073}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1013, file: !14, line: 2728, baseType: !900, size: 64, align: 64, offset: 5440)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1013, file: !14, line: 2735, baseType: !1063, size: 512, align: 64, offset: 5504)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1013, file: !14, line: 2742, baseType: !898, size: 32, align: 32, offset: 6016)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1013, file: !14, line: 2755, baseType: !898, size: 32, align: 32, offset: 6048)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1013, file: !14, line: 2776, baseType: !898, size: 32, align: 32, offset: 6080)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1013, file: !14, line: 2783, baseType: !898, size: 32, align: 32, offset: 6112)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1013, file: !14, line: 2791, baseType: !898, size: 32, align: 32, offset: 6144)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1013, file: !14, line: 2802, baseType: !1033, size: 64, align: 64, offset: 6208)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1013, file: !14, line: 2811, baseType: !898, size: 32, align: 32, offset: 6272)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1013, file: !14, line: 2821, baseType: !898, size: 32, align: 32, offset: 6304)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1013, file: !14, line: 2830, baseType: !898, size: 32, align: 32, offset: 6336)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1013, file: !14, line: 2840, baseType: !898, size: 32, align: 32, offset: 6368)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1013, file: !14, line: 2851, baseType: !1488, size: 64, align: 64, offset: 6400)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!898, !1302, !1491, !900, !1305, !898, !898}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!898, !1302, !900}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1013, file: !14, line: 2871, baseType: !1495, size: 64, align: 64, offset: 6464)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!898, !1302, !1498, !900, !1305, !898}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!898, !1302, !900, !898, !898}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1013, file: !14, line: 2878, baseType: !898, size: 32, align: 32, offset: 6528)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1013, file: !14, line: 2885, baseType: !898, size: 32, align: 32, offset: 6560)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1013, file: !14, line: 3005, baseType: !898, size: 32, align: 32, offset: 6592)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1013, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1013, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1013, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1013, file: !14, line: 3037, baseType: !1039, size: 64, align: 64, offset: 6720)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1013, file: !14, line: 3038, baseType: !898, size: 32, align: 32, offset: 6784)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1013, file: !14, line: 3050, baseType: !951, size: 64, align: 64, offset: 6848)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1013, file: !14, line: 3065, baseType: !898, size: 32, align: 32, offset: 6912)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1013, file: !14, line: 3083, baseType: !898, size: 32, align: 32, offset: 6944)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1013, file: !14, line: 3092, baseType: !933, size: 64, align: 32, offset: 6976)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1013, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1013, file: !14, line: 3106, baseType: !933, size: 64, align: 32, offset: 7072)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1013, file: !14, line: 3113, baseType: !1516, size: 64, align: 64, offset: 7168)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1519)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1520)
!1520 = !{!1521, !1522, !1523, !1524, !1525, !1526, !1529}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1519, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1519, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1519, file: !14, line: 720, baseType: !923, size: 64, align: 64, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1519, file: !14, line: 724, baseType: !923, size: 64, align: 64, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1519, file: !14, line: 728, baseType: !898, size: 32, align: 32, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1519, file: !14, line: 734, baseType: !1527, size: 64, align: 64, offset: 256)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1519, file: !14, line: 739, baseType: !1530, size: 64, align: 64, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1013, file: !14, line: 3129, baseType: !1054, size: 64, align: 64, offset: 7232)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1013, file: !14, line: 3130, baseType: !1054, size: 64, align: 64, offset: 7296)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1013, file: !14, line: 3131, baseType: !1054, size: 64, align: 64, offset: 7360)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1013, file: !14, line: 3132, baseType: !1054, size: 64, align: 64, offset: 7424)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1013, file: !14, line: 3139, baseType: !1428, size: 64, align: 64, offset: 7488)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1013, file: !14, line: 3147, baseType: !898, size: 32, align: 32, offset: 7552)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1013, file: !14, line: 3165, baseType: !898, size: 32, align: 32, offset: 7584)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1013, file: !14, line: 3172, baseType: !898, size: 32, align: 32, offset: 7616)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1013, file: !14, line: 3180, baseType: !898, size: 32, align: 32, offset: 7648)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1013, file: !14, line: 3191, baseType: !1342, size: 64, align: 64, offset: 7680)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1013, file: !14, line: 3199, baseType: !1039, size: 64, align: 64, offset: 7744)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1013, file: !14, line: 3207, baseType: !1428, size: 64, align: 64, offset: 7808)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1013, file: !14, line: 3214, baseType: !899, size: 32, align: 32, offset: 7872)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1013, file: !14, line: 3224, baseType: !1171, size: 64, align: 64, offset: 7936)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1013, file: !14, line: 3225, baseType: !898, size: 32, align: 32, offset: 8000)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1013, file: !14, line: 3249, baseType: !1073, size: 64, align: 64, offset: 8064)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1013, file: !14, line: 3256, baseType: !898, size: 32, align: 32, offset: 8128)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1013, file: !14, line: 3271, baseType: !898, size: 32, align: 32, offset: 8160)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1013, file: !14, line: 3279, baseType: !1054, size: 64, align: 64, offset: 8192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1013, file: !14, line: 3301, baseType: !1073, size: 64, align: 64, offset: 8256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1013, file: !14, line: 3310, baseType: !898, size: 32, align: 32, offset: 8320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1013, file: !14, line: 3337, baseType: !898, size: 32, align: 32, offset: 8352)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1013, file: !14, line: 3351, baseType: !898, size: 32, align: 32, offset: 8384)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1013, file: !14, line: 3359, baseType: !898, size: 32, align: 32, offset: 8416)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !920, file: !14, line: 3535, baseType: !1557, size: 64, align: 64, offset: 1024)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!898, !1011, !1560}
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !920, file: !14, line: 3541, baseType: !1563, size: 64, align: 64, offset: 1088)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1565)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1027, line: 223, size: 128, align: 64, elements: !1567)
!1567 = !{!1568, !1569}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1566, file: !1027, line: 224, baseType: !904, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1566, file: !1027, line: 225, baseType: !904, size: 64, align: 64, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !920, file: !14, line: 3549, baseType: !1571, size: 64, align: 64, offset: 1152)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{null, !1006}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !920, file: !14, line: 3551, baseType: !1008, size: 64, align: 64, offset: 1216)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !920, file: !14, line: 3552, baseType: !1576, size: 64, align: 64, offset: 1280)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!898, !1011, !1039, !898, !1579}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1582)
!1582 = !{!1583, !1584, !1585, !1586, !1587, !1611}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1581, file: !14, line: 3921, baseType: !914, size: 16, align: 16)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1581, file: !14, line: 3922, baseType: !902, size: 32, align: 32, offset: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1581, file: !14, line: 3923, baseType: !902, size: 32, align: 32, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1581, file: !14, line: 3924, baseType: !899, size: 32, align: 32, offset: 96)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1581, file: !14, line: 3925, baseType: !1588, size: 64, align: 64, offset: 128)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596, !1597, !1598, !1604, !1606, !1607, !1608, !1609, !1610}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1591, file: !14, line: 3886, baseType: !898, size: 32, align: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1591, file: !14, line: 3887, baseType: !898, size: 32, align: 32, offset: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1591, file: !14, line: 3888, baseType: !898, size: 32, align: 32, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1591, file: !14, line: 3889, baseType: !898, size: 32, align: 32, offset: 96)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1591, file: !14, line: 3890, baseType: !898, size: 32, align: 32, offset: 128)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1591, file: !14, line: 3897, baseType: !1599, size: 768, align: 64, offset: 192)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1601)
!1601 = !{!1602, !1603}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1600, file: !14, line: 3855, baseType: !1038, size: 512, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1600, file: !14, line: 3857, baseType: !1043, size: 256, align: 32, offset: 512)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1591, file: !14, line: 3903, baseType: !1605, size: 256, align: 64, offset: 960)
!1605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 256, align: 64, elements: !1142)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1591, file: !14, line: 3904, baseType: !1149, size: 128, align: 32, offset: 1216)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1591, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1591, file: !14, line: 3908, baseType: !1428, size: 64, align: 64, offset: 1408)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1591, file: !14, line: 3915, baseType: !1428, size: 64, align: 64, offset: 1472)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1591, file: !14, line: 3917, baseType: !898, size: 32, align: 32, offset: 1536)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1581, file: !14, line: 3926, baseType: !1054, size: 64, align: 64, offset: 192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !920, file: !14, line: 3564, baseType: !1613, size: 64, align: 64, offset: 1344)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!898, !1011, !1159, !1303, !1305}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !920, file: !14, line: 3566, baseType: !1617, size: 64, align: 64, offset: 1408)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!898, !1011, !900, !1305, !1159}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !920, file: !14, line: 3567, baseType: !1008, size: 64, align: 64, offset: 1472)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !920, file: !14, line: 3576, baseType: !1622, size: 64, align: 64, offset: 1536)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!898, !1011, !1303}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !920, file: !14, line: 3577, baseType: !1626, size: 64, align: 64, offset: 1600)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!898, !1011, !1159}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !920, file: !14, line: 3584, baseType: !1447, size: 64, align: 64, offset: 1664)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !920, file: !14, line: 3589, baseType: !1631, size: 64, align: 64, offset: 1728)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{null, !1011}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !920, file: !14, line: 3594, baseType: !898, size: 32, align: 32, offset: 1792)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !920, file: !14, line: 3600, baseType: !923, size: 64, align: 64, offset: 1856)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !920, file: !14, line: 3609, baseType: !1637, size: 64, align: 64, offset: 1920)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1640)
!1640 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1641 = !{i32 2, !"Dwarf Version", i32 4}
!1642 = !{i32 2, !"Debug Info Version", i32 3}
!1643 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1644 = distinct !DISubprogram(name: "bethsoftvid_decode_init", scope: !918, file: !918, line: 41, type: !1009, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1645)
!1645 = !{}
!1646 = !DILocalVariable(name: "avctx", arg: 1, scope: !1644, file: !918, line: 41, type: !1011)
!1647 = !DIExpression()
!1648 = !DILocation(line: 41, column: 74, scope: !1644)
!1649 = !DILocalVariable(name: "vid", scope: !1644, file: !918, line: 43, type: !1650)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "BethsoftvidContext", file: !918, line: 39, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BethsoftvidContext", file: !918, line: 36, size: 256, align: 64, elements: !1653)
!1653 = !{!1654, !1655}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !1652, file: !918, line: 37, baseType: !1033, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1652, file: !918, line: 38, baseType: !1656, size: 192, align: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !1657, line: 35, baseType: !1658)
!1657 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
