; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--v4l2_m2m_enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--v4l2_m2m_enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!877 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!878 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!879 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!880 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!881 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!882 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!883 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!884 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!885 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!886 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!887 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!888 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!889 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!890 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!891 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!892 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!893 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!894 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!895 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!896 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!897 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!898 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!899 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!900 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!901 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!902 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "v4l2_buf_type", file: !910, line: 131, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "/usr/include/linux/videodev2.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!912 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_CAPTURE", value: 1)
!913 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OUTPUT", value: 2)
!914 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OVERLAY", value: 3)
!915 = !DIEnumerator(name: "V4L2_BUF_TYPE_VBI_CAPTURE", value: 4)
!916 = !DIEnumerator(name: "V4L2_BUF_TYPE_VBI_OUTPUT", value: 5)
!917 = !DIEnumerator(name: "V4L2_BUF_TYPE_SLICED_VBI_CAPTURE", value: 6)
!918 = !DIEnumerator(name: "V4L2_BUF_TYPE_SLICED_VBI_OUTPUT", value: 7)
!919 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OUTPUT_OVERLAY", value: 8)
!920 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_CAPTURE_MPLANE", value: 9)
!921 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OUTPUT_MPLANE", value: 10)
!922 = !DIEnumerator(name: "V4L2_BUF_TYPE_SDR_CAPTURE", value: 11)
!923 = !DIEnumerator(name: "V4L2_BUF_TYPE_SDR_OUTPUT", value: 12)
!924 = !DIEnumerator(name: "V4L2_BUF_TYPE_PRIVATE", value: 128)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "V4L2Buffer_status", file: !926, line: 32, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/v4l2_buffers.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = !{!928, !929, !930}
!928 = !DIEnumerator(name: "V4L2BUF_AVAILABLE", value: 0)
!929 = !DIEnumerator(name: "V4L2BUF_IN_DRIVER", value: 1)
!930 = !DIEnumerator(name: "V4L2BUF_RET_USER", value: 2)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "v4l2_mpeg_video_header_mode", file: !932, line: 369, size: 32, align: 32, elements: !933)
!932 = !DIFile(filename: "/usr/include/linux/v4l2-controls.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!933 = !{!934, !935}
!934 = !DIEnumerator(name: "V4L2_MPEG_VIDEO_HEADER_MODE_SEPARATE", value: 0)
!935 = !DIEnumerator(name: "V4L2_MPEG_VIDEO_HEADER_MODE_JOINED_WITH_1ST_FRAME", value: 1)
!936 = !{!937, !938, !939}
!937 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!938 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2m2mPriv", file: !941, line: 73, baseType: !942)
!941 = !DIFile(filename: "libavcodec/v4l2_m2m.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2m2mPriv", file: !941, line: 64, size: 256, align: 64, elements: !943)
!943 = !{!944, !1029, !1808, !1809, !1810}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !942, file: !941, line: 66, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !948)
!948 = !{!949, !953, !958, !988, !989, !990, !991, !995, !1001, !1003, !1007}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !947, file: !713, line: 72, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !947, file: !713, line: 78, baseType: !954, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!950, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !947, file: !713, line: 85, baseType: !959, size: 64, align: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !984, !985, !986, !987}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !961, file: !691, line: 247, baseType: !950, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !961, file: !691, line: 253, baseType: !950, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !961, file: !691, line: 259, baseType: !937, size: 32, align: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !961, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !961, file: !691, line: 271, baseType: !968, size: 64, align: 64, offset: 192)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !961, file: !691, line: 265, size: 64, align: 64, elements: !969)
!969 = !{!970, !974, !976, !977}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !968, file: !691, line: 266, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !972, line: 40, baseType: !973)
!972 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!973 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !968, file: !691, line: 267, baseType: !975, size: 64, align: 64)
!975 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !968, file: !691, line: 268, baseType: !950, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !968, file: !691, line: 270, baseType: !978, size: 64, align: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !979, line: 61, baseType: !980)
!979 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !979, line: 58, size: 64, align: 32, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !980, file: !979, line: 59, baseType: !937, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !980, file: !979, line: 60, baseType: !937, size: 32, align: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !961, file: !691, line: 272, baseType: !975, size: 64, align: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !961, file: !691, line: 273, baseType: !975, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !961, file: !691, line: 275, baseType: !937, size: 32, align: 32, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !961, file: !691, line: 300, baseType: !950, size: 64, align: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !947, file: !713, line: 93, baseType: !937, size: 32, align: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !947, file: !713, line: 99, baseType: !937, size: 32, align: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !947, file: !713, line: 108, baseType: !937, size: 32, align: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !947, file: !713, line: 113, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!957, !957, !957}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !947, file: !713, line: 123, baseType: !996, size: 64, align: 64, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!999, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !947, file: !713, line: 130, baseType: !1002, size: 32, align: 32, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !947, file: !713, line: 136, baseType: !1004, size: 64, align: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!1002, !957}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !947, file: !713, line: 142, baseType: !1008, size: 64, align: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!937, !1011, !957, !950, !937}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1014)
!1014 = !{!1015, !1027, !1028}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1013, file: !691, line: 360, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1019, file: !691, line: 307, baseType: !950, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1019, file: !691, line: 313, baseType: !975, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1019, file: !691, line: 313, baseType: !975, size: 64, align: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1019, file: !691, line: 318, baseType: !975, size: 64, align: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1019, file: !691, line: 318, baseType: !975, size: 64, align: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1019, file: !691, line: 323, baseType: !937, size: 32, align: 32, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1013, file: !691, line: 364, baseType: !937, size: 32, align: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1013, file: !691, line: 368, baseType: !937, size: 32, align: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !942, file: !941, line: 68, baseType: !1030, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2m2mContext", file: !941, line: 62, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2m2mContext", file: !941, line: 43, size: 37568, align: 64, elements: !1033)
!1033 = !{!1034, !1038, !1039, !1266, !1267, !1794, !1804, !1805, !1806, !1807}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "devname", scope: !1032, file: !941, line: 44, baseType: !1035, size: 32768, align: 8)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 32768, align: 8, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 4096)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1032, file: !941, line: 45, baseType: !937, size: 32, align: 32, offset: 32768)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "capture", scope: !1032, file: !941, line: 48, baseType: !1040, size: 2112, align: 64, offset: 32832)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2Context", file: !1041, line: 94, baseType: !1042)
!1041 = !DIFile(filename: "libavcodec/v4l2_context.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Context", file: !1041, line: 36, size: 2112, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1164, !1165, !1166, !1263, !1264, !1265}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !1041, line: 40, baseType: !950, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1042, file: !1041, line: 47, baseType: !909, size: 32, align: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "av_pix_fmt", scope: !1042, file: !1041, line: 53, baseType: !473, size: 32, align: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "av_codec_id", scope: !1042, file: !1041, line: 59, baseType: !13, size: 32, align: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1042, file: !1041, line: 65, baseType: !1049, size: 1664, align: 64, offset: 192)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_format", file: !910, line: 2003, size: 1664, align: 64, elements: !1050)
!1050 = !{!1051, !1054}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1049, file: !910, line: 2004, baseType: !1052, size: 32, align: 32)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !1053, line: 26, baseType: !938)
!1053 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !1049, file: !910, line: 2013, baseType: !1055, size: 1600, align: 64, offset: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1049, file: !910, line: 2005, size: 1600, align: 64, elements: !1056)
!1056 = !{!1057, !1072, !1105, !1127, !1142, !1152, !1160}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pix", scope: !1055, file: !910, line: 2006, baseType: !1058, size: 384, align: 32)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_pix_format", file: !910, line: 449, size: 384, align: 32, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1058, file: !910, line: 450, baseType: !1052, size: 32, align: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1058, file: !910, line: 451, baseType: !1052, size: 32, align: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1058, file: !910, line: 452, baseType: !1052, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1058, file: !910, line: 453, baseType: !1052, size: 32, align: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1058, file: !910, line: 454, baseType: !1052, size: 32, align: 32, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "sizeimage", scope: !1058, file: !910, line: 455, baseType: !1052, size: 32, align: 32, offset: 160)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1058, file: !910, line: 456, baseType: !1052, size: 32, align: 32, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1058, file: !910, line: 457, baseType: !1052, size: 32, align: 32, offset: 224)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !910, line: 458, baseType: !1052, size: 32, align: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr_enc", scope: !1058, file: !910, line: 459, baseType: !1052, size: 32, align: 32, offset: 288)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "quantization", scope: !1058, file: !910, line: 460, baseType: !1052, size: 32, align: 32, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_func", scope: !1058, file: !910, line: 461, baseType: !1052, size: 32, align: 32, offset: 352)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pix_mp", scope: !1055, file: !910, line: 2007, baseType: !1073, size: 1536, align: 8)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_pix_format_mplane", file: !910, line: 1966, size: 1536, align: 8, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1094, !1097, !1098, !1099, !1100, !1101}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1073, file: !910, line: 1967, baseType: !1052, size: 32, align: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1073, file: !910, line: 1968, baseType: !1052, size: 32, align: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1073, file: !910, line: 1969, baseType: !1052, size: 32, align: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1073, file: !910, line: 1970, baseType: !1052, size: 32, align: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1073, file: !910, line: 1971, baseType: !1052, size: 32, align: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "plane_fmt", scope: !1073, file: !910, line: 1973, baseType: !1081, size: 1280, align: 8, offset: 160)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 1280, align: 8, elements: !1092)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_plane_pix_format", file: !910, line: 1946, size: 160, align: 8, elements: !1083)
!1083 = !{!1084, !1085, !1086}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "sizeimage", scope: !1082, file: !910, line: 1947, baseType: !1052, size: 32, align: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1082, file: !910, line: 1948, baseType: !1052, size: 32, align: 32, offset: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1082, file: !910, line: 1949, baseType: !1087, size: 96, align: 16, offset: 64)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 96, align: 16, elements: !1090)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !1053, line: 23, baseType: !1089)
!1089 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1090 = !{!1091}
!1091 = !DISubrange(count: 6)
!1092 = !{!1093}
!1093 = !DISubrange(count: 8)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !1073, file: !910, line: 1974, baseType: !1095, size: 8, align: 8, offset: 1440)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !1053, line: 20, baseType: !1096)
!1096 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1073, file: !910, line: 1975, baseType: !1095, size: 8, align: 8, offset: 1448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr_enc", scope: !1073, file: !910, line: 1976, baseType: !1095, size: 8, align: 8, offset: 1456)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "quantization", scope: !1073, file: !910, line: 1977, baseType: !1095, size: 8, align: 8, offset: 1464)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_func", scope: !1073, file: !910, line: 1978, baseType: !1095, size: 8, align: 8, offset: 1472)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1073, file: !910, line: 1979, baseType: !1102, size: 56, align: 8, offset: 1480)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 56, align: 8, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 7)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1055, file: !910, line: 2008, baseType: !1106, size: 448, align: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_window", file: !910, line: 979, size: 448, align: 64, elements: !1107)
!1107 = !{!1108, !1116, !1117, !1118, !1124, !1125, !1126}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1106, file: !910, line: 980, baseType: !1109, size: 128, align: 32)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_rect", file: !910, line: 376, size: 128, align: 32, elements: !1110)
!1110 = !{!1111, !1113, !1114, !1115}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1109, file: !910, line: 377, baseType: !1112, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !1053, line: 25, baseType: !937)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1109, file: !910, line: 378, baseType: !1112, size: 32, align: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1109, file: !910, line: 379, baseType: !1052, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1109, file: !910, line: 380, baseType: !1052, size: 32, align: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1106, file: !910, line: 981, baseType: !1052, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "chromakey", scope: !1106, file: !910, line: 982, baseType: !1052, size: 32, align: 32, offset: 160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "clips", scope: !1106, file: !910, line: 983, baseType: !1119, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_clip", file: !910, line: 974, size: 192, align: 64, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1120, file: !910, line: 975, baseType: !1109, size: 128, align: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !910, line: 976, baseType: !1119, size: 64, align: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "clipcount", scope: !1106, file: !910, line: 984, baseType: !1052, size: 32, align: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !1106, file: !910, line: 985, baseType: !957, size: 64, align: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "global_alpha", scope: !1106, file: !910, line: 986, baseType: !1095, size: 8, align: 8, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "vbi", scope: !1055, file: !910, line: 2009, baseType: !1128, size: 352, align: 32)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_vbi_format", file: !910, line: 1817, size: 352, align: 32, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1138, !1140, !1141}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_rate", scope: !1128, file: !910, line: 1818, baseType: !1052, size: 32, align: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1128, file: !910, line: 1819, baseType: !1052, size: 32, align: 32, offset: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "samples_per_line", scope: !1128, file: !910, line: 1820, baseType: !1052, size: 32, align: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1128, file: !910, line: 1821, baseType: !1052, size: 32, align: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1128, file: !910, line: 1822, baseType: !1135, size: 64, align: 32, offset: 128)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 64, align: 32, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 2)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1128, file: !910, line: 1823, baseType: !1139, size: 64, align: 32, offset: 192)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 64, align: 32, elements: !1136)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !910, line: 1824, baseType: !1052, size: 32, align: 32, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1128, file: !910, line: 1825, baseType: !1139, size: 64, align: 32, offset: 288)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sliced", scope: !1055, file: !910, line: 2010, baseType: !1143, size: 896, align: 32)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_sliced_vbi_format", file: !910, line: 1845, size: 896, align: 32, elements: !1144)
!1144 = !{!1145, !1146, !1150, !1151}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "service_set", scope: !1143, file: !910, line: 1846, baseType: !1088, size: 16, align: 16)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "service_lines", scope: !1143, file: !910, line: 1851, baseType: !1147, size: 768, align: 16, offset: 16)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 768, align: 16, elements: !1148)
!1148 = !{!1137, !1149}
!1149 = !DISubrange(count: 24)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "io_size", scope: !1143, file: !910, line: 1852, baseType: !1052, size: 32, align: 32, offset: 800)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1143, file: !910, line: 1853, baseType: !1139, size: 64, align: 32, offset: 832)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "sdr", scope: !1055, file: !910, line: 2011, baseType: !1153, size: 256, align: 8)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_sdr_format", file: !910, line: 1987, size: 256, align: 8, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1153, file: !910, line: 1988, baseType: !1052, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buffersize", scope: !1153, file: !910, line: 1989, baseType: !1052, size: 32, align: 32, offset: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1153, file: !910, line: 1990, baseType: !1158, size: 192, align: 8, offset: 64)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 192, align: 8, elements: !1159)
!1159 = !{!1149}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !1055, file: !910, line: 2012, baseType: !1161, size: 1600, align: 8)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 1600, align: 8, elements: !1162)
!1162 = !{!1163}
!1163 = !DISubrange(count: 200)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1042, file: !1041, line: 71, baseType: !937, size: 32, align: 32, offset: 1856)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1042, file: !1041, line: 71, baseType: !937, size: 32, align: 32, offset: 1888)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !1042, file: !1041, line: 76, baseType: !1167, size: 64, align: 64, offset: 1920)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2Buffer", file: !926, line: 66, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Buffer", file: !926, line: 41, size: 6656, align: 64, elements: !1170)
!1170 = !{!1171, !1173, !1187, !1190, !1200, !1201, !1259, !1261, !1262}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1169, file: !926, line: 43, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "context_ref", scope: !1169, file: !926, line: 47, baseType: !1174, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1176, line: 94, baseType: !1177)
!1176 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1176, line: 81, size: 192, align: 64, elements: !1178)
!1178 = !{!1179, !1183, !1186}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1177, file: !1176, line: 82, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1176, line: 73, baseType: !1182)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1176, line: 73, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !1176, line: 89, baseType: !1184, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !972, line: 48, baseType: !1096)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !1176, line: 93, baseType: !937, size: 32, align: 32, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "context_refcount", scope: !1169, file: !926, line: 48, baseType: !1188, size: 32, align: 32, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_uint", file: !1189, line: 47, baseType: !938)
!1189 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdatomic.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "plane_info", scope: !1169, file: !926, line: 55, baseType: !1191, size: 1536, align: 64, offset: 192)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 1536, align: 64, elements: !1092)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Plane_info", file: !926, line: 51, size: 192, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1192, file: !926, line: 52, baseType: !937, size: 32, align: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "mm_addr", scope: !1192, file: !926, line: 53, baseType: !957, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1192, file: !926, line: 54, baseType: !1197, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1198, line: 216, baseType: !1199)
!1198 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1199 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !1169, file: !926, line: 57, baseType: !937, size: 32, align: 32, offset: 1728)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1169, file: !926, line: 60, baseType: !1202, size: 704, align: 64, offset: 1792)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_buffer", file: !910, line: 852, size: 704, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1208, !1209, !1218, !1231, !1232, !1233, !1256, !1257, !1258}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1202, file: !910, line: 853, baseType: !1052, size: 32, align: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1202, file: !910, line: 854, baseType: !1052, size: 32, align: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "bytesused", scope: !1202, file: !910, line: 855, baseType: !1052, size: 32, align: 32, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1202, file: !910, line: 856, baseType: !1052, size: 32, align: 32, offset: 96)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1202, file: !910, line: 857, baseType: !1052, size: 32, align: 32, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1202, file: !910, line: 858, baseType: !1210, size: 128, align: 64, offset: 192)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1211, line: 30, size: 128, align: 64, elements: !1212)
!1211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1212 = !{!1213, !1216}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1210, file: !1211, line: 32, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1215, line: 139, baseType: !973)
!1215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1210, file: !1211, line: 33, baseType: !1217, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !1215, line: 141, baseType: !973)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "timecode", scope: !1202, file: !910, line: 859, baseType: !1219, size: 128, align: 32, offset: 320)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_timecode", file: !910, line: 726, size: 128, align: 32, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1226, !1227}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1219, file: !910, line: 727, baseType: !1052, size: 32, align: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1219, file: !910, line: 728, baseType: !1052, size: 32, align: 32, offset: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1219, file: !910, line: 729, baseType: !1095, size: 8, align: 8, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1219, file: !910, line: 730, baseType: !1095, size: 8, align: 8, offset: 72)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1219, file: !910, line: 731, baseType: !1095, size: 8, align: 8, offset: 80)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "hours", scope: !1219, file: !910, line: 732, baseType: !1095, size: 8, align: 8, offset: 88)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "userbits", scope: !1219, file: !910, line: 733, baseType: !1228, size: 32, align: 8, offset: 96)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 32, align: 8, elements: !1229)
!1229 = !{!1230}
!1230 = !DISubrange(count: 4)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1202, file: !910, line: 860, baseType: !1052, size: 32, align: 32, offset: 448)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1202, file: !910, line: 863, baseType: !1052, size: 32, align: 32, offset: 480)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1202, file: !910, line: 869, baseType: !1234, size: 64, align: 64, offset: 512)
!1234 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1202, file: !910, line: 864, size: 64, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1255}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1234, file: !910, line: 865, baseType: !1052, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !1234, file: !910, line: 866, baseType: !1199, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1234, file: !910, line: 867, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_plane", file: !910, line: 810, size: 512, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1250, !1251}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bytesused", scope: !1240, file: !910, line: 811, baseType: !1052, size: 32, align: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1240, file: !910, line: 812, baseType: !1052, size: 32, align: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1240, file: !910, line: 817, baseType: !1245, size: 64, align: 64, offset: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1240, file: !910, line: 813, size: 64, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "mem_offset", scope: !1245, file: !910, line: 814, baseType: !1052, size: 32, align: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !1245, file: !910, line: 815, baseType: !1199, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1245, file: !910, line: 816, baseType: !1112, size: 32, align: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "data_offset", scope: !1240, file: !910, line: 818, baseType: !1052, size: 32, align: 32, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1240, file: !910, line: 819, baseType: !1252, size: 352, align: 32, offset: 160)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 352, align: 32, elements: !1253)
!1253 = !{!1254}
!1254 = !DISubrange(count: 11)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1234, file: !910, line: 868, baseType: !1112, size: 32, align: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1202, file: !910, line: 870, baseType: !1052, size: 32, align: 32, offset: 576)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !1202, file: !910, line: 871, baseType: !1052, size: 32, align: 32, offset: 608)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1202, file: !910, line: 872, baseType: !1052, size: 32, align: 32, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1169, file: !926, line: 61, baseType: !1260, size: 4096, align: 64, offset: 2496)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1240, size: 4096, align: 64, elements: !1092)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1169, file: !926, line: 63, baseType: !937, size: 32, align: 32, offset: 6592)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1169, file: !926, line: 64, baseType: !925, size: 32, align: 32, offset: 6624)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "num_buffers", scope: !1042, file: !1041, line: 81, baseType: !937, size: 32, align: 32, offset: 1984)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "streamon", scope: !1042, file: !1041, line: 86, baseType: !937, size: 32, align: 32, offset: 2016)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1042, file: !1041, line: 92, baseType: !937, size: 32, align: 32, offset: 2048)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !1032, file: !941, line: 49, baseType: !1040, size: 2112, align: 64, offset: 34944)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1032, file: !941, line: 52, baseType: !1268, size: 64, align: 64, offset: 37056)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1271)
!1271 = !{!1272, !1275, !1276, !1277, !1517, !1518, !1519, !1520, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1546, !1550, !1551, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1732, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1270, file: !14, line: 1561, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1270, file: !14, line: 1562, baseType: !937, size: 32, align: 32, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1270, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1270, file: !14, line: 1565, baseType: !1278, size: 64, align: 64, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1290, !1293, !1296, !1299, !1303, !1304, !1305, !1313, !1314, !1315, !1317, !1321, !1327, !1332, !1336, !1337, !1380, !1488, !1492, !1493, !1497, !1501, !1506, !1510, !1511, !1512}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1280, file: !14, line: 3475, baseType: !950, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1280, file: !14, line: 3480, baseType: !950, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1280, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1280, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1280, file: !14, line: 3487, baseType: !937, size: 32, align: 32, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1280, file: !14, line: 3488, baseType: !1288, size: 64, align: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1280, file: !14, line: 3489, baseType: !1291, size: 64, align: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1280, file: !14, line: 3490, baseType: !1294, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1280, file: !14, line: 3491, baseType: !1297, size: 64, align: 64, offset: 448)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1280, file: !14, line: 3492, baseType: !1300, size: 64, align: 64, offset: 512)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !972, line: 55, baseType: !1199)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1280, file: !14, line: 3493, baseType: !1185, size: 8, align: 8, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1280, file: !14, line: 3494, baseType: !1273, size: 64, align: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1280, file: !14, line: 3495, baseType: !1306, size: 64, align: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1308)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1310)
!1310 = !{!1311, !1312}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1309, file: !14, line: 3402, baseType: !937, size: 32, align: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1309, file: !14, line: 3403, baseType: !950, size: 64, align: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1280, file: !14, line: 3507, baseType: !950, size: 64, align: 64, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1280, file: !14, line: 3516, baseType: !937, size: 32, align: 32, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1280, file: !14, line: 3517, baseType: !1316, size: 64, align: 64, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1280, file: !14, line: 3527, baseType: !1318, size: 64, align: 64, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!937, !1268}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1280, file: !14, line: 3535, baseType: !1322, size: 64, align: 64, offset: 1024)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!937, !1268, !1325}
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1269)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1280, file: !14, line: 3541, baseType: !1328, size: 64, align: 64, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1331)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1280, file: !14, line: 3549, baseType: !1333, size: 64, align: 64, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{null, !1316}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1280, file: !14, line: 3551, baseType: !1318, size: 64, align: 64, offset: 1216)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1280, file: !14, line: 3552, baseType: !1338, size: 64, align: 64, offset: 1280)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!937, !1268, !1184, !937, !1341}
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1344)
!1344 = !{!1345, !1347, !1349, !1350, !1351, !1379}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1343, file: !14, line: 3921, baseType: !1346, size: 16, align: 16)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !972, line: 49, baseType: !1089)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1343, file: !14, line: 3922, baseType: !1348, size: 32, align: 32, offset: 32)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !972, line: 51, baseType: !938)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1343, file: !14, line: 3923, baseType: !1348, size: 32, align: 32, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1343, file: !14, line: 3924, baseType: !938, size: 32, align: 32, offset: 96)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1343, file: !14, line: 3925, baseType: !1352, size: 64, align: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362, !1370, !1372, !1374, !1375, !1377, !1378}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1355, file: !14, line: 3886, baseType: !937, size: 32, align: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1355, file: !14, line: 3887, baseType: !937, size: 32, align: 32, offset: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1355, file: !14, line: 3888, baseType: !937, size: 32, align: 32, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1355, file: !14, line: 3889, baseType: !937, size: 32, align: 32, offset: 96)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1355, file: !14, line: 3890, baseType: !937, size: 32, align: 32, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1355, file: !14, line: 3897, baseType: !1363, size: 768, align: 64, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1365)
!1365 = !{!1366, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1364, file: !14, line: 3855, baseType: !1367, size: 512, align: 64)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 512, align: 64, elements: !1092)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1364, file: !14, line: 3857, baseType: !1369, size: 256, align: 32, offset: 512)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 256, align: 32, elements: !1092)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1355, file: !14, line: 3903, baseType: !1371, size: 256, align: 64, offset: 960)
!1371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 256, align: 64, elements: !1229)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1355, file: !14, line: 3904, baseType: !1373, size: 128, align: 32, offset: 1216)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 128, align: 32, elements: !1229)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1355, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1355, file: !14, line: 3908, baseType: !1376, size: 64, align: 64, offset: 1408)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1355, file: !14, line: 3915, baseType: !1376, size: 64, align: 64, offset: 1472)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1355, file: !14, line: 3917, baseType: !937, size: 32, align: 32, offset: 1536)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1343, file: !14, line: 3926, baseType: !971, size: 64, align: 64, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1280, file: !14, line: 3564, baseType: !1381, size: 64, align: 64, offset: 1344)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!937, !1268, !1384, !1407, !1487}
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1403, !1404, !1405, !1406}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1386, file: !14, line: 1451, baseType: !1174, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1386, file: !14, line: 1461, baseType: !971, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1386, file: !14, line: 1467, baseType: !971, size: 64, align: 64, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1386, file: !14, line: 1468, baseType: !1184, size: 64, align: 64, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1386, file: !14, line: 1469, baseType: !937, size: 32, align: 32, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1386, file: !14, line: 1470, baseType: !937, size: 32, align: 32, offset: 288)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1386, file: !14, line: 1474, baseType: !937, size: 32, align: 32, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1386, file: !14, line: 1479, baseType: !1396, size: 64, align: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1399)
!1399 = !{!1400, !1401, !1402}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1398, file: !14, line: 1412, baseType: !1184, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1398, file: !14, line: 1413, baseType: !937, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1398, file: !14, line: 1414, baseType: !873, size: 32, align: 32, offset: 96)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1386, file: !14, line: 1480, baseType: !937, size: 32, align: 32, offset: 448)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1386, file: !14, line: 1486, baseType: !971, size: 64, align: 64, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1386, file: !14, line: 1488, baseType: !971, size: 64, align: 64, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1386, file: !14, line: 1497, baseType: !971, size: 64, align: 64, offset: 640)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1409)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1441, !1443, !1444, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1410, file: !744, line: 282, baseType: !1367, size: 512, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1410, file: !744, line: 299, baseType: !1369, size: 256, align: 32, offset: 512)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1410, file: !744, line: 315, baseType: !1415, size: 64, align: 64, offset: 768)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1410, file: !744, line: 326, baseType: !937, size: 32, align: 32, offset: 832)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1410, file: !744, line: 326, baseType: !937, size: 32, align: 32, offset: 864)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1410, file: !744, line: 334, baseType: !937, size: 32, align: 32, offset: 896)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1410, file: !744, line: 341, baseType: !937, size: 32, align: 32, offset: 928)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1410, file: !744, line: 346, baseType: !937, size: 32, align: 32, offset: 960)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1410, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1410, file: !744, line: 356, baseType: !978, size: 64, align: 32, offset: 1024)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1410, file: !744, line: 361, baseType: !971, size: 64, align: 64, offset: 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1410, file: !744, line: 369, baseType: !971, size: 64, align: 64, offset: 1152)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1410, file: !744, line: 377, baseType: !971, size: 64, align: 64, offset: 1216)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1410, file: !744, line: 382, baseType: !937, size: 32, align: 32, offset: 1280)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1410, file: !744, line: 386, baseType: !937, size: 32, align: 32, offset: 1312)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1410, file: !744, line: 391, baseType: !937, size: 32, align: 32, offset: 1344)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1410, file: !744, line: 396, baseType: !957, size: 64, align: 64, offset: 1408)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1410, file: !744, line: 403, baseType: !1431, size: 512, align: 64, offset: 1472)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1302, size: 512, align: 64, elements: !1092)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1410, file: !744, line: 410, baseType: !937, size: 32, align: 32, offset: 1984)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1410, file: !744, line: 415, baseType: !937, size: 32, align: 32, offset: 2016)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1410, file: !744, line: 420, baseType: !937, size: 32, align: 32, offset: 2048)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1410, file: !744, line: 425, baseType: !937, size: 32, align: 32, offset: 2080)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1410, file: !744, line: 435, baseType: !971, size: 64, align: 64, offset: 2112)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1410, file: !744, line: 440, baseType: !937, size: 32, align: 32, offset: 2176)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1410, file: !744, line: 445, baseType: !1302, size: 64, align: 64, offset: 2240)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1410, file: !744, line: 459, baseType: !1440, size: 512, align: 64, offset: 2304)
!1440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 512, align: 64, elements: !1092)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1410, file: !744, line: 473, baseType: !1442, size: 64, align: 64, offset: 2816)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1410, file: !744, line: 477, baseType: !937, size: 32, align: 32, offset: 2880)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1410, file: !744, line: 479, baseType: !1445, size: 64, align: 64, offset: 2944)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1458}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1448, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1448, file: !744, line: 203, baseType: !1184, size: 64, align: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1448, file: !744, line: 204, baseType: !937, size: 32, align: 32, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1448, file: !744, line: 205, baseType: !1454, size: 64, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1456, line: 86, baseType: !1457)
!1456 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1456, line: 86, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1448, file: !744, line: 206, baseType: !1174, size: 64, align: 64, offset: 256)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1410, file: !744, line: 480, baseType: !937, size: 32, align: 32, offset: 3008)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1410, file: !744, line: 505, baseType: !937, size: 32, align: 32, offset: 3040)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1410, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1410, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1410, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1410, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1410, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1410, file: !744, line: 532, baseType: !971, size: 64, align: 64, offset: 3264)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1410, file: !744, line: 539, baseType: !971, size: 64, align: 64, offset: 3328)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1410, file: !744, line: 547, baseType: !971, size: 64, align: 64, offset: 3392)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1410, file: !744, line: 554, baseType: !1454, size: 64, align: 64, offset: 3456)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1410, file: !744, line: 563, baseType: !937, size: 32, align: 32, offset: 3520)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1410, file: !744, line: 572, baseType: !937, size: 32, align: 32, offset: 3552)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1410, file: !744, line: 581, baseType: !937, size: 32, align: 32, offset: 3584)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1410, file: !744, line: 588, baseType: !1474, size: 64, align: 64, offset: 3648)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !972, line: 36, baseType: !1476)
!1476 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1410, file: !744, line: 593, baseType: !937, size: 32, align: 32, offset: 3712)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1410, file: !744, line: 596, baseType: !937, size: 32, align: 32, offset: 3744)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1410, file: !744, line: 599, baseType: !1174, size: 64, align: 64, offset: 3776)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1410, file: !744, line: 605, baseType: !1174, size: 64, align: 64, offset: 3840)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1410, file: !744, line: 616, baseType: !1174, size: 64, align: 64, offset: 3904)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1410, file: !744, line: 626, baseType: !1197, size: 64, align: 64, offset: 3968)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1410, file: !744, line: 627, baseType: !1197, size: 64, align: 64, offset: 4032)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1410, file: !744, line: 628, baseType: !1197, size: 64, align: 64, offset: 4096)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1410, file: !744, line: 629, baseType: !1197, size: 64, align: 64, offset: 4160)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1410, file: !744, line: 645, baseType: !1174, size: 64, align: 64, offset: 4224)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1280, file: !14, line: 3566, baseType: !1489, size: 64, align: 64, offset: 1408)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!937, !1268, !957, !1487, !1384}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1280, file: !14, line: 3567, baseType: !1318, size: 64, align: 64, offset: 1472)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1280, file: !14, line: 3576, baseType: !1494, size: 64, align: 64, offset: 1536)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!937, !1268, !1407}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1280, file: !14, line: 3577, baseType: !1498, size: 64, align: 64, offset: 1600)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!937, !1268, !1384}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1280, file: !14, line: 3584, baseType: !1502, size: 64, align: 64, offset: 1664)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!937, !1268, !1505}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1280, file: !14, line: 3589, baseType: !1507, size: 64, align: 64, offset: 1728)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{null, !1268}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1280, file: !14, line: 3594, baseType: !937, size: 32, align: 32, offset: 1792)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1280, file: !14, line: 3600, baseType: !950, size: 64, align: 64, offset: 1856)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1280, file: !14, line: 3609, baseType: !1513, size: 64, align: 64, offset: 1920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1270, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1270, file: !14, line: 1581, baseType: !938, size: 32, align: 32, offset: 224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1270, file: !14, line: 1583, baseType: !957, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1270, file: !14, line: 1591, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1270, file: !14, line: 1598, baseType: !957, size: 64, align: 64, offset: 384)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1270, file: !14, line: 1606, baseType: !971, size: 64, align: 64, offset: 448)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1270, file: !14, line: 1614, baseType: !937, size: 32, align: 32, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1270, file: !14, line: 1622, baseType: !937, size: 32, align: 32, offset: 544)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1270, file: !14, line: 1628, baseType: !937, size: 32, align: 32, offset: 576)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1270, file: !14, line: 1636, baseType: !937, size: 32, align: 32, offset: 608)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1270, file: !14, line: 1643, baseType: !937, size: 32, align: 32, offset: 640)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1270, file: !14, line: 1657, baseType: !1184, size: 64, align: 64, offset: 704)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1270, file: !14, line: 1658, baseType: !937, size: 32, align: 32, offset: 768)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1270, file: !14, line: 1679, baseType: !978, size: 64, align: 32, offset: 800)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1270, file: !14, line: 1688, baseType: !937, size: 32, align: 32, offset: 864)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1270, file: !14, line: 1712, baseType: !937, size: 32, align: 32, offset: 896)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1270, file: !14, line: 1729, baseType: !937, size: 32, align: 32, offset: 928)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1270, file: !14, line: 1729, baseType: !937, size: 32, align: 32, offset: 960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1270, file: !14, line: 1744, baseType: !937, size: 32, align: 32, offset: 992)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1270, file: !14, line: 1744, baseType: !937, size: 32, align: 32, offset: 1024)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1270, file: !14, line: 1751, baseType: !937, size: 32, align: 32, offset: 1056)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1270, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1270, file: !14, line: 1791, baseType: !1542, size: 64, align: 64, offset: 1152)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{null, !1545, !1407, !1487, !937, !937, !937}
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1270, file: !14, line: 1808, baseType: !1547, size: 64, align: 64, offset: 1216)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!473, !1545, !1291}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1270, file: !14, line: 1816, baseType: !937, size: 32, align: 32, offset: 1280)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1270, file: !14, line: 1825, baseType: !1552, size: 32, align: 32, offset: 1312)
!1552 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1270, file: !14, line: 1830, baseType: !937, size: 32, align: 32, offset: 1344)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1270, file: !14, line: 1838, baseType: !1552, size: 32, align: 32, offset: 1376)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1270, file: !14, line: 1846, baseType: !937, size: 32, align: 32, offset: 1408)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1270, file: !14, line: 1851, baseType: !937, size: 32, align: 32, offset: 1440)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1270, file: !14, line: 1861, baseType: !1552, size: 32, align: 32, offset: 1472)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1270, file: !14, line: 1868, baseType: !1552, size: 32, align: 32, offset: 1504)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1270, file: !14, line: 1875, baseType: !1552, size: 32, align: 32, offset: 1536)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1270, file: !14, line: 1882, baseType: !1552, size: 32, align: 32, offset: 1568)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1270, file: !14, line: 1889, baseType: !1552, size: 32, align: 32, offset: 1600)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1270, file: !14, line: 1896, baseType: !1552, size: 32, align: 32, offset: 1632)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1270, file: !14, line: 1903, baseType: !1552, size: 32, align: 32, offset: 1664)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1270, file: !14, line: 1910, baseType: !937, size: 32, align: 32, offset: 1696)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1270, file: !14, line: 1915, baseType: !937, size: 32, align: 32, offset: 1728)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1270, file: !14, line: 1926, baseType: !1487, size: 64, align: 64, offset: 1792)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1270, file: !14, line: 1935, baseType: !978, size: 64, align: 32, offset: 1856)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1270, file: !14, line: 1942, baseType: !937, size: 32, align: 32, offset: 1920)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1270, file: !14, line: 1948, baseType: !937, size: 32, align: 32, offset: 1952)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1270, file: !14, line: 1954, baseType: !937, size: 32, align: 32, offset: 1984)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1270, file: !14, line: 1960, baseType: !937, size: 32, align: 32, offset: 2016)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1270, file: !14, line: 1984, baseType: !937, size: 32, align: 32, offset: 2048)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1270, file: !14, line: 1991, baseType: !937, size: 32, align: 32, offset: 2080)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1270, file: !14, line: 1996, baseType: !937, size: 32, align: 32, offset: 2112)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1270, file: !14, line: 2004, baseType: !937, size: 32, align: 32, offset: 2144)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1270, file: !14, line: 2011, baseType: !937, size: 32, align: 32, offset: 2176)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1270, file: !14, line: 2018, baseType: !937, size: 32, align: 32, offset: 2208)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1270, file: !14, line: 2027, baseType: !937, size: 32, align: 32, offset: 2240)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1270, file: !14, line: 2034, baseType: !937, size: 32, align: 32, offset: 2272)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1270, file: !14, line: 2044, baseType: !937, size: 32, align: 32, offset: 2304)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1270, file: !14, line: 2054, baseType: !1582, size: 64, align: 64, offset: 2368)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1270, file: !14, line: 2061, baseType: !1582, size: 64, align: 64, offset: 2432)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1270, file: !14, line: 2066, baseType: !937, size: 32, align: 32, offset: 2496)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1270, file: !14, line: 2070, baseType: !937, size: 32, align: 32, offset: 2528)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1270, file: !14, line: 2078, baseType: !937, size: 32, align: 32, offset: 2560)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1270, file: !14, line: 2085, baseType: !937, size: 32, align: 32, offset: 2592)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1270, file: !14, line: 2092, baseType: !937, size: 32, align: 32, offset: 2624)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1270, file: !14, line: 2099, baseType: !937, size: 32, align: 32, offset: 2656)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1270, file: !14, line: 2106, baseType: !937, size: 32, align: 32, offset: 2688)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1270, file: !14, line: 2113, baseType: !937, size: 32, align: 32, offset: 2720)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1270, file: !14, line: 2120, baseType: !937, size: 32, align: 32, offset: 2752)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1270, file: !14, line: 2125, baseType: !937, size: 32, align: 32, offset: 2784)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1270, file: !14, line: 2133, baseType: !937, size: 32, align: 32, offset: 2816)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1270, file: !14, line: 2140, baseType: !937, size: 32, align: 32, offset: 2848)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1270, file: !14, line: 2145, baseType: !937, size: 32, align: 32, offset: 2880)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1270, file: !14, line: 2153, baseType: !937, size: 32, align: 32, offset: 2912)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1270, file: !14, line: 2158, baseType: !937, size: 32, align: 32, offset: 2944)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1270, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1270, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1270, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1270, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1270, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1270, file: !14, line: 2203, baseType: !937, size: 32, align: 32, offset: 3136)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1270, file: !14, line: 2209, baseType: !844, size: 32, align: 32, offset: 3168)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1270, file: !14, line: 2212, baseType: !937, size: 32, align: 32, offset: 3200)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1270, file: !14, line: 2213, baseType: !937, size: 32, align: 32, offset: 3232)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1270, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1270, file: !14, line: 2232, baseType: !937, size: 32, align: 32, offset: 3296)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1270, file: !14, line: 2243, baseType: !937, size: 32, align: 32, offset: 3328)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1270, file: !14, line: 2249, baseType: !937, size: 32, align: 32, offset: 3360)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1270, file: !14, line: 2256, baseType: !937, size: 32, align: 32, offset: 3392)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1270, file: !14, line: 2263, baseType: !1302, size: 64, align: 64, offset: 3456)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1270, file: !14, line: 2270, baseType: !1302, size: 64, align: 64, offset: 3520)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1270, file: !14, line: 2277, baseType: !852, size: 32, align: 32, offset: 3584)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1270, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1270, file: !14, line: 2367, baseType: !1618, size: 64, align: 64, offset: 3648)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{!937, !1545, !1505, !937}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1270, file: !14, line: 2383, baseType: !937, size: 32, align: 32, offset: 3712)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1270, file: !14, line: 2386, baseType: !1552, size: 32, align: 32, offset: 3744)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1270, file: !14, line: 2387, baseType: !1552, size: 32, align: 32, offset: 3776)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1270, file: !14, line: 2394, baseType: !937, size: 32, align: 32, offset: 3808)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1270, file: !14, line: 2401, baseType: !937, size: 32, align: 32, offset: 3840)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1270, file: !14, line: 2408, baseType: !937, size: 32, align: 32, offset: 3872)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1270, file: !14, line: 2415, baseType: !937, size: 32, align: 32, offset: 3904)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1270, file: !14, line: 2422, baseType: !937, size: 32, align: 32, offset: 3936)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1270, file: !14, line: 2423, baseType: !1630, size: 64, align: 64, offset: 3968)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1632, file: !14, line: 827, baseType: !937, size: 32, align: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1632, file: !14, line: 828, baseType: !937, size: 32, align: 32, offset: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1632, file: !14, line: 829, baseType: !937, size: 32, align: 32, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1632, file: !14, line: 830, baseType: !1552, size: 32, align: 32, offset: 96)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1270, file: !14, line: 2430, baseType: !971, size: 64, align: 64, offset: 4032)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1270, file: !14, line: 2437, baseType: !971, size: 64, align: 64, offset: 4096)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1270, file: !14, line: 2444, baseType: !1552, size: 32, align: 32, offset: 4160)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1270, file: !14, line: 2451, baseType: !1552, size: 32, align: 32, offset: 4192)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1270, file: !14, line: 2458, baseType: !937, size: 32, align: 32, offset: 4224)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1270, file: !14, line: 2469, baseType: !937, size: 32, align: 32, offset: 4256)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1270, file: !14, line: 2475, baseType: !937, size: 32, align: 32, offset: 4288)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1270, file: !14, line: 2481, baseType: !937, size: 32, align: 32, offset: 4320)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1270, file: !14, line: 2485, baseType: !937, size: 32, align: 32, offset: 4352)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1270, file: !14, line: 2489, baseType: !937, size: 32, align: 32, offset: 4384)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1270, file: !14, line: 2493, baseType: !937, size: 32, align: 32, offset: 4416)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1270, file: !14, line: 2501, baseType: !937, size: 32, align: 32, offset: 4448)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1270, file: !14, line: 2506, baseType: !937, size: 32, align: 32, offset: 4480)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1270, file: !14, line: 2510, baseType: !937, size: 32, align: 32, offset: 4512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1270, file: !14, line: 2514, baseType: !971, size: 64, align: 64, offset: 4544)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1270, file: !14, line: 2528, baseType: !1654, size: 64, align: 64, offset: 4608)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1545, !957, !937, !937}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1270, file: !14, line: 2534, baseType: !937, size: 32, align: 32, offset: 4672)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1270, file: !14, line: 2545, baseType: !937, size: 32, align: 32, offset: 4704)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1270, file: !14, line: 2547, baseType: !937, size: 32, align: 32, offset: 4736)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1270, file: !14, line: 2549, baseType: !937, size: 32, align: 32, offset: 4768)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1270, file: !14, line: 2551, baseType: !937, size: 32, align: 32, offset: 4800)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1270, file: !14, line: 2553, baseType: !937, size: 32, align: 32, offset: 4832)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1270, file: !14, line: 2555, baseType: !937, size: 32, align: 32, offset: 4864)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1270, file: !14, line: 2557, baseType: !937, size: 32, align: 32, offset: 4896)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1270, file: !14, line: 2559, baseType: !937, size: 32, align: 32, offset: 4928)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1270, file: !14, line: 2563, baseType: !937, size: 32, align: 32, offset: 4960)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1270, file: !14, line: 2571, baseType: !1376, size: 64, align: 64, offset: 4992)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1270, file: !14, line: 2579, baseType: !1376, size: 64, align: 64, offset: 5056)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1270, file: !14, line: 2586, baseType: !937, size: 32, align: 32, offset: 5120)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1270, file: !14, line: 2615, baseType: !937, size: 32, align: 32, offset: 5152)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1270, file: !14, line: 2627, baseType: !937, size: 32, align: 32, offset: 5184)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1270, file: !14, line: 2637, baseType: !937, size: 32, align: 32, offset: 5216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1270, file: !14, line: 2681, baseType: !937, size: 32, align: 32, offset: 5248)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1270, file: !14, line: 2709, baseType: !971, size: 64, align: 64, offset: 5312)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1270, file: !14, line: 2716, baseType: !1676, size: 64, align: 64, offset: 5376)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683, !1684, !1685, !1686, !1692, !1696, !1697, !1698, !1699, !1705, !1706, !1707, !1708, !1709}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1678, file: !14, line: 3642, baseType: !950, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1678, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1678, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1678, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1678, file: !14, line: 3669, baseType: !937, size: 32, align: 32, offset: 160)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1678, file: !14, line: 3682, baseType: !1502, size: 64, align: 64, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1678, file: !14, line: 3698, baseType: !1687, size: 64, align: 64, offset: 256)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!937, !1268, !1690, !1348}
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1678, file: !14, line: 3712, baseType: !1693, size: 64, align: 64, offset: 320)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!937, !1268, !937, !1690, !1348}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1678, file: !14, line: 3726, baseType: !1687, size: 64, align: 64, offset: 384)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1678, file: !14, line: 3737, baseType: !1318, size: 64, align: 64, offset: 448)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1678, file: !14, line: 3746, baseType: !937, size: 32, align: 32, offset: 512)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1678, file: !14, line: 3757, baseType: !1700, size: 64, align: 64, offset: 576)
