; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cinepakenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cinepakenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mb_encoding", file: !910, line: 79, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/cinepakenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "ENC_V1", value: 0)
!913 = !DIEnumerator(name: "ENC_V4", value: 1)
!914 = !DIEnumerator(name: "ENC_SKIP", value: 2)
!915 = !DIEnumerator(name: "ENC_UNCERTAIN", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CinepakMode", file: !910, line: 71, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIEnumerator(name: "MODE_V1_ONLY", value: 0)
!919 = !DIEnumerator(name: "MODE_V1_V4", value: 1)
!920 = !DIEnumerator(name: "MODE_MC", value: 2)
!921 = !DIEnumerator(name: "MODE_COUNT", value: 3)
!922 = !{!923, !928, !930, !931, !924, !938}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!927 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !933, line: 221, size: 32, align: 8, elements: !934)
!933 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !932, file: !933, line: 221, baseType: !936, size: 32, align: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !937)
!937 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !933, line: 222, size: 16, align: 8, elements: !940)
!940 = !{!941}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !939, file: !933, line: 222, baseType: !942, size: 16, align: 16)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !943)
!943 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!944 = !{!945, !1700, !1701}
!945 = distinct !DIGlobalVariable(name: "ff_cinepak_encoder", scope: !0, file: !910, line: 1197, type: !946, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_cinepak_encoder)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !948)
!948 = !{!949, !953, !954, !955, !956, !957, !966, !969, !972, !975, !980, !981, !1057, !1065, !1066, !1067, !1069, !1615, !1621, !1629, !1633, !1634, !1671, !1675, !1679, !1680, !1684, !1688, !1689, !1693, !1694, !1695}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !947, file: !14, line: 3475, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !947, file: !14, line: 3480, baseType: !950, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !947, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !947, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !947, file: !14, line: 3487, baseType: !929, size: 32, align: 32, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !947, file: !14, line: 3488, baseType: !958, size: 64, align: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !961, line: 61, baseType: !962)
!961 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !961, line: 58, size: 64, align: 32, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !962, file: !961, line: 59, baseType: !929, size: 32, align: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !962, file: !961, line: 60, baseType: !929, size: 32, align: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !947, file: !14, line: 3489, baseType: !967, size: 64, align: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !947, file: !14, line: 3490, baseType: !970, size: 64, align: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !947, file: !14, line: 3491, baseType: !973, size: 64, align: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !947, file: !14, line: 3492, baseType: !976, size: 64, align: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !979)
!979 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !947, file: !14, line: 3493, baseType: !925, size: 8, align: 8, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !947, file: !14, line: 3494, baseType: !982, size: 64, align: 64, offset: 640)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !986)
!986 = !{!987, !988, !992, !1016, !1017, !1018, !1019, !1023, !1029, !1031, !1035}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !985, file: !713, line: 72, baseType: !950, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !985, file: !713, line: 78, baseType: !989, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!950, !930}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !985, file: !713, line: 85, baseType: !993, size: 64, align: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1012, !1013, !1014, !1015}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !691, line: 247, baseType: !950, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !995, file: !691, line: 253, baseType: !950, size: 64, align: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !995, file: !691, line: 259, baseType: !929, size: 32, align: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !995, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !995, file: !691, line: 271, baseType: !1002, size: 64, align: 64, offset: 192)
!1002 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !691, line: 265, size: 64, align: 64, elements: !1003)
!1003 = !{!1004, !1008, !1010, !1011}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1002, file: !691, line: 266, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1006, line: 197, baseType: !1007)
!1006 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1007 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1002, file: !691, line: 267, baseType: !1009, size: 64, align: 64)
!1009 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1002, file: !691, line: 268, baseType: !950, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1002, file: !691, line: 270, baseType: !960, size: 64, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !995, file: !691, line: 272, baseType: !1009, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !995, file: !691, line: 273, baseType: !1009, size: 64, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !995, file: !691, line: 275, baseType: !929, size: 32, align: 32, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !995, file: !691, line: 300, baseType: !950, size: 64, align: 64, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !985, file: !713, line: 93, baseType: !929, size: 32, align: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !985, file: !713, line: 99, baseType: !929, size: 32, align: 32, offset: 224)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !985, file: !713, line: 108, baseType: !929, size: 32, align: 32, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !985, file: !713, line: 113, baseType: !1020, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!930, !930, !930}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !985, file: !713, line: 123, baseType: !1024, size: 64, align: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !985, file: !713, line: 130, baseType: !1030, size: 32, align: 32, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !985, file: !713, line: 136, baseType: !1032, size: 64, align: 64, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1030, !930}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !985, file: !713, line: 142, baseType: !1036, size: 64, align: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!929, !1039, !930, !950, !929}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1042)
!1042 = !{!1043, !1055, !1056}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1041, file: !691, line: 360, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1047, file: !691, line: 307, baseType: !950, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1047, file: !691, line: 313, baseType: !1009, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1047, file: !691, line: 313, baseType: !1009, size: 64, align: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1047, file: !691, line: 318, baseType: !1009, size: 64, align: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1047, file: !691, line: 318, baseType: !1009, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1047, file: !691, line: 323, baseType: !929, size: 32, align: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1041, file: !691, line: 364, baseType: !929, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1041, file: !691, line: 368, baseType: !929, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !947, file: !14, line: 3495, baseType: !1058, size: 64, align: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1061, file: !14, line: 3402, baseType: !929, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !14, line: 3403, baseType: !950, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !947, file: !14, line: 3507, baseType: !950, size: 64, align: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !947, file: !14, line: 3516, baseType: !929, size: 32, align: 32, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !14, line: 3517, baseType: !1068, size: 64, align: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !947, file: !14, line: 3527, baseType: !1070, size: 64, align: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!929, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1083, !1084, !1085, !1086, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1363, !1367, !1368, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1553, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1075, file: !14, line: 1561, baseType: !982, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1075, file: !14, line: 1562, baseType: !929, size: 32, align: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1075, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1075, file: !14, line: 1565, baseType: !1081, size: 64, align: 64, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1075, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1075, file: !14, line: 1581, baseType: !937, size: 32, align: 32, offset: 224)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1075, file: !14, line: 1583, baseType: !930, size: 64, align: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1075, file: !14, line: 1591, baseType: !1087, size: 64, align: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1089, line: 129, size: 1664, align: 64, elements: !1090)
!1089 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1090 = !{!1091, !1092, !1093, !1094, !1190, !1211, !1212, !1241, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1088, file: !1089, line: 136, baseType: !929, size: 32, align: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1088, file: !1089, line: 151, baseType: !929, size: 32, align: 32, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1088, file: !1089, line: 157, baseType: !929, size: 32, align: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1088, file: !1089, line: 159, baseType: !1095, size: 64, align: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1098)
!1098 = !{!1099, !1103, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1142, !1144, !1145, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1178, !1179, !1180, !1181, !1182, !1183, !1186, !1187, !1188, !1189}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !744, line: 282, baseType: !1100, size: 512, align: 64)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 512, align: 64, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 8)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1097, file: !744, line: 299, baseType: !1104, size: 256, align: 32, offset: 512)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 256, align: 32, elements: !1101)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1097, file: !744, line: 315, baseType: !923, size: 64, align: 64, offset: 768)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1097, file: !744, line: 326, baseType: !929, size: 32, align: 32, offset: 832)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1097, file: !744, line: 326, baseType: !929, size: 32, align: 32, offset: 864)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1097, file: !744, line: 334, baseType: !929, size: 32, align: 32, offset: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1097, file: !744, line: 341, baseType: !929, size: 32, align: 32, offset: 928)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1097, file: !744, line: 346, baseType: !929, size: 32, align: 32, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1097, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1097, file: !744, line: 356, baseType: !960, size: 64, align: 32, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1097, file: !744, line: 361, baseType: !1005, size: 64, align: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1097, file: !744, line: 369, baseType: !1005, size: 64, align: 64, offset: 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1097, file: !744, line: 377, baseType: !1005, size: 64, align: 64, offset: 1216)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1097, file: !744, line: 382, baseType: !929, size: 32, align: 32, offset: 1280)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1097, file: !744, line: 386, baseType: !929, size: 32, align: 32, offset: 1312)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1097, file: !744, line: 391, baseType: !929, size: 32, align: 32, offset: 1344)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1097, file: !744, line: 396, baseType: !930, size: 64, align: 64, offset: 1408)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1097, file: !744, line: 403, baseType: !1121, size: 512, align: 64, offset: 1472)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 512, align: 64, elements: !1101)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1097, file: !744, line: 410, baseType: !929, size: 32, align: 32, offset: 1984)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1097, file: !744, line: 415, baseType: !929, size: 32, align: 32, offset: 2016)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1097, file: !744, line: 420, baseType: !929, size: 32, align: 32, offset: 2048)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1097, file: !744, line: 425, baseType: !929, size: 32, align: 32, offset: 2080)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1097, file: !744, line: 435, baseType: !1005, size: 64, align: 64, offset: 2112)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1097, file: !744, line: 440, baseType: !929, size: 32, align: 32, offset: 2176)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1097, file: !744, line: 445, baseType: !978, size: 64, align: 64, offset: 2240)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1097, file: !744, line: 459, baseType: !1130, size: 512, align: 64, offset: 2304)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !1101)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1133, line: 94, baseType: !1134)
!1133 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1133, line: 81, size: 192, align: 64, elements: !1135)
!1135 = !{!1136, !1140, !1141}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1134, file: !1133, line: 82, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1133, line: 73, baseType: !1139)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1133, line: 73, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !1133, line: 89, baseType: !924, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !1133, line: 93, baseType: !929, size: 32, align: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1097, file: !744, line: 473, baseType: !1143, size: 64, align: 64, offset: 2816)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1097, file: !744, line: 477, baseType: !929, size: 32, align: 32, offset: 2880)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1097, file: !744, line: 479, baseType: !1146, size: 64, align: 64, offset: 2944)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1159}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1149, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !744, line: 203, baseType: !924, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1149, file: !744, line: 204, baseType: !929, size: 32, align: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1149, file: !744, line: 205, baseType: !1155, size: 64, align: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1157, line: 86, baseType: !1158)
!1157 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1157, line: 86, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1149, file: !744, line: 206, baseType: !1131, size: 64, align: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1097, file: !744, line: 480, baseType: !929, size: 32, align: 32, offset: 3008)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1097, file: !744, line: 505, baseType: !929, size: 32, align: 32, offset: 3040)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1097, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1097, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1097, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1097, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1097, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1097, file: !744, line: 532, baseType: !1005, size: 64, align: 64, offset: 3264)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1097, file: !744, line: 539, baseType: !1005, size: 64, align: 64, offset: 3328)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1097, file: !744, line: 547, baseType: !1005, size: 64, align: 64, offset: 3392)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1097, file: !744, line: 554, baseType: !1155, size: 64, align: 64, offset: 3456)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1097, file: !744, line: 563, baseType: !929, size: 32, align: 32, offset: 3520)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1097, file: !744, line: 572, baseType: !929, size: 32, align: 32, offset: 3552)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1097, file: !744, line: 581, baseType: !929, size: 32, align: 32, offset: 3584)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1097, file: !744, line: 588, baseType: !1175, size: 64, align: 64, offset: 3648)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1006, line: 194, baseType: !1177)
!1177 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1097, file: !744, line: 593, baseType: !929, size: 32, align: 32, offset: 3712)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1097, file: !744, line: 596, baseType: !929, size: 32, align: 32, offset: 3744)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1097, file: !744, line: 599, baseType: !1131, size: 64, align: 64, offset: 3776)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1097, file: !744, line: 605, baseType: !1131, size: 64, align: 64, offset: 3840)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1097, file: !744, line: 616, baseType: !1131, size: 64, align: 64, offset: 3904)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1097, file: !744, line: 626, baseType: !1184, size: 64, align: 64, offset: 3968)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1185, line: 216, baseType: !979)
!1185 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1097, file: !744, line: 627, baseType: !1184, size: 64, align: 64, offset: 4032)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1097, file: !744, line: 628, baseType: !1184, size: 64, align: 64, offset: 4096)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1097, file: !744, line: 629, baseType: !1184, size: 64, align: 64, offset: 4160)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1097, file: !744, line: 645, baseType: !1131, size: 64, align: 64, offset: 4224)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1088, file: !1089, line: 161, baseType: !1191, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1089, line: 117, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1089, line: 100, size: 832, align: 64, elements: !1194)
!1194 = !{!1195, !1202, !1203, !1204, !1205, !1206, !1208, !1209, !1210}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1193, file: !1089, line: 105, baseType: !1196, size: 256, align: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 256, align: 64, elements: !1200)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1133, line: 238, baseType: !1199)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1133, line: 238, flags: DIFlagFwdDecl)
!1200 = !{!1201}
!1201 = !DISubrange(count: 4)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1193, file: !1089, line: 110, baseType: !929, size: 32, align: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1193, file: !1089, line: 111, baseType: !929, size: 32, align: 32, offset: 288)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1193, file: !1089, line: 111, baseType: !929, size: 32, align: 32, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1193, file: !1089, line: 112, baseType: !1104, size: 256, align: 32, offset: 352)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1193, file: !1089, line: 113, baseType: !1207, size: 128, align: 32, offset: 608)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 128, align: 32, elements: !1200)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1193, file: !1089, line: 114, baseType: !929, size: 32, align: 32, offset: 736)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1193, file: !1089, line: 115, baseType: !929, size: 32, align: 32, offset: 768)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1193, file: !1089, line: 116, baseType: !929, size: 32, align: 32, offset: 800)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1088, file: !1089, line: 163, baseType: !930, size: 64, align: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1088, file: !1089, line: 165, baseType: !1213, size: 128, align: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1089, line: 122, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1089, line: 119, size: 128, align: 64, elements: !1215)
!1215 = !{!1216, !1240}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1214, file: !1089, line: 120, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1236, !1237, !1238, !1239}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1219, file: !14, line: 1451, baseType: !1131, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1219, file: !14, line: 1461, baseType: !1005, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1219, file: !14, line: 1467, baseType: !1005, size: 64, align: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1219, file: !14, line: 1468, baseType: !924, size: 64, align: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1219, file: !14, line: 1469, baseType: !929, size: 32, align: 32, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1219, file: !14, line: 1470, baseType: !929, size: 32, align: 32, offset: 288)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1219, file: !14, line: 1474, baseType: !929, size: 32, align: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1219, file: !14, line: 1479, baseType: !1229, size: 64, align: 64, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1231, file: !14, line: 1412, baseType: !924, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !14, line: 1413, baseType: !929, size: 32, align: 32, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1231, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1219, file: !14, line: 1480, baseType: !929, size: 32, align: 32, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1219, file: !14, line: 1486, baseType: !1005, size: 64, align: 64, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1219, file: !14, line: 1488, baseType: !1005, size: 64, align: 64, offset: 576)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1219, file: !14, line: 1497, baseType: !1005, size: 64, align: 64, offset: 640)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1214, file: !1089, line: 121, baseType: !1095, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1088, file: !1089, line: 166, baseType: !1242, size: 128, align: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1089, line: 127, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1089, line: 124, size: 128, align: 64, elements: !1244)
!1244 = !{!1245, !1318}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1243, file: !1089, line: 125, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1250)
!1250 = !{!1251, !1252, !1276, !1280, !1281, !1315, !1316, !1317}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1249, file: !14, line: 5751, baseType: !982, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1249, file: !14, line: 5756, baseType: !1253, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1256)
!1256 = !{!1257, !1258, !1261, !1262, !1263, !1267, !1271, !1275}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1255, file: !14, line: 5797, baseType: !950, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1255, file: !14, line: 5804, baseType: !1259, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1255, file: !14, line: 5815, baseType: !982, size: 64, align: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1255, file: !14, line: 5825, baseType: !929, size: 32, align: 32, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1255, file: !14, line: 5826, baseType: !1264, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!929, !1247}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1255, file: !14, line: 5827, baseType: !1268, size: 64, align: 64, offset: 320)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!929, !1247, !1217}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1255, file: !14, line: 5828, baseType: !1272, size: 64, align: 64, offset: 384)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !1247}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1255, file: !14, line: 5829, baseType: !1272, size: 64, align: 64, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1249, file: !14, line: 5762, baseType: !1277, size: 64, align: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1279)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1249, file: !14, line: 5768, baseType: !930, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1249, file: !14, line: 5775, baseType: !1282, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1284, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1284, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1284, file: !14, line: 3948, baseType: !936, size: 32, align: 32, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1284, file: !14, line: 3958, baseType: !924, size: 64, align: 64, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1284, file: !14, line: 3962, baseType: !929, size: 32, align: 32, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1284, file: !14, line: 3968, baseType: !929, size: 32, align: 32, offset: 224)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1284, file: !14, line: 3973, baseType: !1005, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1284, file: !14, line: 3986, baseType: !929, size: 32, align: 32, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1284, file: !14, line: 3999, baseType: !929, size: 32, align: 32, offset: 352)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1284, file: !14, line: 4004, baseType: !929, size: 32, align: 32, offset: 384)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1284, file: !14, line: 4005, baseType: !929, size: 32, align: 32, offset: 416)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1284, file: !14, line: 4010, baseType: !929, size: 32, align: 32, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1284, file: !14, line: 4011, baseType: !929, size: 32, align: 32, offset: 480)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1284, file: !14, line: 4020, baseType: !960, size: 64, align: 32, offset: 512)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1284, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1284, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1284, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1284, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1284, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1284, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1284, file: !14, line: 4039, baseType: !929, size: 32, align: 32, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1284, file: !14, line: 4046, baseType: !978, size: 64, align: 64, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1284, file: !14, line: 4050, baseType: !929, size: 32, align: 32, offset: 896)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1284, file: !14, line: 4054, baseType: !929, size: 32, align: 32, offset: 928)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1284, file: !14, line: 4061, baseType: !929, size: 32, align: 32, offset: 960)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1284, file: !14, line: 4065, baseType: !929, size: 32, align: 32, offset: 992)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1284, file: !14, line: 4073, baseType: !929, size: 32, align: 32, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1284, file: !14, line: 4080, baseType: !929, size: 32, align: 32, offset: 1056)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1284, file: !14, line: 4084, baseType: !929, size: 32, align: 32, offset: 1088)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1249, file: !14, line: 5781, baseType: !1282, size: 64, align: 64, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1249, file: !14, line: 5787, baseType: !960, size: 64, align: 32, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1249, file: !14, line: 5793, baseType: !960, size: 64, align: 32, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1243, file: !1089, line: 126, baseType: !929, size: 32, align: 32, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1088, file: !1089, line: 172, baseType: !1217, size: 64, align: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1088, file: !1089, line: 177, baseType: !924, size: 64, align: 64, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1088, file: !1089, line: 178, baseType: !937, size: 32, align: 32, offset: 704)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1088, file: !1089, line: 180, baseType: !930, size: 64, align: 64, offset: 768)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1088, file: !1089, line: 185, baseType: !929, size: 32, align: 32, offset: 832)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1088, file: !1089, line: 190, baseType: !930, size: 64, align: 64, offset: 896)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1088, file: !1089, line: 195, baseType: !929, size: 32, align: 32, offset: 960)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1088, file: !1089, line: 200, baseType: !1217, size: 64, align: 64, offset: 1024)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1088, file: !1089, line: 201, baseType: !929, size: 32, align: 32, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1088, file: !1089, line: 202, baseType: !1095, size: 64, align: 64, offset: 1152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1088, file: !1089, line: 203, baseType: !929, size: 32, align: 32, offset: 1216)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1088, file: !1089, line: 205, baseType: !929, size: 32, align: 32, offset: 1248)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1088, file: !1089, line: 206, baseType: !929, size: 32, align: 32, offset: 1280)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1088, file: !1089, line: 209, baseType: !1184, size: 64, align: 64, offset: 1344)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1088, file: !1089, line: 212, baseType: !1184, size: 64, align: 64, offset: 1408)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1088, file: !1089, line: 213, baseType: !1095, size: 64, align: 64, offset: 1472)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1088, file: !1089, line: 215, baseType: !929, size: 32, align: 32, offset: 1536)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1088, file: !1089, line: 217, baseType: !929, size: 32, align: 32, offset: 1568)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1088, file: !1089, line: 220, baseType: !929, size: 32, align: 32, offset: 1600)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1075, file: !14, line: 1598, baseType: !930, size: 64, align: 64, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1075, file: !14, line: 1606, baseType: !1005, size: 64, align: 64, offset: 448)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1075, file: !14, line: 1614, baseType: !929, size: 32, align: 32, offset: 512)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1075, file: !14, line: 1622, baseType: !929, size: 32, align: 32, offset: 544)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1075, file: !14, line: 1628, baseType: !929, size: 32, align: 32, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !14, line: 1636, baseType: !929, size: 32, align: 32, offset: 608)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1075, file: !14, line: 1643, baseType: !929, size: 32, align: 32, offset: 640)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1075, file: !14, line: 1657, baseType: !924, size: 64, align: 64, offset: 704)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1075, file: !14, line: 1658, baseType: !929, size: 32, align: 32, offset: 768)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1075, file: !14, line: 1679, baseType: !960, size: 64, align: 32, offset: 800)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1075, file: !14, line: 1688, baseType: !929, size: 32, align: 32, offset: 864)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1075, file: !14, line: 1712, baseType: !929, size: 32, align: 32, offset: 896)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1075, file: !14, line: 1729, baseType: !929, size: 32, align: 32, offset: 928)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1075, file: !14, line: 1729, baseType: !929, size: 32, align: 32, offset: 960)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1075, file: !14, line: 1744, baseType: !929, size: 32, align: 32, offset: 992)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1075, file: !14, line: 1744, baseType: !929, size: 32, align: 32, offset: 1024)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1075, file: !14, line: 1751, baseType: !929, size: 32, align: 32, offset: 1056)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1075, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1075, file: !14, line: 1791, baseType: !1357, size: 64, align: 64, offset: 1152)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{null, !1360, !1361, !928, !929, !929, !929}
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1075, file: !14, line: 1808, baseType: !1364, size: 64, align: 64, offset: 1216)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!473, !1360, !967}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1075, file: !14, line: 1816, baseType: !929, size: 32, align: 32, offset: 1280)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1075, file: !14, line: 1825, baseType: !1369, size: 32, align: 32, offset: 1312)
!1369 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1075, file: !14, line: 1830, baseType: !929, size: 32, align: 32, offset: 1344)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1075, file: !14, line: 1838, baseType: !1369, size: 32, align: 32, offset: 1376)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1075, file: !14, line: 1846, baseType: !929, size: 32, align: 32, offset: 1408)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1075, file: !14, line: 1851, baseType: !929, size: 32, align: 32, offset: 1440)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1075, file: !14, line: 1861, baseType: !1369, size: 32, align: 32, offset: 1472)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1075, file: !14, line: 1868, baseType: !1369, size: 32, align: 32, offset: 1504)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1075, file: !14, line: 1875, baseType: !1369, size: 32, align: 32, offset: 1536)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1075, file: !14, line: 1882, baseType: !1369, size: 32, align: 32, offset: 1568)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1075, file: !14, line: 1889, baseType: !1369, size: 32, align: 32, offset: 1600)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1075, file: !14, line: 1896, baseType: !1369, size: 32, align: 32, offset: 1632)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1075, file: !14, line: 1903, baseType: !1369, size: 32, align: 32, offset: 1664)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1075, file: !14, line: 1910, baseType: !929, size: 32, align: 32, offset: 1696)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1075, file: !14, line: 1915, baseType: !929, size: 32, align: 32, offset: 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1075, file: !14, line: 1926, baseType: !928, size: 64, align: 64, offset: 1792)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1075, file: !14, line: 1935, baseType: !960, size: 64, align: 32, offset: 1856)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1075, file: !14, line: 1942, baseType: !929, size: 32, align: 32, offset: 1920)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1075, file: !14, line: 1948, baseType: !929, size: 32, align: 32, offset: 1952)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1075, file: !14, line: 1954, baseType: !929, size: 32, align: 32, offset: 1984)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1075, file: !14, line: 1960, baseType: !929, size: 32, align: 32, offset: 2016)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1075, file: !14, line: 1984, baseType: !929, size: 32, align: 32, offset: 2048)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1075, file: !14, line: 1991, baseType: !929, size: 32, align: 32, offset: 2080)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1075, file: !14, line: 1996, baseType: !929, size: 32, align: 32, offset: 2112)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1075, file: !14, line: 2004, baseType: !929, size: 32, align: 32, offset: 2144)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1075, file: !14, line: 2011, baseType: !929, size: 32, align: 32, offset: 2176)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1075, file: !14, line: 2018, baseType: !929, size: 32, align: 32, offset: 2208)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1075, file: !14, line: 2027, baseType: !929, size: 32, align: 32, offset: 2240)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1075, file: !14, line: 2034, baseType: !929, size: 32, align: 32, offset: 2272)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1075, file: !14, line: 2044, baseType: !929, size: 32, align: 32, offset: 2304)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1075, file: !14, line: 2054, baseType: !1399, size: 64, align: 64, offset: 2368)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1075, file: !14, line: 2061, baseType: !1399, size: 64, align: 64, offset: 2432)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1075, file: !14, line: 2066, baseType: !929, size: 32, align: 32, offset: 2496)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1075, file: !14, line: 2070, baseType: !929, size: 32, align: 32, offset: 2528)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1075, file: !14, line: 2078, baseType: !929, size: 32, align: 32, offset: 2560)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1075, file: !14, line: 2085, baseType: !929, size: 32, align: 32, offset: 2592)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1075, file: !14, line: 2092, baseType: !929, size: 32, align: 32, offset: 2624)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1075, file: !14, line: 2099, baseType: !929, size: 32, align: 32, offset: 2656)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1075, file: !14, line: 2106, baseType: !929, size: 32, align: 32, offset: 2688)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1075, file: !14, line: 2113, baseType: !929, size: 32, align: 32, offset: 2720)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1075, file: !14, line: 2120, baseType: !929, size: 32, align: 32, offset: 2752)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1075, file: !14, line: 2125, baseType: !929, size: 32, align: 32, offset: 2784)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1075, file: !14, line: 2133, baseType: !929, size: 32, align: 32, offset: 2816)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1075, file: !14, line: 2140, baseType: !929, size: 32, align: 32, offset: 2848)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1075, file: !14, line: 2145, baseType: !929, size: 32, align: 32, offset: 2880)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1075, file: !14, line: 2153, baseType: !929, size: 32, align: 32, offset: 2912)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1075, file: !14, line: 2158, baseType: !929, size: 32, align: 32, offset: 2944)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1075, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1075, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1075, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1075, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1075, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1075, file: !14, line: 2203, baseType: !929, size: 32, align: 32, offset: 3136)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1075, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1075, file: !14, line: 2212, baseType: !929, size: 32, align: 32, offset: 3200)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1075, file: !14, line: 2213, baseType: !929, size: 32, align: 32, offset: 3232)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1075, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1075, file: !14, line: 2232, baseType: !929, size: 32, align: 32, offset: 3296)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1075, file: !14, line: 2243, baseType: !929, size: 32, align: 32, offset: 3328)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1075, file: !14, line: 2249, baseType: !929, size: 32, align: 32, offset: 3360)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1075, file: !14, line: 2256, baseType: !929, size: 32, align: 32, offset: 3392)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1075, file: !14, line: 2263, baseType: !978, size: 64, align: 64, offset: 3456)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1075, file: !14, line: 2270, baseType: !978, size: 64, align: 64, offset: 3520)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1075, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1075, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1075, file: !14, line: 2367, baseType: !1435, size: 64, align: 64, offset: 3648)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!929, !1360, !1095, !929}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1075, file: !14, line: 2383, baseType: !929, size: 32, align: 32, offset: 3712)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1075, file: !14, line: 2386, baseType: !1369, size: 32, align: 32, offset: 3744)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1075, file: !14, line: 2387, baseType: !1369, size: 32, align: 32, offset: 3776)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1075, file: !14, line: 2394, baseType: !929, size: 32, align: 32, offset: 3808)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1075, file: !14, line: 2401, baseType: !929, size: 32, align: 32, offset: 3840)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1075, file: !14, line: 2408, baseType: !929, size: 32, align: 32, offset: 3872)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1075, file: !14, line: 2415, baseType: !929, size: 32, align: 32, offset: 3904)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1075, file: !14, line: 2422, baseType: !929, size: 32, align: 32, offset: 3936)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1075, file: !14, line: 2423, baseType: !1447, size: 64, align: 64, offset: 3968)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1449, file: !14, line: 827, baseType: !929, size: 32, align: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1449, file: !14, line: 828, baseType: !929, size: 32, align: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1449, file: !14, line: 829, baseType: !929, size: 32, align: 32, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1449, file: !14, line: 830, baseType: !1369, size: 32, align: 32, offset: 96)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1075, file: !14, line: 2430, baseType: !1005, size: 64, align: 64, offset: 4032)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1075, file: !14, line: 2437, baseType: !1005, size: 64, align: 64, offset: 4096)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1075, file: !14, line: 2444, baseType: !1369, size: 32, align: 32, offset: 4160)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1075, file: !14, line: 2451, baseType: !1369, size: 32, align: 32, offset: 4192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1075, file: !14, line: 2458, baseType: !929, size: 32, align: 32, offset: 4224)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1075, file: !14, line: 2469, baseType: !929, size: 32, align: 32, offset: 4256)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1075, file: !14, line: 2475, baseType: !929, size: 32, align: 32, offset: 4288)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1075, file: !14, line: 2481, baseType: !929, size: 32, align: 32, offset: 4320)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1075, file: !14, line: 2485, baseType: !929, size: 32, align: 32, offset: 4352)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1075, file: !14, line: 2489, baseType: !929, size: 32, align: 32, offset: 4384)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1075, file: !14, line: 2493, baseType: !929, size: 32, align: 32, offset: 4416)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1075, file: !14, line: 2501, baseType: !929, size: 32, align: 32, offset: 4448)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1075, file: !14, line: 2506, baseType: !929, size: 32, align: 32, offset: 4480)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1075, file: !14, line: 2510, baseType: !929, size: 32, align: 32, offset: 4512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1075, file: !14, line: 2514, baseType: !1005, size: 64, align: 64, offset: 4544)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1075, file: !14, line: 2528, baseType: !1471, size: 64, align: 64, offset: 4608)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{null, !1360, !930, !929, !929}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1075, file: !14, line: 2534, baseType: !929, size: 32, align: 32, offset: 4672)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1075, file: !14, line: 2545, baseType: !929, size: 32, align: 32, offset: 4704)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1075, file: !14, line: 2547, baseType: !929, size: 32, align: 32, offset: 4736)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1075, file: !14, line: 2549, baseType: !929, size: 32, align: 32, offset: 4768)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1075, file: !14, line: 2551, baseType: !929, size: 32, align: 32, offset: 4800)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1075, file: !14, line: 2553, baseType: !929, size: 32, align: 32, offset: 4832)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1075, file: !14, line: 2555, baseType: !929, size: 32, align: 32, offset: 4864)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1075, file: !14, line: 2557, baseType: !929, size: 32, align: 32, offset: 4896)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1075, file: !14, line: 2559, baseType: !929, size: 32, align: 32, offset: 4928)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1075, file: !14, line: 2563, baseType: !929, size: 32, align: 32, offset: 4960)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1075, file: !14, line: 2571, baseType: !1485, size: 64, align: 64, offset: 4992)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1075, file: !14, line: 2579, baseType: !1485, size: 64, align: 64, offset: 5056)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1075, file: !14, line: 2586, baseType: !929, size: 32, align: 32, offset: 5120)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1075, file: !14, line: 2615, baseType: !929, size: 32, align: 32, offset: 5152)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1075, file: !14, line: 2627, baseType: !929, size: 32, align: 32, offset: 5184)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1075, file: !14, line: 2637, baseType: !929, size: 32, align: 32, offset: 5216)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1075, file: !14, line: 2681, baseType: !929, size: 32, align: 32, offset: 5248)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1075, file: !14, line: 2709, baseType: !1005, size: 64, align: 64, offset: 5312)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1075, file: !14, line: 2716, baseType: !1494, size: 64, align: 64, offset: 5376)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1497)
!1497 = !{!1498, !1499, !1500, !1501, !1502, !1503, !1507, !1513, !1517, !1518, !1519, !1520, !1526, !1527, !1528, !1529, !1530}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1496, file: !14, line: 3642, baseType: !950, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1496, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1496, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1496, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1496, file: !14, line: 3669, baseType: !929, size: 32, align: 32, offset: 160)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1496, file: !14, line: 3682, baseType: !1504, size: 64, align: 64, offset: 192)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!929, !1073, !1095}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1496, file: !14, line: 3698, baseType: !1508, size: 64, align: 64, offset: 256)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!929, !1073, !1511, !936}
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1496, file: !14, line: 3712, baseType: !1514, size: 64, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!929, !1073, !929, !1511, !936}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1496, file: !14, line: 3726, baseType: !1508, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1496, file: !14, line: 3737, baseType: !1070, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1496, file: !14, line: 3746, baseType: !929, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1496, file: !14, line: 3757, baseType: !1521, size: 64, align: 64, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{null, !1524}
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1496, file: !14, line: 3766, baseType: !1070, size: 64, align: 64, offset: 640)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1496, file: !14, line: 3774, baseType: !1070, size: 64, align: 64, offset: 704)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1496, file: !14, line: 3780, baseType: !929, size: 32, align: 32, offset: 768)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1496, file: !14, line: 3785, baseType: !929, size: 32, align: 32, offset: 800)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1496, file: !14, line: 3795, baseType: !1531, size: 64, align: 64, offset: 832)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!929, !1073, !1131}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1075, file: !14, line: 2728, baseType: !930, size: 64, align: 64, offset: 5440)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1075, file: !14, line: 2735, baseType: !1121, size: 512, align: 64, offset: 5504)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1075, file: !14, line: 2742, baseType: !929, size: 32, align: 32, offset: 6016)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1075, file: !14, line: 2755, baseType: !929, size: 32, align: 32, offset: 6048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1075, file: !14, line: 2776, baseType: !929, size: 32, align: 32, offset: 6080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1075, file: !14, line: 2783, baseType: !929, size: 32, align: 32, offset: 6112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1075, file: !14, line: 2791, baseType: !929, size: 32, align: 32, offset: 6144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1075, file: !14, line: 2802, baseType: !1095, size: 64, align: 64, offset: 6208)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1075, file: !14, line: 2811, baseType: !929, size: 32, align: 32, offset: 6272)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1075, file: !14, line: 2821, baseType: !929, size: 32, align: 32, offset: 6304)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1075, file: !14, line: 2830, baseType: !929, size: 32, align: 32, offset: 6336)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1075, file: !14, line: 2840, baseType: !929, size: 32, align: 32, offset: 6368)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1075, file: !14, line: 2851, baseType: !1547, size: 64, align: 64, offset: 6400)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!929, !1360, !1550, !930, !928, !929, !929}
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!929, !1360, !930}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1075, file: !14, line: 2871, baseType: !1554, size: 64, align: 64, offset: 6464)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!929, !1360, !1557, !930, !928, !929}
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!929, !1360, !930, !929, !929}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1075, file: !14, line: 2878, baseType: !929, size: 32, align: 32, offset: 6528)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1075, file: !14, line: 2885, baseType: !929, size: 32, align: 32, offset: 6560)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1075, file: !14, line: 3005, baseType: !929, size: 32, align: 32, offset: 6592)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1075, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1075, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1075, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1075, file: !14, line: 3037, baseType: !924, size: 64, align: 64, offset: 6720)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1075, file: !14, line: 3038, baseType: !929, size: 32, align: 32, offset: 6784)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1075, file: !14, line: 3050, baseType: !978, size: 64, align: 64, offset: 6848)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1075, file: !14, line: 3065, baseType: !929, size: 32, align: 32, offset: 6912)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1075, file: !14, line: 3083, baseType: !929, size: 32, align: 32, offset: 6944)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1075, file: !14, line: 3092, baseType: !960, size: 64, align: 32, offset: 6976)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1075, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1075, file: !14, line: 3106, baseType: !960, size: 64, align: 32, offset: 7072)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1075, file: !14, line: 3113, baseType: !1575, size: 64, align: 64, offset: 7168)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1577)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1579)
!1579 = !{!1580, !1581, !1582, !1583, !1584, !1585, !1588}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1578, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1578, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1578, file: !14, line: 720, baseType: !950, size: 64, align: 64, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1578, file: !14, line: 724, baseType: !950, size: 64, align: 64, offset: 128)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1578, file: !14, line: 728, baseType: !929, size: 32, align: 32, offset: 192)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1578, file: !14, line: 734, baseType: !1586, size: 64, align: 64, offset: 256)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1578, file: !14, line: 739, baseType: !1589, size: 64, align: 64, offset: 320)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1075, file: !14, line: 3129, baseType: !1005, size: 64, align: 64, offset: 7232)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1075, file: !14, line: 3130, baseType: !1005, size: 64, align: 64, offset: 7296)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1075, file: !14, line: 3131, baseType: !1005, size: 64, align: 64, offset: 7360)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1075, file: !14, line: 3132, baseType: !1005, size: 64, align: 64, offset: 7424)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1075, file: !14, line: 3139, baseType: !1485, size: 64, align: 64, offset: 7488)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1075, file: !14, line: 3147, baseType: !929, size: 32, align: 32, offset: 7552)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1075, file: !14, line: 3165, baseType: !929, size: 32, align: 32, offset: 7584)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1075, file: !14, line: 3172, baseType: !929, size: 32, align: 32, offset: 7616)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1075, file: !14, line: 3180, baseType: !929, size: 32, align: 32, offset: 7648)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1075, file: !14, line: 3191, baseType: !1399, size: 64, align: 64, offset: 7680)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1075, file: !14, line: 3199, baseType: !924, size: 64, align: 64, offset: 7744)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1075, file: !14, line: 3207, baseType: !1485, size: 64, align: 64, offset: 7808)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1075, file: !14, line: 3214, baseType: !937, size: 32, align: 32, offset: 7872)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1075, file: !14, line: 3224, baseType: !1229, size: 64, align: 64, offset: 7936)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1075, file: !14, line: 3225, baseType: !929, size: 32, align: 32, offset: 8000)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1075, file: !14, line: 3249, baseType: !1131, size: 64, align: 64, offset: 8064)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1075, file: !14, line: 3256, baseType: !929, size: 32, align: 32, offset: 8128)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1075, file: !14, line: 3271, baseType: !929, size: 32, align: 32, offset: 8160)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1075, file: !14, line: 3279, baseType: !1005, size: 64, align: 64, offset: 8192)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1075, file: !14, line: 3301, baseType: !1131, size: 64, align: 64, offset: 8256)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1075, file: !14, line: 3310, baseType: !929, size: 32, align: 32, offset: 8320)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1075, file: !14, line: 3337, baseType: !929, size: 32, align: 32, offset: 8352)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1075, file: !14, line: 3351, baseType: !929, size: 32, align: 32, offset: 8384)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1075, file: !14, line: 3359, baseType: !929, size: 32, align: 32, offset: 8416)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !947, file: !14, line: 3535, baseType: !1616, size: 64, align: 64, offset: 1024)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!929, !1073, !1619}
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !947, file: !14, line: 3541, baseType: !1622, size: 64, align: 64, offset: 1088)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1624)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1089, line: 223, size: 128, align: 64, elements: !1626)
!1626 = !{!1627, !1628}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1625, file: !1089, line: 224, baseType: !1511, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1625, file: !1089, line: 225, baseType: !1511, size: 64, align: 64, offset: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !947, file: !14, line: 3549, baseType: !1630, size: 64, align: 64, offset: 1152)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{null, !1068}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !947, file: !14, line: 3551, baseType: !1070, size: 64, align: 64, offset: 1216)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !947, file: !14, line: 3552, baseType: !1635, size: 64, align: 64, offset: 1280)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!929, !1073, !924, !929, !1638}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1646, !1670}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1640, file: !14, line: 3921, baseType: !942, size: 16, align: 16)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1640, file: !14, line: 3922, baseType: !936, size: 32, align: 32, offset: 32)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1640, file: !14, line: 3923, baseType: !936, size: 32, align: 32, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1640, file: !14, line: 3924, baseType: !937, size: 32, align: 32, offset: 96)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1640, file: !14, line: 3925, baseType: !1647, size: 64, align: 64, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1663, !1665, !1666, !1667, !1668, !1669}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1650, file: !14, line: 3886, baseType: !929, size: 32, align: 32)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1650, file: !14, line: 3887, baseType: !929, size: 32, align: 32, offset: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1650, file: !14, line: 3888, baseType: !929, size: 32, align: 32, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1650, file: !14, line: 3889, baseType: !929, size: 32, align: 32, offset: 96)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1650, file: !14, line: 3890, baseType: !929, size: 32, align: 32, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1650, file: !14, line: 3897, baseType: !1658, size: 768, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1660)
!1660 = !{!1661, !1662}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1659, file: !14, line: 3855, baseType: !1100, size: 512, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1659, file: !14, line: 3857, baseType: !1104, size: 256, align: 32, offset: 512)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1650, file: !14, line: 3903, baseType: !1664, size: 256, align: 64, offset: 960)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 256, align: 64, elements: !1200)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1650, file: !14, line: 3904, baseType: !1207, size: 128, align: 32, offset: 1216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1650, file: !14, line: 3908, baseType: !1485, size: 64, align: 64, offset: 1408)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1650, file: !14, line: 3915, baseType: !1485, size: 64, align: 64, offset: 1472)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1650, file: !14, line: 3917, baseType: !929, size: 32, align: 32, offset: 1536)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1640, file: !14, line: 3926, baseType: !1005, size: 64, align: 64, offset: 192)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !947, file: !14, line: 3564, baseType: !1672, size: 64, align: 64, offset: 1344)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!929, !1073, !1217, !1361, !928}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !947, file: !14, line: 3566, baseType: !1676, size: 64, align: 64, offset: 1408)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!929, !1073, !930, !928, !1217}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !947, file: !14, line: 3567, baseType: !1070, size: 64, align: 64, offset: 1472)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !947, file: !14, line: 3576, baseType: !1681, size: 64, align: 64, offset: 1536)
