; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--v4l2_context.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--v4l2_context.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.V4L2Context = type { i8*, i32, i32, i32, %struct.v4l2_format, i32, i32, %struct.V4L2Buffer*, i32, i32, i32 }
%struct.v4l2_format = type { i32, %union.anon }
%union.anon = type { %struct.v4l2_window, [144 x i8] }
%struct.v4l2_window = type { %struct.v4l2_rect, i32, i32, %struct.v4l2_clip*, i32, i8*, i8 }
%struct.v4l2_rect = type { i32, i32, i32, i32 }
%struct.v4l2_clip = type { %struct.v4l2_rect, %struct.v4l2_clip* }
%struct.V4L2Buffer = type { %struct.V4L2Context*, %struct.AVBufferRef*, i32, [8 x %struct.V4L2Plane_info], i32, %struct.v4l2_buffer, [8 x %struct.v4l2_plane], i32, i32 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.V4L2Plane_info = type { i32, i8*, i64 }
%struct.v4l2_buffer = type { i32, i32, i32, i32, i32, %struct.timeval, %struct.v4l2_timecode, i32, i32, %union.anon.0, i32, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.v4l2_timecode = type { i32, i32, i8, i8, i8, i8, [4 x i8] }
%union.anon.0 = type { i64 }
%struct.v4l2_plane = type { i32, i32, %union.anon.1, i32, [11 x i32] }
%union.anon.1 = type { i64 }

!845 = !{!846, !847, !848, !849}
!846 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!847 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!848 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!849 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !220, line: 1175, size: 32, align: 32, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!852 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!853 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!854 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!855 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!856 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!857 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!858 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!859 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!860 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!861 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!862 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!863 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!864 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!865 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!866 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!867 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!868 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!870 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!871 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!873 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!874 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!875 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!876 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!878 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!879 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !220, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !220, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !220, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "v4l2_memory", file: !4, line: 175, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914}
!911 = !DIEnumerator(name: "V4L2_MEMORY_MMAP", value: 1)
!912 = !DIEnumerator(name: "V4L2_MEMORY_USERPTR", value: 2)
!913 = !DIEnumerator(name: "V4L2_MEMORY_OVERLAY", value: 3)
!914 = !DIEnumerator(name: "V4L2_MEMORY_DMABUF", value: 4)
!915 = !{!916, !917, !918, !1321}
!916 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!917 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2m2mContext", file: !920, line: 62, baseType: !921)
!920 = !DIFile(filename: "libavcodec/v4l2_m2m.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2m2mContext", file: !920, line: 43, size: 37568, align: 64, elements: !922)
!922 = !{!923, !928, !929, !1161, !1162, !1865, !1875, !1876, !1877, !1878}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "devname", scope: !921, file: !920, line: 44, baseType: !924, size: 32768, align: 8)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 32768, align: 8, elements: !926)
!925 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!926 = !{!927}
!927 = !DISubrange(count: 4096)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !921, file: !920, line: 45, baseType: !916, size: 32, align: 32, offset: 32768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "capture", scope: !921, file: !920, line: 48, baseType: !930, size: 2112, align: 64, offset: 32832)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2Context", file: !931, line: 94, baseType: !932)
!931 = !DIFile(filename: "libavcodec/v4l2_context.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Context", file: !931, line: 36, size: 2112, align: 64, elements: !933)
!933 = !{!934, !937, !938, !939, !940, !1057, !1058, !1059, !1158, !1159, !1160}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !931, line: 40, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !932, file: !931, line: 47, baseType: !3, size: 32, align: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "av_pix_fmt", scope: !932, file: !931, line: 53, baseType: !19, size: 32, align: 32, offset: 96)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "av_codec_id", scope: !932, file: !931, line: 59, baseType: !219, size: 32, align: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !932, file: !931, line: 65, baseType: !941, size: 1664, align: 64, offset: 192)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_format", file: !4, line: 2003, size: 1664, align: 64, elements: !942)
!942 = !{!943, !946}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !4, line: 2004, baseType: !944, size: 32, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !945, line: 26, baseType: !917)
!945 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !941, file: !4, line: 2013, baseType: !947, size: 1600, align: 64, offset: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !941, file: !4, line: 2005, size: 1600, align: 64, elements: !948)
!948 = !{!949, !964, !997, !1020, !1035, !1045, !1053}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pix", scope: !947, file: !4, line: 2006, baseType: !950, size: 384, align: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_pix_format", file: !4, line: 449, size: 384, align: 32, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !950, file: !4, line: 450, baseType: !944, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !950, file: !4, line: 451, baseType: !944, size: 32, align: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !950, file: !4, line: 452, baseType: !944, size: 32, align: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !950, file: !4, line: 453, baseType: !944, size: 32, align: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !950, file: !4, line: 454, baseType: !944, size: 32, align: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sizeimage", scope: !950, file: !4, line: 455, baseType: !944, size: 32, align: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !950, file: !4, line: 456, baseType: !944, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !950, file: !4, line: 457, baseType: !944, size: 32, align: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !4, line: 458, baseType: !944, size: 32, align: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr_enc", scope: !950, file: !4, line: 459, baseType: !944, size: 32, align: 32, offset: 288)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "quantization", scope: !950, file: !4, line: 460, baseType: !944, size: 32, align: 32, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_func", scope: !950, file: !4, line: 461, baseType: !944, size: 32, align: 32, offset: 352)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pix_mp", scope: !947, file: !4, line: 2007, baseType: !965, size: 1536, align: 8)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_pix_format_mplane", file: !4, line: 1966, size: 1536, align: 8, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !986, !989, !990, !991, !992, !993}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !965, file: !4, line: 1967, baseType: !944, size: 32, align: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !965, file: !4, line: 1968, baseType: !944, size: 32, align: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !965, file: !4, line: 1969, baseType: !944, size: 32, align: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !965, file: !4, line: 1970, baseType: !944, size: 32, align: 32, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !965, file: !4, line: 1971, baseType: !944, size: 32, align: 32, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "plane_fmt", scope: !965, file: !4, line: 1973, baseType: !973, size: 1280, align: 8, offset: 160)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 1280, align: 8, elements: !984)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_plane_pix_format", file: !4, line: 1946, size: 160, align: 8, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sizeimage", scope: !974, file: !4, line: 1947, baseType: !944, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !974, file: !4, line: 1948, baseType: !944, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !974, file: !4, line: 1949, baseType: !979, size: 96, align: 16, offset: 64)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 96, align: 16, elements: !982)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !945, line: 23, baseType: !981)
!981 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!982 = !{!983}
!983 = !DISubrange(count: 6)
!984 = !{!985}
!985 = !DISubrange(count: 8)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !965, file: !4, line: 1974, baseType: !987, size: 8, align: 8, offset: 1440)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !945, line: 20, baseType: !988)
!988 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !965, file: !4, line: 1975, baseType: !987, size: 8, align: 8, offset: 1448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr_enc", scope: !965, file: !4, line: 1976, baseType: !987, size: 8, align: 8, offset: 1456)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "quantization", scope: !965, file: !4, line: 1977, baseType: !987, size: 8, align: 8, offset: 1464)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_func", scope: !965, file: !4, line: 1978, baseType: !987, size: 8, align: 8, offset: 1472)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !965, file: !4, line: 1979, baseType: !994, size: 56, align: 8, offset: 1480)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 56, align: 8, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 7)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !947, file: !4, line: 2008, baseType: !998, size: 448, align: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_window", file: !4, line: 979, size: 448, align: 64, elements: !999)
!999 = !{!1000, !1008, !1009, !1010, !1016, !1017, !1019}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !998, file: !4, line: 980, baseType: !1001, size: 128, align: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_rect", file: !4, line: 376, size: 128, align: 32, elements: !1002)
!1002 = !{!1003, !1005, !1006, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1001, file: !4, line: 377, baseType: !1004, size: 32, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !945, line: 25, baseType: !916)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1001, file: !4, line: 378, baseType: !1004, size: 32, align: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1001, file: !4, line: 379, baseType: !944, size: 32, align: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1001, file: !4, line: 380, baseType: !944, size: 32, align: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !998, file: !4, line: 981, baseType: !944, size: 32, align: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "chromakey", scope: !998, file: !4, line: 982, baseType: !944, size: 32, align: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "clips", scope: !998, file: !4, line: 983, baseType: !1011, size: 64, align: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_clip", file: !4, line: 974, size: 192, align: 64, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1012, file: !4, line: 975, baseType: !1001, size: 128, align: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1012, file: !4, line: 976, baseType: !1011, size: 64, align: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "clipcount", scope: !998, file: !4, line: 984, baseType: !944, size: 32, align: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !998, file: !4, line: 985, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "global_alpha", scope: !998, file: !4, line: 986, baseType: !987, size: 8, align: 8, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vbi", scope: !947, file: !4, line: 2009, baseType: !1021, size: 352, align: 32)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_vbi_format", file: !4, line: 1817, size: 352, align: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1031, !1033, !1034}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_rate", scope: !1021, file: !4, line: 1818, baseType: !944, size: 32, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1021, file: !4, line: 1819, baseType: !944, size: 32, align: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "samples_per_line", scope: !1021, file: !4, line: 1820, baseType: !944, size: 32, align: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1021, file: !4, line: 1821, baseType: !944, size: 32, align: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1021, file: !4, line: 1822, baseType: !1028, size: 64, align: 32, offset: 128)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 64, align: 32, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 2)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1021, file: !4, line: 1823, baseType: !1032, size: 64, align: 32, offset: 192)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 64, align: 32, elements: !1029)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1021, file: !4, line: 1824, baseType: !944, size: 32, align: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1021, file: !4, line: 1825, baseType: !1032, size: 64, align: 32, offset: 288)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sliced", scope: !947, file: !4, line: 2010, baseType: !1036, size: 896, align: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_sliced_vbi_format", file: !4, line: 1845, size: 896, align: 32, elements: !1037)
!1037 = !{!1038, !1039, !1043, !1044}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "service_set", scope: !1036, file: !4, line: 1846, baseType: !980, size: 16, align: 16)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "service_lines", scope: !1036, file: !4, line: 1851, baseType: !1040, size: 768, align: 16, offset: 16)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 768, align: 16, elements: !1041)
!1041 = !{!1030, !1042}
!1042 = !DISubrange(count: 24)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "io_size", scope: !1036, file: !4, line: 1852, baseType: !944, size: 32, align: 32, offset: 800)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1036, file: !4, line: 1853, baseType: !1032, size: 64, align: 32, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "sdr", scope: !947, file: !4, line: 2011, baseType: !1046, size: 256, align: 8)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_sdr_format", file: !4, line: 1987, size: 256, align: 8, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1046, file: !4, line: 1988, baseType: !944, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "buffersize", scope: !1046, file: !4, line: 1989, baseType: !944, size: 32, align: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1046, file: !4, line: 1990, baseType: !1051, size: 192, align: 8, offset: 64)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 192, align: 8, elements: !1052)
!1052 = !{!1042}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !947, file: !4, line: 2012, baseType: !1054, size: 1600, align: 8)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 1600, align: 8, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 200)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !932, file: !931, line: 71, baseType: !916, size: 32, align: 32, offset: 1856)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !932, file: !931, line: 71, baseType: !916, size: 32, align: 32, offset: 1888)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !932, file: !931, line: 76, baseType: !1060, size: 64, align: 64, offset: 1920)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2Buffer", file: !680, line: 66, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Buffer", file: !680, line: 41, size: 6656, align: 64, elements: !1063)
!1063 = !{!1064, !1066, !1081, !1084, !1094, !1095, !1154, !1156, !1157}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1062, file: !680, line: 43, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "context_ref", scope: !1062, file: !680, line: 47, baseType: !1067, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1069, line: 94, baseType: !1070)
!1069 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1069, line: 81, size: 192, align: 64, elements: !1071)
!1071 = !{!1072, !1076, !1080}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1070, file: !1069, line: 82, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1069, line: 73, baseType: !1075)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1069, line: 73, flags: DIFlagFwdDecl)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1070, file: !1069, line: 89, baseType: !1077, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1079, line: 48, baseType: !988)
!1079 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !1069, line: 93, baseType: !916, size: 32, align: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "context_refcount", scope: !1062, file: !680, line: 48, baseType: !1082, size: 32, align: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_uint", file: !1083, line: 47, baseType: !917)
!1083 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdatomic.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "plane_info", scope: !1062, file: !680, line: 55, baseType: !1085, size: 1536, align: 64, offset: 192)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 1536, align: 64, elements: !984)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Plane_info", file: !680, line: 51, size: 192, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1086, file: !680, line: 52, baseType: !916, size: 32, align: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mm_addr", scope: !1086, file: !680, line: 53, baseType: !1018, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1086, file: !680, line: 54, baseType: !1091, size: 64, align: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1092, line: 216, baseType: !1093)
!1092 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1093 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !1062, file: !680, line: 57, baseType: !916, size: 32, align: 32, offset: 1728)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1062, file: !680, line: 60, baseType: !1096, size: 704, align: 64, offset: 1792)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_buffer", file: !4, line: 852, size: 704, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1113, !1126, !1127, !1128, !1151, !1152, !1153}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1096, file: !4, line: 853, baseType: !944, size: 32, align: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1096, file: !4, line: 854, baseType: !944, size: 32, align: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "bytesused", scope: !1096, file: !4, line: 855, baseType: !944, size: 32, align: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !4, line: 856, baseType: !944, size: 32, align: 32, offset: 96)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1096, file: !4, line: 857, baseType: !944, size: 32, align: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1096, file: !4, line: 858, baseType: !1104, size: 128, align: 64, offset: 192)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1105, line: 30, size: 128, align: 64, elements: !1106)
!1105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1106 = !{!1107, !1111}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1104, file: !1105, line: 32, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1109, line: 139, baseType: !1110)
!1109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1104, file: !1105, line: 33, baseType: !1112, size: 64, align: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !1109, line: 141, baseType: !1110)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "timecode", scope: !1096, file: !4, line: 859, baseType: !1114, size: 128, align: 32, offset: 320)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_timecode", file: !4, line: 726, size: 128, align: 32, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !4, line: 727, baseType: !944, size: 32, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !4, line: 728, baseType: !944, size: 32, align: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1114, file: !4, line: 729, baseType: !987, size: 8, align: 8, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1114, file: !4, line: 730, baseType: !987, size: 8, align: 8, offset: 72)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1114, file: !4, line: 731, baseType: !987, size: 8, align: 8, offset: 80)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "hours", scope: !1114, file: !4, line: 732, baseType: !987, size: 8, align: 8, offset: 88)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "userbits", scope: !1114, file: !4, line: 733, baseType: !1123, size: 32, align: 8, offset: 96)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 32, align: 8, elements: !1124)
!1124 = !{!1125}
!1125 = !DISubrange(count: 4)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1096, file: !4, line: 860, baseType: !944, size: 32, align: 32, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1096, file: !4, line: 863, baseType: !944, size: 32, align: 32, offset: 480)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1096, file: !4, line: 869, baseType: !1129, size: 64, align: 64, offset: 512)
!1129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1096, file: !4, line: 864, size: 64, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1150}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1129, file: !4, line: 865, baseType: !944, size: 32, align: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !1129, file: !4, line: 866, baseType: !1093, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1129, file: !4, line: 867, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_plane", file: !4, line: 810, size: 512, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1145, !1146}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "bytesused", scope: !1135, file: !4, line: 811, baseType: !944, size: 32, align: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1135, file: !4, line: 812, baseType: !944, size: 32, align: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1135, file: !4, line: 817, baseType: !1140, size: 64, align: 64, offset: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1135, file: !4, line: 813, size: 64, align: 64, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "mem_offset", scope: !1140, file: !4, line: 814, baseType: !944, size: 32, align: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !1140, file: !4, line: 815, baseType: !1093, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1140, file: !4, line: 816, baseType: !1004, size: 32, align: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data_offset", scope: !1135, file: !4, line: 818, baseType: !944, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1135, file: !4, line: 819, baseType: !1147, size: 352, align: 32, offset: 160)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 352, align: 32, elements: !1148)
!1148 = !{!1149}
!1149 = !DISubrange(count: 11)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1129, file: !4, line: 868, baseType: !1004, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1096, file: !4, line: 870, baseType: !944, size: 32, align: 32, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !1096, file: !4, line: 871, baseType: !944, size: 32, align: 32, offset: 608)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1096, file: !4, line: 872, baseType: !944, size: 32, align: 32, offset: 640)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1062, file: !680, line: 61, baseType: !1155, size: 4096, align: 64, offset: 2496)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 4096, align: 64, elements: !984)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1062, file: !680, line: 63, baseType: !916, size: 32, align: 32, offset: 6592)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1062, file: !680, line: 64, baseType: !679, size: 32, align: 32, offset: 6624)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "num_buffers", scope: !932, file: !931, line: 81, baseType: !916, size: 32, align: 32, offset: 1984)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "streamon", scope: !932, file: !931, line: 86, baseType: !916, size: 32, align: 32, offset: 2016)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !932, file: !931, line: 92, baseType: !916, size: 32, align: 32, offset: 2048)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !921, file: !920, line: 49, baseType: !930, size: 2112, align: 64, offset: 34944)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !921, file: !920, line: 52, baseType: !1163, size: 64, align: 64, offset: 37056)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !220, line: 3360, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !220, line: 1556, size: 8448, align: 64, elements: !1166)
!1166 = !{!1167, !1208, !1209, !1210, !1463, !1464, !1465, !1466, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1619, !1623, !1624, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1803, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1165, file: !220, line: 1561, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !798, line: 143, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !798, line: 67, size: 640, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1178, !1182, !1183, !1184, !1185, !1189, !1195, !1197, !1201}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1171, file: !798, line: 72, baseType: !935, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1171, file: !798, line: 78, baseType: !1175, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!935, !1018}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1171, file: !798, line: 85, baseType: !1179, size: 64, align: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !798, line: 85, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1171, file: !798, line: 93, baseType: !916, size: 32, align: 32, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1171, file: !798, line: 99, baseType: !916, size: 32, align: 32, offset: 224)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1171, file: !798, line: 108, baseType: !916, size: 32, align: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1171, file: !798, line: 113, baseType: !1186, size: 64, align: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!1018, !1018, !1018}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1171, file: !798, line: 123, baseType: !1190, size: 64, align: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!1193, !1193}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1171)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1171, file: !798, line: 130, baseType: !1196, size: 32, align: 32, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !798, line: 48, baseType: !797)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1171, file: !798, line: 136, baseType: !1198, size: 64, align: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!1196, !1018}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1171, file: !798, line: 142, baseType: !1202, size: 64, align: 64, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!916, !1205, !1018, !935, !916}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !798, line: 60, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1165, file: !220, line: 1562, baseType: !916, size: 32, align: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1165, file: !220, line: 1564, baseType: !818, size: 32, align: 32, offset: 96)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1165, file: !220, line: 1565, baseType: !1211, size: 64, align: 64, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !220, line: 3468, size: 1984, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1229, !1232, !1235, !1238, !1242, !1243, !1244, !1252, !1253, !1254, !1256, !1260, !1266, !1277, !1281, !1282, !1326, !1434, !1438, !1439, !1443, !1447, !1452, !1456, !1457, !1458}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1213, file: !220, line: 3475, baseType: !935, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1213, file: !220, line: 3480, baseType: !935, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !220, line: 3481, baseType: !818, size: 32, align: 32, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1213, file: !220, line: 3482, baseType: !219, size: 32, align: 32, offset: 160)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1213, file: !220, line: 3487, baseType: !916, size: 32, align: 32, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1213, file: !220, line: 3488, baseType: !1221, size: 64, align: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1224, line: 61, baseType: !1225)
!1224 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1224, line: 58, size: 64, align: 32, elements: !1226)
!1226 = !{!1227, !1228}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1225, file: !1224, line: 59, baseType: !916, size: 32, align: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1225, file: !1224, line: 60, baseType: !916, size: 32, align: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1213, file: !220, line: 3489, baseType: !1230, size: 64, align: 64, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1213, file: !220, line: 3490, baseType: !1233, size: 64, align: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1213, file: !220, line: 3491, baseType: !1236, size: 64, align: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1213, file: !220, line: 3492, baseType: !1239, size: 64, align: 64, offset: 512)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1079, line: 55, baseType: !1093)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1213, file: !220, line: 3493, baseType: !1078, size: 8, align: 8, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1213, file: !220, line: 3494, baseType: !1168, size: 64, align: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1213, file: !220, line: 3495, baseType: !1245, size: 64, align: 64, offset: 704)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !220, line: 3404, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !220, line: 3401, size: 128, align: 64, elements: !1249)
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1248, file: !220, line: 3402, baseType: !916, size: 32, align: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1248, file: !220, line: 3403, baseType: !935, size: 64, align: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1213, file: !220, line: 3507, baseType: !935, size: 64, align: 64, offset: 768)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1213, file: !220, line: 3516, baseType: !916, size: 32, align: 32, offset: 832)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1213, file: !220, line: 3517, baseType: !1255, size: 64, align: 64, offset: 896)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1213, file: !220, line: 3527, baseType: !1257, size: 64, align: 64, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!916, !1163}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1213, file: !220, line: 3535, baseType: !1261, size: 64, align: 64, offset: 1024)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!916, !1163, !1264}
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1164)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1213, file: !220, line: 3541, baseType: !1267, size: 64, align: 64, offset: 1088)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !220, line: 3461, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1271, line: 223, size: 128, align: 64, elements: !1272)
!1271 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1272 = !{!1273, !1276}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1270, file: !1271, line: 224, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1270, file: !1271, line: 225, baseType: !1274, size: 64, align: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1213, file: !220, line: 3549, baseType: !1278, size: 64, align: 64, offset: 1152)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{null, !1255}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1213, file: !220, line: 3551, baseType: !1257, size: 64, align: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1213, file: !220, line: 3552, baseType: !1283, size: 64, align: 64, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!916, !1163, !1077, !916, !1286}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !220, line: 3920, size: 256, align: 64, elements: !1289)
!1289 = !{!1290, !1292, !1294, !1295, !1296, !1324}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1288, file: !220, line: 3921, baseType: !1291, size: 16, align: 16)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1079, line: 49, baseType: !981)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1288, file: !220, line: 3922, baseType: !1293, size: 32, align: 32, offset: 32)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1079, line: 51, baseType: !917)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1288, file: !220, line: 3923, baseType: !1293, size: 32, align: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1288, file: !220, line: 3924, baseType: !917, size: 32, align: 32, offset: 96)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1288, file: !220, line: 3925, baseType: !1297, size: 64, align: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !220, line: 3918, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !220, line: 3885, size: 1600, align: 64, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1315, !1317, !1319, !1320, !1322, !1323}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1300, file: !220, line: 3886, baseType: !916, size: 32, align: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1300, file: !220, line: 3887, baseType: !916, size: 32, align: 32, offset: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1300, file: !220, line: 3888, baseType: !916, size: 32, align: 32, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1300, file: !220, line: 3889, baseType: !916, size: 32, align: 32, offset: 96)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1300, file: !220, line: 3890, baseType: !916, size: 32, align: 32, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1300, file: !220, line: 3897, baseType: !1308, size: 768, align: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !220, line: 3858, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !220, line: 3853, size: 768, align: 64, elements: !1310)
!1310 = !{!1311, !1313}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1309, file: !220, line: 3855, baseType: !1312, size: 512, align: 64)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 512, align: 64, elements: !984)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1309, file: !220, line: 3857, baseType: !1314, size: 256, align: 32, offset: 512)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 256, align: 32, elements: !984)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1300, file: !220, line: 3903, baseType: !1316, size: 256, align: 64, offset: 960)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 256, align: 64, elements: !1124)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1300, file: !220, line: 3904, baseType: !1318, size: 128, align: 32, offset: 1216)
!1318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 128, align: 32, elements: !1124)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1300, file: !220, line: 3906, baseType: !844, size: 32, align: 32, offset: 1344)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1300, file: !220, line: 3908, baseType: !1321, size: 64, align: 64, offset: 1408)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1300, file: !220, line: 3915, baseType: !1321, size: 64, align: 64, offset: 1472)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1300, file: !220, line: 3917, baseType: !916, size: 32, align: 32, offset: 1536)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1288, file: !220, line: 3926, baseType: !1325, size: 64, align: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1079, line: 40, baseType: !1110)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1213, file: !220, line: 3564, baseType: !1327, size: 64, align: 64, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!916, !1163, !1330, !1353, !1433}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !220, line: 1499, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !220, line: 1445, size: 704, align: 64, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1349, !1350, !1351, !1352}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1332, file: !220, line: 1451, baseType: !1067, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1332, file: !220, line: 1461, baseType: !1325, size: 64, align: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1332, file: !220, line: 1467, baseType: !1325, size: 64, align: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1332, file: !220, line: 1468, baseType: !1077, size: 64, align: 64, offset: 192)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1332, file: !220, line: 1469, baseType: !916, size: 32, align: 32, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1332, file: !220, line: 1470, baseType: !916, size: 32, align: 32, offset: 288)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1332, file: !220, line: 1474, baseType: !916, size: 32, align: 32, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1332, file: !220, line: 1479, baseType: !1342, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !220, line: 1415, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !220, line: 1411, size: 128, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1348}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1344, file: !220, line: 1412, baseType: !1077, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1344, file: !220, line: 1413, baseType: !916, size: 32, align: 32, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1344, file: !220, line: 1414, baseType: !850, size: 32, align: 32, offset: 96)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1332, file: !220, line: 1480, baseType: !916, size: 32, align: 32, offset: 448)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1332, file: !220, line: 1486, baseType: !1325, size: 64, align: 64, offset: 512)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1332, file: !220, line: 1488, baseType: !1325, size: 64, align: 64, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1332, file: !220, line: 1497, baseType: !1325, size: 64, align: 64, offset: 640)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !697, line: 646, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !697, line: 268, size: 4288, align: 64, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1387, !1389, !1390, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1356, file: !697, line: 282, baseType: !1312, size: 512, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1356, file: !697, line: 299, baseType: !1314, size: 256, align: 32, offset: 512)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1356, file: !697, line: 315, baseType: !1361, size: 64, align: 64, offset: 768)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1356, file: !697, line: 326, baseType: !916, size: 32, align: 32, offset: 832)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1356, file: !697, line: 326, baseType: !916, size: 32, align: 32, offset: 864)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1356, file: !697, line: 334, baseType: !916, size: 32, align: 32, offset: 896)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1356, file: !697, line: 341, baseType: !916, size: 32, align: 32, offset: 928)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1356, file: !697, line: 346, baseType: !916, size: 32, align: 32, offset: 960)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1356, file: !697, line: 351, baseType: !685, size: 32, align: 32, offset: 992)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1356, file: !697, line: 356, baseType: !1223, size: 64, align: 32, offset: 1024)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1356, file: !697, line: 361, baseType: !1325, size: 64, align: 64, offset: 1088)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1356, file: !697, line: 369, baseType: !1325, size: 64, align: 64, offset: 1152)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1356, file: !697, line: 377, baseType: !1325, size: 64, align: 64, offset: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1356, file: !697, line: 382, baseType: !916, size: 32, align: 32, offset: 1280)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1356, file: !697, line: 386, baseType: !916, size: 32, align: 32, offset: 1312)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1356, file: !697, line: 391, baseType: !916, size: 32, align: 32, offset: 1344)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1356, file: !697, line: 396, baseType: !1018, size: 64, align: 64, offset: 1408)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1356, file: !697, line: 403, baseType: !1377, size: 512, align: 64, offset: 1472)
!1377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 512, align: 64, elements: !984)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1356, file: !697, line: 410, baseType: !916, size: 32, align: 32, offset: 1984)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1356, file: !697, line: 415, baseType: !916, size: 32, align: 32, offset: 2016)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1356, file: !697, line: 420, baseType: !916, size: 32, align: 32, offset: 2048)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1356, file: !697, line: 425, baseType: !916, size: 32, align: 32, offset: 2080)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1356, file: !697, line: 435, baseType: !1325, size: 64, align: 64, offset: 2112)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1356, file: !697, line: 440, baseType: !916, size: 32, align: 32, offset: 2176)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1356, file: !697, line: 445, baseType: !1241, size: 64, align: 64, offset: 2240)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1356, file: !697, line: 459, baseType: !1386, size: 512, align: 64, offset: 2304)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 512, align: 64, elements: !984)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1356, file: !697, line: 473, baseType: !1388, size: 64, align: 64, offset: 2816)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1356, file: !697, line: 477, baseType: !916, size: 32, align: 32, offset: 2880)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1356, file: !697, line: 479, baseType: !1391, size: 64, align: 64, offset: 2944)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !697, line: 207, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !697, line: 201, size: 320, align: 64, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1404}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1394, file: !697, line: 202, baseType: !696, size: 32, align: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1394, file: !697, line: 203, baseType: !1077, size: 64, align: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1394, file: !697, line: 204, baseType: !916, size: 32, align: 32, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1394, file: !697, line: 205, baseType: !1400, size: 64, align: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1402, line: 86, baseType: !1403)
!1402 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1403 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1402, line: 86, flags: DIFlagFwdDecl)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1394, file: !697, line: 206, baseType: !1067, size: 64, align: 64, offset: 256)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1356, file: !697, line: 480, baseType: !916, size: 32, align: 32, offset: 3008)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1356, file: !697, line: 505, baseType: !916, size: 32, align: 32, offset: 3040)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1356, file: !697, line: 512, baseType: !720, size: 32, align: 32, offset: 3072)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1356, file: !697, line: 514, baseType: !726, size: 32, align: 32, offset: 3104)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1356, file: !697, line: 516, baseType: !744, size: 32, align: 32, offset: 3136)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1356, file: !697, line: 523, baseType: !768, size: 32, align: 32, offset: 3168)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1356, file: !697, line: 525, baseType: !787, size: 32, align: 32, offset: 3200)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1356, file: !697, line: 532, baseType: !1325, size: 64, align: 64, offset: 3264)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1356, file: !697, line: 539, baseType: !1325, size: 64, align: 64, offset: 3328)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1356, file: !697, line: 547, baseType: !1325, size: 64, align: 64, offset: 3392)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1356, file: !697, line: 554, baseType: !1400, size: 64, align: 64, offset: 3456)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1356, file: !697, line: 563, baseType: !916, size: 32, align: 32, offset: 3520)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1356, file: !697, line: 572, baseType: !916, size: 32, align: 32, offset: 3552)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1356, file: !697, line: 581, baseType: !916, size: 32, align: 32, offset: 3584)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1356, file: !697, line: 588, baseType: !1420, size: 64, align: 64, offset: 3648)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1079, line: 36, baseType: !1422)
!1422 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1356, file: !697, line: 593, baseType: !916, size: 32, align: 32, offset: 3712)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1356, file: !697, line: 596, baseType: !916, size: 32, align: 32, offset: 3744)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1356, file: !697, line: 599, baseType: !1067, size: 64, align: 64, offset: 3776)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1356, file: !697, line: 605, baseType: !1067, size: 64, align: 64, offset: 3840)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1356, file: !697, line: 616, baseType: !1067, size: 64, align: 64, offset: 3904)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1356, file: !697, line: 626, baseType: !1091, size: 64, align: 64, offset: 3968)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1356, file: !697, line: 627, baseType: !1091, size: 64, align: 64, offset: 4032)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1356, file: !697, line: 628, baseType: !1091, size: 64, align: 64, offset: 4096)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1356, file: !697, line: 629, baseType: !1091, size: 64, align: 64, offset: 4160)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1356, file: !697, line: 645, baseType: !1067, size: 64, align: 64, offset: 4224)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1213, file: !220, line: 3566, baseType: !1435, size: 64, align: 64, offset: 1408)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!916, !1163, !1018, !1433, !1330}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1213, file: !220, line: 3567, baseType: !1257, size: 64, align: 64, offset: 1472)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1213, file: !220, line: 3576, baseType: !1440, size: 64, align: 64, offset: 1536)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!916, !1163, !1353}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1213, file: !220, line: 3577, baseType: !1444, size: 64, align: 64, offset: 1600)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!916, !1163, !1330}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1213, file: !220, line: 3584, baseType: !1448, size: 64, align: 64, offset: 1664)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!916, !1163, !1451}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1213, file: !220, line: 3589, baseType: !1453, size: 64, align: 64, offset: 1728)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{null, !1163}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1213, file: !220, line: 3594, baseType: !916, size: 32, align: 32, offset: 1792)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1213, file: !220, line: 3600, baseType: !935, size: 64, align: 64, offset: 1856)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1213, file: !220, line: 3609, baseType: !1459, size: 64, align: 64, offset: 1920)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1462)
!1462 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !220, line: 3609, flags: DIFlagFwdDecl)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1165, file: !220, line: 1566, baseType: !219, size: 32, align: 32, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1165, file: !220, line: 1581, baseType: !917, size: 32, align: 32, offset: 224)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1165, file: !220, line: 1583, baseType: !1018, size: 64, align: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1165, file: !220, line: 1591, baseType: !1467, size: 64, align: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1271, line: 129, size: 1664, align: 64, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473, !1474, !1492, !1493, !1499, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1468, file: !1271, line: 136, baseType: !916, size: 32, align: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1468, file: !1271, line: 151, baseType: !916, size: 32, align: 32, offset: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1468, file: !1271, line: 157, baseType: !916, size: 32, align: 32, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1468, file: !1271, line: 159, baseType: !1451, size: 64, align: 64, offset: 128)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1468, file: !1271, line: 161, baseType: !1475, size: 64, align: 64, offset: 192)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1271, line: 117, baseType: !1477)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1271, line: 100, size: 832, align: 64, elements: !1478)
!1478 = !{!1479, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1477, file: !1271, line: 105, baseType: !1480, size: 256, align: 64)
!1480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1481, size: 256, align: 64, elements: !1124)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1069, line: 238, baseType: !1483)
!1483 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1069, line: 238, flags: DIFlagFwdDecl)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1477, file: !1271, line: 110, baseType: !916, size: 32, align: 32, offset: 256)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1477, file: !1271, line: 111, baseType: !916, size: 32, align: 32, offset: 288)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1477, file: !1271, line: 111, baseType: !916, size: 32, align: 32, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1477, file: !1271, line: 112, baseType: !1314, size: 256, align: 32, offset: 352)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1477, file: !1271, line: 113, baseType: !1318, size: 128, align: 32, offset: 608)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1477, file: !1271, line: 114, baseType: !916, size: 32, align: 32, offset: 736)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1477, file: !1271, line: 115, baseType: !916, size: 32, align: 32, offset: 768)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1477, file: !1271, line: 116, baseType: !916, size: 32, align: 32, offset: 800)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1468, file: !1271, line: 163, baseType: !1018, size: 64, align: 64, offset: 256)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1468, file: !1271, line: 165, baseType: !1494, size: 128, align: 64, offset: 320)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1271, line: 122, baseType: !1495)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1271, line: 119, size: 128, align: 64, elements: !1496)
!1496 = !{!1497, !1498}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1495, file: !1271, line: 120, baseType: !1330, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1495, file: !1271, line: 121, baseType: !1451, size: 64, align: 64, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1468, file: !1271, line: 166, baseType: !1500, size: 128, align: 64, offset: 448)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1271, line: 127, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1271, line: 124, size: 128, align: 64, elements: !1502)
!1502 = !{!1503, !1576}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1501, file: !1271, line: 125, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !220, line: 5794, baseType: !1507)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !220, line: 5747, size: 512, align: 64, elements: !1508)
!1508 = !{!1509, !1510, !1534, !1538, !1539, !1573, !1574, !1575}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1507, file: !220, line: 5751, baseType: !1168, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1507, file: !220, line: 5756, baseType: !1511, size: 64, align: 64, offset: 64)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1513)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !220, line: 5796, size: 512, align: 64, elements: !1514)
!1514 = !{!1515, !1516, !1519, !1520, !1521, !1525, !1529, !1533}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1513, file: !220, line: 5797, baseType: !935, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1513, file: !220, line: 5804, baseType: !1517, size: 64, align: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1513, file: !220, line: 5815, baseType: !1168, size: 64, align: 64, offset: 128)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1513, file: !220, line: 5825, baseType: !916, size: 32, align: 32, offset: 192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1513, file: !220, line: 5826, baseType: !1522, size: 64, align: 64, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{!916, !1505}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1513, file: !220, line: 5827, baseType: !1526, size: 64, align: 64, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!916, !1505, !1330}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1513, file: !220, line: 5828, baseType: !1530, size: 64, align: 64, offset: 384)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{null, !1505}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1513, file: !220, line: 5829, baseType: !1530, size: 64, align: 64, offset: 448)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1507, file: !220, line: 5762, baseType: !1535, size: 64, align: 64, offset: 128)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !220, line: 5735, baseType: !1537)
!1537 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !220, line: 5735, flags: DIFlagFwdDecl)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1507, file: !220, line: 5768, baseType: !1018, size: 64, align: 64, offset: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1507, file: !220, line: 5775, baseType: !1540, size: 64, align: 64, offset: 256)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !220, line: 4085, baseType: !1542)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !220, line: 3936, size: 1152, align: 64, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1542, file: !220, line: 3940, baseType: !818, size: 32, align: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1542, file: !220, line: 3944, baseType: !219, size: 32, align: 32, offset: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1542, file: !220, line: 3948, baseType: !1293, size: 32, align: 32, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1542, file: !220, line: 3958, baseType: !1077, size: 64, align: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1542, file: !220, line: 3962, baseType: !916, size: 32, align: 32, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1542, file: !220, line: 3968, baseType: !916, size: 32, align: 32, offset: 224)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1542, file: !220, line: 3973, baseType: !1325, size: 64, align: 64, offset: 256)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1542, file: !220, line: 3986, baseType: !916, size: 32, align: 32, offset: 320)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1542, file: !220, line: 3999, baseType: !916, size: 32, align: 32, offset: 352)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1542, file: !220, line: 4004, baseType: !916, size: 32, align: 32, offset: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1542, file: !220, line: 4005, baseType: !916, size: 32, align: 32, offset: 416)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1542, file: !220, line: 4010, baseType: !916, size: 32, align: 32, offset: 448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1542, file: !220, line: 4011, baseType: !916, size: 32, align: 32, offset: 480)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1542, file: !220, line: 4020, baseType: !1223, size: 64, align: 32, offset: 512)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1542, file: !220, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1542, file: !220, line: 4030, baseType: !720, size: 32, align: 32, offset: 608)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1542, file: !220, line: 4031, baseType: !726, size: 32, align: 32, offset: 640)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1542, file: !220, line: 4032, baseType: !744, size: 32, align: 32, offset: 672)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1542, file: !220, line: 4033, baseType: !768, size: 32, align: 32, offset: 704)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1542, file: !220, line: 4034, baseType: !787, size: 32, align: 32, offset: 736)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1542, file: !220, line: 4039, baseType: !916, size: 32, align: 32, offset: 768)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1542, file: !220, line: 4046, baseType: !1241, size: 64, align: 64, offset: 832)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1542, file: !220, line: 4050, baseType: !916, size: 32, align: 32, offset: 896)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1542, file: !220, line: 4054, baseType: !916, size: 32, align: 32, offset: 928)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1542, file: !220, line: 4061, baseType: !916, size: 32, align: 32, offset: 960)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1542, file: !220, line: 4065, baseType: !916, size: 32, align: 32, offset: 992)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1542, file: !220, line: 4073, baseType: !916, size: 32, align: 32, offset: 1024)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1542, file: !220, line: 4080, baseType: !916, size: 32, align: 32, offset: 1056)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1542, file: !220, line: 4084, baseType: !916, size: 32, align: 32, offset: 1088)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1507, file: !220, line: 5781, baseType: !1540, size: 64, align: 64, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1507, file: !220, line: 5787, baseType: !1223, size: 64, align: 32, offset: 384)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1507, file: !220, line: 5793, baseType: !1223, size: 64, align: 32, offset: 448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1501, file: !1271, line: 126, baseType: !916, size: 32, align: 32, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1468, file: !1271, line: 172, baseType: !1330, size: 64, align: 64, offset: 576)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1468, file: !1271, line: 177, baseType: !1077, size: 64, align: 64, offset: 640)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1468, file: !1271, line: 178, baseType: !917, size: 32, align: 32, offset: 704)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1468, file: !1271, line: 180, baseType: !1018, size: 64, align: 64, offset: 768)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1468, file: !1271, line: 185, baseType: !916, size: 32, align: 32, offset: 832)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1468, file: !1271, line: 190, baseType: !1018, size: 64, align: 64, offset: 896)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1468, file: !1271, line: 195, baseType: !916, size: 32, align: 32, offset: 960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1468, file: !1271, line: 200, baseType: !1330, size: 64, align: 64, offset: 1024)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1468, file: !1271, line: 201, baseType: !916, size: 32, align: 32, offset: 1088)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1468, file: !1271, line: 202, baseType: !1451, size: 64, align: 64, offset: 1152)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1468, file: !1271, line: 203, baseType: !916, size: 32, align: 32, offset: 1216)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1468, file: !1271, line: 205, baseType: !916, size: 32, align: 32, offset: 1248)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1468, file: !1271, line: 206, baseType: !916, size: 32, align: 32, offset: 1280)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1468, file: !1271, line: 209, baseType: !1091, size: 64, align: 64, offset: 1344)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1468, file: !1271, line: 212, baseType: !1091, size: 64, align: 64, offset: 1408)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1468, file: !1271, line: 213, baseType: !1451, size: 64, align: 64, offset: 1472)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1468, file: !1271, line: 215, baseType: !916, size: 32, align: 32, offset: 1536)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1468, file: !1271, line: 217, baseType: !916, size: 32, align: 32, offset: 1568)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1468, file: !1271, line: 220, baseType: !916, size: 32, align: 32, offset: 1600)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1165, file: !220, line: 1598, baseType: !1018, size: 64, align: 64, offset: 384)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1165, file: !220, line: 1606, baseType: !1325, size: 64, align: 64, offset: 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1165, file: !220, line: 1614, baseType: !916, size: 32, align: 32, offset: 512)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1165, file: !220, line: 1622, baseType: !916, size: 32, align: 32, offset: 544)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1165, file: !220, line: 1628, baseType: !916, size: 32, align: 32, offset: 576)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1165, file: !220, line: 1636, baseType: !916, size: 32, align: 32, offset: 608)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1165, file: !220, line: 1643, baseType: !916, size: 32, align: 32, offset: 640)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1165, file: !220, line: 1657, baseType: !1077, size: 64, align: 64, offset: 704)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1165, file: !220, line: 1658, baseType: !916, size: 32, align: 32, offset: 768)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1165, file: !220, line: 1679, baseType: !1223, size: 64, align: 32, offset: 800)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1165, file: !220, line: 1688, baseType: !916, size: 32, align: 32, offset: 864)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1165, file: !220, line: 1712, baseType: !916, size: 32, align: 32, offset: 896)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1165, file: !220, line: 1729, baseType: !916, size: 32, align: 32, offset: 928)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1165, file: !220, line: 1729, baseType: !916, size: 32, align: 32, offset: 960)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1165, file: !220, line: 1744, baseType: !916, size: 32, align: 32, offset: 992)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1165, file: !220, line: 1744, baseType: !916, size: 32, align: 32, offset: 1024)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1165, file: !220, line: 1751, baseType: !916, size: 32, align: 32, offset: 1056)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1165, file: !220, line: 1766, baseType: !19, size: 32, align: 32, offset: 1088)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1165, file: !220, line: 1791, baseType: !1615, size: 64, align: 64, offset: 1152)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !1618, !1353, !1433, !916, !916, !916}
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1165, file: !220, line: 1808, baseType: !1620, size: 64, align: 64, offset: 1216)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!19, !1618, !1230}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1165, file: !220, line: 1816, baseType: !916, size: 32, align: 32, offset: 1280)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1165, file: !220, line: 1825, baseType: !1625, size: 32, align: 32, offset: 1312)
!1625 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1165, file: !220, line: 1830, baseType: !916, size: 32, align: 32, offset: 1344)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1165, file: !220, line: 1838, baseType: !1625, size: 32, align: 32, offset: 1376)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1165, file: !220, line: 1846, baseType: !916, size: 32, align: 32, offset: 1408)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1165, file: !220, line: 1851, baseType: !916, size: 32, align: 32, offset: 1440)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1165, file: !220, line: 1861, baseType: !1625, size: 32, align: 32, offset: 1472)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1165, file: !220, line: 1868, baseType: !1625, size: 32, align: 32, offset: 1504)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1165, file: !220, line: 1875, baseType: !1625, size: 32, align: 32, offset: 1536)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1165, file: !220, line: 1882, baseType: !1625, size: 32, align: 32, offset: 1568)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1165, file: !220, line: 1889, baseType: !1625, size: 32, align: 32, offset: 1600)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1165, file: !220, line: 1896, baseType: !1625, size: 32, align: 32, offset: 1632)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1165, file: !220, line: 1903, baseType: !1625, size: 32, align: 32, offset: 1664)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1165, file: !220, line: 1910, baseType: !916, size: 32, align: 32, offset: 1696)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1165, file: !220, line: 1915, baseType: !916, size: 32, align: 32, offset: 1728)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1165, file: !220, line: 1926, baseType: !1433, size: 64, align: 64, offset: 1792)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1165, file: !220, line: 1935, baseType: !1223, size: 64, align: 32, offset: 1856)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1165, file: !220, line: 1942, baseType: !916, size: 32, align: 32, offset: 1920)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1165, file: !220, line: 1948, baseType: !916, size: 32, align: 32, offset: 1952)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1165, file: !220, line: 1954, baseType: !916, size: 32, align: 32, offset: 1984)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1165, file: !220, line: 1960, baseType: !916, size: 32, align: 32, offset: 2016)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1165, file: !220, line: 1984, baseType: !916, size: 32, align: 32, offset: 2048)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1165, file: !220, line: 1991, baseType: !916, size: 32, align: 32, offset: 2080)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1165, file: !220, line: 1996, baseType: !916, size: 32, align: 32, offset: 2112)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1165, file: !220, line: 2004, baseType: !916, size: 32, align: 32, offset: 2144)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1165, file: !220, line: 2011, baseType: !916, size: 32, align: 32, offset: 2176)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1165, file: !220, line: 2018, baseType: !916, size: 32, align: 32, offset: 2208)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1165, file: !220, line: 2027, baseType: !916, size: 32, align: 32, offset: 2240)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1165, file: !220, line: 2034, baseType: !916, size: 32, align: 32, offset: 2272)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1165, file: !220, line: 2044, baseType: !916, size: 32, align: 32, offset: 2304)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1165, file: !220, line: 2054, baseType: !1655, size: 64, align: 64, offset: 2368)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1165, file: !220, line: 2061, baseType: !1655, size: 64, align: 64, offset: 2432)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1165, file: !220, line: 2066, baseType: !916, size: 32, align: 32, offset: 2496)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1165, file: !220, line: 2070, baseType: !916, size: 32, align: 32, offset: 2528)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1165, file: !220, line: 2078, baseType: !916, size: 32, align: 32, offset: 2560)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1165, file: !220, line: 2085, baseType: !916, size: 32, align: 32, offset: 2592)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1165, file: !220, line: 2092, baseType: !916, size: 32, align: 32, offset: 2624)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1165, file: !220, line: 2099, baseType: !916, size: 32, align: 32, offset: 2656)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1165, file: !220, line: 2106, baseType: !916, size: 32, align: 32, offset: 2688)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1165, file: !220, line: 2113, baseType: !916, size: 32, align: 32, offset: 2720)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1165, file: !220, line: 2120, baseType: !916, size: 32, align: 32, offset: 2752)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1165, file: !220, line: 2125, baseType: !916, size: 32, align: 32, offset: 2784)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1165, file: !220, line: 2133, baseType: !916, size: 32, align: 32, offset: 2816)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1165, file: !220, line: 2140, baseType: !916, size: 32, align: 32, offset: 2848)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1165, file: !220, line: 2145, baseType: !916, size: 32, align: 32, offset: 2880)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1165, file: !220, line: 2153, baseType: !916, size: 32, align: 32, offset: 2912)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1165, file: !220, line: 2158, baseType: !916, size: 32, align: 32, offset: 2944)
