; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cljrenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a/[inter]libavcodec--cljrenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!853 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!854 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!855 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!856 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!857 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!858 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!860 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!861 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!862 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!863 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!864 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!865 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!866 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!868 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!869 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!870 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !{!910, !918}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !912, line: 221, size: 32, align: 8, elements: !913)
!912 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !911, file: !912, line: 221, baseType: !915, size: 32, align: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !916, line: 51, baseType: !917)
!916 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!917 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!919 = !{!920, !1683, !1684, !1690}
!920 = distinct !DIGlobalVariable(name: "ff_cljr_encoder", scope: !0, file: !921, line: 112, type: !922, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_cljr_encoder)
!921 = !DIFile(filename: "libavcodec/cljrenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !924)
!924 = !{!925, !929, !930, !931, !932, !934, !943, !946, !949, !952, !957, !960, !1035, !1043, !1044, !1045, !1047, !1598, !1604, !1612, !1616, !1617, !1654, !1658, !1662, !1663, !1667, !1671, !1672, !1676, !1677, !1678}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !14, line: 3475, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !923, file: !14, line: 3480, baseType: !926, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !923, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !923, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !923, file: !14, line: 3487, baseType: !933, size: 32, align: 32, offset: 192)
!933 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !923, file: !14, line: 3488, baseType: !935, size: 64, align: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !938, line: 61, baseType: !939)
!938 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !938, line: 58, size: 64, align: 32, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !939, file: !938, line: 59, baseType: !933, size: 32, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !939, file: !938, line: 60, baseType: !933, size: 32, align: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !923, file: !14, line: 3489, baseType: !944, size: 64, align: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !923, file: !14, line: 3490, baseType: !947, size: 64, align: 64, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !923, file: !14, line: 3491, baseType: !950, size: 64, align: 64, offset: 448)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !923, file: !14, line: 3492, baseType: !953, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !916, line: 55, baseType: !956)
!956 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !923, file: !14, line: 3493, baseType: !958, size: 8, align: 8, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !916, line: 48, baseType: !959)
!959 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !923, file: !14, line: 3494, baseType: !961, size: 64, align: 64, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !965)
!965 = !{!966, !967, !971, !994, !995, !996, !997, !1001, !1007, !1009, !1013}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !964, file: !713, line: 72, baseType: !926, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !964, file: !713, line: 78, baseType: !968, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!926, !918}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !964, file: !713, line: 85, baseType: !972, size: 64, align: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !990, !991, !992, !993}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !691, line: 247, baseType: !926, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !974, file: !691, line: 253, baseType: !926, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !974, file: !691, line: 259, baseType: !933, size: 32, align: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !974, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !974, file: !691, line: 271, baseType: !981, size: 64, align: 64, offset: 192)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !974, file: !691, line: 265, size: 64, align: 64, elements: !982)
!982 = !{!983, !986, !988, !989}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !981, file: !691, line: 266, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !916, line: 40, baseType: !985)
!985 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !981, file: !691, line: 267, baseType: !987, size: 64, align: 64)
!987 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !981, file: !691, line: 268, baseType: !926, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !981, file: !691, line: 270, baseType: !937, size: 64, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !974, file: !691, line: 272, baseType: !987, size: 64, align: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !974, file: !691, line: 273, baseType: !987, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !974, file: !691, line: 275, baseType: !933, size: 32, align: 32, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !974, file: !691, line: 300, baseType: !926, size: 64, align: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !964, file: !713, line: 93, baseType: !933, size: 32, align: 32, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !964, file: !713, line: 99, baseType: !933, size: 32, align: 32, offset: 224)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !964, file: !713, line: 108, baseType: !933, size: 32, align: 32, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !964, file: !713, line: 113, baseType: !998, size: 64, align: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!918, !918, !918}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !964, file: !713, line: 123, baseType: !1002, size: 64, align: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!1005, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !964, file: !713, line: 130, baseType: !1008, size: 32, align: 32, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !964, file: !713, line: 136, baseType: !1010, size: 64, align: 64, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!1008, !918}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !964, file: !713, line: 142, baseType: !1014, size: 64, align: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!933, !1017, !918, !926, !933}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1020)
!1020 = !{!1021, !1033, !1034}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1019, file: !691, line: 360, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1025, file: !691, line: 307, baseType: !926, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1025, file: !691, line: 313, baseType: !987, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1025, file: !691, line: 313, baseType: !987, size: 64, align: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1025, file: !691, line: 318, baseType: !987, size: 64, align: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1025, file: !691, line: 318, baseType: !987, size: 64, align: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1025, file: !691, line: 323, baseType: !933, size: 32, align: 32, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1019, file: !691, line: 364, baseType: !933, size: 32, align: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1019, file: !691, line: 368, baseType: !933, size: 32, align: 32, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !923, file: !14, line: 3495, baseType: !1036, size: 64, align: 64, offset: 704)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1039, file: !14, line: 3402, baseType: !933, size: 32, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !14, line: 3403, baseType: !926, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !923, file: !14, line: 3507, baseType: !926, size: 64, align: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !923, file: !14, line: 3516, baseType: !933, size: 32, align: 32, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !923, file: !14, line: 3517, baseType: !1046, size: 64, align: 64, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !923, file: !14, line: 3527, baseType: !1048, size: 64, align: 64, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!933, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1061, !1062, !1063, !1064, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1344, !1348, !1349, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1536, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1053, file: !14, line: 1561, baseType: !961, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1053, file: !14, line: 1562, baseType: !933, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1053, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1053, file: !14, line: 1565, baseType: !1059, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1053, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1053, file: !14, line: 1581, baseType: !917, size: 32, align: 32, offset: 224)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1053, file: !14, line: 1583, baseType: !918, size: 64, align: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1053, file: !14, line: 1591, baseType: !1065, size: 64, align: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1067, line: 129, size: 1664, align: 64, elements: !1068)
!1067 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1068 = !{!1069, !1070, !1071, !1072, !1170, !1191, !1192, !1221, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1066, file: !1067, line: 136, baseType: !933, size: 32, align: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1066, file: !1067, line: 151, baseType: !933, size: 32, align: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1066, file: !1067, line: 157, baseType: !933, size: 32, align: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1066, file: !1067, line: 159, baseType: !1073, size: 64, align: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1076)
!1076 = !{!1077, !1082, !1084, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1122, !1124, !1125, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1158, !1159, !1160, !1161, !1162, !1163, !1166, !1167, !1168, !1169}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !744, line: 282, baseType: !1078, size: 512, align: 64)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 512, align: 64, elements: !1080)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1080 = !{!1081}
!1081 = !DISubrange(count: 8)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1075, file: !744, line: 299, baseType: !1083, size: 256, align: 32, offset: 512)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 256, align: 32, elements: !1080)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1075, file: !744, line: 315, baseType: !1085, size: 64, align: 64, offset: 768)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1075, file: !744, line: 326, baseType: !933, size: 32, align: 32, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1075, file: !744, line: 326, baseType: !933, size: 32, align: 32, offset: 864)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1075, file: !744, line: 334, baseType: !933, size: 32, align: 32, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1075, file: !744, line: 341, baseType: !933, size: 32, align: 32, offset: 928)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1075, file: !744, line: 346, baseType: !933, size: 32, align: 32, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1075, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1075, file: !744, line: 356, baseType: !937, size: 64, align: 32, offset: 1024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1075, file: !744, line: 361, baseType: !984, size: 64, align: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1075, file: !744, line: 369, baseType: !984, size: 64, align: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1075, file: !744, line: 377, baseType: !984, size: 64, align: 64, offset: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1075, file: !744, line: 382, baseType: !933, size: 32, align: 32, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1075, file: !744, line: 386, baseType: !933, size: 32, align: 32, offset: 1312)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1075, file: !744, line: 391, baseType: !933, size: 32, align: 32, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1075, file: !744, line: 396, baseType: !918, size: 64, align: 64, offset: 1408)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1075, file: !744, line: 403, baseType: !1101, size: 512, align: 64, offset: 1472)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 512, align: 64, elements: !1080)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1075, file: !744, line: 410, baseType: !933, size: 32, align: 32, offset: 1984)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1075, file: !744, line: 415, baseType: !933, size: 32, align: 32, offset: 2016)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1075, file: !744, line: 420, baseType: !933, size: 32, align: 32, offset: 2048)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1075, file: !744, line: 425, baseType: !933, size: 32, align: 32, offset: 2080)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1075, file: !744, line: 435, baseType: !984, size: 64, align: 64, offset: 2112)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1075, file: !744, line: 440, baseType: !933, size: 32, align: 32, offset: 2176)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1075, file: !744, line: 445, baseType: !955, size: 64, align: 64, offset: 2240)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1075, file: !744, line: 459, baseType: !1110, size: 512, align: 64, offset: 2304)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 512, align: 64, elements: !1080)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1113, line: 94, baseType: !1114)
!1113 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1113, line: 81, size: 192, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1121}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1114, file: !1113, line: 82, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1113, line: 73, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1113, line: 73, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !1113, line: 89, baseType: !1079, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1113, line: 93, baseType: !933, size: 32, align: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1075, file: !744, line: 473, baseType: !1123, size: 64, align: 64, offset: 2816)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1075, file: !744, line: 477, baseType: !933, size: 32, align: 32, offset: 2880)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1075, file: !744, line: 479, baseType: !1126, size: 64, align: 64, offset: 2944)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1139}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !744, line: 203, baseType: !1079, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !744, line: 204, baseType: !933, size: 32, align: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1129, file: !744, line: 205, baseType: !1135, size: 64, align: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1137, line: 86, baseType: !1138)
!1137 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1137, line: 86, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1129, file: !744, line: 206, baseType: !1111, size: 64, align: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1075, file: !744, line: 480, baseType: !933, size: 32, align: 32, offset: 3008)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !744, line: 505, baseType: !933, size: 32, align: 32, offset: 3040)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1075, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1075, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1075, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1075, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1075, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1075, file: !744, line: 532, baseType: !984, size: 64, align: 64, offset: 3264)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1075, file: !744, line: 539, baseType: !984, size: 64, align: 64, offset: 3328)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1075, file: !744, line: 547, baseType: !984, size: 64, align: 64, offset: 3392)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1075, file: !744, line: 554, baseType: !1135, size: 64, align: 64, offset: 3456)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1075, file: !744, line: 563, baseType: !933, size: 32, align: 32, offset: 3520)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1075, file: !744, line: 572, baseType: !933, size: 32, align: 32, offset: 3552)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1075, file: !744, line: 581, baseType: !933, size: 32, align: 32, offset: 3584)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1075, file: !744, line: 588, baseType: !1155, size: 64, align: 64, offset: 3648)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !916, line: 36, baseType: !1157)
!1157 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1075, file: !744, line: 593, baseType: !933, size: 32, align: 32, offset: 3712)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1075, file: !744, line: 596, baseType: !933, size: 32, align: 32, offset: 3744)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1075, file: !744, line: 599, baseType: !1111, size: 64, align: 64, offset: 3776)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1075, file: !744, line: 605, baseType: !1111, size: 64, align: 64, offset: 3840)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1075, file: !744, line: 616, baseType: !1111, size: 64, align: 64, offset: 3904)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1075, file: !744, line: 626, baseType: !1164, size: 64, align: 64, offset: 3968)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1165, line: 216, baseType: !956)
!1165 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavcodec--libavcodec.a")
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1075, file: !744, line: 627, baseType: !1164, size: 64, align: 64, offset: 4032)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1075, file: !744, line: 628, baseType: !1164, size: 64, align: 64, offset: 4096)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1075, file: !744, line: 629, baseType: !1164, size: 64, align: 64, offset: 4160)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1075, file: !744, line: 645, baseType: !1111, size: 64, align: 64, offset: 4224)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1066, file: !1067, line: 161, baseType: !1171, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1067, line: 117, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1067, line: 100, size: 832, align: 64, elements: !1174)
!1174 = !{!1175, !1182, !1183, !1184, !1185, !1186, !1188, !1189, !1190}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1173, file: !1067, line: 105, baseType: !1176, size: 256, align: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1177, size: 256, align: 64, elements: !1180)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1113, line: 238, baseType: !1179)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1113, line: 238, flags: DIFlagFwdDecl)
!1180 = !{!1181}
!1181 = !DISubrange(count: 4)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1173, file: !1067, line: 110, baseType: !933, size: 32, align: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1173, file: !1067, line: 111, baseType: !933, size: 32, align: 32, offset: 288)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1173, file: !1067, line: 111, baseType: !933, size: 32, align: 32, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1173, file: !1067, line: 112, baseType: !1083, size: 256, align: 32, offset: 352)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1173, file: !1067, line: 113, baseType: !1187, size: 128, align: 32, offset: 608)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 128, align: 32, elements: !1180)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1173, file: !1067, line: 114, baseType: !933, size: 32, align: 32, offset: 736)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1173, file: !1067, line: 115, baseType: !933, size: 32, align: 32, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1173, file: !1067, line: 116, baseType: !933, size: 32, align: 32, offset: 800)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1066, file: !1067, line: 163, baseType: !918, size: 64, align: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1066, file: !1067, line: 165, baseType: !1193, size: 128, align: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1067, line: 122, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1067, line: 119, size: 128, align: 64, elements: !1195)
!1195 = !{!1196, !1220}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1194, file: !1067, line: 120, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1216, !1217, !1218, !1219}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1199, file: !14, line: 1451, baseType: !1111, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1199, file: !14, line: 1461, baseType: !984, size: 64, align: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1199, file: !14, line: 1467, baseType: !984, size: 64, align: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !14, line: 1468, baseType: !1079, size: 64, align: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1199, file: !14, line: 1469, baseType: !933, size: 32, align: 32, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1199, file: !14, line: 1470, baseType: !933, size: 32, align: 32, offset: 288)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !14, line: 1474, baseType: !933, size: 32, align: 32, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1199, file: !14, line: 1479, baseType: !1209, size: 64, align: 64, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1211, file: !14, line: 1412, baseType: !1079, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !14, line: 1413, baseType: !933, size: 32, align: 32, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1211, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1199, file: !14, line: 1480, baseType: !933, size: 32, align: 32, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1199, file: !14, line: 1486, baseType: !984, size: 64, align: 64, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1199, file: !14, line: 1488, baseType: !984, size: 64, align: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1199, file: !14, line: 1497, baseType: !984, size: 64, align: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1194, file: !1067, line: 121, baseType: !1073, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1066, file: !1067, line: 166, baseType: !1222, size: 128, align: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1067, line: 127, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1067, line: 124, size: 128, align: 64, elements: !1224)
!1224 = !{!1225, !1298}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1223, file: !1067, line: 125, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1256, !1260, !1261, !1295, !1296, !1297}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1229, file: !14, line: 5751, baseType: !961, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1229, file: !14, line: 5756, baseType: !1233, size: 64, align: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1241, !1242, !1243, !1247, !1251, !1255}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1235, file: !14, line: 5797, baseType: !926, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1235, file: !14, line: 5804, baseType: !1239, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1235, file: !14, line: 5815, baseType: !961, size: 64, align: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1235, file: !14, line: 5825, baseType: !933, size: 32, align: 32, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1235, file: !14, line: 5826, baseType: !1244, size: 64, align: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!933, !1227}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1235, file: !14, line: 5827, baseType: !1248, size: 64, align: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!933, !1227, !1197}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1235, file: !14, line: 5828, baseType: !1252, size: 64, align: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !1227}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1235, file: !14, line: 5829, baseType: !1252, size: 64, align: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1229, file: !14, line: 5762, baseType: !1257, size: 64, align: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1259)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1229, file: !14, line: 5768, baseType: !918, size: 64, align: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1229, file: !14, line: 5775, baseType: !1262, size: 64, align: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1264, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1264, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1264, file: !14, line: 3948, baseType: !915, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1264, file: !14, line: 3958, baseType: !1079, size: 64, align: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1264, file: !14, line: 3962, baseType: !933, size: 32, align: 32, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1264, file: !14, line: 3968, baseType: !933, size: 32, align: 32, offset: 224)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1264, file: !14, line: 3973, baseType: !984, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1264, file: !14, line: 3986, baseType: !933, size: 32, align: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1264, file: !14, line: 3999, baseType: !933, size: 32, align: 32, offset: 352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1264, file: !14, line: 4004, baseType: !933, size: 32, align: 32, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1264, file: !14, line: 4005, baseType: !933, size: 32, align: 32, offset: 416)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1264, file: !14, line: 4010, baseType: !933, size: 32, align: 32, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1264, file: !14, line: 4011, baseType: !933, size: 32, align: 32, offset: 480)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1264, file: !14, line: 4020, baseType: !937, size: 64, align: 32, offset: 512)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1264, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1264, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1264, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1264, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1264, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1264, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1264, file: !14, line: 4039, baseType: !933, size: 32, align: 32, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1264, file: !14, line: 4046, baseType: !955, size: 64, align: 64, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1264, file: !14, line: 4050, baseType: !933, size: 32, align: 32, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1264, file: !14, line: 4054, baseType: !933, size: 32, align: 32, offset: 928)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1264, file: !14, line: 4061, baseType: !933, size: 32, align: 32, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1264, file: !14, line: 4065, baseType: !933, size: 32, align: 32, offset: 992)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1264, file: !14, line: 4073, baseType: !933, size: 32, align: 32, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1264, file: !14, line: 4080, baseType: !933, size: 32, align: 32, offset: 1056)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1264, file: !14, line: 4084, baseType: !933, size: 32, align: 32, offset: 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1229, file: !14, line: 5781, baseType: !1262, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1229, file: !14, line: 5787, baseType: !937, size: 64, align: 32, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1229, file: !14, line: 5793, baseType: !937, size: 64, align: 32, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1223, file: !1067, line: 126, baseType: !933, size: 32, align: 32, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1066, file: !1067, line: 172, baseType: !1197, size: 64, align: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1066, file: !1067, line: 177, baseType: !1079, size: 64, align: 64, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1066, file: !1067, line: 178, baseType: !917, size: 32, align: 32, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1066, file: !1067, line: 180, baseType: !918, size: 64, align: 64, offset: 768)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1066, file: !1067, line: 185, baseType: !933, size: 32, align: 32, offset: 832)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1066, file: !1067, line: 190, baseType: !918, size: 64, align: 64, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1066, file: !1067, line: 195, baseType: !933, size: 32, align: 32, offset: 960)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1066, file: !1067, line: 200, baseType: !1197, size: 64, align: 64, offset: 1024)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1066, file: !1067, line: 201, baseType: !933, size: 32, align: 32, offset: 1088)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1066, file: !1067, line: 202, baseType: !1073, size: 64, align: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1066, file: !1067, line: 203, baseType: !933, size: 32, align: 32, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1066, file: !1067, line: 205, baseType: !933, size: 32, align: 32, offset: 1248)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1066, file: !1067, line: 206, baseType: !933, size: 32, align: 32, offset: 1280)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1066, file: !1067, line: 209, baseType: !1164, size: 64, align: 64, offset: 1344)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1066, file: !1067, line: 212, baseType: !1164, size: 64, align: 64, offset: 1408)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1066, file: !1067, line: 213, baseType: !1073, size: 64, align: 64, offset: 1472)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1066, file: !1067, line: 215, baseType: !933, size: 32, align: 32, offset: 1536)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1066, file: !1067, line: 217, baseType: !933, size: 32, align: 32, offset: 1568)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1066, file: !1067, line: 220, baseType: !933, size: 32, align: 32, offset: 1600)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1053, file: !14, line: 1598, baseType: !918, size: 64, align: 64, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1053, file: !14, line: 1606, baseType: !984, size: 64, align: 64, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1053, file: !14, line: 1614, baseType: !933, size: 32, align: 32, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1053, file: !14, line: 1622, baseType: !933, size: 32, align: 32, offset: 544)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1053, file: !14, line: 1628, baseType: !933, size: 32, align: 32, offset: 576)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !14, line: 1636, baseType: !933, size: 32, align: 32, offset: 608)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1053, file: !14, line: 1643, baseType: !933, size: 32, align: 32, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1053, file: !14, line: 1657, baseType: !1079, size: 64, align: 64, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1053, file: !14, line: 1658, baseType: !933, size: 32, align: 32, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1053, file: !14, line: 1679, baseType: !937, size: 64, align: 32, offset: 800)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1053, file: !14, line: 1688, baseType: !933, size: 32, align: 32, offset: 864)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1053, file: !14, line: 1712, baseType: !933, size: 32, align: 32, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1053, file: !14, line: 1729, baseType: !933, size: 32, align: 32, offset: 928)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1053, file: !14, line: 1729, baseType: !933, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1053, file: !14, line: 1744, baseType: !933, size: 32, align: 32, offset: 992)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1053, file: !14, line: 1744, baseType: !933, size: 32, align: 32, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1053, file: !14, line: 1751, baseType: !933, size: 32, align: 32, offset: 1056)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1053, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1053, file: !14, line: 1791, baseType: !1337, size: 64, align: 64, offset: 1152)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !1340, !1341, !1343, !933, !933, !933}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1053, file: !14, line: 1808, baseType: !1345, size: 64, align: 64, offset: 1216)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!473, !1340, !944}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1053, file: !14, line: 1816, baseType: !933, size: 32, align: 32, offset: 1280)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1053, file: !14, line: 1825, baseType: !1350, size: 32, align: 32, offset: 1312)
!1350 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1053, file: !14, line: 1830, baseType: !933, size: 32, align: 32, offset: 1344)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1053, file: !14, line: 1838, baseType: !1350, size: 32, align: 32, offset: 1376)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1053, file: !14, line: 1846, baseType: !933, size: 32, align: 32, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1053, file: !14, line: 1851, baseType: !933, size: 32, align: 32, offset: 1440)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1053, file: !14, line: 1861, baseType: !1350, size: 32, align: 32, offset: 1472)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1053, file: !14, line: 1868, baseType: !1350, size: 32, align: 32, offset: 1504)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1053, file: !14, line: 1875, baseType: !1350, size: 32, align: 32, offset: 1536)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1053, file: !14, line: 1882, baseType: !1350, size: 32, align: 32, offset: 1568)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1053, file: !14, line: 1889, baseType: !1350, size: 32, align: 32, offset: 1600)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1053, file: !14, line: 1896, baseType: !1350, size: 32, align: 32, offset: 1632)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1053, file: !14, line: 1903, baseType: !1350, size: 32, align: 32, offset: 1664)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1053, file: !14, line: 1910, baseType: !933, size: 32, align: 32, offset: 1696)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1053, file: !14, line: 1915, baseType: !933, size: 32, align: 32, offset: 1728)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1053, file: !14, line: 1926, baseType: !1343, size: 64, align: 64, offset: 1792)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1053, file: !14, line: 1935, baseType: !937, size: 64, align: 32, offset: 1856)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1053, file: !14, line: 1942, baseType: !933, size: 32, align: 32, offset: 1920)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1053, file: !14, line: 1948, baseType: !933, size: 32, align: 32, offset: 1952)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1053, file: !14, line: 1954, baseType: !933, size: 32, align: 32, offset: 1984)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1053, file: !14, line: 1960, baseType: !933, size: 32, align: 32, offset: 2016)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1053, file: !14, line: 1984, baseType: !933, size: 32, align: 32, offset: 2048)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1053, file: !14, line: 1991, baseType: !933, size: 32, align: 32, offset: 2080)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1053, file: !14, line: 1996, baseType: !933, size: 32, align: 32, offset: 2112)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1053, file: !14, line: 2004, baseType: !933, size: 32, align: 32, offset: 2144)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1053, file: !14, line: 2011, baseType: !933, size: 32, align: 32, offset: 2176)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1053, file: !14, line: 2018, baseType: !933, size: 32, align: 32, offset: 2208)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1053, file: !14, line: 2027, baseType: !933, size: 32, align: 32, offset: 2240)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1053, file: !14, line: 2034, baseType: !933, size: 32, align: 32, offset: 2272)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1053, file: !14, line: 2044, baseType: !933, size: 32, align: 32, offset: 2304)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1053, file: !14, line: 2054, baseType: !1380, size: 64, align: 64, offset: 2368)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !916, line: 49, baseType: !1382)
!1382 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1053, file: !14, line: 2061, baseType: !1380, size: 64, align: 64, offset: 2432)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1053, file: !14, line: 2066, baseType: !933, size: 32, align: 32, offset: 2496)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1053, file: !14, line: 2070, baseType: !933, size: 32, align: 32, offset: 2528)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1053, file: !14, line: 2078, baseType: !933, size: 32, align: 32, offset: 2560)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1053, file: !14, line: 2085, baseType: !933, size: 32, align: 32, offset: 2592)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1053, file: !14, line: 2092, baseType: !933, size: 32, align: 32, offset: 2624)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1053, file: !14, line: 2099, baseType: !933, size: 32, align: 32, offset: 2656)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1053, file: !14, line: 2106, baseType: !933, size: 32, align: 32, offset: 2688)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1053, file: !14, line: 2113, baseType: !933, size: 32, align: 32, offset: 2720)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1053, file: !14, line: 2120, baseType: !933, size: 32, align: 32, offset: 2752)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1053, file: !14, line: 2125, baseType: !933, size: 32, align: 32, offset: 2784)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1053, file: !14, line: 2133, baseType: !933, size: 32, align: 32, offset: 2816)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1053, file: !14, line: 2140, baseType: !933, size: 32, align: 32, offset: 2848)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1053, file: !14, line: 2145, baseType: !933, size: 32, align: 32, offset: 2880)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1053, file: !14, line: 2153, baseType: !933, size: 32, align: 32, offset: 2912)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1053, file: !14, line: 2158, baseType: !933, size: 32, align: 32, offset: 2944)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1053, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1053, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1053, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1053, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1053, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1053, file: !14, line: 2203, baseType: !933, size: 32, align: 32, offset: 3136)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1053, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1053, file: !14, line: 2212, baseType: !933, size: 32, align: 32, offset: 3200)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1053, file: !14, line: 2213, baseType: !933, size: 32, align: 32, offset: 3232)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1053, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1053, file: !14, line: 2232, baseType: !933, size: 32, align: 32, offset: 3296)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1053, file: !14, line: 2243, baseType: !933, size: 32, align: 32, offset: 3328)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1053, file: !14, line: 2249, baseType: !933, size: 32, align: 32, offset: 3360)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1053, file: !14, line: 2256, baseType: !933, size: 32, align: 32, offset: 3392)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1053, file: !14, line: 2263, baseType: !955, size: 64, align: 64, offset: 3456)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1053, file: !14, line: 2270, baseType: !955, size: 64, align: 64, offset: 3520)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1053, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1053, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1053, file: !14, line: 2367, baseType: !1418, size: 64, align: 64, offset: 3648)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!933, !1340, !1073, !933}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1053, file: !14, line: 2383, baseType: !933, size: 32, align: 32, offset: 3712)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1053, file: !14, line: 2386, baseType: !1350, size: 32, align: 32, offset: 3744)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1053, file: !14, line: 2387, baseType: !1350, size: 32, align: 32, offset: 3776)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1053, file: !14, line: 2394, baseType: !933, size: 32, align: 32, offset: 3808)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1053, file: !14, line: 2401, baseType: !933, size: 32, align: 32, offset: 3840)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1053, file: !14, line: 2408, baseType: !933, size: 32, align: 32, offset: 3872)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1053, file: !14, line: 2415, baseType: !933, size: 32, align: 32, offset: 3904)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1053, file: !14, line: 2422, baseType: !933, size: 32, align: 32, offset: 3936)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1053, file: !14, line: 2423, baseType: !1430, size: 64, align: 64, offset: 3968)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1432, file: !14, line: 827, baseType: !933, size: 32, align: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1432, file: !14, line: 828, baseType: !933, size: 32, align: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1432, file: !14, line: 829, baseType: !933, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1432, file: !14, line: 830, baseType: !1350, size: 32, align: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1053, file: !14, line: 2430, baseType: !984, size: 64, align: 64, offset: 4032)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1053, file: !14, line: 2437, baseType: !984, size: 64, align: 64, offset: 4096)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1053, file: !14, line: 2444, baseType: !1350, size: 32, align: 32, offset: 4160)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1053, file: !14, line: 2451, baseType: !1350, size: 32, align: 32, offset: 4192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1053, file: !14, line: 2458, baseType: !933, size: 32, align: 32, offset: 4224)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1053, file: !14, line: 2469, baseType: !933, size: 32, align: 32, offset: 4256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1053, file: !14, line: 2475, baseType: !933, size: 32, align: 32, offset: 4288)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1053, file: !14, line: 2481, baseType: !933, size: 32, align: 32, offset: 4320)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1053, file: !14, line: 2485, baseType: !933, size: 32, align: 32, offset: 4352)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1053, file: !14, line: 2489, baseType: !933, size: 32, align: 32, offset: 4384)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1053, file: !14, line: 2493, baseType: !933, size: 32, align: 32, offset: 4416)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1053, file: !14, line: 2501, baseType: !933, size: 32, align: 32, offset: 4448)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1053, file: !14, line: 2506, baseType: !933, size: 32, align: 32, offset: 4480)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1053, file: !14, line: 2510, baseType: !933, size: 32, align: 32, offset: 4512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1053, file: !14, line: 2514, baseType: !984, size: 64, align: 64, offset: 4544)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1053, file: !14, line: 2528, baseType: !1454, size: 64, align: 64, offset: 4608)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{null, !1340, !918, !933, !933}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1053, file: !14, line: 2534, baseType: !933, size: 32, align: 32, offset: 4672)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1053, file: !14, line: 2545, baseType: !933, size: 32, align: 32, offset: 4704)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1053, file: !14, line: 2547, baseType: !933, size: 32, align: 32, offset: 4736)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1053, file: !14, line: 2549, baseType: !933, size: 32, align: 32, offset: 4768)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1053, file: !14, line: 2551, baseType: !933, size: 32, align: 32, offset: 4800)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1053, file: !14, line: 2553, baseType: !933, size: 32, align: 32, offset: 4832)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1053, file: !14, line: 2555, baseType: !933, size: 32, align: 32, offset: 4864)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1053, file: !14, line: 2557, baseType: !933, size: 32, align: 32, offset: 4896)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1053, file: !14, line: 2559, baseType: !933, size: 32, align: 32, offset: 4928)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1053, file: !14, line: 2563, baseType: !933, size: 32, align: 32, offset: 4960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1053, file: !14, line: 2571, baseType: !1468, size: 64, align: 64, offset: 4992)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1053, file: !14, line: 2579, baseType: !1468, size: 64, align: 64, offset: 5056)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1053, file: !14, line: 2586, baseType: !933, size: 32, align: 32, offset: 5120)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1053, file: !14, line: 2615, baseType: !933, size: 32, align: 32, offset: 5152)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1053, file: !14, line: 2627, baseType: !933, size: 32, align: 32, offset: 5184)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1053, file: !14, line: 2637, baseType: !933, size: 32, align: 32, offset: 5216)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1053, file: !14, line: 2681, baseType: !933, size: 32, align: 32, offset: 5248)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1053, file: !14, line: 2709, baseType: !984, size: 64, align: 64, offset: 5312)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1053, file: !14, line: 2716, baseType: !1477, size: 64, align: 64, offset: 5376)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1484, !1485, !1486, !1490, !1496, !1500, !1501, !1502, !1503, !1509, !1510, !1511, !1512, !1513}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1479, file: !14, line: 3642, baseType: !926, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1479, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1479, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1479, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1479, file: !14, line: 3669, baseType: !933, size: 32, align: 32, offset: 160)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1479, file: !14, line: 3682, baseType: !1487, size: 64, align: 64, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!933, !1051, !1073}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1479, file: !14, line: 3698, baseType: !1491, size: 64, align: 64, offset: 256)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!933, !1051, !1494, !915}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1479, file: !14, line: 3712, baseType: !1497, size: 64, align: 64, offset: 320)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!933, !1051, !933, !1494, !915}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1479, file: !14, line: 3726, baseType: !1491, size: 64, align: 64, offset: 384)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1479, file: !14, line: 3737, baseType: !1048, size: 64, align: 64, offset: 448)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1479, file: !14, line: 3746, baseType: !933, size: 32, align: 32, offset: 512)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1479, file: !14, line: 3757, baseType: !1504, size: 64, align: 64, offset: 576)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !1507}
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1479, file: !14, line: 3766, baseType: !1048, size: 64, align: 64, offset: 640)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1479, file: !14, line: 3774, baseType: !1048, size: 64, align: 64, offset: 704)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1479, file: !14, line: 3780, baseType: !933, size: 32, align: 32, offset: 768)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1479, file: !14, line: 3785, baseType: !933, size: 32, align: 32, offset: 800)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1479, file: !14, line: 3795, baseType: !1514, size: 64, align: 64, offset: 832)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!933, !1051, !1111}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1053, file: !14, line: 2728, baseType: !918, size: 64, align: 64, offset: 5440)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1053, file: !14, line: 2735, baseType: !1101, size: 512, align: 64, offset: 5504)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1053, file: !14, line: 2742, baseType: !933, size: 32, align: 32, offset: 6016)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1053, file: !14, line: 2755, baseType: !933, size: 32, align: 32, offset: 6048)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1053, file: !14, line: 2776, baseType: !933, size: 32, align: 32, offset: 6080)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1053, file: !14, line: 2783, baseType: !933, size: 32, align: 32, offset: 6112)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1053, file: !14, line: 2791, baseType: !933, size: 32, align: 32, offset: 6144)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1053, file: !14, line: 2802, baseType: !1073, size: 64, align: 64, offset: 6208)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1053, file: !14, line: 2811, baseType: !933, size: 32, align: 32, offset: 6272)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1053, file: !14, line: 2821, baseType: !933, size: 32, align: 32, offset: 6304)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1053, file: !14, line: 2830, baseType: !933, size: 32, align: 32, offset: 6336)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1053, file: !14, line: 2840, baseType: !933, size: 32, align: 32, offset: 6368)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1053, file: !14, line: 2851, baseType: !1530, size: 64, align: 64, offset: 6400)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!933, !1340, !1533, !918, !1343, !933, !933}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!933, !1340, !918}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1053, file: !14, line: 2871, baseType: !1537, size: 64, align: 64, offset: 6464)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{!933, !1340, !1540, !918, !1343, !933}
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!933, !1340, !918, !933, !933}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1053, file: !14, line: 2878, baseType: !933, size: 32, align: 32, offset: 6528)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1053, file: !14, line: 2885, baseType: !933, size: 32, align: 32, offset: 6560)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1053, file: !14, line: 3005, baseType: !933, size: 32, align: 32, offset: 6592)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1053, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1053, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1053, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1053, file: !14, line: 3037, baseType: !1079, size: 64, align: 64, offset: 6720)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1053, file: !14, line: 3038, baseType: !933, size: 32, align: 32, offset: 6784)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1053, file: !14, line: 3050, baseType: !955, size: 64, align: 64, offset: 6848)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1053, file: !14, line: 3065, baseType: !933, size: 32, align: 32, offset: 6912)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1053, file: !14, line: 3083, baseType: !933, size: 32, align: 32, offset: 6944)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1053, file: !14, line: 3092, baseType: !937, size: 64, align: 32, offset: 6976)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1053, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1053, file: !14, line: 3106, baseType: !937, size: 64, align: 32, offset: 7072)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1053, file: !14, line: 3113, baseType: !1558, size: 64, align: 64, offset: 7168)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1560)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1561)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1567, !1568, !1571}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1561, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1561, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1561, file: !14, line: 720, baseType: !926, size: 64, align: 64, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1561, file: !14, line: 724, baseType: !926, size: 64, align: 64, offset: 128)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1561, file: !14, line: 728, baseType: !933, size: 32, align: 32, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1561, file: !14, line: 734, baseType: !1569, size: 64, align: 64, offset: 256)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1561, file: !14, line: 739, baseType: !1572, size: 64, align: 64, offset: 320)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1053, file: !14, line: 3129, baseType: !984, size: 64, align: 64, offset: 7232)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1053, file: !14, line: 3130, baseType: !984, size: 64, align: 64, offset: 7296)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1053, file: !14, line: 3131, baseType: !984, size: 64, align: 64, offset: 7360)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1053, file: !14, line: 3132, baseType: !984, size: 64, align: 64, offset: 7424)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1053, file: !14, line: 3139, baseType: !1468, size: 64, align: 64, offset: 7488)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1053, file: !14, line: 3147, baseType: !933, size: 32, align: 32, offset: 7552)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1053, file: !14, line: 3165, baseType: !933, size: 32, align: 32, offset: 7584)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1053, file: !14, line: 3172, baseType: !933, size: 32, align: 32, offset: 7616)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1053, file: !14, line: 3180, baseType: !933, size: 32, align: 32, offset: 7648)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1053, file: !14, line: 3191, baseType: !1380, size: 64, align: 64, offset: 7680)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1053, file: !14, line: 3199, baseType: !1079, size: 64, align: 64, offset: 7744)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1053, file: !14, line: 3207, baseType: !1468, size: 64, align: 64, offset: 7808)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1053, file: !14, line: 3214, baseType: !917, size: 32, align: 32, offset: 7872)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1053, file: !14, line: 3224, baseType: !1209, size: 64, align: 64, offset: 7936)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1053, file: !14, line: 3225, baseType: !933, size: 32, align: 32, offset: 8000)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1053, file: !14, line: 3249, baseType: !1111, size: 64, align: 64, offset: 8064)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1053, file: !14, line: 3256, baseType: !933, size: 32, align: 32, offset: 8128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1053, file: !14, line: 3271, baseType: !933, size: 32, align: 32, offset: 8160)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1053, file: !14, line: 3279, baseType: !984, size: 64, align: 64, offset: 8192)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1053, file: !14, line: 3301, baseType: !1111, size: 64, align: 64, offset: 8256)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1053, file: !14, line: 3310, baseType: !933, size: 32, align: 32, offset: 8320)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1053, file: !14, line: 3337, baseType: !933, size: 32, align: 32, offset: 8352)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1053, file: !14, line: 3351, baseType: !933, size: 32, align: 32, offset: 8384)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1053, file: !14, line: 3359, baseType: !933, size: 32, align: 32, offset: 8416)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !923, file: !14, line: 3535, baseType: !1599, size: 64, align: 64, offset: 1024)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!933, !1051, !1602}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !923, file: !14, line: 3541, baseType: !1605, size: 64, align: 64, offset: 1088)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1607)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1067, line: 223, size: 128, align: 64, elements: !1609)
!1609 = !{!1610, !1611}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1608, file: !1067, line: 224, baseType: !1494, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1608, file: !1067, line: 225, baseType: !1494, size: 64, align: 64, offset: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !923, file: !14, line: 3549, baseType: !1613, size: 64, align: 64, offset: 1152)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !1046}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !923, file: !14, line: 3551, baseType: !1048, size: 64, align: 64, offset: 1216)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !923, file: !14, line: 3552, baseType: !1618, size: 64, align: 64, offset: 1280)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{!933, !1051, !1079, !933, !1621}
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1624)
!1624 = !{!1625, !1626, !1627, !1628, !1629, !1653}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1623, file: !14, line: 3921, baseType: !1381, size: 16, align: 16)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1623, file: !14, line: 3922, baseType: !915, size: 32, align: 32, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1623, file: !14, line: 3923, baseType: !915, size: 32, align: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1623, file: !14, line: 3924, baseType: !917, size: 32, align: 32, offset: 96)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1623, file: !14, line: 3925, baseType: !1630, size: 64, align: 64, offset: 128)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1633)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638, !1639, !1640, !1646, !1648, !1649, !1650, !1651, !1652}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1633, file: !14, line: 3886, baseType: !933, size: 32, align: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1633, file: !14, line: 3887, baseType: !933, size: 32, align: 32, offset: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1633, file: !14, line: 3888, baseType: !933, size: 32, align: 32, offset: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1633, file: !14, line: 3889, baseType: !933, size: 32, align: 32, offset: 96)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1633, file: !14, line: 3890, baseType: !933, size: 32, align: 32, offset: 128)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1633, file: !14, line: 3897, baseType: !1641, size: 768, align: 64, offset: 192)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1643)
!1643 = !{!1644, !1645}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1642, file: !14, line: 3855, baseType: !1078, size: 512, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1642, file: !14, line: 3857, baseType: !1083, size: 256, align: 32, offset: 512)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1633, file: !14, line: 3903, baseType: !1647, size: 256, align: 64, offset: 960)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 256, align: 64, elements: !1180)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1633, file: !14, line: 3904, baseType: !1187, size: 128, align: 32, offset: 1216)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1633, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1633, file: !14, line: 3908, baseType: !1468, size: 64, align: 64, offset: 1408)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1633, file: !14, line: 3915, baseType: !1468, size: 64, align: 64, offset: 1472)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1633, file: !14, line: 3917, baseType: !933, size: 32, align: 32, offset: 1536)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1623, file: !14, line: 3926, baseType: !984, size: 64, align: 64, offset: 192)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !923, file: !14, line: 3564, baseType: !1655, size: 64, align: 64, offset: 1344)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!933, !1051, !1197, !1341, !1343}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !923, file: !14, line: 3566, baseType: !1659, size: 64, align: 64, offset: 1408)
