; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test/[inter]test--siphash_internal_test-bin-siphash_internal_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test/[inter]test--siphash_internal_test-bin-siphash_internal_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TESTDATA = type { i32, %struct.SIZED_DATA }
%struct.SIZED_DATA = type { i64, [64 x i8] }
%struct.siphash_st = type { i64, i64, i64, i64, i64, i32, i32, i32, i32, [8 x i8] }

@.str = private unnamed_addr constant [19 x i8] c"test_siphash_basic\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"test_siphash\00", align 1
@.str.2 = private unnamed_addr constant [29 x i8] c"test/siphash_internal_test.c\00", align 1
@.str.3 = private unnamed_addr constant [35 x i8] c"SipHash_set_hash_size(&siphash, 4)\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.5 = private unnamed_addr constant [35 x i8] c"SipHash_set_hash_size(&siphash, 8)\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"SipHash_Init(&siphash, key, 0, 0)\00", align 1
@.str.7 = private unnamed_addr constant [35 x i8] c"SipHash_Final(&siphash, output, 8)\00", align 1
@.str.8 = private unnamed_addr constant [36 x i8] c"SipHash_Final(&siphash, output, 16)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !5)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test/[inter]test--siphash_internal_test-bin-siphash_internal_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!5 = !{!6}
!6 = distinct !DIGlobalVariable(name: "tests", scope: !0, file: !7, line: 39, type: !8, isLocal: true, isDefinition: true, variable: [128 x %struct.TESTDATA]* @tests)
!7 = !DIFile(filename: "test/siphash_internal_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 81920, align: 64, elements: !26)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "TESTDATA", file: !7, line: 29, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 26, size: 640, align: 64, elements: !11)
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !10, file: !7, line: 27, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !10, file: !7, line: 28, baseType: !15, size: 576, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIZED_DATA", file: !7, line: 24, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 21, size: 576, align: 64, elements: !17)
!17 = !{!18, !22}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !7, line: 22, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 216, baseType: !21)
!20 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test")
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !16, file: !7, line: 23, baseType: !23, size: 512, align: 8, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 8, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 64)
!26 = !{!27}
!27 = !DISubrange(count: 128)
!28 = !{i32 2, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!31 = distinct !DISubprogram(name: "setup_tests", scope: !7, file: !7, line: 285, type: !32, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!32 = !DISubroutineType(types: !33)
!33 = !{!13}
!34 = !DILocation(line: 287, column: 5, scope: !31)
!35 = !DILocation(line: 288, column: 5, scope: !31)
!36 = !DILocation(line: 289, column: 5, scope: !31)
!37 = distinct !DISubprogram(name: "test_siphash_basic", scope: !7, file: !7, line: 258, type: !32, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!38 = !DILocalVariable(name: "siphash", scope: !37, file: !7, line: 260, type: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIPHASH", file: !40, line: 17, baseType: !41)
!40 = !DIFile(filename: "crypto/include/internal/siphash.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siphash_st", file: !42, line: 12, size: 512, align: 64, elements: !43)
!42 = !DIFile(filename: "test/../crypto/siphash/siphash_local.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test")
!43 = !{!44, !47, !48, !49, !50, !51, !53, !54, !55, !56}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "total_inlen", scope: !41, file: !42, line: 13, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !46, line: 55, baseType: !21)
!46 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--siphash_internal_test")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "v0", scope: !41, file: !42, line: 14, baseType: !45, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !41, file: !42, line: 15, baseType: !45, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !41, file: !42, line: 16, baseType: !45, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !41, file: !42, line: 17, baseType: !45, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !41, file: !42, line: 18, baseType: !52, size: 32, align: 32, offset: 320)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !41, file: !42, line: 19, baseType: !13, size: 32, align: 32, offset: 352)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "crounds", scope: !41, file: !42, line: 20, baseType: !13, size: 32, align: 32, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "drounds", scope: !41, file: !42, line: 21, baseType: !13, size: 32, align: 32, offset: 416)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "leavings", scope: !41, file: !42, line: 22, baseType: !57, size: 64, align: 8, offset: 448)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 8, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 8)
!60 = !DIExpression()
!61 = !DILocation(line: 260, column: 13, scope: !37)
!62 = !DILocalVariable(name: "key", scope: !37, file: !7, line: 261, type: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 16)
!66 = !DILocation(line: 261, column: 19, scope: !37)
!67 = !DILocalVariable(name: "output", scope: !37, file: !7, line: 262, type: !63)
!68 = !DILocation(line: 262, column: 19, scope: !37)
!69 = !DILocation(line: 265, column: 104, scope: !37)
!70 = !DILocation(line: 265, column: 12, scope: !71)
!71 = !DILexicalBlockFile(scope: !37, file: !7, discriminator: 2)
!72 = !DILocation(line: 265, column: 12, scope: !37)
!73 = !DILocation(line: 267, column: 12, scope: !37)
!74 = !DILocation(line: 267, column: 101, scope: !75)
!75 = !DILexicalBlockFile(scope: !37, file: !7, discriminator: 1)
!76 = !DILocation(line: 267, column: 137, scope: !75)
!77 = !DILocation(line: 267, column: 15, scope: !78)
!78 = !DILexicalBlockFile(scope: !75, file: !7, discriminator: 2)
!79 = !DILocation(line: 267, column: 15, scope: !75)
!80 = !DILocation(line: 268, column: 12, scope: !37)
!81 = !DILocation(line: 268, column: 123, scope: !75)
!82 = !DILocation(line: 268, column: 100, scope: !75)
!83 = !DILocation(line: 268, column: 135, scope: !75)
!84 = !DILocation(line: 268, column: 15, scope: !78)
!85 = !DILocation(line: 268, column: 15, scope: !75)
!86 = !DILocation(line: 269, column: 12, scope: !37)
!87 = !DILocation(line: 269, column: 125, scope: !75)
!88 = !DILocation(line: 269, column: 101, scope: !75)
!89 = !DILocation(line: 269, column: 137, scope: !75)
!90 = !DILocation(line: 269, column: 15, scope: !78)
!91 = !DILocation(line: 269, column: 15, scope: !75)
!92 = !DILocation(line: 270, column: 12, scope: !37)
!93 = !DILocation(line: 270, column: 132, scope: !75)
!94 = !DILocation(line: 270, column: 108, scope: !75)
!95 = !DILocation(line: 270, column: 15, scope: !78)
!96 = !DILocation(line: 270, column: 15, scope: !75)
!97 = !DILocation(line: 273, column: 12, scope: !37)
!98 = !DILocation(line: 273, column: 102, scope: !75)
!99 = !DILocation(line: 273, column: 139, scope: !75)
!100 = !DILocation(line: 273, column: 15, scope: !78)
!101 = !DILocation(line: 273, column: 15, scope: !75)
!102 = !DILocation(line: 274, column: 12, scope: !37)
!103 = !DILocation(line: 274, column: 123, scope: !75)
!104 = !DILocation(line: 274, column: 100, scope: !75)
!105 = !DILocation(line: 274, column: 135, scope: !75)
!106 = !DILocation(line: 274, column: 15, scope: !78)
!107 = !DILocation(line: 274, column: 15, scope: !75)
!108 = !DILocation(line: 275, column: 12, scope: !37)
!109 = !DILocation(line: 275, column: 131, scope: !75)
!110 = !DILocation(line: 275, column: 107, scope: !75)
!111 = !DILocation(line: 275, column: 15, scope: !78)
!112 = !DILocation(line: 275, column: 15, scope: !75)
!113 = !DILocation(line: 276, column: 12, scope: !37)
!114 = !DILocation(line: 276, column: 126, scope: !75)
!115 = !DILocation(line: 276, column: 102, scope: !75)
!116 = !DILocation(line: 276, column: 139, scope: !75)
!117 = !DILocation(line: 276, column: 15, scope: !78)
!118 = !DILocation(line: 276, column: 15, scope: !75)
!119 = !DILocation(line: 279, column: 12, scope: !37)
!120 = !DILocation(line: 279, column: 101, scope: !75)
!121 = !DILocation(line: 279, column: 137, scope: !75)
!122 = !DILocation(line: 279, column: 15, scope: !78)
!123 = !DILocation(line: 279, column: 15, scope: !75)
!124 = !DILocation(line: 280, column: 12, scope: !37)
!125 = !DILocation(line: 280, column: 123, scope: !75)
!126 = !DILocation(line: 280, column: 100, scope: !75)
!127 = !DILocation(line: 280, column: 135, scope: !75)
