; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--alphablend.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--alphablend.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!204 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!205 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!206 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!207 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!208 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!209 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!210 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!211 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!212 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!213 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!214 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!215 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!216 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!217 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!218 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!219 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!220 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!221 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!222 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!223 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !225, line: 65, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!228 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!229 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!230 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!231 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!232 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!233 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !225, line: 75, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!237 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!238 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!239 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!240 = !{!241, !242, !247}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !245, line: 49, baseType: !246)
!245 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!246 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!248 = !{i32 2, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!251 = distinct !DISubprogram(name: "ff_sws_alphablendaway", scope: !252, file: !252, line: 23, type: !253, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!252 = !DIFile(filename: "libswscale/alphablend.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !256, !310, !315, !255, !255, !316, !315}
!255 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !259)
!259 = !{!260, !304, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !346, !350, !354, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !388, !402, !408, !409, !412, !413, !414, !415, !416, !417, !418, !423, !424, !425, !426, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !451, !452, !453, !457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !498, !499, !500, !501, !502, !503, !504, !505, !509, !510, !514, !516, !517, !518, !519, !520, !521, !522, !523, !526, !527, !534, !540, !545, !550, !555, !560, !565, !570, !571, !575, !579, !583, !584, !588, !592, !598, !599, !603, !607, !608, !610}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !258, file: !225, line: 284, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !265)
!265 = !{!266, !270, !274, !278, !279, !280, !281, !285, !291, !293, !297}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !264, file: !4, line: 72, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !264, file: !4, line: 78, baseType: !271, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!267, !241}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !264, file: !4, line: 85, baseType: !275, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !264, file: !4, line: 93, baseType: !255, size: 32, align: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !264, file: !4, line: 99, baseType: !255, size: 32, align: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !264, file: !4, line: 108, baseType: !255, size: 32, align: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !264, file: !4, line: 113, baseType: !282, size: 64, align: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!241, !241, !241}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !264, file: !4, line: 123, baseType: !286, size: 64, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !264, file: !4, line: 130, baseType: !292, size: 32, align: 32, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !264, file: !4, line: 136, baseType: !294, size: 64, align: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!292, !241}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !264, file: !4, line: 142, baseType: !298, size: 64, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!255, !301, !241, !267, !255}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !258, file: !225, line: 290, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!255, !309, !310, !315, !255, !255, !316, !315}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !245, line: 48, baseType: !314)
!314 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !258, file: !225, line: 291, baseType: !255, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !258, file: !225, line: 292, baseType: !255, size: 32, align: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !258, file: !225, line: 293, baseType: !255, size: 32, align: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !258, file: !225, line: 294, baseType: !255, size: 32, align: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !258, file: !225, line: 295, baseType: !255, size: 32, align: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !258, file: !225, line: 296, baseType: !255, size: 32, align: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !258, file: !225, line: 297, baseType: !255, size: 32, align: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !258, file: !225, line: 298, baseType: !255, size: 32, align: 32, offset: 352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !258, file: !225, line: 298, baseType: !255, size: 32, align: 32, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !258, file: !225, line: 299, baseType: !255, size: 32, align: 32, offset: 416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !258, file: !225, line: 299, baseType: !255, size: 32, align: 32, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !258, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !258, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !258, file: !225, line: 302, baseType: !255, size: 32, align: 32, offset: 544)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !258, file: !225, line: 303, baseType: !255, size: 32, align: 32, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !258, file: !225, line: 304, baseType: !255, size: 32, align: 32, offset: 608)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !258, file: !225, line: 304, baseType: !255, size: 32, align: 32, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !258, file: !225, line: 305, baseType: !255, size: 32, align: 32, offset: 672)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !258, file: !225, line: 306, baseType: !255, size: 32, align: 32, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !258, file: !225, line: 307, baseType: !255, size: 32, align: 32, offset: 736)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !258, file: !225, line: 308, baseType: !255, size: 32, align: 32, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !258, file: !225, line: 309, baseType: !255, size: 32, align: 32, offset: 800)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !258, file: !225, line: 310, baseType: !255, size: 32, align: 32, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !258, file: !225, line: 311, baseType: !342, size: 128, align: 64, offset: 896)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 128, align: 64, elements: !344)
!343 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!344 = !{!345}
!345 = !DISubrange(count: 2)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !258, file: !225, line: 317, baseType: !347, size: 192, align: 64, offset: 1024)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 192, align: 64, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 3)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !258, file: !225, line: 318, baseType: !351, size: 128, align: 32, offset: 1216)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 128, align: 32, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 4)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !258, file: !225, line: 319, baseType: !355, size: 256, align: 64, offset: 1344)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 256, align: 64, elements: !352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !258, file: !225, line: 320, baseType: !351, size: 128, align: 32, offset: 1600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !258, file: !225, line: 321, baseType: !355, size: 256, align: 64, offset: 1728)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !258, file: !225, line: 322, baseType: !255, size: 32, align: 32, offset: 1984)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !258, file: !225, line: 324, baseType: !343, size: 64, align: 64, offset: 2048)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !258, file: !225, line: 325, baseType: !255, size: 32, align: 32, offset: 2112)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !258, file: !225, line: 326, baseType: !255, size: 32, align: 32, offset: 2144)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !258, file: !225, line: 327, baseType: !247, size: 64, align: 64, offset: 2176)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !258, file: !225, line: 328, baseType: !247, size: 64, align: 64, offset: 2240)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !258, file: !225, line: 330, baseType: !255, size: 32, align: 32, offset: 2304)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !258, file: !225, line: 331, baseType: !366, size: 64, align: 32, offset: 2336)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, align: 32, elements: !344)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !258, file: !225, line: 332, baseType: !255, size: 32, align: 32, offset: 2400)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !258, file: !225, line: 333, baseType: !369, size: 64, align: 64, offset: 2432)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !370, file: !225, line: 945, baseType: !255, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !370, file: !225, line: 946, baseType: !255, size: 32, align: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !370, file: !225, line: 947, baseType: !255, size: 32, align: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !370, file: !225, line: 948, baseType: !255, size: 32, align: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !370, file: !225, line: 949, baseType: !255, size: 32, align: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !370, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !370, file: !225, line: 951, baseType: !379, size: 1024, align: 64, offset: 192)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 1024, align: 64, elements: !352)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !381, file: !225, line: 931, baseType: !255, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !381, file: !225, line: 932, baseType: !255, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !381, file: !225, line: 933, baseType: !255, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !381, file: !225, line: 934, baseType: !316, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !381, file: !225, line: 935, baseType: !316, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !258, file: !225, line: 334, baseType: !389, size: 64, align: 64, offset: 2496)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !391)
!391 = !{!392, !395, !396, !397, !398}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !390, file: !225, line: 960, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !370)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !390, file: !225, line: 961, baseType: !393, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !390, file: !225, line: 963, baseType: !255, size: 32, align: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !390, file: !225, line: 964, baseType: !241, size: 64, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !390, file: !225, line: 967, baseType: !399, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!255, !256, !389, !255, !255}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !258, file: !225, line: 336, baseType: !403, size: 8192, align: 32, offset: 2560)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 8192, align: 32, elements: !406)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !245, line: 51, baseType: !405)
!405 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!406 = !{!407}
!407 = !DISubrange(count: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !258, file: !225, line: 337, baseType: !403, size: 8192, align: 32, offset: 10752)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !258, file: !225, line: 339, baseType: !410, size: 8192, align: 32, offset: 18944)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 8192, align: 32, elements: !406)
!411 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !258, file: !225, line: 351, baseType: !255, size: 32, align: 32, offset: 27136)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !258, file: !225, line: 352, baseType: !255, size: 32, align: 32, offset: 27168)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !258, file: !225, line: 353, baseType: !255, size: 32, align: 32, offset: 27200)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !258, file: !225, line: 354, baseType: !255, size: 32, align: 32, offset: 27232)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !258, file: !225, line: 357, baseType: !317, size: 64, align: 64, offset: 27264)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !258, file: !225, line: 358, baseType: !255, size: 32, align: 32, offset: 27328)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !258, file: !225, line: 374, baseType: !419, size: 64, align: 64, offset: 27392)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !421, line: 195, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!422 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !258, file: !225, line: 375, baseType: !419, size: 64, align: 64, offset: 27456)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !258, file: !225, line: 376, baseType: !419, size: 64, align: 64, offset: 27520)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !258, file: !225, line: 377, baseType: !419, size: 64, align: 64, offset: 27584)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !258, file: !225, line: 378, baseType: !427, size: 64, align: 64, offset: 27648)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !421, line: 196, baseType: !255)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !258, file: !225, line: 379, baseType: !427, size: 64, align: 64, offset: 27712)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !258, file: !225, line: 380, baseType: !427, size: 64, align: 64, offset: 27776)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !258, file: !225, line: 381, baseType: !427, size: 64, align: 64, offset: 27840)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !258, file: !225, line: 382, baseType: !255, size: 32, align: 32, offset: 27904)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !258, file: !225, line: 383, baseType: !255, size: 32, align: 32, offset: 27936)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !258, file: !225, line: 384, baseType: !255, size: 32, align: 32, offset: 27968)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !258, file: !225, line: 385, baseType: !255, size: 32, align: 32, offset: 28000)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !258, file: !225, line: 388, baseType: !255, size: 32, align: 32, offset: 28032)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !258, file: !225, line: 389, baseType: !255, size: 32, align: 32, offset: 28064)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !258, file: !225, line: 390, baseType: !317, size: 64, align: 64, offset: 28096)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !258, file: !225, line: 391, baseType: !317, size: 64, align: 64, offset: 28160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !258, file: !225, line: 393, baseType: !255, size: 32, align: 32, offset: 28224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !258, file: !225, line: 394, baseType: !255, size: 32, align: 32, offset: 28256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !258, file: !225, line: 396, baseType: !255, size: 32, align: 32, offset: 28288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !225, line: 397, baseType: !255, size: 32, align: 32, offset: 28320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !258, file: !225, line: 398, baseType: !241, size: 64, align: 64, offset: 28352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !258, file: !225, line: 401, baseType: !446, size: 40960, align: 32, offset: 28416)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 40960, align: 32, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !258, file: !225, line: 402, baseType: !450, size: 81920, align: 64, offset: 69376)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 81920, align: 64, elements: !447)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !258, file: !225, line: 403, baseType: !450, size: 81920, align: 64, offset: 151296)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !258, file: !225, line: 404, baseType: !450, size: 81920, align: 64, offset: 233216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !258, file: !225, line: 405, baseType: !454, size: 5632, align: 32, offset: 315136)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 5632, align: 32, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 176)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !258, file: !225, line: 417, baseType: !458, size: 256, align: 64, offset: 320768)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 256, align: 64, elements: !352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !258, file: !225, line: 420, baseType: !255, size: 32, align: 32, offset: 321024)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !258, file: !225, line: 420, baseType: !255, size: 32, align: 32, offset: 321056)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !258, file: !225, line: 420, baseType: !255, size: 32, align: 32, offset: 321088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !258, file: !225, line: 421, baseType: !351, size: 128, align: 32, offset: 321120)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !258, file: !225, line: 422, baseType: !351, size: 128, align: 32, offset: 321248)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !258, file: !225, line: 423, baseType: !255, size: 32, align: 32, offset: 321376)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !258, file: !225, line: 424, baseType: !255, size: 32, align: 32, offset: 321408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !258, file: !225, line: 425, baseType: !255, size: 32, align: 32, offset: 321440)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !258, file: !225, line: 426, baseType: !255, size: 32, align: 32, offset: 321472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !258, file: !225, line: 427, baseType: !255, size: 32, align: 32, offset: 321504)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !258, file: !225, line: 428, baseType: !255, size: 32, align: 32, offset: 321536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !258, file: !225, line: 429, baseType: !255, size: 32, align: 32, offset: 321568)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !258, file: !225, line: 430, baseType: !255, size: 32, align: 32, offset: 321600)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !258, file: !225, line: 431, baseType: !255, size: 32, align: 32, offset: 321632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !258, file: !225, line: 432, baseType: !255, size: 32, align: 32, offset: 321664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !258, file: !225, line: 433, baseType: !255, size: 32, align: 32, offset: 321696)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !258, file: !225, line: 434, baseType: !255, size: 32, align: 32, offset: 321728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !258, file: !225, line: 435, baseType: !255, size: 32, align: 32, offset: 321760)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !258, file: !225, line: 436, baseType: !255, size: 32, align: 32, offset: 321792)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !258, file: !225, line: 437, baseType: !255, size: 32, align: 32, offset: 321824)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !258, file: !225, line: 438, baseType: !255, size: 32, align: 32, offset: 321856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !258, file: !225, line: 466, baseType: !481, size: 64, align: 64, offset: 321920)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !245, line: 55, baseType: !482)
!482 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !258, file: !225, line: 467, baseType: !481, size: 64, align: 64, offset: 321984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !258, file: !225, line: 468, baseType: !481, size: 64, align: 64, offset: 322048)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !258, file: !225, line: 470, baseType: !481, size: 64, align: 64, offset: 322112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !258, file: !225, line: 471, baseType: !481, size: 64, align: 64, offset: 322176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !258, file: !225, line: 472, baseType: !481, size: 64, align: 64, offset: 322240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !258, file: !225, line: 473, baseType: !481, size: 64, align: 64, offset: 322304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !258, file: !225, line: 474, baseType: !481, size: 64, align: 64, offset: 322368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !258, file: !225, line: 475, baseType: !481, size: 64, align: 64, offset: 322432)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !258, file: !225, line: 476, baseType: !481, size: 64, align: 64, offset: 322496)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !258, file: !225, line: 477, baseType: !481, size: 64, align: 64, offset: 322560)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !258, file: !225, line: 478, baseType: !494, size: 32768, align: 32, offset: 322624)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 32768, align: 32, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 1024)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !258, file: !225, line: 479, baseType: !494, size: 32768, align: 32, offset: 355392)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !258, file: !225, line: 480, baseType: !255, size: 32, align: 32, offset: 388160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !258, file: !225, line: 481, baseType: !481, size: 64, align: 64, offset: 388224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !258, file: !225, line: 482, baseType: !481, size: 64, align: 64, offset: 388288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !258, file: !225, line: 483, baseType: !481, size: 64, align: 64, offset: 388352)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !258, file: !225, line: 484, baseType: !481, size: 64, align: 64, offset: 388416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !258, file: !225, line: 485, baseType: !481, size: 64, align: 64, offset: 388480)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !258, file: !225, line: 486, baseType: !494, size: 32768, align: 32, offset: 388544)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !258, file: !225, line: 490, baseType: !506, size: 64, align: 64, offset: 421312)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !507, line: 149, baseType: !508)
!507 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!508 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !258, file: !225, line: 491, baseType: !506, size: 64, align: 64, offset: 421376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !258, file: !225, line: 492, baseType: !511, size: 128, align: 16, offset: 421440)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, align: 16, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !258, file: !225, line: 493, baseType: !515, size: 256, align: 32, offset: 421568)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 256, align: 32, elements: !512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !258, file: !225, line: 495, baseType: !311, size: 64, align: 64, offset: 421824)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !258, file: !225, line: 495, baseType: !311, size: 64, align: 64, offset: 421888)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !258, file: !225, line: 508, baseType: !255, size: 32, align: 32, offset: 421952)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !258, file: !225, line: 513, baseType: !419, size: 64, align: 64, offset: 422016)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !258, file: !225, line: 514, baseType: !419, size: 64, align: 64, offset: 422080)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !258, file: !225, line: 515, baseType: !419, size: 64, align: 64, offset: 422144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !258, file: !225, line: 516, baseType: !419, size: 64, align: 64, offset: 422208)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !258, file: !225, line: 517, baseType: !524, size: 192, align: 16, offset: 422272)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 192, align: 16, elements: !525)
!525 = !{!349, !353}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !258, file: !225, line: 518, baseType: !524, size: 192, align: 16, offset: 422464)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !258, file: !225, line: 521, baseType: !528, size: 64, align: 64, offset: 422656)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532, !317, !255, !311, !255}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !258, file: !225, line: 522, baseType: !535, size: 64, align: 64, offset: 422720)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !532, !255, !539, !317, !255, !311, !255}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !258, file: !225, line: 523, baseType: !541, size: 64, align: 64, offset: 422784)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !309, !532, !255, !539, !539, !317, !255}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !258, file: !225, line: 524, baseType: !546, size: 64, align: 64, offset: 422848)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !309, !532, !539, !539, !532, !317, !255, !255, !255}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !258, file: !225, line: 525, baseType: !551, size: 64, align: 64, offset: 422912)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !309, !539, !539, !539, !539, !317, !255, !255, !255, !255}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !258, file: !225, line: 526, baseType: !556, size: 64, align: 64, offset: 422976)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !309, !532, !539, !255, !532, !539, !539, !255, !539, !317, !255, !255}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !258, file: !225, line: 527, baseType: !561, size: 64, align: 64, offset: 423040)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !309, !532, !539, !255, !532, !539, !539, !255, !539, !316, !255, !255}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !258, file: !225, line: 530, baseType: !566, size: 64, align: 64, offset: 423104)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !317, !311, !311, !311, !255, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !258, file: !225, line: 533, baseType: !566, size: 64, align: 64, offset: 423168)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !258, file: !225, line: 536, baseType: !572, size: 64, align: 64, offset: 423232)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !317, !317, !311, !311, !311, !255, !569}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !258, file: !225, line: 545, baseType: !576, size: 64, align: 64, offset: 423296)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !317, !310, !255, !427}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !258, file: !225, line: 546, baseType: !580, size: 64, align: 64, offset: 423360)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !317, !317, !310, !255, !427}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !258, file: !225, line: 548, baseType: !576, size: 64, align: 64, offset: 423424)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !258, file: !225, line: 570, baseType: !585, size: 64, align: 64, offset: 423488)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !309, !419, !255, !311, !255, !255}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !258, file: !225, line: 573, baseType: !589, size: 64, align: 64, offset: 423552)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !309, !419, !419, !255, !311, !311, !255, !255}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !258, file: !225, line: 610, baseType: !593, size: 64, align: 64, offset: 423616)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !309, !419, !255, !311, !532, !596, !255}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !258, file: !225, line: 613, baseType: !593, size: 64, align: 64, offset: 423680)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !258, file: !225, line: 619, baseType: !600, size: 64, align: 64, offset: 423744)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !419, !255}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !258, file: !225, line: 621, baseType: !604, size: 64, align: 64, offset: 423808)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !419, !419, !255}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !258, file: !225, line: 623, baseType: !255, size: 32, align: 32, offset: 423872)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !258, file: !225, line: 625, baseType: !609, size: 32, align: 32, offset: 423904)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !258, file: !225, line: 627, baseType: !611, size: 32, align: 32, offset: 423936)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!612 = !{}
!613 = !DILocalVariable(name: "a", arg: 1, scope: !614, file: !615, line: 127, type: !255)
!614 = distinct !DISubprogram(name: "av_clip_c", scope: !615, file: !615, line: 127, type: !616, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!615 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!616 = !DISubroutineType(types: !617)
!617 = !{!255, !255, !255, !255}
!618 = !DIExpression()
!619 = !DILocation(line: 127, column: 87, scope: !614, inlinedAt: !620)
!620 = distinct !DILocation(line: 80, column: 40, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !252, line: 73, column: 53)
!622 = distinct !DILexicalBlock(scope: !623, file: !252, line: 73, column: 29)
!623 = distinct !DILexicalBlock(scope: !624, file: !252, line: 73, column: 29)
!624 = distinct !DILexicalBlock(scope: !625, file: !252, line: 72, column: 32)
!625 = distinct !DILexicalBlock(scope: !626, file: !252, line: 62, column: 29)
!626 = distinct !DILexicalBlock(scope: !627, file: !252, line: 57, column: 39)
!627 = distinct !DILexicalBlock(scope: !628, file: !252, line: 57, column: 25)
!628 = distinct !DILexicalBlock(scope: !629, file: !252, line: 54, column: 49)
!629 = distinct !DILexicalBlock(scope: !630, file: !252, line: 54, column: 21)
!630 = distinct !DILexicalBlock(scope: !631, file: !252, line: 53, column: 190)
!631 = distinct !DILexicalBlock(scope: !632, file: !252, line: 53, column: 13)
!632 = distinct !DILexicalBlock(scope: !633, file: !252, line: 53, column: 13)
!633 = distinct !DILexicalBlock(scope: !634, file: !252, line: 49, column: 55)
!634 = distinct !DILexicalBlock(scope: !635, file: !252, line: 49, column: 9)
!635 = distinct !DILexicalBlock(scope: !636, file: !252, line: 49, column: 9)
!636 = distinct !DILexicalBlock(scope: !637, file: !252, line: 48, column: 33)
!637 = distinct !DILexicalBlock(scope: !251, file: !252, line: 48, column: 9)
!638 = !DILocalVariable(name: "amin", arg: 2, scope: !614, file: !615, line: 127, type: !255)
!639 = !DILocation(line: 127, column: 94, scope: !614, inlinedAt: !620)
!640 = !DILocalVariable(name: "amax", arg: 3, scope: !614, file: !615, line: 127, type: !255)
!641 = !DILocation(line: 127, column: 104, scope: !614, inlinedAt: !620)
!642 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !643, file: !225, line: 660, type: !24)
!643 = distinct !DISubprogram(name: "isBE", scope: !225, file: !225, line: 660, type: !644, isLocal: true, isDefinition: true, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!644 = !DISubroutineType(types: !645)
!645 = !{!255, !24}
!646 = !DILocation(line: 660, column: 74, scope: !643, inlinedAt: !647)
!647 = distinct !DILocation(line: 103, column: 27, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !252, line: 103, column: 25)
!649 = distinct !DILexicalBlock(scope: !650, file: !252, line: 99, column: 35)
!650 = distinct !DILexicalBlock(scope: !651, file: !252, line: 99, column: 21)
!651 = distinct !DILexicalBlock(scope: !629, file: !252, line: 98, column: 24)
!652 = !DILocalVariable(name: "desc", scope: !643, file: !225, line: 662, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !656, line: 123, baseType: !657)
!656 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !656, line: 81, size: 1280, align: 64, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !677}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !656, line: 82, baseType: !267, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !657, file: !656, line: 83, baseType: !313, size: 8, align: 8, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !657, file: !656, line: 92, baseType: !313, size: 8, align: 8, offset: 72)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !657, file: !656, line: 101, baseType: !313, size: 8, align: 8, offset: 80)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !657, file: !656, line: 106, baseType: !481, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !657, file: !656, line: 117, baseType: !665, size: 1024, align: 32, offset: 192)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 1024, align: 32, elements: !352)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !656, line: 70, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !656, line: 31, size: 256, align: 32, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !667, file: !656, line: 35, baseType: !255, size: 32, align: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !667, file: !656, line: 41, baseType: !255, size: 32, align: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !667, file: !656, line: 47, baseType: !255, size: 32, align: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !667, file: !656, line: 53, baseType: !255, size: 32, align: 32, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !667, file: !656, line: 58, baseType: !255, size: 32, align: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !667, file: !656, line: 62, baseType: !255, size: 32, align: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !667, file: !656, line: 65, baseType: !255, size: 32, align: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !667, file: !656, line: 68, baseType: !255, size: 32, align: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !657, file: !656, line: 122, baseType: !267, size: 64, align: 64, offset: 1216)
!678 = !DILocation(line: 662, column: 31, scope: !643, inlinedAt: !647)
!679 = !DILocation(line: 127, column: 87, scope: !614, inlinedAt: !680)
!680 = distinct !DILocation(line: 106, column: 36, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !252, line: 104, column: 49)
!682 = distinct !DILexicalBlock(scope: !683, file: !252, line: 104, column: 25)
!683 = distinct !DILexicalBlock(scope: !684, file: !252, line: 104, column: 25)
!684 = distinct !DILexicalBlock(scope: !648, file: !252, line: 103, column: 54)
!685 = !DILocation(line: 127, column: 94, scope: !614, inlinedAt: !680)
!686 = !DILocation(line: 127, column: 104, scope: !614, inlinedAt: !680)
!687 = !DILocalVariable(name: "x", arg: 1, scope: !688, file: !689, line: 58, type: !244)
!688 = distinct !DISubprogram(name: "av_bswap16", scope: !689, file: !689, line: 58, type: !690, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!689 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!690 = !DISubroutineType(types: !691)
!691 = !{!244, !244}
!692 = !DILocation(line: 58, column: 98, scope: !688, inlinedAt: !693)
!693 = distinct !DILocation(line: 110, column: 45, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !252, line: 109, column: 49)
!695 = distinct !DILexicalBlock(scope: !696, file: !252, line: 109, column: 25)
!696 = distinct !DILexicalBlock(scope: !697, file: !252, line: 109, column: 25)
!697 = distinct !DILexicalBlock(scope: !648, file: !252, line: 108, column: 28)
!698 = !DILocation(line: 58, column: 98, scope: !688, inlinedAt: !699)
!699 = distinct !DILocation(line: 111, column: 42, scope: !694)
!700 = !DILocation(line: 127, column: 87, scope: !614, inlinedAt: !701)
!701 = distinct !DILocation(line: 112, column: 36, scope: !694)
!702 = !DILocation(line: 127, column: 94, scope: !614, inlinedAt: !701)
!703 = !DILocation(line: 127, column: 104, scope: !614, inlinedAt: !701)
!704 = !DILocation(line: 58, column: 98, scope: !688, inlinedAt: !705)
!705 = distinct !DILocation(line: 79, column: 37, scope: !621)
!706 = !DILocation(line: 58, column: 98, scope: !688, inlinedAt: !707)
!707 = distinct !DILocation(line: 78, column: 67, scope: !708)
!708 = !DILexicalBlockFile(scope: !709, file: !252, discriminator: 1)
!709 = distinct !DILexicalBlock(scope: !621, file: !252, line: 74, column: 37)
!710 = !DILocation(line: 58, column: 98, scope: !688, inlinedAt: !711)
!711 = distinct !DILocation(line: 78, column: 46, scope: !709)
!712 = !DILocation(line: 660, column: 74, scope: !643, inlinedAt: !713)
!713 = distinct !DILocation(line: 135, column: 23, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !252, line: 135, column: 21)
!715 = distinct !DILexicalBlock(scope: !716, file: !252, line: 131, column: 31)
!716 = distinct !DILexicalBlock(scope: !717, file: !252, line: 131, column: 17)
!717 = distinct !DILexicalBlock(scope: !718, file: !252, line: 130, column: 49)
!718 = distinct !DILexicalBlock(scope: !719, file: !252, line: 130, column: 9)
!719 = distinct !DILexicalBlock(scope: !720, file: !252, line: 130, column: 9)
!720 = distinct !DILexicalBlock(scope: !637, file: !252, line: 127, column: 12)
!721 = !DILocation(line: 662, column: 31, scope: !643, inlinedAt: !713)
!722 = !DILocation(line: 127, column: 87, scope: !614, inlinedAt: !723)
!723 = distinct !DILocation(line: 140, column: 56, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !252, line: 137, column: 71)
!725 = distinct !DILexicalBlock(scope: !726, file: !252, line: 137, column: 25)
!726 = distinct !DILexicalBlock(scope: !727, file: !252, line: 137, column: 25)
!727 = distinct !DILexicalBlock(scope: !728, file: !252, line: 136, column: 45)
