; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--utils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FormatEntry = type { i8 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.ScaleAlgorithm = type { i32, i8*, i32 }

!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !247, line: 65, size: 32, align: 32, elements: !248)
!247 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!248 = !{!249, !250, !251, !252, !253, !254, !255}
!249 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!250 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!251 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!252 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!253 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!254 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!255 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !247, line: 75, size: 32, align: 32, elements: !257)
!257 = !{!258, !259, !260, !261}
!258 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!259 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!260 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!261 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!262 = !{!263, !264, !267, !268, !269, !271, !272, !275, !282}
!263 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !265, line: 40, baseType: !266)
!265 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!266 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!267 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !265, line: 51, baseType: !263)
!271 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !265, line: 48, baseType: !274)
!274 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !277, line: 222, size: 16, align: 8, elements: !278)
!277 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !276, file: !277, line: 222, baseType: !280, size: 16, align: 16)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !265, line: 49, baseType: !281)
!281 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!283 = !{!284, !691, !698, !709, !721, !726, !727, !731, !732, !733, !734}
!284 = distinct !DIGlobalVariable(name: "float_mult", scope: !285, file: !286, line: 1182, type: !690, isLocal: true, isDefinition: true, variable: float* @sws_init_context.float_mult)
!285 = distinct !DISubprogram(name: "sws_init_context", scope: !286, file: !286, line: 1163, type: !287, isLocal: false, isDefinition: true, scopeLine: 1165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!286 = !DIFile(filename: "libswscale/utils.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!287 = !DISubroutineType(types: !288)
!288 = !{!271, !289, !673, !673}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !247, line: 628, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !247, line: 280, size: 424064, align: 128, elements: !292)
!292 = !{!293, !375, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !413, !417, !421, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !434, !435, !455, !469, !473, !474, !476, !477, !478, !479, !480, !481, !482, !486, !487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !514, !515, !516, !520, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !560, !561, !562, !563, !564, !565, !566, !567, !568, !571, !572, !576, !578, !579, !580, !581, !582, !583, !584, !585, !588, !589, !596, !602, !607, !612, !617, !622, !627, !631, !632, !636, !640, !644, !645, !649, !653, !659, !660, !664, !668, !669, !671}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !291, file: !247, line: 284, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !226, line: 143, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !226, line: 67, size: 640, align: 64, elements: !298)
!298 = !{!299, !303, !307, !334, !335, !336, !337, !341, !347, !349, !353}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !297, file: !226, line: 72, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !297, file: !226, line: 78, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!300, !268}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !297, file: !226, line: 85, baseType: !308, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 246, size: 512, align: 64, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !330, !331, !332, !333}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !204, line: 247, baseType: !300, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !310, file: !204, line: 253, baseType: !300, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !310, file: !204, line: 259, baseType: !271, size: 32, align: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !204, line: 260, baseType: !203, size: 32, align: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !310, file: !204, line: 271, baseType: !317, size: 64, align: 64, offset: 192)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !310, file: !204, line: 265, size: 64, align: 64, elements: !318)
!318 = !{!319, !320, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !317, file: !204, line: 266, baseType: !264, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !317, file: !204, line: 267, baseType: !321, size: 64, align: 64)
!321 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !317, file: !204, line: 268, baseType: !300, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !317, file: !204, line: 270, baseType: !324, size: 64, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !325, line: 61, baseType: !326)
!325 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !325, line: 58, size: 64, align: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !326, file: !325, line: 59, baseType: !271, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !326, file: !325, line: 60, baseType: !271, size: 32, align: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !310, file: !204, line: 272, baseType: !321, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !310, file: !204, line: 273, baseType: !321, size: 64, align: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !204, line: 275, baseType: !271, size: 32, align: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !310, file: !204, line: 300, baseType: !300, size: 64, align: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !297, file: !226, line: 93, baseType: !271, size: 32, align: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !297, file: !226, line: 99, baseType: !271, size: 32, align: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !297, file: !226, line: 108, baseType: !271, size: 32, align: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !297, file: !226, line: 113, baseType: !338, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!268, !268, !268}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !297, file: !226, line: 123, baseType: !342, size: 64, align: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !297, file: !226, line: 130, baseType: !348, size: 32, align: 32, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !226, line: 48, baseType: !225)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !297, file: !226, line: 136, baseType: !350, size: 64, align: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!348, !268}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !297, file: !226, line: 142, baseType: !354, size: 64, align: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!271, !357, !268, !300, !271}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 329, size: 128, align: 64, elements: !360)
!360 = !{!361, !373, !374}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !359, file: !204, line: 360, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !204, line: 324, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !204, line: 306, size: 384, align: 64, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !365, file: !204, line: 307, baseType: !300, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !365, file: !204, line: 313, baseType: !321, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !365, file: !204, line: 313, baseType: !321, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !365, file: !204, line: 318, baseType: !321, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !365, file: !204, line: 318, baseType: !321, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !365, file: !204, line: 323, baseType: !271, size: 32, align: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !359, file: !204, line: 364, baseType: !271, size: 32, align: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !359, file: !204, line: 368, baseType: !271, size: 32, align: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !291, file: !247, line: 290, baseType: !376, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !247, line: 82, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!271, !380, !381, !384, !271, !271, !385, !384}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !291, file: !247, line: 291, baseType: !271, size: 32, align: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !291, file: !247, line: 292, baseType: !271, size: 32, align: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !291, file: !247, line: 293, baseType: !271, size: 32, align: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !291, file: !247, line: 294, baseType: !271, size: 32, align: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !291, file: !247, line: 295, baseType: !271, size: 32, align: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !291, file: !247, line: 296, baseType: !271, size: 32, align: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !291, file: !247, line: 297, baseType: !271, size: 32, align: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !291, file: !247, line: 298, baseType: !271, size: 32, align: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !291, file: !247, line: 298, baseType: !271, size: 32, align: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !291, file: !247, line: 299, baseType: !271, size: 32, align: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !291, file: !247, line: 299, baseType: !271, size: 32, align: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !291, file: !247, line: 300, baseType: !3, size: 32, align: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !291, file: !247, line: 301, baseType: !3, size: 32, align: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !291, file: !247, line: 302, baseType: !271, size: 32, align: 32, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !291, file: !247, line: 303, baseType: !271, size: 32, align: 32, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !291, file: !247, line: 304, baseType: !271, size: 32, align: 32, offset: 608)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !291, file: !247, line: 304, baseType: !271, size: 32, align: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !291, file: !247, line: 305, baseType: !271, size: 32, align: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !291, file: !247, line: 306, baseType: !271, size: 32, align: 32, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !291, file: !247, line: 307, baseType: !271, size: 32, align: 32, offset: 736)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !291, file: !247, line: 308, baseType: !271, size: 32, align: 32, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !291, file: !247, line: 309, baseType: !271, size: 32, align: 32, offset: 800)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !291, file: !247, line: 310, baseType: !271, size: 32, align: 32, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !291, file: !247, line: 311, baseType: !410, size: 128, align: 64, offset: 896)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, align: 64, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 2)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !291, file: !247, line: 317, baseType: !414, size: 192, align: 64, offset: 1024)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 192, align: 64, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 3)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !291, file: !247, line: 318, baseType: !418, size: 128, align: 32, offset: 1216)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, align: 32, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 4)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !291, file: !247, line: 319, baseType: !422, size: 256, align: 64, offset: 1344)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 256, align: 64, elements: !419)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !291, file: !247, line: 320, baseType: !418, size: 128, align: 32, offset: 1600)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !291, file: !247, line: 321, baseType: !422, size: 256, align: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !291, file: !247, line: 322, baseType: !271, size: 32, align: 32, offset: 1984)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !291, file: !247, line: 324, baseType: !321, size: 64, align: 64, offset: 2048)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !291, file: !247, line: 325, baseType: !271, size: 32, align: 32, offset: 2112)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !291, file: !247, line: 326, baseType: !271, size: 32, align: 32, offset: 2144)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !291, file: !247, line: 327, baseType: !282, size: 64, align: 64, offset: 2176)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !291, file: !247, line: 328, baseType: !282, size: 64, align: 64, offset: 2240)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !291, file: !247, line: 330, baseType: !271, size: 32, align: 32, offset: 2304)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !291, file: !247, line: 331, baseType: !433, size: 64, align: 32, offset: 2336)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 64, align: 32, elements: !411)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !291, file: !247, line: 332, baseType: !271, size: 32, align: 32, offset: 2400)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !291, file: !247, line: 333, baseType: !436, size: 64, align: 64, offset: 2432)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !247, line: 943, size: 1216, align: 64, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !437, file: !247, line: 945, baseType: !271, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !437, file: !247, line: 946, baseType: !271, size: 32, align: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !437, file: !247, line: 947, baseType: !271, size: 32, align: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !437, file: !247, line: 948, baseType: !271, size: 32, align: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !437, file: !247, line: 949, baseType: !271, size: 32, align: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !437, file: !247, line: 950, baseType: !3, size: 32, align: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !437, file: !247, line: 951, baseType: !446, size: 1024, align: 64, offset: 192)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 1024, align: 64, elements: !419)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !247, line: 936, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !247, line: 929, size: 256, align: 64, elements: !449)
!449 = !{!450, !451, !452, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !448, file: !247, line: 931, baseType: !271, size: 32, align: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !448, file: !247, line: 932, baseType: !271, size: 32, align: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !448, file: !247, line: 933, baseType: !271, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !448, file: !247, line: 934, baseType: !385, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !448, file: !247, line: 935, baseType: !385, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !291, file: !247, line: 334, baseType: !456, size: 64, align: 64, offset: 2496)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !247, line: 958, size: 320, align: 64, elements: !458)
!458 = !{!459, !462, !463, !464, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !457, file: !247, line: 960, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !247, line: 952, baseType: !437)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !457, file: !247, line: 961, baseType: !460, size: 64, align: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !457, file: !247, line: 963, baseType: !271, size: 32, align: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !457, file: !247, line: 964, baseType: !268, size: 64, align: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !457, file: !247, line: 967, baseType: !466, size: 64, align: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!271, !289, !456, !271, !271}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !291, file: !247, line: 336, baseType: !470, size: 8192, align: 32, offset: 2560)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 8192, align: 32, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !291, file: !247, line: 337, baseType: !470, size: 8192, align: 32, offset: 10752)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !291, file: !247, line: 339, baseType: !475, size: 8192, align: 32, offset: 18944)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 8192, align: 32, elements: !471)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !291, file: !247, line: 351, baseType: !271, size: 32, align: 32, offset: 27136)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !291, file: !247, line: 352, baseType: !271, size: 32, align: 32, offset: 27168)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !291, file: !247, line: 353, baseType: !271, size: 32, align: 32, offset: 27200)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !291, file: !247, line: 354, baseType: !271, size: 32, align: 32, offset: 27232)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !291, file: !247, line: 357, baseType: !272, size: 64, align: 64, offset: 27264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !291, file: !247, line: 358, baseType: !271, size: 32, align: 32, offset: 27328)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !291, file: !247, line: 374, baseType: !483, size: 64, align: 64, offset: 27392)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !265, line: 37, baseType: !485)
!485 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !291, file: !247, line: 375, baseType: !483, size: 64, align: 64, offset: 27456)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !291, file: !247, line: 376, baseType: !483, size: 64, align: 64, offset: 27520)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !291, file: !247, line: 377, baseType: !483, size: 64, align: 64, offset: 27584)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !291, file: !247, line: 378, baseType: !490, size: 64, align: 64, offset: 27648)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !265, line: 38, baseType: !271)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !291, file: !247, line: 379, baseType: !490, size: 64, align: 64, offset: 27712)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !291, file: !247, line: 380, baseType: !490, size: 64, align: 64, offset: 27776)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !291, file: !247, line: 381, baseType: !490, size: 64, align: 64, offset: 27840)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !291, file: !247, line: 382, baseType: !271, size: 32, align: 32, offset: 27904)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !291, file: !247, line: 383, baseType: !271, size: 32, align: 32, offset: 27936)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !291, file: !247, line: 384, baseType: !271, size: 32, align: 32, offset: 27968)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !291, file: !247, line: 385, baseType: !271, size: 32, align: 32, offset: 28000)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !291, file: !247, line: 388, baseType: !271, size: 32, align: 32, offset: 28032)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !291, file: !247, line: 389, baseType: !271, size: 32, align: 32, offset: 28064)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !291, file: !247, line: 390, baseType: !272, size: 64, align: 64, offset: 28096)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !291, file: !247, line: 391, baseType: !272, size: 64, align: 64, offset: 28160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !291, file: !247, line: 393, baseType: !271, size: 32, align: 32, offset: 28224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !291, file: !247, line: 394, baseType: !271, size: 32, align: 32, offset: 28256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !291, file: !247, line: 396, baseType: !271, size: 32, align: 32, offset: 28288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !291, file: !247, line: 397, baseType: !271, size: 32, align: 32, offset: 28320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !291, file: !247, line: 398, baseType: !268, size: 64, align: 64, offset: 28352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !291, file: !247, line: 401, baseType: !509, size: 40960, align: 32, offset: 28416)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 40960, align: 32, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !291, file: !247, line: 402, baseType: !513, size: 81920, align: 64, offset: 69376)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 81920, align: 64, elements: !510)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !291, file: !247, line: 403, baseType: !513, size: 81920, align: 64, offset: 151296)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !291, file: !247, line: 404, baseType: !513, size: 81920, align: 64, offset: 233216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !291, file: !247, line: 405, baseType: !517, size: 5632, align: 32, offset: 315136)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 5632, align: 32, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 176)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !291, file: !247, line: 417, baseType: !521, size: 256, align: 64, offset: 320768)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 256, align: 64, elements: !419)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !291, file: !247, line: 420, baseType: !271, size: 32, align: 32, offset: 321024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !291, file: !247, line: 420, baseType: !271, size: 32, align: 32, offset: 321056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !291, file: !247, line: 420, baseType: !271, size: 32, align: 32, offset: 321088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !291, file: !247, line: 421, baseType: !418, size: 128, align: 32, offset: 321120)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !291, file: !247, line: 422, baseType: !418, size: 128, align: 32, offset: 321248)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !291, file: !247, line: 423, baseType: !271, size: 32, align: 32, offset: 321376)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !291, file: !247, line: 424, baseType: !271, size: 32, align: 32, offset: 321408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !291, file: !247, line: 425, baseType: !271, size: 32, align: 32, offset: 321440)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !291, file: !247, line: 426, baseType: !271, size: 32, align: 32, offset: 321472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !291, file: !247, line: 427, baseType: !271, size: 32, align: 32, offset: 321504)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !291, file: !247, line: 428, baseType: !271, size: 32, align: 32, offset: 321536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !291, file: !247, line: 429, baseType: !271, size: 32, align: 32, offset: 321568)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !291, file: !247, line: 430, baseType: !271, size: 32, align: 32, offset: 321600)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !291, file: !247, line: 431, baseType: !271, size: 32, align: 32, offset: 321632)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !291, file: !247, line: 432, baseType: !271, size: 32, align: 32, offset: 321664)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !291, file: !247, line: 433, baseType: !271, size: 32, align: 32, offset: 321696)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !291, file: !247, line: 434, baseType: !271, size: 32, align: 32, offset: 321728)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !291, file: !247, line: 435, baseType: !271, size: 32, align: 32, offset: 321760)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !291, file: !247, line: 436, baseType: !271, size: 32, align: 32, offset: 321792)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !291, file: !247, line: 437, baseType: !271, size: 32, align: 32, offset: 321824)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !291, file: !247, line: 438, baseType: !271, size: 32, align: 32, offset: 321856)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !291, file: !247, line: 466, baseType: !544, size: 64, align: 64, offset: 321920)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !265, line: 55, baseType: !545)
!545 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !291, file: !247, line: 467, baseType: !544, size: 64, align: 64, offset: 321984)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !291, file: !247, line: 468, baseType: !544, size: 64, align: 64, offset: 322048)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !291, file: !247, line: 470, baseType: !544, size: 64, align: 64, offset: 322112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !291, file: !247, line: 471, baseType: !544, size: 64, align: 64, offset: 322176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !291, file: !247, line: 472, baseType: !544, size: 64, align: 64, offset: 322240)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !291, file: !247, line: 473, baseType: !544, size: 64, align: 64, offset: 322304)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !291, file: !247, line: 474, baseType: !544, size: 64, align: 64, offset: 322368)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !291, file: !247, line: 475, baseType: !544, size: 64, align: 64, offset: 322432)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !291, file: !247, line: 476, baseType: !544, size: 64, align: 64, offset: 322496)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !291, file: !247, line: 477, baseType: !544, size: 64, align: 64, offset: 322560)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !291, file: !247, line: 478, baseType: !557, size: 32768, align: 32, offset: 322624)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 32768, align: 32, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 1024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !291, file: !247, line: 479, baseType: !557, size: 32768, align: 32, offset: 355392)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !291, file: !247, line: 480, baseType: !271, size: 32, align: 32, offset: 388160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !291, file: !247, line: 481, baseType: !544, size: 64, align: 64, offset: 388224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !291, file: !247, line: 482, baseType: !544, size: 64, align: 64, offset: 388288)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !291, file: !247, line: 483, baseType: !544, size: 64, align: 64, offset: 388352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !291, file: !247, line: 484, baseType: !544, size: 64, align: 64, offset: 388416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !291, file: !247, line: 485, baseType: !544, size: 64, align: 64, offset: 388480)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !291, file: !247, line: 486, baseType: !557, size: 32768, align: 32, offset: 388544)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !291, file: !247, line: 490, baseType: !569, size: 64, align: 64, offset: 421312)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !570, line: 149, baseType: !266)
!570 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!571 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !291, file: !247, line: 491, baseType: !569, size: 64, align: 64, offset: 421376)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !291, file: !247, line: 492, baseType: !573, size: 128, align: 16, offset: 421440)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, align: 16, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !291, file: !247, line: 493, baseType: !577, size: 256, align: 32, offset: 421568)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 256, align: 32, elements: !574)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !291, file: !247, line: 495, baseType: !382, size: 64, align: 64, offset: 421824)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !291, file: !247, line: 495, baseType: !382, size: 64, align: 64, offset: 421888)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !291, file: !247, line: 508, baseType: !271, size: 32, align: 32, offset: 421952)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !291, file: !247, line: 513, baseType: !483, size: 64, align: 64, offset: 422016)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !291, file: !247, line: 514, baseType: !483, size: 64, align: 64, offset: 422080)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !291, file: !247, line: 515, baseType: !483, size: 64, align: 64, offset: 422144)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !291, file: !247, line: 516, baseType: !483, size: 64, align: 64, offset: 422208)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !291, file: !247, line: 517, baseType: !586, size: 192, align: 16, offset: 422272)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 192, align: 16, elements: !587)
!587 = !{!416, !420}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !291, file: !247, line: 518, baseType: !586, size: 192, align: 16, offset: 422464)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !291, file: !247, line: 521, baseType: !590, size: 64, align: 64, offset: 422656)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !247, line: 98, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !594, !272, !271, !382, !271}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !291, file: !247, line: 522, baseType: !597, size: 64, align: 64, offset: 422720)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !247, line: 114, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !594, !271, !601, !272, !271, !382, !271}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !291, file: !247, line: 523, baseType: !603, size: 64, align: 64, offset: 422784)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !247, line: 133, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !380, !594, !271, !601, !601, !272, !271}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !291, file: !247, line: 524, baseType: !608, size: 64, align: 64, offset: 422848)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !247, line: 169, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !380, !594, !601, !601, !594, !272, !271, !271, !271}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !291, file: !247, line: 525, baseType: !613, size: 64, align: 64, offset: 422912)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !247, line: 202, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !380, !601, !601, !601, !601, !272, !271, !271, !271, !271}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !291, file: !247, line: 526, baseType: !618, size: 64, align: 64, offset: 422976)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !247, line: 234, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !380, !594, !601, !271, !594, !601, !601, !271, !601, !272, !271, !271}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !291, file: !247, line: 527, baseType: !623, size: 64, align: 64, offset: 423040)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !247, line: 268, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !380, !594, !601, !271, !594, !601, !601, !271, !601, !385, !271, !271}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !291, file: !247, line: 530, baseType: !628, size: 64, align: 64, offset: 423104)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !272, !382, !382, !382, !271, !269}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !291, file: !247, line: 533, baseType: !628, size: 64, align: 64, offset: 423168)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !291, file: !247, line: 536, baseType: !633, size: 64, align: 64, offset: 423232)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !272, !272, !382, !382, !382, !271, !269}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !291, file: !247, line: 545, baseType: !637, size: 64, align: 64, offset: 423296)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !272, !381, !271, !490}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !291, file: !247, line: 546, baseType: !641, size: 64, align: 64, offset: 423360)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !272, !272, !381, !271, !490}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !291, file: !247, line: 548, baseType: !637, size: 64, align: 64, offset: 423424)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !291, file: !247, line: 570, baseType: !646, size: 64, align: 64, offset: 423488)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !380, !483, !271, !382, !271, !271}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !291, file: !247, line: 573, baseType: !650, size: 64, align: 64, offset: 423552)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !380, !483, !483, !271, !382, !382, !271, !271}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !291, file: !247, line: 610, baseType: !654, size: 64, align: 64, offset: 423616)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !380, !483, !271, !382, !594, !657, !271}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !291, file: !247, line: 613, baseType: !654, size: 64, align: 64, offset: 423680)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !291, file: !247, line: 619, baseType: !661, size: 64, align: 64, offset: 423744)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !483, !271}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !291, file: !247, line: 621, baseType: !665, size: 64, align: 64, offset: 423808)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !483, !483, !271}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !291, file: !247, line: 623, baseType: !271, size: 32, align: 32, offset: 423872)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !291, file: !247, line: 625, baseType: !670, size: 32, align: 32, offset: 423904)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !247, line: 73, baseType: !246)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !291, file: !247, line: 627, baseType: !672, size: 32, align: 32, offset: 423936)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !247, line: 80, baseType: !256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFilter", file: !675, line: 120, baseType: !676)
!675 = !DIFile(filename: "libswscale/swscale.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilter", file: !675, line: 115, size: 256, align: 64, elements: !677)
!677 = !{!678, !686, !687, !688}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lumH", scope: !676, file: !675, line: 116, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsVector", file: !675, line: 112, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsVector", file: !675, line: 109, size: 128, align: 64, elements: !682)
!682 = !{!683, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !681, file: !675, line: 110, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !681, file: !675, line: 111, baseType: !271, size: 32, align: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lumV", scope: !676, file: !675, line: 117, baseType: !679, size: 64, align: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "chrH", scope: !676, file: !675, line: 118, baseType: !679, size: 64, align: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chrV", scope: !676, file: !675, line: 119, baseType: !679, size: 64, align: 64, offset: 192)
!689 = !{}
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!691 = distinct !DIGlobalVariable(name: "default_param", scope: !692, file: !286, line: 2377, type: !697, isLocal: true, isDefinition: true, variable: [2 x double]* @sws_getCachedContext.default_param)
!692 = distinct !DISubprogram(name: "sws_getCachedContext", scope: !286, file: !286, line: 2369, type: !693, isLocal: false, isDefinition: true, scopeLine: 2376, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!693 = !DISubroutineType(types: !694)
!694 = !{!380, !380, !271, !271, !3, !271, !271, !3, !271, !673, !673, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 128, align: 64, elements: !411)
!698 = distinct !DIGlobalVariable(name: "format_entries", scope: !0, file: !286, line: 98, type: !699, isLocal: true, isDefinition: true, variable: [191 x %struct.FormatEntry]* @format_entries)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 1528, align: 8, elements: !707)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "FormatEntry", file: !286, line: 96, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FormatEntry", file: !286, line: 92, size: 8, align: 8, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "is_supported_in", scope: !702, file: !286, line: 93, baseType: !273, size: 1, align: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "is_supported_out", scope: !702, file: !286, line: 94, baseType: !273, size: 1, align: 8, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "is_supported_endianness", scope: !702, file: !286, line: 95, baseType: !273, size: 1, align: 8, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!707 = !{!708}
!708 = !DISubrange(count: 191)
!709 = distinct !DIGlobalVariable(name: "map", scope: !710, file: !286, line: 737, type: !715, isLocal: true, isDefinition: true, variable: [280 x i8]* @fill_rgb2yuv_table.map)
!710 = distinct !DISubprogram(name: "fill_rgb2yuv_table", scope: !286, file: !286, line: 726, type: !711, isLocal: true, isDefinition: true, scopeLine: 727, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !289, !713, !271}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 2240, align: 8, elements: !719)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !265, line: 36, baseType: !718)
!718 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!719 = !{!720}
!720 = !DISubrange(count: 280)
!721 = distinct !DIGlobalVariable(name: "xyz2rgb_matrix", scope: !722, file: !286, line: 827, type: !725, isLocal: true, isDefinition: true, variable: [3 x [4 x i16]]* @fill_xyztables.xyz2rgb_matrix)
!722 = distinct !DISubprogram(name: "fill_xyztables", scope: !286, file: !286, line: 820, type: !723, isLocal: true, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !380}
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 192, align: 16, elements: !587)
!726 = distinct !DIGlobalVariable(name: "rgb2xyz_matrix", scope: !722, file: !286, line: 831, type: !725, isLocal: true, isDefinition: true, variable: [3 x [4 x i16]]* @fill_xyztables.rgb2xyz_matrix)
!727 = distinct !DIGlobalVariable(name: "xyzgamma_tab", scope: !722, file: !286, line: 835, type: !728, isLocal: true, isDefinition: true, variable: [4096 x i16]* @fill_xyztables.xyzgamma_tab)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 65536, align: 16, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 4096)
!731 = distinct !DIGlobalVariable(name: "rgbgamma_tab", scope: !722, file: !286, line: 835, type: !728, isLocal: true, isDefinition: true, variable: [4096 x i16]* @fill_xyztables.rgbgamma_tab)
!732 = distinct !DIGlobalVariable(name: "xyzgammainv_tab", scope: !722, file: !286, line: 835, type: !728, isLocal: true, isDefinition: true, variable: [4096 x i16]* @fill_xyztables.xyzgammainv_tab)
!733 = distinct !DIGlobalVariable(name: "rgbgammainv_tab", scope: !722, file: !286, line: 835, type: !728, isLocal: true, isDefinition: true, variable: [4096 x i16]* @fill_xyztables.rgbgammainv_tab)
!734 = distinct !DIGlobalVariable(name: "scale_algorithms", scope: !0, file: !286, line: 315, type: !735, isLocal: true, isDefinition: true, variable: [11 x %struct.ScaleAlgorithm]* @scale_algorithms)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 2112, align: 64, elements: !743)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScaleAlgorithm", file: !286, line: 313, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !286, line: 309, size: 192, align: 64, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !738, file: !286, line: 310, baseType: !271, size: 32, align: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !738, file: !286, line: 311, baseType: !300, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "size_factor", scope: !738, file: !286, line: 312, baseType: !271, size: 32, align: 32, offset: 128)
!743 = !{!744}
!744 = !DISubrange(count: 11)
!745 = !{i32 2, !"Dwarf Version", i32 4}
!746 = !{i32 2, !"Debug Info Version", i32 3}
!747 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!748 = distinct !DISubprogram(name: "swscale_version", scope: !286, file: !286, line: 75, type: !749, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!749 = !DISubroutineType(types: !750)
!750 = !{!263}
!751 = !DILocation(line: 77, column: 5, scope: !748)
!752 = distinct !{!752, !751}
!753 = !DILocation(line: 77, column: 95, scope: !754)
!754 = !DILexicalBlockFile(scope: !755, file: !286, discriminator: 1)
!755 = distinct !DILexicalBlock(scope: !748, file: !286, line: 77, column: 8)
!756 = !DILocation(line: 78, column: 5, scope: !748)
!757 = distinct !DISubprogram(name: "swscale_configuration", scope: !286, file: !286, line: 81, type: !758, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!758 = !DISubroutineType(types: !759)
!759 = !{!300}
!760 = !DILocation(line: 83, column: 5, scope: !757)
!761 = distinct !DISubprogram(name: "swscale_license", scope: !286, file: !286, line: 86, type: !758, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!762 = !DILocation(line: 89, column: 5, scope: !761)
!763 = distinct !DISubprogram(name: "sws_isSupportedInput", scope: !286, file: !286, line: 269, type: !764, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!764 = !DISubroutineType(types: !765)
!765 = !{!271, !3}
!766 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !763, file: !286, line: 269, type: !3)
!767 = !DIExpression()
!768 = !DILocation(line: 269, column: 45, scope: !763)
!769 = !DILocation(line: 271, column: 22, scope: !763)
!770 = !DILocation(line: 271, column: 30, scope: !763)
!771 = !DILocation(line: 271, column: 12, scope: !763)
!772 = !DILocation(line: 272, column: 27, scope: !763)
!773 = !DILocation(line: 272, column: 12, scope: !763)
!774 = !DILocation(line: 272, column: 36, scope: !763)
!775 = !DILocation(line: 271, column: 12, scope: !776)
!776 = !DILexicalBlockFile(scope: !763, file: !286, discriminator: 1)
!777 = !DILocation(line: 271, column: 12, scope: !778)
!778 = !DILexicalBlockFile(scope: !763, file: !286, discriminator: 2)
!779 = !DILocation(line: 271, column: 12, scope: !780)
!780 = !DILexicalBlockFile(scope: !763, file: !286, discriminator: 3)
!781 = !DILocation(line: 271, column: 5, scope: !780)
!782 = distinct !DISubprogram(name: "sws_isSupportedOutput", scope: !286, file: !286, line: 275, type: !764, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!783 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !782, file: !286, line: 275, type: !3)
!784 = !DILocation(line: 275, column: 46, scope: !782)
!785 = !DILocation(line: 277, column: 22, scope: !782)
!786 = !DILocation(line: 277, column: 30, scope: !782)
!787 = !DILocation(line: 277, column: 12, scope: !782)
!788 = !DILocation(line: 278, column: 27, scope: !782)
!789 = !DILocation(line: 278, column: 12, scope: !782)
!790 = !DILocation(line: 278, column: 36, scope: !782)
!791 = !DILocation(line: 277, column: 12, scope: !792)
!792 = !DILexicalBlockFile(scope: !782, file: !286, discriminator: 1)
!793 = !DILocation(line: 277, column: 12, scope: !794)
!794 = !DILexicalBlockFile(scope: !782, file: !286, discriminator: 2)
!795 = !DILocation(line: 277, column: 12, scope: !796)
!796 = !DILexicalBlockFile(scope: !782, file: !286, discriminator: 3)
!797 = !DILocation(line: 277, column: 5, scope: !796)
!798 = distinct !DISubprogram(name: "sws_isSupportedEndiannessConversion", scope: !286, file: !286, line: 281, type: !764, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!799 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !798, file: !286, line: 281, type: !3)
!800 = !DILocation(line: 281, column: 60, scope: !798)
!801 = !DILocation(line: 283, column: 22, scope: !798)
!802 = !DILocation(line: 283, column: 30, scope: !798)
!803 = !DILocation(line: 283, column: 12, scope: !798)
!804 = !DILocation(line: 284, column: 27, scope: !798)
!805 = !DILocation(line: 284, column: 12, scope: !798)
!806 = !DILocation(line: 284, column: 36, scope: !798)
!807 = !DILocation(line: 283, column: 12, scope: !808)
!808 = !DILexicalBlockFile(scope: !798, file: !286, discriminator: 1)
!809 = !DILocation(line: 283, column: 12, scope: !810)
!810 = !DILexicalBlockFile(scope: !798, file: !286, discriminator: 2)
!811 = !DILocation(line: 283, column: 12, scope: !812)
!812 = !DILexicalBlockFile(scope: !798, file: !286, discriminator: 3)
!813 = !DILocation(line: 283, column: 5, scope: !812)
!814 = distinct !DISubprogram(name: "sws_setColorspaceDetails", scope: !286, file: !286, line: 856, type: !815, isLocal: false, isDefinition: true, scopeLine: 859, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!815 = !DISubroutineType(types: !816)
!816 = !{!271, !380, !713, !271, !713, !271, !271, !271, !271}
!817 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !818, file: !247, line: 699, type: !3)
!818 = distinct !DISubprogram(name: "isGray", scope: !247, file: !247, line: 699, type: !764, isLocal: true, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!819 = !DILocation(line: 699, column: 76, scope: !818, inlinedAt: !820)
!820 = distinct !DILocation(line: 908, column: 33, scope: !821)
!821 = !DILexicalBlockFile(scope: !822, file: !286, discriminator: 1)
!822 = distinct !DILexicalBlock(scope: !814, file: !286, line: 908, column: 9)
!823 = !DILocalVariable(name: "desc", scope: !818, file: !247, line: 701, type: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !827, line: 123, baseType: !828)
!827 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !827, line: 81, size: 1280, align: 64, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !848}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !827, line: 82, baseType: !300, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !828, file: !827, line: 83, baseType: !273, size: 8, align: 8, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !828, file: !827, line: 92, baseType: !273, size: 8, align: 8, offset: 72)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !828, file: !827, line: 101, baseType: !273, size: 8, align: 8, offset: 80)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !827, line: 106, baseType: !544, size: 64, align: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !828, file: !827, line: 117, baseType: !836, size: 1024, align: 32, offset: 192)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 1024, align: 32, elements: !419)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !827, line: 70, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !827, line: 31, size: 256, align: 32, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !838, file: !827, line: 35, baseType: !271, size: 32, align: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !838, file: !827, line: 41, baseType: !271, size: 32, align: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !838, file: !827, line: 47, baseType: !271, size: 32, align: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !838, file: !827, line: 53, baseType: !271, size: 32, align: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !838, file: !827, line: 58, baseType: !271, size: 32, align: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !838, file: !827, line: 62, baseType: !271, size: 32, align: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !838, file: !827, line: 65, baseType: !271, size: 32, align: 32, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !838, file: !827, line: 68, baseType: !271, size: 32, align: 32, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !828, file: !827, line: 122, baseType: !300, size: 64, align: 64, offset: 1216)
!849 = !DILocation(line: 701, column: 31, scope: !818, inlinedAt: !820)
!850 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !851, file: !247, line: 667, type: !3)
!851 = distinct !DISubprogram(name: "isYUV", scope: !247, file: !247, line: 667, type: !764, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!852 = !DILocation(line: 667, column: 75, scope: !851, inlinedAt: !853)
!853 = distinct !DILocation(line: 908, column: 10, scope: !822)
!854 = !DILocalVariable(name: "desc", scope: !851, file: !247, line: 669, type: !824)
!855 = !DILocation(line: 669, column: 31, scope: !851, inlinedAt: !853)
!856 = !DILocation(line: 667, column: 75, scope: !851, inlinedAt: !857)
!857 = distinct !DILocation(line: 908, column: 59, scope: !858)
!858 = !DILexicalBlockFile(scope: !822, file: !286, discriminator: 2)
!859 = !DILocation(line: 669, column: 31, scope: !851, inlinedAt: !857)
!860 = !DILocation(line: 667, column: 75, scope: !851, inlinedAt: !861)
!861 = distinct !DILocation(line: 896, column: 44, scope: !862)
!862 = !DILexicalBlockFile(scope: !863, file: !286, discriminator: 2)
!863 = distinct !DILexicalBlock(scope: !814, file: !286, line: 896, column: 9)
!864 = !DILocation(line: 669, column: 31, scope: !851, inlinedAt: !861)
!865 = !DILocation(line: 699, column: 76, scope: !818, inlinedAt: !866)
!866 = distinct !DILocation(line: 870, column: 33, scope: !867)
!867 = !DILexicalBlockFile(scope: !868, file: !286, discriminator: 1)
!868 = distinct !DILexicalBlock(scope: !814, file: !286, line: 870, column: 8)
!869 = !DILocation(line: 701, column: 31, scope: !818, inlinedAt: !866)
!870 = !DILocation(line: 667, column: 75, scope: !851, inlinedAt: !871)
!871 = distinct !DILocation(line: 870, column: 9, scope: !868)
!872 = !DILocation(line: 669, column: 31, scope: !851, inlinedAt: !871)
!873 = !DILocation(line: 699, column: 76, scope: !818, inlinedAt: !874)
!874 = distinct !DILocation(line: 868, column: 33, scope: !875)
!875 = !DILexicalBlockFile(scope: !876, file: !286, discriminator: 1)
!876 = distinct !DILexicalBlock(scope: !814, file: !286, line: 868, column: 8)
!877 = !DILocation(line: 701, column: 31, scope: !818, inlinedAt: !874)
!878 = !DILocation(line: 667, column: 75, scope: !851, inlinedAt: !879)
!879 = distinct !DILocation(line: 868, column: 9, scope: !876)
!880 = !DILocation(line: 669, column: 31, scope: !851, inlinedAt: !879)
!881 = !DILocation(line: 699, column: 76, scope: !818, inlinedAt: !882)
!882 = distinct !DILocation(line: 908, column: 82, scope: !883)
!883 = !DILexicalBlockFile(scope: !822, file: !286, discriminator: 3)
!884 = !DILocation(line: 701, column: 31, scope: !818, inlinedAt: !882)
!885 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !886, file: !247, line: 653, type: !3)
!886 = distinct !DISubprogram(name: "isNBPS", scope: !247, file: !247, line: 653, type: !764, isLocal: true, isDefinition: true, scopeLine: 654, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !689)
!887 = !DILocation(line: 653, column: 76, scope: !886, inlinedAt: !888)
!888 = distinct !DILocation(line: 921, column: 17, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !286, line: 921, column: 17)
!890 = distinct !DILexicalBlock(scope: !891, file: !286, line: 911, column: 55)
!891 = distinct !DILexicalBlock(scope: !892, file: !286, line: 909, column: 13)
!892 = distinct !DILexicalBlock(scope: !822, file: !286, line: 908, column: 105)
!893 = !DILocalVariable(name: "desc", scope: !886, file: !247, line: 655, type: !824)
!894 = !DILocation(line: 655, column: 31, scope: !886, inlinedAt: !888)
!895 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !896, file: !247, line: 646, type: !3)
