; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--yuv2rgb.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--yuv2rgb.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!246 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!247 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !246, line: 51, baseType: !251)
!251 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !246, line: 49, baseType: !254)
!254 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!255 = !{!256}
!256 = distinct !DIGlobalVariable(name: "ff_yuv2rgb_coeffs", scope: !0, file: !257, line: 49, type: !258, isLocal: false, isDefinition: true, variable: [11 x [4 x i32]]* @ff_yuv2rgb_coeffs)
!257 = !DIFile(filename: "libswscale/yuv2rgb.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 1408, align: 32, elements: !262)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !242, line: 196, baseType: !261)
!261 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!262 = !{!263, !264}
!263 = !DISubrange(count: 11)
!264 = !DISubrange(count: 4)
!265 = !{i32 2, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!268 = distinct !DISubprogram(name: "sws_getCoefficients", scope: !257, file: !257, line: 63, type: !269, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !261}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!273 = !{}
!274 = !DILocalVariable(name: "colorspace", arg: 1, scope: !268, file: !257, line: 63, type: !261)
!275 = !DIExpression()
!276 = !DILocation(line: 63, column: 36, scope: !268)
!277 = !DILocation(line: 65, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !268, file: !257, line: 65, column: 9)
!279 = !DILocation(line: 65, column: 20, scope: !278)
!280 = !DILocation(line: 65, column: 25, scope: !278)
!281 = !DILocation(line: 65, column: 28, scope: !282)
!282 = !DILexicalBlockFile(scope: !278, file: !257, discriminator: 1)
!283 = !DILocation(line: 65, column: 39, scope: !282)
!284 = !DILocation(line: 65, column: 43, scope: !282)
!285 = !DILocation(line: 65, column: 46, scope: !286)
!286 = !DILexicalBlockFile(scope: !278, file: !257, discriminator: 2)
!287 = !DILocation(line: 65, column: 57, scope: !286)
!288 = !DILocation(line: 65, column: 9, scope: !286)
!289 = !DILocation(line: 66, column: 20, scope: !278)
!290 = !DILocation(line: 66, column: 9, scope: !278)
!291 = !DILocation(line: 67, column: 30, scope: !268)
!292 = !DILocation(line: 67, column: 12, scope: !268)
!293 = !DILocation(line: 67, column: 5, scope: !268)
!294 = distinct !DISubprogram(name: "ff_yuv2rgb_get_func_ptr", scope: !257, file: !257, line: 678, type: !295, isLocal: false, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !433}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!261, !301, !608, !486, !261, !261, !417, !486}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !303)
!303 = !{!304, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !377, !381, !384, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !397, !398, !419, !435, !439, !440, !443, !444, !445, !446, !447, !448, !449, !451, !452, !453, !454, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !476, !478, !479, !480, !484, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !525, !526, !527, !528, !529, !530, !531, !532, !533, !537, !538, !542, !544, !547, !548, !549, !550, !551, !552, !553, !556, !557, !564, !570, !575, !580, !585, !590, !595, !599, !600, !604, !609, !613, !614, !618, !622, !627, !628, !632, !636, !637, !639}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !302, file: !225, line: 284, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !309)
!309 = !{!310, !314, !318, !322, !323, !324, !325, !329, !335, !337, !341}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !308, file: !4, line: 72, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !308, file: !4, line: 78, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!311, !248}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !308, file: !4, line: 85, baseType: !319, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !308, file: !4, line: 93, baseType: !261, size: 32, align: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !308, file: !4, line: 99, baseType: !261, size: 32, align: 32, offset: 224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !308, file: !4, line: 108, baseType: !261, size: 32, align: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !308, file: !4, line: 113, baseType: !326, size: 64, align: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!248, !248, !248}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !308, file: !4, line: 123, baseType: !330, size: 64, align: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !308, file: !4, line: 130, baseType: !336, size: 32, align: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !308, file: !4, line: 136, baseType: !338, size: 64, align: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!336, !248}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !308, file: !4, line: 142, baseType: !342, size: 64, align: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!261, !345, !248, !311, !261}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !302, file: !225, line: 290, baseType: !297, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !302, file: !225, line: 291, baseType: !261, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !302, file: !225, line: 292, baseType: !261, size: 32, align: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !302, file: !225, line: 293, baseType: !261, size: 32, align: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !302, file: !225, line: 294, baseType: !261, size: 32, align: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !302, file: !225, line: 295, baseType: !261, size: 32, align: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !302, file: !225, line: 296, baseType: !261, size: 32, align: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !302, file: !225, line: 297, baseType: !261, size: 32, align: 32, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !302, file: !225, line: 298, baseType: !261, size: 32, align: 32, offset: 352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !302, file: !225, line: 298, baseType: !261, size: 32, align: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !302, file: !225, line: 299, baseType: !261, size: 32, align: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !302, file: !225, line: 299, baseType: !261, size: 32, align: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !302, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !302, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !302, file: !225, line: 302, baseType: !261, size: 32, align: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !302, file: !225, line: 303, baseType: !261, size: 32, align: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !302, file: !225, line: 304, baseType: !261, size: 32, align: 32, offset: 608)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !302, file: !225, line: 304, baseType: !261, size: 32, align: 32, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !302, file: !225, line: 305, baseType: !261, size: 32, align: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !302, file: !225, line: 306, baseType: !261, size: 32, align: 32, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !302, file: !225, line: 307, baseType: !261, size: 32, align: 32, offset: 736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !302, file: !225, line: 308, baseType: !261, size: 32, align: 32, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !302, file: !225, line: 309, baseType: !261, size: 32, align: 32, offset: 800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !302, file: !225, line: 310, baseType: !261, size: 32, align: 32, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !302, file: !225, line: 311, baseType: !373, size: 128, align: 64, offset: 896)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 128, align: 64, elements: !375)
!374 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!375 = !{!376}
!376 = !DISubrange(count: 2)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !302, file: !225, line: 317, baseType: !378, size: 192, align: 64, offset: 1024)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 192, align: 64, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 3)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !302, file: !225, line: 318, baseType: !382, size: 128, align: 32, offset: 1216)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, align: 32, elements: !383)
!383 = !{!264}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !302, file: !225, line: 319, baseType: !385, size: 256, align: 64, offset: 1344)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 256, align: 64, elements: !383)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !302, file: !225, line: 320, baseType: !382, size: 128, align: 32, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !302, file: !225, line: 321, baseType: !385, size: 256, align: 64, offset: 1728)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !302, file: !225, line: 322, baseType: !261, size: 32, align: 32, offset: 1984)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !302, file: !225, line: 324, baseType: !374, size: 64, align: 64, offset: 2048)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !302, file: !225, line: 325, baseType: !261, size: 32, align: 32, offset: 2112)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !302, file: !225, line: 326, baseType: !261, size: 32, align: 32, offset: 2144)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !302, file: !225, line: 327, baseType: !252, size: 64, align: 64, offset: 2176)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !302, file: !225, line: 328, baseType: !252, size: 64, align: 64, offset: 2240)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !302, file: !225, line: 330, baseType: !261, size: 32, align: 32, offset: 2304)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !302, file: !225, line: 331, baseType: !396, size: 64, align: 32, offset: 2336)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 64, align: 32, elements: !375)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !302, file: !225, line: 332, baseType: !261, size: 32, align: 32, offset: 2400)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !302, file: !225, line: 333, baseType: !399, size: 64, align: 64, offset: 2432)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !400, file: !225, line: 945, baseType: !261, size: 32, align: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !400, file: !225, line: 946, baseType: !261, size: 32, align: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !400, file: !225, line: 947, baseType: !261, size: 32, align: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !400, file: !225, line: 948, baseType: !261, size: 32, align: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !400, file: !225, line: 949, baseType: !261, size: 32, align: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !400, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !400, file: !225, line: 951, baseType: !409, size: 1024, align: 64, offset: 192)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 1024, align: 64, elements: !383)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !412)
!412 = !{!413, !414, !415, !416, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !411, file: !225, line: 931, baseType: !261, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !411, file: !225, line: 932, baseType: !261, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !411, file: !225, line: 933, baseType: !261, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !411, file: !225, line: 934, baseType: !417, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !411, file: !225, line: 935, baseType: !417, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !302, file: !225, line: 334, baseType: !420, size: 64, align: 64, offset: 2496)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !422)
!422 = !{!423, !426, !427, !428, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !421, file: !225, line: 960, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !400)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !421, file: !225, line: 961, baseType: !424, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !421, file: !225, line: 963, baseType: !261, size: 32, align: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !421, file: !225, line: 964, baseType: !248, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !421, file: !225, line: 967, baseType: !430, size: 64, align: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!261, !433, !420, !261, !261}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !302)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !302, file: !225, line: 336, baseType: !436, size: 8192, align: 32, offset: 2560)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 8192, align: 32, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !302, file: !225, line: 337, baseType: !436, size: 8192, align: 32, offset: 10752)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !302, file: !225, line: 339, baseType: !441, size: 8192, align: 32, offset: 18944)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 8192, align: 32, elements: !437)
!442 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !302, file: !225, line: 351, baseType: !261, size: 32, align: 32, offset: 27136)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !302, file: !225, line: 352, baseType: !261, size: 32, align: 32, offset: 27168)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !302, file: !225, line: 353, baseType: !261, size: 32, align: 32, offset: 27200)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !302, file: !225, line: 354, baseType: !261, size: 32, align: 32, offset: 27232)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !302, file: !225, line: 357, baseType: !244, size: 64, align: 64, offset: 27264)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !302, file: !225, line: 358, baseType: !261, size: 32, align: 32, offset: 27328)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !302, file: !225, line: 374, baseType: !450, size: 64, align: 64, offset: 27392)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !302, file: !225, line: 375, baseType: !450, size: 64, align: 64, offset: 27456)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !302, file: !225, line: 376, baseType: !450, size: 64, align: 64, offset: 27520)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !302, file: !225, line: 377, baseType: !450, size: 64, align: 64, offset: 27584)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !302, file: !225, line: 378, baseType: !455, size: 64, align: 64, offset: 27648)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !302, file: !225, line: 379, baseType: !455, size: 64, align: 64, offset: 27712)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !302, file: !225, line: 380, baseType: !455, size: 64, align: 64, offset: 27776)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !302, file: !225, line: 381, baseType: !455, size: 64, align: 64, offset: 27840)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !302, file: !225, line: 382, baseType: !261, size: 32, align: 32, offset: 27904)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !302, file: !225, line: 383, baseType: !261, size: 32, align: 32, offset: 27936)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !302, file: !225, line: 384, baseType: !261, size: 32, align: 32, offset: 27968)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !302, file: !225, line: 385, baseType: !261, size: 32, align: 32, offset: 28000)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !302, file: !225, line: 388, baseType: !261, size: 32, align: 32, offset: 28032)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !302, file: !225, line: 389, baseType: !261, size: 32, align: 32, offset: 28064)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !302, file: !225, line: 390, baseType: !244, size: 64, align: 64, offset: 28096)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !302, file: !225, line: 391, baseType: !244, size: 64, align: 64, offset: 28160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !302, file: !225, line: 393, baseType: !261, size: 32, align: 32, offset: 28224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !302, file: !225, line: 394, baseType: !261, size: 32, align: 32, offset: 28256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !302, file: !225, line: 396, baseType: !261, size: 32, align: 32, offset: 28288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !225, line: 397, baseType: !261, size: 32, align: 32, offset: 28320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !302, file: !225, line: 398, baseType: !248, size: 64, align: 64, offset: 28352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !302, file: !225, line: 401, baseType: !473, size: 40960, align: 32, offset: 28416)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 40960, align: 32, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !302, file: !225, line: 402, baseType: !477, size: 81920, align: 64, offset: 69376)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 81920, align: 64, elements: !474)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !302, file: !225, line: 403, baseType: !477, size: 81920, align: 64, offset: 151296)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !302, file: !225, line: 404, baseType: !477, size: 81920, align: 64, offset: 233216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !302, file: !225, line: 405, baseType: !481, size: 5632, align: 32, offset: 315136)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 5632, align: 32, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !302, file: !225, line: 417, baseType: !485, size: 256, align: 64, offset: 320768)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 256, align: 64, elements: !383)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !302, file: !225, line: 420, baseType: !261, size: 32, align: 32, offset: 321024)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !302, file: !225, line: 420, baseType: !261, size: 32, align: 32, offset: 321056)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !302, file: !225, line: 420, baseType: !261, size: 32, align: 32, offset: 321088)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !302, file: !225, line: 421, baseType: !382, size: 128, align: 32, offset: 321120)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !302, file: !225, line: 422, baseType: !382, size: 128, align: 32, offset: 321248)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !302, file: !225, line: 423, baseType: !261, size: 32, align: 32, offset: 321376)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !302, file: !225, line: 424, baseType: !261, size: 32, align: 32, offset: 321408)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !302, file: !225, line: 425, baseType: !261, size: 32, align: 32, offset: 321440)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !302, file: !225, line: 426, baseType: !261, size: 32, align: 32, offset: 321472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !302, file: !225, line: 427, baseType: !261, size: 32, align: 32, offset: 321504)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !302, file: !225, line: 428, baseType: !261, size: 32, align: 32, offset: 321536)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !302, file: !225, line: 429, baseType: !261, size: 32, align: 32, offset: 321568)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !302, file: !225, line: 430, baseType: !261, size: 32, align: 32, offset: 321600)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !302, file: !225, line: 431, baseType: !261, size: 32, align: 32, offset: 321632)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !302, file: !225, line: 432, baseType: !261, size: 32, align: 32, offset: 321664)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !302, file: !225, line: 433, baseType: !261, size: 32, align: 32, offset: 321696)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !302, file: !225, line: 434, baseType: !261, size: 32, align: 32, offset: 321728)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !302, file: !225, line: 435, baseType: !261, size: 32, align: 32, offset: 321760)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !302, file: !225, line: 436, baseType: !261, size: 32, align: 32, offset: 321792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !302, file: !225, line: 437, baseType: !261, size: 32, align: 32, offset: 321824)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !302, file: !225, line: 438, baseType: !261, size: 32, align: 32, offset: 321856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !302, file: !225, line: 466, baseType: !509, size: 64, align: 64, offset: 321920)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !246, line: 55, baseType: !510)
!510 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !302, file: !225, line: 467, baseType: !509, size: 64, align: 64, offset: 321984)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !302, file: !225, line: 468, baseType: !509, size: 64, align: 64, offset: 322048)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !302, file: !225, line: 470, baseType: !509, size: 64, align: 64, offset: 322112)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !302, file: !225, line: 471, baseType: !509, size: 64, align: 64, offset: 322176)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !302, file: !225, line: 472, baseType: !509, size: 64, align: 64, offset: 322240)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !302, file: !225, line: 473, baseType: !509, size: 64, align: 64, offset: 322304)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !302, file: !225, line: 474, baseType: !509, size: 64, align: 64, offset: 322368)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !302, file: !225, line: 475, baseType: !509, size: 64, align: 64, offset: 322432)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !302, file: !225, line: 476, baseType: !509, size: 64, align: 64, offset: 322496)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !302, file: !225, line: 477, baseType: !509, size: 64, align: 64, offset: 322560)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !302, file: !225, line: 478, baseType: !522, size: 32768, align: 32, offset: 322624)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32768, align: 32, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 1024)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !302, file: !225, line: 479, baseType: !522, size: 32768, align: 32, offset: 355392)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !302, file: !225, line: 480, baseType: !261, size: 32, align: 32, offset: 388160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !302, file: !225, line: 481, baseType: !509, size: 64, align: 64, offset: 388224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !302, file: !225, line: 482, baseType: !509, size: 64, align: 64, offset: 388288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !302, file: !225, line: 483, baseType: !509, size: 64, align: 64, offset: 388352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !302, file: !225, line: 484, baseType: !509, size: 64, align: 64, offset: 388416)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !302, file: !225, line: 485, baseType: !509, size: 64, align: 64, offset: 388480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !302, file: !225, line: 486, baseType: !522, size: 32768, align: 32, offset: 388544)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !302, file: !225, line: 490, baseType: !534, size: 64, align: 64, offset: 421312)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !535, line: 149, baseType: !536)
!535 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!536 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !302, file: !225, line: 491, baseType: !534, size: 64, align: 64, offset: 421376)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !302, file: !225, line: 492, baseType: !539, size: 128, align: 16, offset: 421440)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, align: 16, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !302, file: !225, line: 493, baseType: !543, size: 256, align: 32, offset: 421568)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 256, align: 32, elements: !540)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !302, file: !225, line: 495, baseType: !545, size: 64, align: 64, offset: 421824)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !302, file: !225, line: 495, baseType: !545, size: 64, align: 64, offset: 421888)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !302, file: !225, line: 508, baseType: !261, size: 32, align: 32, offset: 421952)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !302, file: !225, line: 513, baseType: !450, size: 64, align: 64, offset: 422016)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !302, file: !225, line: 514, baseType: !450, size: 64, align: 64, offset: 422080)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !302, file: !225, line: 515, baseType: !450, size: 64, align: 64, offset: 422144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !302, file: !225, line: 516, baseType: !450, size: 64, align: 64, offset: 422208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !302, file: !225, line: 517, baseType: !554, size: 192, align: 16, offset: 422272)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 192, align: 16, elements: !555)
!555 = !{!380, !264}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !302, file: !225, line: 518, baseType: !554, size: 192, align: 16, offset: 422464)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !302, file: !225, line: 521, baseType: !558, size: 64, align: 64, offset: 422656)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !562, !244, !261, !545, !261}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !302, file: !225, line: 522, baseType: !565, size: 64, align: 64, offset: 422720)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !562, !261, !569, !244, !261, !545, !261}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !302, file: !225, line: 523, baseType: !571, size: 64, align: 64, offset: 422784)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !301, !562, !261, !569, !569, !244, !261}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !302, file: !225, line: 524, baseType: !576, size: 64, align: 64, offset: 422848)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !301, !562, !569, !569, !562, !244, !261, !261, !261}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !302, file: !225, line: 525, baseType: !581, size: 64, align: 64, offset: 422912)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !301, !569, !569, !569, !569, !244, !261, !261, !261, !261}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !302, file: !225, line: 526, baseType: !586, size: 64, align: 64, offset: 422976)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !301, !562, !569, !261, !562, !569, !569, !261, !569, !244, !261, !261}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !302, file: !225, line: 527, baseType: !591, size: 64, align: 64, offset: 423040)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !301, !562, !569, !261, !562, !569, !569, !261, !569, !417, !261, !261}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !302, file: !225, line: 530, baseType: !596, size: 64, align: 64, offset: 423104)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !244, !545, !545, !545, !261, !249}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !302, file: !225, line: 533, baseType: !596, size: 64, align: 64, offset: 423168)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !302, file: !225, line: 536, baseType: !601, size: 64, align: 64, offset: 423232)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !244, !244, !545, !545, !545, !261, !249}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !302, file: !225, line: 545, baseType: !605, size: 64, align: 64, offset: 423296)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !244, !608, !261, !455}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !302, file: !225, line: 546, baseType: !610, size: 64, align: 64, offset: 423360)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !244, !244, !608, !261, !455}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !302, file: !225, line: 548, baseType: !605, size: 64, align: 64, offset: 423424)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !302, file: !225, line: 570, baseType: !615, size: 64, align: 64, offset: 423488)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !301, !450, !261, !545, !261, !261}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !302, file: !225, line: 573, baseType: !619, size: 64, align: 64, offset: 423552)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !301, !450, !450, !261, !545, !545, !261, !261}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !302, file: !225, line: 610, baseType: !623, size: 64, align: 64, offset: 423616)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !301, !450, !261, !545, !562, !626, !261}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !302, file: !225, line: 613, baseType: !623, size: 64, align: 64, offset: 423680)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !302, file: !225, line: 619, baseType: !629, size: 64, align: 64, offset: 423744)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !450, !261}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !302, file: !225, line: 621, baseType: !633, size: 64, align: 64, offset: 423808)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !450, !450, !261}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !302, file: !225, line: 623, baseType: !261, size: 32, align: 32, offset: 423872)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !302, file: !225, line: 625, baseType: !638, size: 32, align: 32, offset: 423904)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !302, file: !225, line: 627, baseType: !640, size: 32, align: 32, offset: 423936)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!641 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !642, file: !225, line: 776, type: !24)
!642 = distinct !DISubprogram(name: "isALPHA", scope: !225, file: !225, line: 776, type: !643, isLocal: true, isDefinition: true, scopeLine: 777, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!643 = !DISubroutineType(types: !644)
!644 = !{!261, !24}
!645 = !DILocation(line: 776, column: 77, scope: !642, inlinedAt: !646)
!646 = distinct !DILocation(line: 707, column: 22, scope: !647)
!647 = distinct !DILexicalBlock(scope: !294, file: !257, line: 694, column: 27)
!648 = !DILocalVariable(name: "desc", scope: !642, file: !225, line: 778, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !652, line: 123, baseType: !653)
!652 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !652, line: 81, size: 1280, align: 64, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !673}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !652, line: 82, baseType: !311, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !653, file: !652, line: 83, baseType: !245, size: 8, align: 8, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !653, file: !652, line: 92, baseType: !245, size: 8, align: 8, offset: 72)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !653, file: !652, line: 101, baseType: !245, size: 8, align: 8, offset: 80)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !653, file: !652, line: 106, baseType: !509, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !653, file: !652, line: 117, baseType: !661, size: 1024, align: 32, offset: 192)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 1024, align: 32, elements: !383)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !652, line: 70, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !652, line: 31, size: 256, align: 32, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !663, file: !652, line: 35, baseType: !261, size: 32, align: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !663, file: !652, line: 41, baseType: !261, size: 32, align: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !663, file: !652, line: 47, baseType: !261, size: 32, align: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !663, file: !652, line: 53, baseType: !261, size: 32, align: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !663, file: !652, line: 58, baseType: !261, size: 32, align: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !663, file: !652, line: 62, baseType: !261, size: 32, align: 32, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !663, file: !652, line: 65, baseType: !261, size: 32, align: 32, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !663, file: !652, line: 68, baseType: !261, size: 32, align: 32, offset: 224)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !653, file: !652, line: 122, baseType: !311, size: 64, align: 64, offset: 1216)
!674 = !DILocation(line: 778, column: 31, scope: !642, inlinedAt: !646)
!675 = !DILocation(line: 776, column: 77, scope: !642, inlinedAt: !676)
!676 = distinct !DILocation(line: 703, column: 18, scope: !677)
!677 = distinct !DILexicalBlock(scope: !647, file: !257, line: 703, column: 13)
!678 = !DILocation(line: 778, column: 31, scope: !642, inlinedAt: !676)
!679 = !DILocalVariable(name: "c", arg: 1, scope: !294, file: !257, line: 678, type: !433)
!680 = !DILocation(line: 678, column: 45, scope: !294)
!681 = !DILocalVariable(name: "t", scope: !294, file: !257, line: 680, type: !297)
!682 = !DILocation(line: 680, column: 13, scope: !294)
!683 = !DILocation(line: 685, column: 33, scope: !684)
!684 = distinct !DILexicalBlock(scope: !294, file: !257, line: 684, column: 9)
!685 = !DILocation(line: 685, column: 13, scope: !684)
!686 = !DILocation(line: 685, column: 11, scope: !684)
!687 = !DILocation(line: 687, column: 9, scope: !688)
!688 = distinct !DILexicalBlock(scope: !294, file: !257, line: 687, column: 9)
!689 = !DILocation(line: 687, column: 9, scope: !294)
!690 = !DILocation(line: 688, column: 16, scope: !688)
!691 = !DILocation(line: 688, column: 9, scope: !688)
!692 = !DILocation(line: 690, column: 12, scope: !294)
!693 = !DILocation(line: 692, column: 32, scope: !294)
!694 = !DILocation(line: 692, column: 35, scope: !294)
!695 = !DILocation(line: 692, column: 12, scope: !294)
!696 = !DILocation(line: 692, column: 67, scope: !294)
!697 = !DILocation(line: 692, column: 70, scope: !294)
!698 = !DILocation(line: 692, column: 47, scope: !699)
!699 = !DILexicalBlockFile(scope: !294, file: !257, discriminator: 1)
!700 = !DILocation(line: 690, column: 5, scope: !294)
!701 = !DILocation(line: 694, column: 13, scope: !294)
!702 = !DILocation(line: 694, column: 16, scope: !294)
!703 = !DILocation(line: 694, column: 5, scope: !294)
!704 = !DILocation(line: 697, column: 9, scope: !647)
!705 = !DILocation(line: 700, column: 9, scope: !647)
!706 = !DILocation(line: 703, column: 26, scope: !677)
!707 = !DILocation(line: 703, column: 29, scope: !677)
!708 = !DILocation(line: 703, column: 18, scope: !677)
!709 = !DILocation(line: 778, column: 58, scope: !642, inlinedAt: !676)
!710 = !DILocation(line: 778, column: 38, scope: !642, inlinedAt: !676)
!711 = !DILocation(line: 779, column: 16, scope: !712, inlinedAt: !676)
!712 = !DILexicalBlockFile(scope: !713, file: !225, discriminator: 1)
!713 = distinct !DILexicalBlock(scope: !714, file: !225, line: 779, column: 14)
!714 = distinct !DILexicalBlock(scope: !642, file: !225, line: 779, column: 8)
!715 = !DILocation(line: 779, column: 15, scope: !712, inlinedAt: !676)
!716 = !DILocation(line: 779, column: 14, scope: !712, inlinedAt: !676)
!717 = !DILocation(line: 779, column: 25, scope: !718, inlinedAt: !676)
!718 = !DILexicalBlockFile(scope: !719, file: !225, discriminator: 2)
!719 = distinct !DILexicalBlock(scope: !713, file: !225, line: 779, column: 23)
!720 = !DILocation(line: 779, column: 90, scope: !721, inlinedAt: !676)
!721 = !DILexicalBlockFile(scope: !718, file: !225, discriminator: 4)
!722 = !DILocation(line: 779, column: 90, scope: !718, inlinedAt: !676)
!723 = !DILocation(line: 780, column: 9, scope: !724, inlinedAt: !676)
!724 = distinct !DILexicalBlock(scope: !642, file: !225, line: 780, column: 9)
!725 = !DILocation(line: 780, column: 17, scope: !724, inlinedAt: !676)
!726 = !DILocation(line: 780, column: 9, scope: !642, inlinedAt: !676)
!727 = !DILocation(line: 781, column: 9, scope: !724, inlinedAt: !676)
!728 = !DILocation(line: 782, column: 12, scope: !642, inlinedAt: !676)
!729 = !DILocation(line: 782, column: 18, scope: !642, inlinedAt: !676)
!730 = !DILocation(line: 782, column: 24, scope: !642, inlinedAt: !676)
!731 = !DILocation(line: 782, column: 5, scope: !642, inlinedAt: !676)
!732 = !DILocation(line: 783, column: 1, scope: !642, inlinedAt: !676)
