; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--x86--yuv2rgb.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--x86--yuv2rgb.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!240 = !{!241, !247, !248, !249, !250, !251, !252, !261, !262, !263, !264}
!241 = distinct !DIGlobalVariable(name: "mmx_00ffw", scope: !0, file: !242, line: 45, type: !243, isLocal: true, isDefinition: true, variable: i64* @mmx_00ffw)
!242 = !DIFile(filename: "libswscale/x86/yuv2rgb.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !245, line: 55, baseType: !246)
!245 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!246 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!247 = distinct !DIGlobalVariable(name: "mmx_redmask", scope: !0, file: !242, line: 46, type: !243, isLocal: true, isDefinition: true, variable: i64* @mmx_redmask)
!248 = distinct !DIGlobalVariable(name: "mmx_grnmask", scope: !0, file: !242, line: 47, type: !243, isLocal: true, isDefinition: true, variable: i64* @mmx_grnmask)
!249 = distinct !DIGlobalVariable(name: "pb_e0", scope: !0, file: !242, line: 48, type: !243, isLocal: true, isDefinition: true, variable: i64* @pb_e0)
!250 = distinct !DIGlobalVariable(name: "pb_03", scope: !0, file: !242, line: 49, type: !243, isLocal: true, isDefinition: true, variable: i64* @pb_03)
!251 = distinct !DIGlobalVariable(name: "pb_07", scope: !0, file: !242, line: 50, type: !243, isLocal: true, isDefinition: true, variable: i64* @pb_07)
!252 = distinct !DIGlobalVariable(name: "mask1101", scope: !0, file: !253, line: 274, type: !254, isLocal: true, isDefinition: true, variable: [4 x i16]* @mask1101)
!253 = !DIFile(filename: "libswscale/x86/yuv2rgb_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, align: 16, elements: !259)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !257, line: 195, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!258 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!259 = !{!260}
!260 = !DISubrange(count: 4)
!261 = distinct !DIGlobalVariable(name: "mask0010", scope: !0, file: !253, line: 275, type: !254, isLocal: true, isDefinition: true, variable: [4 x i16]* @mask0010)
!262 = distinct !DIGlobalVariable(name: "mask0110", scope: !0, file: !253, line: 276, type: !254, isLocal: true, isDefinition: true, variable: [4 x i16]* @mask0110)
!263 = distinct !DIGlobalVariable(name: "mask1001", scope: !0, file: !253, line: 277, type: !254, isLocal: true, isDefinition: true, variable: [4 x i16]* @mask1001)
!264 = distinct !DIGlobalVariable(name: "mask0100", scope: !0, file: !253, line: 278, type: !254, isLocal: true, isDefinition: true, variable: [4 x i16]* @mask0100)
!265 = !{i32 2, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!268 = distinct !DISubprogram(name: "ff_yuv2rgb_init_x86", scope: !242, file: !242, line: 72, type: !269, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !624)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !414}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !276, !590, !470, !275, !275, !398, !470}
!275 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !278)
!278 = !{!279, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !353, !357, !359, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !378, !379, !400, !416, !422, !423, !426, !427, !428, !429, !430, !431, !432, !434, !435, !436, !437, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !460, !462, !463, !464, !468, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !507, !508, !509, !510, !511, !512, !513, !514, !515, !519, !520, !524, !526, !529, !530, !531, !532, !533, !534, !535, !538, !539, !545, !551, !556, !561, !566, !571, !576, !581, !582, !586, !591, !595, !596, !600, !604, !610, !611, !615, !619, !620, !622}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !277, file: !225, line: 284, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !284)
!284 = !{!285, !289, !294, !298, !299, !300, !301, !305, !311, !313, !317}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !283, file: !4, line: 72, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !283, file: !4, line: 78, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!286, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !283, file: !4, line: 85, baseType: !295, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !283, file: !4, line: 93, baseType: !275, size: 32, align: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !283, file: !4, line: 99, baseType: !275, size: 32, align: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !283, file: !4, line: 108, baseType: !275, size: 32, align: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !283, file: !4, line: 113, baseType: !302, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!293, !293, !293}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !283, file: !4, line: 123, baseType: !306, size: 64, align: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !283, file: !4, line: 130, baseType: !312, size: 32, align: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !283, file: !4, line: 136, baseType: !314, size: 64, align: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!312, !293}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !283, file: !4, line: 142, baseType: !318, size: 64, align: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!275, !321, !293, !286, !275}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !277, file: !225, line: 290, baseType: !271, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !277, file: !225, line: 291, baseType: !275, size: 32, align: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !277, file: !225, line: 292, baseType: !275, size: 32, align: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !277, file: !225, line: 293, baseType: !275, size: 32, align: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !277, file: !225, line: 294, baseType: !275, size: 32, align: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !277, file: !225, line: 295, baseType: !275, size: 32, align: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !277, file: !225, line: 296, baseType: !275, size: 32, align: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !277, file: !225, line: 297, baseType: !275, size: 32, align: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !277, file: !225, line: 298, baseType: !275, size: 32, align: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !277, file: !225, line: 298, baseType: !275, size: 32, align: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !277, file: !225, line: 299, baseType: !275, size: 32, align: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !277, file: !225, line: 299, baseType: !275, size: 32, align: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !277, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !277, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !277, file: !225, line: 302, baseType: !275, size: 32, align: 32, offset: 544)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !277, file: !225, line: 303, baseType: !275, size: 32, align: 32, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !277, file: !225, line: 304, baseType: !275, size: 32, align: 32, offset: 608)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !277, file: !225, line: 304, baseType: !275, size: 32, align: 32, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !277, file: !225, line: 305, baseType: !275, size: 32, align: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !277, file: !225, line: 306, baseType: !275, size: 32, align: 32, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !277, file: !225, line: 307, baseType: !275, size: 32, align: 32, offset: 736)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !277, file: !225, line: 308, baseType: !275, size: 32, align: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !277, file: !225, line: 309, baseType: !275, size: 32, align: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !277, file: !225, line: 310, baseType: !275, size: 32, align: 32, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !277, file: !225, line: 311, baseType: !349, size: 128, align: 64, offset: 896)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 128, align: 64, elements: !351)
!350 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!351 = !{!352}
!352 = !DISubrange(count: 2)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !277, file: !225, line: 317, baseType: !354, size: 192, align: 64, offset: 1024)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 192, align: 64, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 3)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !277, file: !225, line: 318, baseType: !358, size: 128, align: 32, offset: 1216)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, align: 32, elements: !259)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !277, file: !225, line: 319, baseType: !360, size: 256, align: 64, offset: 1344)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 256, align: 64, elements: !259)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !245, line: 48, baseType: !363)
!363 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !277, file: !225, line: 320, baseType: !358, size: 128, align: 32, offset: 1600)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !277, file: !225, line: 321, baseType: !360, size: 256, align: 64, offset: 1728)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !277, file: !225, line: 322, baseType: !275, size: 32, align: 32, offset: 1984)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !277, file: !225, line: 324, baseType: !350, size: 64, align: 64, offset: 2048)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !277, file: !225, line: 325, baseType: !275, size: 32, align: 32, offset: 2112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !277, file: !225, line: 326, baseType: !275, size: 32, align: 32, offset: 2144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !277, file: !225, line: 327, baseType: !371, size: 64, align: 64, offset: 2176)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !245, line: 49, baseType: !373)
!373 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !277, file: !225, line: 328, baseType: !371, size: 64, align: 64, offset: 2240)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !277, file: !225, line: 330, baseType: !275, size: 32, align: 32, offset: 2304)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !277, file: !225, line: 331, baseType: !377, size: 64, align: 32, offset: 2336)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, align: 32, elements: !351)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !277, file: !225, line: 332, baseType: !275, size: 32, align: 32, offset: 2400)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !277, file: !225, line: 333, baseType: !380, size: 64, align: 64, offset: 2432)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !381, file: !225, line: 945, baseType: !275, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !381, file: !225, line: 946, baseType: !275, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !381, file: !225, line: 947, baseType: !275, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !381, file: !225, line: 948, baseType: !275, size: 32, align: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !381, file: !225, line: 949, baseType: !275, size: 32, align: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !381, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !381, file: !225, line: 951, baseType: !390, size: 1024, align: 64, offset: 192)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 1024, align: 64, elements: !259)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !393)
!393 = !{!394, !395, !396, !397, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !392, file: !225, line: 931, baseType: !275, size: 32, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !392, file: !225, line: 932, baseType: !275, size: 32, align: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !392, file: !225, line: 933, baseType: !275, size: 32, align: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !392, file: !225, line: 934, baseType: !398, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !392, file: !225, line: 935, baseType: !398, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !277, file: !225, line: 334, baseType: !401, size: 64, align: 64, offset: 2496)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !403)
!403 = !{!404, !407, !408, !409, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !402, file: !225, line: 960, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !381)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !402, file: !225, line: 961, baseType: !405, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !402, file: !225, line: 963, baseType: !275, size: 32, align: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !402, file: !225, line: 964, baseType: !293, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !402, file: !225, line: 967, baseType: !411, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!275, !414, !401, !275, !275}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !277)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !277, file: !225, line: 336, baseType: !417, size: 8192, align: 32, offset: 2560)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 8192, align: 32, elements: !420)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !245, line: 51, baseType: !419)
!419 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!420 = !{!421}
!421 = !DISubrange(count: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !277, file: !225, line: 337, baseType: !417, size: 8192, align: 32, offset: 10752)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !277, file: !225, line: 339, baseType: !424, size: 8192, align: 32, offset: 18944)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 8192, align: 32, elements: !420)
!425 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !277, file: !225, line: 351, baseType: !275, size: 32, align: 32, offset: 27136)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !277, file: !225, line: 352, baseType: !275, size: 32, align: 32, offset: 27168)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !277, file: !225, line: 353, baseType: !275, size: 32, align: 32, offset: 27200)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !277, file: !225, line: 354, baseType: !275, size: 32, align: 32, offset: 27232)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !277, file: !225, line: 357, baseType: !361, size: 64, align: 64, offset: 27264)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !277, file: !225, line: 358, baseType: !275, size: 32, align: 32, offset: 27328)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !277, file: !225, line: 374, baseType: !433, size: 64, align: 64, offset: 27392)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !277, file: !225, line: 375, baseType: !433, size: 64, align: 64, offset: 27456)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !277, file: !225, line: 376, baseType: !433, size: 64, align: 64, offset: 27520)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !277, file: !225, line: 377, baseType: !433, size: 64, align: 64, offset: 27584)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !277, file: !225, line: 378, baseType: !438, size: 64, align: 64, offset: 27648)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !257, line: 196, baseType: !275)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !277, file: !225, line: 379, baseType: !438, size: 64, align: 64, offset: 27712)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !277, file: !225, line: 380, baseType: !438, size: 64, align: 64, offset: 27776)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !277, file: !225, line: 381, baseType: !438, size: 64, align: 64, offset: 27840)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !277, file: !225, line: 382, baseType: !275, size: 32, align: 32, offset: 27904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !277, file: !225, line: 383, baseType: !275, size: 32, align: 32, offset: 27936)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !277, file: !225, line: 384, baseType: !275, size: 32, align: 32, offset: 27968)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !277, file: !225, line: 385, baseType: !275, size: 32, align: 32, offset: 28000)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !277, file: !225, line: 388, baseType: !275, size: 32, align: 32, offset: 28032)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !277, file: !225, line: 389, baseType: !275, size: 32, align: 32, offset: 28064)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !277, file: !225, line: 390, baseType: !361, size: 64, align: 64, offset: 28096)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !277, file: !225, line: 391, baseType: !361, size: 64, align: 64, offset: 28160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !277, file: !225, line: 393, baseType: !275, size: 32, align: 32, offset: 28224)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !277, file: !225, line: 394, baseType: !275, size: 32, align: 32, offset: 28256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !277, file: !225, line: 396, baseType: !275, size: 32, align: 32, offset: 28288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !277, file: !225, line: 397, baseType: !275, size: 32, align: 32, offset: 28320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !277, file: !225, line: 398, baseType: !293, size: 64, align: 64, offset: 28352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !277, file: !225, line: 401, baseType: !457, size: 40960, align: 32, offset: 28416)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 40960, align: 32, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !277, file: !225, line: 402, baseType: !461, size: 81920, align: 64, offset: 69376)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 81920, align: 64, elements: !458)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !277, file: !225, line: 403, baseType: !461, size: 81920, align: 64, offset: 151296)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !277, file: !225, line: 404, baseType: !461, size: 81920, align: 64, offset: 233216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !277, file: !225, line: 405, baseType: !465, size: 5632, align: 32, offset: 315136)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 5632, align: 32, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 176)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !277, file: !225, line: 417, baseType: !469, size: 256, align: 64, offset: 320768)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 256, align: 64, elements: !259)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !277, file: !225, line: 420, baseType: !275, size: 32, align: 32, offset: 321024)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !277, file: !225, line: 420, baseType: !275, size: 32, align: 32, offset: 321056)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !277, file: !225, line: 420, baseType: !275, size: 32, align: 32, offset: 321088)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !277, file: !225, line: 421, baseType: !358, size: 128, align: 32, offset: 321120)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !277, file: !225, line: 422, baseType: !358, size: 128, align: 32, offset: 321248)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !277, file: !225, line: 423, baseType: !275, size: 32, align: 32, offset: 321376)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !277, file: !225, line: 424, baseType: !275, size: 32, align: 32, offset: 321408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !277, file: !225, line: 425, baseType: !275, size: 32, align: 32, offset: 321440)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !277, file: !225, line: 426, baseType: !275, size: 32, align: 32, offset: 321472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !277, file: !225, line: 427, baseType: !275, size: 32, align: 32, offset: 321504)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !277, file: !225, line: 428, baseType: !275, size: 32, align: 32, offset: 321536)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !277, file: !225, line: 429, baseType: !275, size: 32, align: 32, offset: 321568)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !277, file: !225, line: 430, baseType: !275, size: 32, align: 32, offset: 321600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !277, file: !225, line: 431, baseType: !275, size: 32, align: 32, offset: 321632)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !277, file: !225, line: 432, baseType: !275, size: 32, align: 32, offset: 321664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !277, file: !225, line: 433, baseType: !275, size: 32, align: 32, offset: 321696)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !277, file: !225, line: 434, baseType: !275, size: 32, align: 32, offset: 321728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !277, file: !225, line: 435, baseType: !275, size: 32, align: 32, offset: 321760)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !277, file: !225, line: 436, baseType: !275, size: 32, align: 32, offset: 321792)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !277, file: !225, line: 437, baseType: !275, size: 32, align: 32, offset: 321824)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !277, file: !225, line: 438, baseType: !275, size: 32, align: 32, offset: 321856)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !277, file: !225, line: 466, baseType: !244, size: 64, align: 64, offset: 321920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !277, file: !225, line: 467, baseType: !244, size: 64, align: 64, offset: 321984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !277, file: !225, line: 468, baseType: !244, size: 64, align: 64, offset: 322048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !277, file: !225, line: 470, baseType: !244, size: 64, align: 64, offset: 322112)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !277, file: !225, line: 471, baseType: !244, size: 64, align: 64, offset: 322176)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !277, file: !225, line: 472, baseType: !244, size: 64, align: 64, offset: 322240)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !277, file: !225, line: 473, baseType: !244, size: 64, align: 64, offset: 322304)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !277, file: !225, line: 474, baseType: !244, size: 64, align: 64, offset: 322368)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !277, file: !225, line: 475, baseType: !244, size: 64, align: 64, offset: 322432)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !277, file: !225, line: 476, baseType: !244, size: 64, align: 64, offset: 322496)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !277, file: !225, line: 477, baseType: !244, size: 64, align: 64, offset: 322560)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !277, file: !225, line: 478, baseType: !504, size: 32768, align: 32, offset: 322624)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 32768, align: 32, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 1024)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !277, file: !225, line: 479, baseType: !504, size: 32768, align: 32, offset: 355392)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !277, file: !225, line: 480, baseType: !275, size: 32, align: 32, offset: 388160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !277, file: !225, line: 481, baseType: !244, size: 64, align: 64, offset: 388224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !277, file: !225, line: 482, baseType: !244, size: 64, align: 64, offset: 388288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !277, file: !225, line: 483, baseType: !244, size: 64, align: 64, offset: 388352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !277, file: !225, line: 484, baseType: !244, size: 64, align: 64, offset: 388416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !277, file: !225, line: 485, baseType: !244, size: 64, align: 64, offset: 388480)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !277, file: !225, line: 486, baseType: !504, size: 32768, align: 32, offset: 388544)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !277, file: !225, line: 490, baseType: !516, size: 64, align: 64, offset: 421312)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !517, line: 149, baseType: !518)
!517 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!518 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !277, file: !225, line: 491, baseType: !516, size: 64, align: 64, offset: 421376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !277, file: !225, line: 492, baseType: !521, size: 128, align: 16, offset: 421440)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, align: 16, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !277, file: !225, line: 493, baseType: !525, size: 256, align: 32, offset: 421568)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 256, align: 32, elements: !522)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !277, file: !225, line: 495, baseType: !527, size: 64, align: 64, offset: 421824)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !277, file: !225, line: 495, baseType: !527, size: 64, align: 64, offset: 421888)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !277, file: !225, line: 508, baseType: !275, size: 32, align: 32, offset: 421952)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !277, file: !225, line: 513, baseType: !433, size: 64, align: 64, offset: 422016)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !277, file: !225, line: 514, baseType: !433, size: 64, align: 64, offset: 422080)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !277, file: !225, line: 515, baseType: !433, size: 64, align: 64, offset: 422144)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !277, file: !225, line: 516, baseType: !433, size: 64, align: 64, offset: 422208)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !277, file: !225, line: 517, baseType: !536, size: 192, align: 16, offset: 422272)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 192, align: 16, elements: !537)
!537 = !{!356, !260}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !277, file: !225, line: 518, baseType: !536, size: 192, align: 16, offset: 422464)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !277, file: !225, line: 521, baseType: !540, size: 64, align: 64, offset: 422656)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544, !361, !275, !527, !275}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !277, file: !225, line: 522, baseType: !546, size: 64, align: 64, offset: 422720)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !544, !275, !550, !361, !275, !527, !275}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !277, file: !225, line: 523, baseType: !552, size: 64, align: 64, offset: 422784)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !276, !544, !275, !550, !550, !361, !275}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !277, file: !225, line: 524, baseType: !557, size: 64, align: 64, offset: 422848)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !276, !544, !550, !550, !544, !361, !275, !275, !275}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !277, file: !225, line: 525, baseType: !562, size: 64, align: 64, offset: 422912)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !276, !550, !550, !550, !550, !361, !275, !275, !275, !275}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !277, file: !225, line: 526, baseType: !567, size: 64, align: 64, offset: 422976)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !276, !544, !550, !275, !544, !550, !550, !275, !550, !361, !275, !275}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !277, file: !225, line: 527, baseType: !572, size: 64, align: 64, offset: 423040)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !276, !544, !550, !275, !544, !550, !550, !275, !550, !398, !275, !275}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !277, file: !225, line: 530, baseType: !577, size: 64, align: 64, offset: 423104)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !361, !527, !527, !527, !275, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !277, file: !225, line: 533, baseType: !577, size: 64, align: 64, offset: 423168)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !277, file: !225, line: 536, baseType: !583, size: 64, align: 64, offset: 423232)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !361, !361, !527, !527, !527, !275, !580}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !277, file: !225, line: 545, baseType: !587, size: 64, align: 64, offset: 423296)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !361, !590, !275, !438}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !277, file: !225, line: 546, baseType: !592, size: 64, align: 64, offset: 423360)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !361, !361, !590, !275, !438}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !277, file: !225, line: 548, baseType: !587, size: 64, align: 64, offset: 423424)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !277, file: !225, line: 570, baseType: !597, size: 64, align: 64, offset: 423488)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !276, !433, !275, !527, !275, !275}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !277, file: !225, line: 573, baseType: !601, size: 64, align: 64, offset: 423552)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !276, !433, !433, !275, !527, !527, !275, !275}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !277, file: !225, line: 610, baseType: !605, size: 64, align: 64, offset: 423616)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !276, !433, !275, !527, !544, !608, !275}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !277, file: !225, line: 613, baseType: !605, size: 64, align: 64, offset: 423680)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !277, file: !225, line: 619, baseType: !612, size: 64, align: 64, offset: 423744)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !433, !275}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !277, file: !225, line: 621, baseType: !616, size: 64, align: 64, offset: 423808)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !433, !433, !275}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !277, file: !225, line: 623, baseType: !275, size: 32, align: 32, offset: 423872)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !277, file: !225, line: 625, baseType: !621, size: 32, align: 32, offset: 423904)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !277, file: !225, line: 627, baseType: !623, size: 32, align: 32, offset: 423936)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!624 = !{}
!625 = !DILocalVariable(name: "c", arg: 1, scope: !268, file: !242, line: 72, type: !414)
!626 = !DIExpression()
!627 = !DILocation(line: 72, column: 63, scope: !268)
!628 = !DILocalVariable(name: "cpu_flags", scope: !268, file: !242, line: 75, type: !275)
!629 = !DILocation(line: 75, column: 9, scope: !268)
!630 = !DILocation(line: 75, column: 21, scope: !268)
!631 = !DILocation(line: 78, column: 17, scope: !632)
!632 = distinct !DILexicalBlock(scope: !268, file: !242, line: 78, column: 9)
!633 = !DILocation(line: 78, column: 28, scope: !632)
!634 = !DILocation(line: 78, column: 9, scope: !268)
!635 = !DILocation(line: 79, column: 17, scope: !636)
!636 = distinct !DILexicalBlock(scope: !632, file: !242, line: 78, column: 40)
!637 = !DILocation(line: 79, column: 20, scope: !636)
!638 = !DILocation(line: 79, column: 9, scope: !636)
!639 = !DILocation(line: 81, column: 13, scope: !640)
!640 = distinct !DILexicalBlock(scope: !636, file: !242, line: 79, column: 31)
!641 = !DILocation(line: 83, column: 13, scope: !640)
!642 = !DILocation(line: 85, column: 5, scope: !636)
!643 = !DILocation(line: 88, column: 17, scope: !644)
!644 = distinct !DILexicalBlock(scope: !268, file: !242, line: 88, column: 9)
!645 = !DILocation(line: 88, column: 28, scope: !644)
!646 = !DILocation(line: 88, column: 9, scope: !268)
!647 = !DILocation(line: 89, column: 17, scope: !648)
!648 = distinct !DILexicalBlock(scope: !644, file: !242, line: 88, column: 40)
!649 = !DILocation(line: 89, column: 20, scope: !648)
!650 = !DILocation(line: 89, column: 9, scope: !648)
!651 = !DILocation(line: 91, column: 21, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !242, line: 91, column: 21)
!653 = distinct !DILexicalBlock(scope: !648, file: !242, line: 89, column: 31)
!654 = !DILocation(line: 91, column: 24, scope: !652)
!655 = !DILocation(line: 91, column: 34, scope: !652)
!656 = !DILocation(line: 91, column: 21, scope: !653)
!657 = !DILocation(line: 93, column: 21, scope: !658)
!658 = distinct !DILexicalBlock(scope: !652, file: !242, line: 91, column: 58)
!659 = !DILocation(line: 97, column: 21, scope: !652)
!660 = !DILocation(line: 99, column: 21, scope: !661)
!661 = distinct !DILexicalBlock(scope: !653, file: !242, line: 99, column: 21)
!662 = !DILocation(line: 99, column: 24, scope: !661)
!663 = !DILocation(line: 99, column: 34, scope: !661)
!664 = !DILocation(line: 99, column: 21, scope: !653)
!665 = !DILocation(line: 101, column: 21, scope: !666)
!666 = distinct !DILexicalBlock(scope: !661, file: !242, line: 99, column: 58)
!667 = !DILocation(line: 105, column: 21, scope: !661)
!668 = !DILocation(line: 107, column: 17, scope: !653)
!669 = !DILocation(line: 109, column: 17, scope: !653)
!670 = !DILocation(line: 111, column: 17, scope: !653)
!671 = !DILocation(line: 113, column: 17, scope: !653)
!672 = !DILocation(line: 115, column: 5, scope: !648)
!673 = !DILocation(line: 118, column: 5, scope: !268)
!674 = !DILocation(line: 119, column: 1, scope: !268)
!675 = distinct !DISubprogram(name: "yuv420_rgb24_mmxext", scope: !253, file: !253, line: 319, type: !676, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !624)
!676 = !DISubroutineType(types: !677)
!677 = !{!275, !414, !590, !470, !275, !275, !398, !470}
!678 = !DILocalVariable(name: "c", arg: 1, scope: !675, file: !253, line: 319, type: !414)
!679 = !DILocation(line: 319, column: 51, scope: !675)
!680 = !DILocalVariable(name: "src", arg: 2, scope: !675, file: !253, line: 319, type: !590)
!681 = !DILocation(line: 319, column: 69, scope: !675)
!682 = !DILocalVariable(name: "srcStride", arg: 3, scope: !675, file: !253, line: 320, type: !470)
