; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--vscale.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--vscale.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!217 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!218 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!219 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!220 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!221 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!222 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!223 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !225, line: 65, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!228 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!229 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!230 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!231 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!232 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!233 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !225, line: 75, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!237 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!238 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!239 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!240 = !{!241, !245, !246, !250, !259, !263, !264, !537, !542, !552}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !243, line: 195, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!244 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250, !252, !256, !257, !256}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !254, line: 48, baseType: !255)
!254 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!255 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!256 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !250, !256, !263, !252, !256, !257, !256}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !268, !250, !256, !263, !263, !252, !256}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !270)
!270 = !{!271, !315, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !351, !355, !359, !361, !362, !363, !364, !365, !366, !367, !371, !372, !373, !375, !376, !396, !412, !418, !419, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !457, !458, !459, !463, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !503, !504, !505, !506, !507, !508, !509, !510, !511, !515, !516, !520, !522, !523, !524, !525, !526, !527, !528, !529, !532, !533, !534, !535, !536, !541, !546, !551, !556, !561, !562, !566, !570, !574, !575, !579, !583, !589, !590, !594, !598, !599, !601}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !269, file: !225, line: 284, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !276)
!276 = !{!277, !281, !285, !289, !290, !291, !292, !296, !302, !304, !308}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !275, file: !4, line: 72, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !275, file: !4, line: 78, baseType: !282, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!278, !245}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !275, file: !4, line: 85, baseType: !286, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !275, file: !4, line: 93, baseType: !256, size: 32, align: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !275, file: !4, line: 99, baseType: !256, size: 32, align: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !275, file: !4, line: 108, baseType: !256, size: 32, align: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !275, file: !4, line: 113, baseType: !293, size: 64, align: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!245, !245, !245}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !275, file: !4, line: 123, baseType: !297, size: 64, align: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !275, file: !4, line: 130, baseType: !303, size: 32, align: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !275, file: !4, line: 136, baseType: !305, size: 64, align: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!303, !245}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !275, file: !4, line: 142, baseType: !309, size: 64, align: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!256, !312, !245, !278, !256}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !269, file: !225, line: 290, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!256, !268, !320, !321, !256, !256, !322, !321}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !269, file: !225, line: 291, baseType: !256, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !269, file: !225, line: 292, baseType: !256, size: 32, align: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !269, file: !225, line: 293, baseType: !256, size: 32, align: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !269, file: !225, line: 294, baseType: !256, size: 32, align: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !269, file: !225, line: 295, baseType: !256, size: 32, align: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !269, file: !225, line: 296, baseType: !256, size: 32, align: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !269, file: !225, line: 297, baseType: !256, size: 32, align: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !269, file: !225, line: 298, baseType: !256, size: 32, align: 32, offset: 352)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !269, file: !225, line: 298, baseType: !256, size: 32, align: 32, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !269, file: !225, line: 299, baseType: !256, size: 32, align: 32, offset: 416)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !269, file: !225, line: 299, baseType: !256, size: 32, align: 32, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !269, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !269, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !269, file: !225, line: 302, baseType: !256, size: 32, align: 32, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !269, file: !225, line: 303, baseType: !256, size: 32, align: 32, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !269, file: !225, line: 304, baseType: !256, size: 32, align: 32, offset: 608)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !269, file: !225, line: 304, baseType: !256, size: 32, align: 32, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !269, file: !225, line: 305, baseType: !256, size: 32, align: 32, offset: 672)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !269, file: !225, line: 306, baseType: !256, size: 32, align: 32, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !269, file: !225, line: 307, baseType: !256, size: 32, align: 32, offset: 736)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !269, file: !225, line: 308, baseType: !256, size: 32, align: 32, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !269, file: !225, line: 309, baseType: !256, size: 32, align: 32, offset: 800)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !269, file: !225, line: 310, baseType: !256, size: 32, align: 32, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !269, file: !225, line: 311, baseType: !347, size: 128, align: 64, offset: 896)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 128, align: 64, elements: !349)
!348 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!349 = !{!350}
!350 = !DISubrange(count: 2)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !269, file: !225, line: 317, baseType: !352, size: 192, align: 64, offset: 1024)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 192, align: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 3)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !269, file: !225, line: 318, baseType: !356, size: 128, align: 32, offset: 1216)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, align: 32, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 4)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !269, file: !225, line: 319, baseType: !360, size: 256, align: 64, offset: 1344)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 256, align: 64, elements: !357)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !269, file: !225, line: 320, baseType: !356, size: 128, align: 32, offset: 1600)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !269, file: !225, line: 321, baseType: !360, size: 256, align: 64, offset: 1728)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !269, file: !225, line: 322, baseType: !256, size: 32, align: 32, offset: 1984)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !269, file: !225, line: 324, baseType: !348, size: 64, align: 64, offset: 2048)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !269, file: !225, line: 325, baseType: !256, size: 32, align: 32, offset: 2112)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !269, file: !225, line: 326, baseType: !256, size: 32, align: 32, offset: 2144)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !269, file: !225, line: 327, baseType: !368, size: 64, align: 64, offset: 2176)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !254, line: 49, baseType: !370)
!370 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !269, file: !225, line: 328, baseType: !368, size: 64, align: 64, offset: 2240)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !269, file: !225, line: 330, baseType: !256, size: 32, align: 32, offset: 2304)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !269, file: !225, line: 331, baseType: !374, size: 64, align: 32, offset: 2336)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 64, align: 32, elements: !349)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !269, file: !225, line: 332, baseType: !256, size: 32, align: 32, offset: 2400)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !269, file: !225, line: 333, baseType: !377, size: 64, align: 64, offset: 2432)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !378, file: !225, line: 945, baseType: !256, size: 32, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !378, file: !225, line: 946, baseType: !256, size: 32, align: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !378, file: !225, line: 947, baseType: !256, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !378, file: !225, line: 948, baseType: !256, size: 32, align: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !378, file: !225, line: 949, baseType: !256, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !378, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !378, file: !225, line: 951, baseType: !387, size: 1024, align: 64, offset: 192)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 1024, align: 64, elements: !357)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !389, file: !225, line: 931, baseType: !256, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !389, file: !225, line: 932, baseType: !256, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !389, file: !225, line: 933, baseType: !256, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !389, file: !225, line: 934, baseType: !322, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !389, file: !225, line: 935, baseType: !322, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !269, file: !225, line: 334, baseType: !397, size: 64, align: 64, offset: 2496)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !399)
!399 = !{!400, !403, !404, !405, !406}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !398, file: !225, line: 960, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !378)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !398, file: !225, line: 961, baseType: !401, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !398, file: !225, line: 963, baseType: !256, size: 32, align: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !398, file: !225, line: 964, baseType: !245, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !398, file: !225, line: 967, baseType: !407, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!256, !410, !397, !256, !256}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !269)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !269, file: !225, line: 336, baseType: !413, size: 8192, align: 32, offset: 2560)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 8192, align: 32, elements: !416)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !254, line: 51, baseType: !415)
!415 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!416 = !{!417}
!417 = !DISubrange(count: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !269, file: !225, line: 337, baseType: !413, size: 8192, align: 32, offset: 10752)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !269, file: !225, line: 339, baseType: !420, size: 8192, align: 32, offset: 18944)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 8192, align: 32, elements: !416)
!421 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !269, file: !225, line: 351, baseType: !256, size: 32, align: 32, offset: 27136)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !269, file: !225, line: 352, baseType: !256, size: 32, align: 32, offset: 27168)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !269, file: !225, line: 353, baseType: !256, size: 32, align: 32, offset: 27200)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !269, file: !225, line: 354, baseType: !256, size: 32, align: 32, offset: 27232)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !269, file: !225, line: 357, baseType: !252, size: 64, align: 64, offset: 27264)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !269, file: !225, line: 358, baseType: !256, size: 32, align: 32, offset: 27328)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !269, file: !225, line: 374, baseType: !241, size: 64, align: 64, offset: 27392)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !269, file: !225, line: 375, baseType: !241, size: 64, align: 64, offset: 27456)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !269, file: !225, line: 376, baseType: !241, size: 64, align: 64, offset: 27520)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !269, file: !225, line: 377, baseType: !241, size: 64, align: 64, offset: 27584)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !269, file: !225, line: 378, baseType: !433, size: 64, align: 64, offset: 27648)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !243, line: 196, baseType: !256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !269, file: !225, line: 379, baseType: !433, size: 64, align: 64, offset: 27712)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !269, file: !225, line: 380, baseType: !433, size: 64, align: 64, offset: 27776)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !269, file: !225, line: 381, baseType: !433, size: 64, align: 64, offset: 27840)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !269, file: !225, line: 382, baseType: !256, size: 32, align: 32, offset: 27904)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !269, file: !225, line: 383, baseType: !256, size: 32, align: 32, offset: 27936)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !269, file: !225, line: 384, baseType: !256, size: 32, align: 32, offset: 27968)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !269, file: !225, line: 385, baseType: !256, size: 32, align: 32, offset: 28000)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !269, file: !225, line: 388, baseType: !256, size: 32, align: 32, offset: 28032)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !269, file: !225, line: 389, baseType: !256, size: 32, align: 32, offset: 28064)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !269, file: !225, line: 390, baseType: !252, size: 64, align: 64, offset: 28096)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !269, file: !225, line: 391, baseType: !252, size: 64, align: 64, offset: 28160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !269, file: !225, line: 393, baseType: !256, size: 32, align: 32, offset: 28224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !269, file: !225, line: 394, baseType: !256, size: 32, align: 32, offset: 28256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !269, file: !225, line: 396, baseType: !256, size: 32, align: 32, offset: 28288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !269, file: !225, line: 397, baseType: !256, size: 32, align: 32, offset: 28320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !269, file: !225, line: 398, baseType: !245, size: 64, align: 64, offset: 28352)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !269, file: !225, line: 401, baseType: !452, size: 40960, align: 32, offset: 28416)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 40960, align: 32, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !269, file: !225, line: 402, baseType: !456, size: 81920, align: 64, offset: 69376)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 81920, align: 64, elements: !453)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !269, file: !225, line: 403, baseType: !456, size: 81920, align: 64, offset: 151296)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !269, file: !225, line: 404, baseType: !456, size: 81920, align: 64, offset: 233216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !269, file: !225, line: 405, baseType: !460, size: 5632, align: 32, offset: 315136)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 5632, align: 32, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 176)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !269, file: !225, line: 417, baseType: !464, size: 256, align: 64, offset: 320768)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 256, align: 64, elements: !357)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !269, file: !225, line: 420, baseType: !256, size: 32, align: 32, offset: 321024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !269, file: !225, line: 420, baseType: !256, size: 32, align: 32, offset: 321056)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !269, file: !225, line: 420, baseType: !256, size: 32, align: 32, offset: 321088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !269, file: !225, line: 421, baseType: !356, size: 128, align: 32, offset: 321120)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !269, file: !225, line: 422, baseType: !356, size: 128, align: 32, offset: 321248)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !269, file: !225, line: 423, baseType: !256, size: 32, align: 32, offset: 321376)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !269, file: !225, line: 424, baseType: !256, size: 32, align: 32, offset: 321408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !269, file: !225, line: 425, baseType: !256, size: 32, align: 32, offset: 321440)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !269, file: !225, line: 426, baseType: !256, size: 32, align: 32, offset: 321472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !269, file: !225, line: 427, baseType: !256, size: 32, align: 32, offset: 321504)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !269, file: !225, line: 428, baseType: !256, size: 32, align: 32, offset: 321536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !269, file: !225, line: 429, baseType: !256, size: 32, align: 32, offset: 321568)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !269, file: !225, line: 430, baseType: !256, size: 32, align: 32, offset: 321600)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !269, file: !225, line: 431, baseType: !256, size: 32, align: 32, offset: 321632)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !269, file: !225, line: 432, baseType: !256, size: 32, align: 32, offset: 321664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !269, file: !225, line: 433, baseType: !256, size: 32, align: 32, offset: 321696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !269, file: !225, line: 434, baseType: !256, size: 32, align: 32, offset: 321728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !269, file: !225, line: 435, baseType: !256, size: 32, align: 32, offset: 321760)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !269, file: !225, line: 436, baseType: !256, size: 32, align: 32, offset: 321792)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !269, file: !225, line: 437, baseType: !256, size: 32, align: 32, offset: 321824)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !269, file: !225, line: 438, baseType: !256, size: 32, align: 32, offset: 321856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !269, file: !225, line: 466, baseType: !487, size: 64, align: 64, offset: 321920)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !254, line: 55, baseType: !488)
!488 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !269, file: !225, line: 467, baseType: !487, size: 64, align: 64, offset: 321984)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !269, file: !225, line: 468, baseType: !487, size: 64, align: 64, offset: 322048)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !269, file: !225, line: 470, baseType: !487, size: 64, align: 64, offset: 322112)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !269, file: !225, line: 471, baseType: !487, size: 64, align: 64, offset: 322176)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !269, file: !225, line: 472, baseType: !487, size: 64, align: 64, offset: 322240)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !269, file: !225, line: 473, baseType: !487, size: 64, align: 64, offset: 322304)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !269, file: !225, line: 474, baseType: !487, size: 64, align: 64, offset: 322368)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !269, file: !225, line: 475, baseType: !487, size: 64, align: 64, offset: 322432)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !269, file: !225, line: 476, baseType: !487, size: 64, align: 64, offset: 322496)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !269, file: !225, line: 477, baseType: !487, size: 64, align: 64, offset: 322560)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !269, file: !225, line: 478, baseType: !500, size: 32768, align: 32, offset: 322624)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 32768, align: 32, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 1024)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !269, file: !225, line: 479, baseType: !500, size: 32768, align: 32, offset: 355392)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !269, file: !225, line: 480, baseType: !256, size: 32, align: 32, offset: 388160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !269, file: !225, line: 481, baseType: !487, size: 64, align: 64, offset: 388224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !269, file: !225, line: 482, baseType: !487, size: 64, align: 64, offset: 388288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !269, file: !225, line: 483, baseType: !487, size: 64, align: 64, offset: 388352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !269, file: !225, line: 484, baseType: !487, size: 64, align: 64, offset: 388416)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !269, file: !225, line: 485, baseType: !487, size: 64, align: 64, offset: 388480)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !269, file: !225, line: 486, baseType: !500, size: 32768, align: 32, offset: 388544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !269, file: !225, line: 490, baseType: !512, size: 64, align: 64, offset: 421312)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !513, line: 149, baseType: !514)
!513 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!514 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !269, file: !225, line: 491, baseType: !512, size: 64, align: 64, offset: 421376)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !269, file: !225, line: 492, baseType: !517, size: 128, align: 16, offset: 421440)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 128, align: 16, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 8)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !269, file: !225, line: 493, baseType: !521, size: 256, align: 32, offset: 421568)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 256, align: 32, elements: !518)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !269, file: !225, line: 495, baseType: !257, size: 64, align: 64, offset: 421824)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !269, file: !225, line: 495, baseType: !257, size: 64, align: 64, offset: 421888)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !269, file: !225, line: 508, baseType: !256, size: 32, align: 32, offset: 421952)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !269, file: !225, line: 513, baseType: !241, size: 64, align: 64, offset: 422016)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !269, file: !225, line: 514, baseType: !241, size: 64, align: 64, offset: 422080)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !269, file: !225, line: 515, baseType: !241, size: 64, align: 64, offset: 422144)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !269, file: !225, line: 516, baseType: !241, size: 64, align: 64, offset: 422208)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !269, file: !225, line: 517, baseType: !530, size: 192, align: 16, offset: 422272)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 192, align: 16, elements: !531)
!531 = !{!354, !358}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !269, file: !225, line: 518, baseType: !530, size: 192, align: 16, offset: 422464)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !269, file: !225, line: 521, baseType: !246, size: 64, align: 64, offset: 422656)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !269, file: !225, line: 522, baseType: !259, size: 64, align: 64, offset: 422720)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !269, file: !225, line: 523, baseType: !264, size: 64, align: 64, offset: 422784)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !269, file: !225, line: 524, baseType: !537, size: 64, align: 64, offset: 422848)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !268, !250, !263, !263, !250, !252, !256, !256, !256}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !269, file: !225, line: 525, baseType: !542, size: 64, align: 64, offset: 422912)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !268, !263, !263, !263, !263, !252, !256, !256, !256, !256}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !269, file: !225, line: 526, baseType: !547, size: 64, align: 64, offset: 422976)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !268, !250, !263, !256, !250, !263, !263, !256, !263, !252, !256, !256}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !269, file: !225, line: 527, baseType: !552, size: 64, align: 64, offset: 423040)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !268, !250, !263, !256, !250, !263, !263, !256, !263, !322, !256, !256}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !269, file: !225, line: 530, baseType: !557, size: 64, align: 64, offset: 423104)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !252, !257, !257, !257, !256, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !269, file: !225, line: 533, baseType: !557, size: 64, align: 64, offset: 423168)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !269, file: !225, line: 536, baseType: !563, size: 64, align: 64, offset: 423232)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !252, !252, !257, !257, !257, !256, !560}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !269, file: !225, line: 545, baseType: !567, size: 64, align: 64, offset: 423296)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !252, !320, !256, !433}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !269, file: !225, line: 546, baseType: !571, size: 64, align: 64, offset: 423360)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !252, !252, !320, !256, !433}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !269, file: !225, line: 548, baseType: !567, size: 64, align: 64, offset: 423424)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !269, file: !225, line: 570, baseType: !576, size: 64, align: 64, offset: 423488)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !268, !241, !256, !257, !256, !256}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !269, file: !225, line: 573, baseType: !580, size: 64, align: 64, offset: 423552)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !268, !241, !241, !256, !257, !257, !256, !256}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !269, file: !225, line: 610, baseType: !584, size: 64, align: 64, offset: 423616)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !268, !241, !256, !257, !250, !587, !256}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !269, file: !225, line: 613, baseType: !584, size: 64, align: 64, offset: 423680)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !269, file: !225, line: 619, baseType: !591, size: 64, align: 64, offset: 423744)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !241, !256}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !269, file: !225, line: 621, baseType: !595, size: 64, align: 64, offset: 423808)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !241, !241, !256}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !269, file: !225, line: 623, baseType: !256, size: 32, align: 32, offset: 423872)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !269, file: !225, line: 625, baseType: !600, size: 32, align: 32, offset: 423904)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !269, file: !225, line: 627, baseType: !602, size: 32, align: 32, offset: 423936)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!603 = !{i32 2, !"Dwarf Version", i32 4}
!604 = !{i32 2, !"Debug Info Version", i32 3}
!605 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!606 = distinct !DISubprogram(name: "ff_init_vscale", scope: !607, file: !607, line: 206, type: !608, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!607 = !DIFile(filename: "libswscale/vscale.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!608 = !DISubroutineType(types: !609)
!609 = !{!256, !410, !610, !401, !401}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFilterDescriptor", file: !225, line: 968, baseType: !398)
!612 = !{}
!613 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !614, file: !225, line: 699, type: !24)
!614 = distinct !DISubprogram(name: "isGray", scope: !225, file: !225, line: 699, type: !615, isLocal: true, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!615 = !DISubroutineType(types: !616)
!616 = !{!256, !24}
!617 = !DIExpression()
!618 = !DILocation(line: 699, column: 76, scope: !614, inlinedAt: !619)
!619 = distinct !DILocation(line: 223, column: 14, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !607, line: 223, column: 13)
!621 = distinct !DILexicalBlock(scope: !622, file: !607, line: 211, column: 88)
!622 = distinct !DILexicalBlock(scope: !606, file: !607, line: 211, column: 9)
!623 = !DILocalVariable(name: "desc", scope: !614, file: !225, line: 701, type: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !627, line: 123, baseType: !628)
!627 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !627, line: 81, size: 1280, align: 64, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !648}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !627, line: 82, baseType: !278, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !628, file: !627, line: 83, baseType: !253, size: 8, align: 8, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !628, file: !627, line: 92, baseType: !253, size: 8, align: 8, offset: 72)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !628, file: !627, line: 101, baseType: !253, size: 8, align: 8, offset: 80)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !627, line: 106, baseType: !487, size: 64, align: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !628, file: !627, line: 117, baseType: !636, size: 1024, align: 32, offset: 192)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 1024, align: 32, elements: !357)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !627, line: 70, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !627, line: 31, size: 256, align: 32, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !638, file: !627, line: 35, baseType: !256, size: 32, align: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !638, file: !627, line: 41, baseType: !256, size: 32, align: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !638, file: !627, line: 47, baseType: !256, size: 32, align: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !638, file: !627, line: 53, baseType: !256, size: 32, align: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !638, file: !627, line: 58, baseType: !256, size: 32, align: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !638, file: !627, line: 62, baseType: !256, size: 32, align: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !638, file: !627, line: 65, baseType: !256, size: 32, align: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !638, file: !627, line: 68, baseType: !256, size: 32, align: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !628, file: !627, line: 122, baseType: !278, size: 64, align: 64, offset: 1216)
!649 = !DILocation(line: 701, column: 31, scope: !614, inlinedAt: !619)
!650 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !651, file: !225, line: 776, type: !24)
!651 = distinct !DISubprogram(name: "isALPHA", scope: !225, file: !225, line: 776, type: !615, isLocal: true, isDefinition: true, scopeLine: 777, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!652 = !DILocation(line: 776, column: 77, scope: !651, inlinedAt: !653)
!653 = distinct !DILocation(line: 211, column: 64, scope: !654)
!654 = !DILexicalBlockFile(scope: !622, file: !607, discriminator: 2)
!655 = !DILocalVariable(name: "desc", scope: !651, file: !225, line: 778, type: !624)
!656 = !DILocation(line: 778, column: 31, scope: !651, inlinedAt: !653)
!657 = !DILocation(line: 699, column: 76, scope: !614, inlinedAt: !658)
!658 = distinct !DILocation(line: 211, column: 39, scope: !659)
!659 = !DILexicalBlockFile(scope: !622, file: !607, discriminator: 1)
!660 = !DILocation(line: 701, column: 31, scope: !614, inlinedAt: !658)
!661 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !662, file: !225, line: 667, type: !24)
!662 = distinct !DISubprogram(name: "isYUV", scope: !225, file: !225, line: 667, type: !615, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!663 = !DILocation(line: 667, column: 75, scope: !662, inlinedAt: !664)
!664 = distinct !DILocation(line: 678, column: 41, scope: !665, inlinedAt: !667)
!665 = !DILexicalBlockFile(scope: !666, file: !225, discriminator: 1)
!666 = distinct !DISubprogram(name: "isPlanarYUV", scope: !225, file: !225, line: 674, type: !615, isLocal: true, isDefinition: true, scopeLine: 675, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!667 = distinct !DILocation(line: 211, column: 9, scope: !622)
!668 = !DILocalVariable(name: "desc", scope: !662, file: !225, line: 669, type: !624)
!669 = !DILocation(line: 669, column: 31, scope: !662, inlinedAt: !664)
!670 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !666, file: !225, line: 674, type: !24)
!671 = !DILocation(line: 674, column: 81, scope: !666, inlinedAt: !667)
!672 = !DILocalVariable(name: "desc", scope: !666, file: !225, line: 676, type: !624)
!673 = !DILocation(line: 676, column: 31, scope: !666, inlinedAt: !667)
!674 = !DILocalVariable(name: "c", arg: 1, scope: !606, file: !607, line: 206, type: !410)
!675 = !DILocation(line: 206, column: 32, scope: !606)
!676 = !DILocalVariable(name: "desc", arg: 2, scope: !606, file: !607, line: 206, type: !610)
!677 = !DILocation(line: 206, column: 56, scope: !606)
!678 = !DILocalVariable(name: "src", arg: 3, scope: !606, file: !607, line: 206, type: !401)
!679 = !DILocation(line: 206, column: 72, scope: !606)
!680 = !DILocalVariable(name: "dst", arg: 4, scope: !606, file: !607, line: 206, type: !401)
!681 = !DILocation(line: 206, column: 87, scope: !606)
!682 = !DILocalVariable(name: "lumCtx", scope: !606, file: !607, line: 208, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "VScalerContext", file: !607, line: 30, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VScalerContext", file: !607, line: 22, size: 384, align: 64, elements: !686)
!686 = !{!687, !689, !690, !691, !692, !693}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !685, file: !607, line: 24, baseType: !688, size: 128, align: 64)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, align: 64, elements: !349)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "filter_pos", scope: !685, file: !607, line: 25, baseType: !433, size: 64, align: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !685, file: !607, line: 26, baseType: !256, size: 32, align: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "isMMX", scope: !685, file: !607, line: 27, baseType: !256, size: 32, align: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", scope: !685, file: !607, line: 28, baseType: !245, size: 64, align: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !685, file: !607, line: 29, baseType: !547, size: 64, align: 64, offset: 320)
!694 = !DILocation(line: 208, column: 21, scope: !606)
!695 = !DILocalVariable(name: "chrCtx", scope: !606, file: !607, line: 209, type: !683)
!696 = !DILocation(line: 209, column: 21, scope: !606)
!697 = !DILocation(line: 211, column: 21, scope: !622)
!698 = !DILocation(line: 211, column: 24, scope: !622)
!699 = !DILocation(line: 211, column: 9, scope: !622)
!700 = !DILocation(line: 676, column: 58, scope: !666, inlinedAt: !667)
!701 = !DILocation(line: 676, column: 38, scope: !666, inlinedAt: !667)
!702 = !DILocation(line: 677, column: 16, scope: !703, inlinedAt: !667)
!703 = !DILexicalBlockFile(scope: !704, file: !225, discriminator: 1)
!704 = distinct !DILexicalBlock(scope: !705, file: !225, line: 677, column: 14)
!705 = distinct !DILexicalBlock(scope: !666, file: !225, line: 677, column: 8)
!706 = !DILocation(line: 677, column: 15, scope: !703, inlinedAt: !667)
!707 = !DILocation(line: 677, column: 14, scope: !703, inlinedAt: !667)
!708 = !DILocation(line: 677, column: 25, scope: !709, inlinedAt: !667)
!709 = !DILexicalBlockFile(scope: !710, file: !225, discriminator: 2)
!710 = distinct !DILexicalBlock(scope: !704, file: !225, line: 677, column: 23)
!711 = !DILocation(line: 677, column: 90, scope: !712, inlinedAt: !667)
!712 = !DILexicalBlockFile(scope: !709, file: !225, discriminator: 4)
!713 = !DILocation(line: 677, column: 90, scope: !709, inlinedAt: !667)
!714 = !DILocation(line: 678, column: 14, scope: !666, inlinedAt: !667)
!715 = !DILocation(line: 678, column: 20, scope: !666, inlinedAt: !667)
!716 = !DILocation(line: 678, column: 26, scope: !666, inlinedAt: !667)
!717 = !DILocation(line: 678, column: 38, scope: !666, inlinedAt: !667)
!718 = !DILocation(line: 678, column: 47, scope: !665, inlinedAt: !667)
!719 = !DILocation(line: 678, column: 41, scope: !665, inlinedAt: !667)
!720 = !DILocation(line: 669, column: 58, scope: !662, inlinedAt: !664)
!721 = !DILocation(line: 669, column: 38, scope: !662, inlinedAt: !664)
!722 = !DILocation(line: 670, column: 16, scope: !723, inlinedAt: !664)
!723 = !DILexicalBlockFile(scope: !724, file: !225, discriminator: 1)
!724 = distinct !DILexicalBlock(scope: !725, file: !225, line: 670, column: 14)
!725 = distinct !DILexicalBlock(scope: !662, file: !225, line: 670, column: 8)
!726 = !DILocation(line: 670, column: 15, scope: !723, inlinedAt: !664)
!727 = !DILocation(line: 670, column: 14, scope: !723, inlinedAt: !664)
!728 = !DILocation(line: 670, column: 25, scope: !729, inlinedAt: !664)
!729 = !DILexicalBlockFile(scope: !730, file: !225, discriminator: 2)
!730 = distinct !DILexicalBlock(scope: !724, file: !225, line: 670, column: 23)
!731 = !DILocation(line: 670, column: 90, scope: !732, inlinedAt: !664)
!732 = !DILexicalBlockFile(scope: !729, file: !225, discriminator: 4)
!733 = !DILocation(line: 670, column: 90, scope: !729, inlinedAt: !664)
!734 = !DILocation(line: 671, column: 14, scope: !662, inlinedAt: !664)
!735 = !DILocation(line: 671, column: 20, scope: !662, inlinedAt: !664)
!736 = !DILocation(line: 671, column: 26, scope: !662, inlinedAt: !664)
!737 = !DILocation(line: 671, column: 38, scope: !662, inlinedAt: !664)
!738 = !DILocation(line: 671, column: 41, scope: !739, inlinedAt: !664)
!739 = !DILexicalBlockFile(scope: !662, file: !225, discriminator: 1)
!740 = !DILocation(line: 671, column: 47, scope: !739, inlinedAt: !664)
!741 = !DILocation(line: 671, column: 61, scope: !739, inlinedAt: !664)
!742 = !DILocation(line: 671, column: 38, scope: !743, inlinedAt: !664)
!743 = !DILexicalBlockFile(scope: !662, file: !225, discriminator: 2)
!744 = !DILocation(line: 678, column: 38, scope: !745, inlinedAt: !667)
!745 = !DILexicalBlockFile(scope: !666, file: !225, discriminator: 2)
!746 = !DILocation(line: 211, column: 35, scope: !622)
!747 = !DILocation(line: 211, column: 46, scope: !659)
!748 = !DILocation(line: 211, column: 49, scope: !659)
