; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--swscale.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--swscale.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !246, line: 48, baseType: !247)
!246 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!247 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !246, line: 51, baseType: !251)
!251 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!252 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !246, line: 49, baseType: !255)
!255 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !246, line: 38, baseType: !252)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !246, line: 122, baseType: !262)
!262 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !267, line: 222, size: 16, align: 8, elements: !268)
!267 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !266, file: !267, line: 222, baseType: !254, size: 16, align: 16)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!272 = !{!273, !279, !627, !628}
!273 = distinct !DIGlobalVariable(name: "ff_dither_8x8_128", scope: !0, file: !274, line: 39, type: !275, isLocal: false, isDefinition: true, variable: [9 x [8 x i8]]* @ff_dither_8x8_128)
!274 = !DIFile(filename: "libswscale/swscale.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 576, align: 8, elements: !276)
!276 = !{!277, !278}
!277 = !DISubrange(count: 9)
!278 = !DISubrange(count: 8)
!279 = distinct !DIGlobalVariable(name: "warnedAlready", scope: !280, file: !274, line: 318, type: !252, isLocal: true, isDefinition: true, variable: i32* @swscale.warnedAlready)
!280 = distinct !DISubprogram(name: "swscale", scope: !274, file: !274, line: 237, type: !281, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !626)
!281 = !DISubroutineType(types: !282)
!282 = !{!252, !283, !337, !338, !252, !252, !263, !338}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !286)
!286 = !{!287, !331, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !367, !371, !375, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !388, !389, !409, !423, !427, !428, !431, !432, !433, !434, !435, !436, !437, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !465, !467, !468, !469, !473, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !513, !514, !515, !516, !517, !518, !519, !520, !524, !525, !528, !530, !531, !532, !533, !534, !535, !536, !537, !540, !541, !548, !554, !559, !564, !569, !574, !579, !584, !585, !589, !593, !597, !598, !602, !606, !612, !613, !617, !621, !622, !624}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !285, file: !225, line: 284, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !292)
!292 = !{!293, !297, !301, !305, !306, !307, !308, !312, !318, !320, !324}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !291, file: !4, line: 72, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !291, file: !4, line: 78, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!294, !258}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !291, file: !4, line: 85, baseType: !302, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !291, file: !4, line: 93, baseType: !252, size: 32, align: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !291, file: !4, line: 99, baseType: !252, size: 32, align: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !291, file: !4, line: 108, baseType: !252, size: 32, align: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !291, file: !4, line: 113, baseType: !309, size: 64, align: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!258, !258, !258}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !291, file: !4, line: 123, baseType: !313, size: 64, align: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !291, file: !4, line: 130, baseType: !319, size: 32, align: 32, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !291, file: !4, line: 136, baseType: !321, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!319, !258}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !291, file: !4, line: 142, baseType: !325, size: 64, align: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!252, !328, !258, !294, !252}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !285, file: !225, line: 290, baseType: !332, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!252, !336, !337, !338, !252, !252, !263, !338}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !285, file: !225, line: 291, baseType: !252, size: 32, align: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !285, file: !225, line: 292, baseType: !252, size: 32, align: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !285, file: !225, line: 293, baseType: !252, size: 32, align: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !285, file: !225, line: 294, baseType: !252, size: 32, align: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !285, file: !225, line: 295, baseType: !252, size: 32, align: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !285, file: !225, line: 296, baseType: !252, size: 32, align: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !285, file: !225, line: 297, baseType: !252, size: 32, align: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !285, file: !225, line: 298, baseType: !252, size: 32, align: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !285, file: !225, line: 298, baseType: !252, size: 32, align: 32, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !285, file: !225, line: 299, baseType: !252, size: 32, align: 32, offset: 416)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !285, file: !225, line: 299, baseType: !252, size: 32, align: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !285, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !285, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !285, file: !225, line: 302, baseType: !252, size: 32, align: 32, offset: 544)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !285, file: !225, line: 303, baseType: !252, size: 32, align: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !285, file: !225, line: 304, baseType: !252, size: 32, align: 32, offset: 608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !285, file: !225, line: 304, baseType: !252, size: 32, align: 32, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !285, file: !225, line: 305, baseType: !252, size: 32, align: 32, offset: 672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !285, file: !225, line: 306, baseType: !252, size: 32, align: 32, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !285, file: !225, line: 307, baseType: !252, size: 32, align: 32, offset: 736)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !285, file: !225, line: 308, baseType: !252, size: 32, align: 32, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !285, file: !225, line: 309, baseType: !252, size: 32, align: 32, offset: 800)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !285, file: !225, line: 310, baseType: !252, size: 32, align: 32, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !285, file: !225, line: 311, baseType: !363, size: 128, align: 64, offset: 896)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 128, align: 64, elements: !365)
!364 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!365 = !{!366}
!366 = !DISubrange(count: 2)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !285, file: !225, line: 317, baseType: !368, size: 192, align: 64, offset: 1024)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 192, align: 64, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 3)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !285, file: !225, line: 318, baseType: !372, size: 128, align: 32, offset: 1216)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 128, align: 32, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 4)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !285, file: !225, line: 319, baseType: !376, size: 256, align: 64, offset: 1344)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 256, align: 64, elements: !373)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !285, file: !225, line: 320, baseType: !372, size: 128, align: 32, offset: 1600)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !285, file: !225, line: 321, baseType: !376, size: 256, align: 64, offset: 1728)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !285, file: !225, line: 322, baseType: !252, size: 32, align: 32, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !285, file: !225, line: 324, baseType: !364, size: 64, align: 64, offset: 2048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !285, file: !225, line: 325, baseType: !252, size: 32, align: 32, offset: 2112)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !285, file: !225, line: 326, baseType: !252, size: 32, align: 32, offset: 2144)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !285, file: !225, line: 327, baseType: !253, size: 64, align: 64, offset: 2176)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !285, file: !225, line: 328, baseType: !253, size: 64, align: 64, offset: 2240)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !285, file: !225, line: 330, baseType: !252, size: 32, align: 32, offset: 2304)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !285, file: !225, line: 331, baseType: !387, size: 64, align: 32, offset: 2336)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, align: 32, elements: !365)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !285, file: !225, line: 332, baseType: !252, size: 32, align: 32, offset: 2400)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !285, file: !225, line: 333, baseType: !390, size: 64, align: 64, offset: 2432)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !391, file: !225, line: 945, baseType: !252, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !391, file: !225, line: 946, baseType: !252, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !391, file: !225, line: 947, baseType: !252, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !391, file: !225, line: 948, baseType: !252, size: 32, align: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !391, file: !225, line: 949, baseType: !252, size: 32, align: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !391, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !391, file: !225, line: 951, baseType: !400, size: 1024, align: 64, offset: 192)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 1024, align: 64, elements: !373)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !403)
!403 = !{!404, !405, !406, !407, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !402, file: !225, line: 931, baseType: !252, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !402, file: !225, line: 932, baseType: !252, size: 32, align: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !402, file: !225, line: 933, baseType: !252, size: 32, align: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !402, file: !225, line: 934, baseType: !263, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !402, file: !225, line: 935, baseType: !263, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !285, file: !225, line: 334, baseType: !410, size: 64, align: 64, offset: 2496)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !412)
!412 = !{!413, !416, !417, !418, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !411, file: !225, line: 960, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !391)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !411, file: !225, line: 961, baseType: !414, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !411, file: !225, line: 963, baseType: !252, size: 32, align: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !411, file: !225, line: 964, baseType: !258, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !411, file: !225, line: 967, baseType: !420, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!252, !283, !410, !252, !252}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !285, file: !225, line: 336, baseType: !424, size: 8192, align: 32, offset: 2560)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 8192, align: 32, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !285, file: !225, line: 337, baseType: !424, size: 8192, align: 32, offset: 10752)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !285, file: !225, line: 339, baseType: !429, size: 8192, align: 32, offset: 18944)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 8192, align: 32, elements: !425)
!430 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !285, file: !225, line: 351, baseType: !252, size: 32, align: 32, offset: 27136)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !285, file: !225, line: 352, baseType: !252, size: 32, align: 32, offset: 27168)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !285, file: !225, line: 353, baseType: !252, size: 32, align: 32, offset: 27200)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !285, file: !225, line: 354, baseType: !252, size: 32, align: 32, offset: 27232)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !285, file: !225, line: 357, baseType: !264, size: 64, align: 64, offset: 27264)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !285, file: !225, line: 358, baseType: !252, size: 32, align: 32, offset: 27328)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !285, file: !225, line: 374, baseType: !438, size: 64, align: 64, offset: 27392)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !246, line: 37, baseType: !440)
!440 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !285, file: !225, line: 375, baseType: !438, size: 64, align: 64, offset: 27456)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !285, file: !225, line: 376, baseType: !438, size: 64, align: 64, offset: 27520)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !285, file: !225, line: 377, baseType: !438, size: 64, align: 64, offset: 27584)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !285, file: !225, line: 378, baseType: !259, size: 64, align: 64, offset: 27648)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !285, file: !225, line: 379, baseType: !259, size: 64, align: 64, offset: 27712)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !285, file: !225, line: 380, baseType: !259, size: 64, align: 64, offset: 27776)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !285, file: !225, line: 381, baseType: !259, size: 64, align: 64, offset: 27840)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !285, file: !225, line: 382, baseType: !252, size: 32, align: 32, offset: 27904)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !285, file: !225, line: 383, baseType: !252, size: 32, align: 32, offset: 27936)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !285, file: !225, line: 384, baseType: !252, size: 32, align: 32, offset: 27968)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !285, file: !225, line: 385, baseType: !252, size: 32, align: 32, offset: 28000)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !285, file: !225, line: 388, baseType: !252, size: 32, align: 32, offset: 28032)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !285, file: !225, line: 389, baseType: !252, size: 32, align: 32, offset: 28064)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !285, file: !225, line: 390, baseType: !264, size: 64, align: 64, offset: 28096)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !285, file: !225, line: 391, baseType: !264, size: 64, align: 64, offset: 28160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !285, file: !225, line: 393, baseType: !252, size: 32, align: 32, offset: 28224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !285, file: !225, line: 394, baseType: !252, size: 32, align: 32, offset: 28256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !285, file: !225, line: 396, baseType: !252, size: 32, align: 32, offset: 28288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !285, file: !225, line: 397, baseType: !252, size: 32, align: 32, offset: 28320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !285, file: !225, line: 398, baseType: !258, size: 64, align: 64, offset: 28352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !285, file: !225, line: 401, baseType: !462, size: 40960, align: 32, offset: 28416)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 40960, align: 32, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 1280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !285, file: !225, line: 402, baseType: !466, size: 81920, align: 64, offset: 69376)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 81920, align: 64, elements: !463)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !285, file: !225, line: 403, baseType: !466, size: 81920, align: 64, offset: 151296)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !285, file: !225, line: 404, baseType: !466, size: 81920, align: 64, offset: 233216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !285, file: !225, line: 405, baseType: !470, size: 5632, align: 32, offset: 315136)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 5632, align: 32, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !285, file: !225, line: 417, baseType: !474, size: 256, align: 64, offset: 320768)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 256, align: 64, elements: !373)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !285, file: !225, line: 420, baseType: !252, size: 32, align: 32, offset: 321024)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !285, file: !225, line: 420, baseType: !252, size: 32, align: 32, offset: 321056)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !285, file: !225, line: 420, baseType: !252, size: 32, align: 32, offset: 321088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !285, file: !225, line: 421, baseType: !372, size: 128, align: 32, offset: 321120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !285, file: !225, line: 422, baseType: !372, size: 128, align: 32, offset: 321248)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !285, file: !225, line: 423, baseType: !252, size: 32, align: 32, offset: 321376)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !285, file: !225, line: 424, baseType: !252, size: 32, align: 32, offset: 321408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !285, file: !225, line: 425, baseType: !252, size: 32, align: 32, offset: 321440)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !285, file: !225, line: 426, baseType: !252, size: 32, align: 32, offset: 321472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !285, file: !225, line: 427, baseType: !252, size: 32, align: 32, offset: 321504)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !285, file: !225, line: 428, baseType: !252, size: 32, align: 32, offset: 321536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !285, file: !225, line: 429, baseType: !252, size: 32, align: 32, offset: 321568)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !285, file: !225, line: 430, baseType: !252, size: 32, align: 32, offset: 321600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !285, file: !225, line: 431, baseType: !252, size: 32, align: 32, offset: 321632)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !285, file: !225, line: 432, baseType: !252, size: 32, align: 32, offset: 321664)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !285, file: !225, line: 433, baseType: !252, size: 32, align: 32, offset: 321696)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !285, file: !225, line: 434, baseType: !252, size: 32, align: 32, offset: 321728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !285, file: !225, line: 435, baseType: !252, size: 32, align: 32, offset: 321760)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !285, file: !225, line: 436, baseType: !252, size: 32, align: 32, offset: 321792)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !285, file: !225, line: 437, baseType: !252, size: 32, align: 32, offset: 321824)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !285, file: !225, line: 438, baseType: !252, size: 32, align: 32, offset: 321856)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !285, file: !225, line: 466, baseType: !497, size: 64, align: 64, offset: 321920)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !246, line: 55, baseType: !262)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !285, file: !225, line: 467, baseType: !497, size: 64, align: 64, offset: 321984)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !285, file: !225, line: 468, baseType: !497, size: 64, align: 64, offset: 322048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !285, file: !225, line: 470, baseType: !497, size: 64, align: 64, offset: 322112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !285, file: !225, line: 471, baseType: !497, size: 64, align: 64, offset: 322176)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !285, file: !225, line: 472, baseType: !497, size: 64, align: 64, offset: 322240)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !285, file: !225, line: 473, baseType: !497, size: 64, align: 64, offset: 322304)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !285, file: !225, line: 474, baseType: !497, size: 64, align: 64, offset: 322368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !285, file: !225, line: 475, baseType: !497, size: 64, align: 64, offset: 322432)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !285, file: !225, line: 476, baseType: !497, size: 64, align: 64, offset: 322496)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !285, file: !225, line: 477, baseType: !497, size: 64, align: 64, offset: 322560)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !285, file: !225, line: 478, baseType: !509, size: 32768, align: 32, offset: 322624)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32768, align: 32, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !285, file: !225, line: 479, baseType: !509, size: 32768, align: 32, offset: 355392)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !285, file: !225, line: 480, baseType: !252, size: 32, align: 32, offset: 388160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !285, file: !225, line: 481, baseType: !497, size: 64, align: 64, offset: 388224)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !285, file: !225, line: 482, baseType: !497, size: 64, align: 64, offset: 388288)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !285, file: !225, line: 483, baseType: !497, size: 64, align: 64, offset: 388352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !285, file: !225, line: 484, baseType: !497, size: 64, align: 64, offset: 388416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !285, file: !225, line: 485, baseType: !497, size: 64, align: 64, offset: 388480)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !285, file: !225, line: 486, baseType: !509, size: 32768, align: 32, offset: 388544)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !285, file: !225, line: 490, baseType: !521, size: 64, align: 64, offset: 421312)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !522, line: 149, baseType: !523)
!522 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!523 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !285, file: !225, line: 491, baseType: !521, size: 64, align: 64, offset: 421376)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !285, file: !225, line: 492, baseType: !526, size: 128, align: 16, offset: 421440)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, align: 16, elements: !527)
!527 = !{!278}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !285, file: !225, line: 493, baseType: !529, size: 256, align: 32, offset: 421568)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 256, align: 32, elements: !527)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !285, file: !225, line: 495, baseType: !243, size: 64, align: 64, offset: 421824)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !285, file: !225, line: 495, baseType: !243, size: 64, align: 64, offset: 421888)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !285, file: !225, line: 508, baseType: !252, size: 32, align: 32, offset: 421952)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !285, file: !225, line: 513, baseType: !438, size: 64, align: 64, offset: 422016)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !285, file: !225, line: 514, baseType: !438, size: 64, align: 64, offset: 422080)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !285, file: !225, line: 515, baseType: !438, size: 64, align: 64, offset: 422144)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !285, file: !225, line: 516, baseType: !438, size: 64, align: 64, offset: 422208)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !285, file: !225, line: 517, baseType: !538, size: 192, align: 16, offset: 422272)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 192, align: 16, elements: !539)
!539 = !{!370, !374}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !285, file: !225, line: 518, baseType: !538, size: 192, align: 16, offset: 422464)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !285, file: !225, line: 521, baseType: !542, size: 64, align: 64, offset: 422656)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !546, !264, !252, !243, !252}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !285, file: !225, line: 522, baseType: !549, size: 64, align: 64, offset: 422720)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !546, !252, !553, !264, !252, !243, !252}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !285, file: !225, line: 523, baseType: !555, size: 64, align: 64, offset: 422784)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !336, !546, !252, !553, !553, !264, !252}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !285, file: !225, line: 524, baseType: !560, size: 64, align: 64, offset: 422848)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !336, !546, !553, !553, !546, !264, !252, !252, !252}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !285, file: !225, line: 525, baseType: !565, size: 64, align: 64, offset: 422912)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !336, !553, !553, !553, !553, !264, !252, !252, !252, !252}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !285, file: !225, line: 526, baseType: !570, size: 64, align: 64, offset: 422976)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !336, !546, !553, !252, !546, !553, !553, !252, !553, !264, !252, !252}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !285, file: !225, line: 527, baseType: !575, size: 64, align: 64, offset: 423040)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !336, !546, !553, !252, !546, !553, !553, !252, !553, !263, !252, !252}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !285, file: !225, line: 530, baseType: !580, size: 64, align: 64, offset: 423104)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !264, !243, !243, !243, !252, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !285, file: !225, line: 533, baseType: !580, size: 64, align: 64, offset: 423168)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !285, file: !225, line: 536, baseType: !586, size: 64, align: 64, offset: 423232)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !264, !264, !243, !243, !243, !252, !583}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !285, file: !225, line: 545, baseType: !590, size: 64, align: 64, offset: 423296)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !264, !337, !252, !259}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !285, file: !225, line: 546, baseType: !594, size: 64, align: 64, offset: 423360)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !264, !264, !337, !252, !259}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !285, file: !225, line: 548, baseType: !590, size: 64, align: 64, offset: 423424)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !285, file: !225, line: 570, baseType: !599, size: 64, align: 64, offset: 423488)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !336, !438, !252, !243, !252, !252}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !285, file: !225, line: 573, baseType: !603, size: 64, align: 64, offset: 423552)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !336, !438, !438, !252, !243, !243, !252, !252}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !285, file: !225, line: 610, baseType: !607, size: 64, align: 64, offset: 423616)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !336, !438, !252, !243, !546, !610, !252}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !285, file: !225, line: 613, baseType: !607, size: 64, align: 64, offset: 423680)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !285, file: !225, line: 619, baseType: !614, size: 64, align: 64, offset: 423744)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !438, !252}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !285, file: !225, line: 621, baseType: !618, size: 64, align: 64, offset: 423808)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !438, !438, !252}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !285, file: !225, line: 623, baseType: !252, size: 32, align: 32, offset: 423872)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !285, file: !225, line: 625, baseType: !623, size: 32, align: 32, offset: 423904)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !285, file: !225, line: 627, baseType: !625, size: 32, align: 32, offset: 423936)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!626 = !{}
!627 = distinct !DIGlobalVariable(name: "warnedAlready", scope: !280, file: !274, line: 332, type: !252, isLocal: true, isDefinition: true, variable: i32* @swscale.warnedAlready.13)
!628 = distinct !DIGlobalVariable(name: "sws_pb_64", scope: !0, file: !274, line: 51, type: !629, isLocal: true, isDefinition: true, variable: [8 x i8]* @sws_pb_64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 64, align: 8, elements: !527)
!630 = !{i32 2, !"Dwarf Version", i32 4}
!631 = !{i32 2, !"Debug Info Version", i32 3}
!632 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!633 = distinct !DISubprogram(name: "ff_sws_init_range_convert", scope: !274, file: !274, line: 540, type: !634, isLocal: false, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !626)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !283}
!636 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !637, file: !225, line: 761, type: !24)
!637 = distinct !DISubprogram(name: "isAnyRGB", scope: !225, file: !225, line: 761, type: !638, isLocal: true, isDefinition: true, scopeLine: 762, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !626)
!638 = !DISubroutineType(types: !639)
!639 = !{!252, !24}
!640 = !DIExpression()
!641 = !DILocation(line: 761, column: 78, scope: !637, inlinedAt: !642)
!642 = distinct !DILocation(line: 544, column: 40, scope: !643)
!643 = !DILexicalBlockFile(scope: !644, file: !274, discriminator: 1)
!644 = distinct !DILexicalBlock(scope: !633, file: !274, line: 544, column: 9)
!645 = !DILocalVariable(name: "desc", scope: !637, file: !225, line: 763, type: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !649, line: 123, baseType: !650)
!649 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !649, line: 81, size: 1280, align: 64, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !670}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !649, line: 82, baseType: !294, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !650, file: !649, line: 83, baseType: !245, size: 8, align: 8, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !650, file: !649, line: 92, baseType: !245, size: 8, align: 8, offset: 72)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !650, file: !649, line: 101, baseType: !245, size: 8, align: 8, offset: 80)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !650, file: !649, line: 106, baseType: !497, size: 64, align: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !650, file: !649, line: 117, baseType: !658, size: 1024, align: 32, offset: 192)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 1024, align: 32, elements: !373)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !649, line: 70, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !649, line: 31, size: 256, align: 32, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !660, file: !649, line: 35, baseType: !252, size: 32, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !660, file: !649, line: 41, baseType: !252, size: 32, align: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !660, file: !649, line: 47, baseType: !252, size: 32, align: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !660, file: !649, line: 53, baseType: !252, size: 32, align: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !660, file: !649, line: 58, baseType: !252, size: 32, align: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !660, file: !649, line: 62, baseType: !252, size: 32, align: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !660, file: !649, line: 65, baseType: !252, size: 32, align: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !660, file: !649, line: 68, baseType: !252, size: 32, align: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !650, file: !649, line: 122, baseType: !294, size: 64, align: 64, offset: 1216)
!671 = !DILocation(line: 763, column: 31, scope: !637, inlinedAt: !642)
!672 = !DILocalVariable(name: "c", arg: 1, scope: !633, file: !274, line: 540, type: !283)
!673 = !DILocation(line: 540, column: 66, scope: !633)
!674 = !DILocation(line: 542, column: 5, scope: !633)
!675 = !DILocation(line: 542, column: 8, scope: !633)
!676 = !DILocation(line: 542, column: 24, scope: !633)
!677 = !DILocation(line: 543, column: 5, scope: !633)
!678 = !DILocation(line: 543, column: 8, scope: !633)
!679 = !DILocation(line: 543, column: 24, scope: !633)
!680 = !DILocation(line: 544, column: 9, scope: !644)
!681 = !DILocation(line: 544, column: 12, scope: !644)
!682 = !DILocation(line: 544, column: 24, scope: !644)
!683 = !DILocation(line: 544, column: 27, scope: !644)
!684 = !DILocation(line: 544, column: 21, scope: !644)
!685 = !DILocation(line: 544, column: 36, scope: !644)
!686 = !DILocation(line: 544, column: 49, scope: !643)
!687 = !DILocation(line: 544, column: 52, scope: !643)
!688 = !DILocation(line: 544, column: 40, scope: !643)
!689 = !DILocation(line: 763, column: 58, scope: !637, inlinedAt: !642)
!690 = !DILocation(line: 763, column: 38, scope: !637, inlinedAt: !642)
!691 = !DILocation(line: 764, column: 16, scope: !692, inlinedAt: !642)
!692 = !DILexicalBlockFile(scope: !693, file: !225, discriminator: 1)
!693 = distinct !DILexicalBlock(scope: !694, file: !225, line: 764, column: 14)
!694 = distinct !DILexicalBlock(scope: !637, file: !225, line: 764, column: 8)
!695 = !DILocation(line: 764, column: 15, scope: !692, inlinedAt: !642)
!696 = !DILocation(line: 764, column: 14, scope: !692, inlinedAt: !642)
!697 = !DILocation(line: 764, column: 25, scope: !698, inlinedAt: !642)
!698 = !DILexicalBlockFile(scope: !699, file: !225, discriminator: 2)
!699 = distinct !DILexicalBlock(scope: !693, file: !225, line: 764, column: 23)
!700 = !DILocation(line: 764, column: 90, scope: !701, inlinedAt: !642)
!701 = !DILexicalBlockFile(scope: !698, file: !225, discriminator: 4)
!702 = !DILocation(line: 764, column: 90, scope: !698, inlinedAt: !642)
!703 = !DILocation(line: 765, column: 13, scope: !637, inlinedAt: !642)
!704 = !DILocation(line: 765, column: 19, scope: !637, inlinedAt: !642)
!705 = !DILocation(line: 765, column: 25, scope: !637, inlinedAt: !642)
!706 = !DILocation(line: 765, column: 37, scope: !637, inlinedAt: !642)
!707 = !DILocation(line: 766, column: 13, scope: !637, inlinedAt: !642)
!708 = !DILocation(line: 766, column: 21, scope: !637, inlinedAt: !642)
!709 = !DILocation(line: 766, column: 45, scope: !637, inlinedAt: !642)
!710 = !DILocation(line: 766, column: 48, scope: !711, inlinedAt: !642)
!711 = !DILexicalBlockFile(scope: !637, file: !225, discriminator: 1)
!712 = !DILocation(line: 766, column: 56, scope: !711, inlinedAt: !642)
!713 = !DILocation(line: 766, column: 45, scope: !711, inlinedAt: !642)
!714 = !DILocation(line: 766, column: 45, scope: !715, inlinedAt: !642)
!715 = !DILexicalBlockFile(scope: !637, file: !225, discriminator: 2)
!716 = !DILocation(line: 544, column: 9, scope: !643)
!717 = !DILocation(line: 545, column: 13, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !274, line: 545, column: 13)
!719 = distinct !DILexicalBlock(scope: !644, file: !274, line: 544, column: 64)
!720 = !DILocation(line: 545, column: 16, scope: !718)
!721 = !DILocation(line: 545, column: 23, scope: !718)
!722 = !DILocation(line: 545, column: 13, scope: !719)
!723 = !DILocation(line: 546, column: 17, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !274, line: 546, column: 17)
!725 = distinct !DILexicalBlock(scope: !718, file: !274, line: 545, column: 30)
!726 = !DILocation(line: 546, column: 20, scope: !724)
!727 = !DILocation(line: 546, column: 17, scope: !725)
!728 = !DILocation(line: 547, column: 17, scope: !729)
