; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--hscale_fast_bilinear.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a/[inter]libswscale--hscale_fast_bilinear.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!192 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!193 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!194 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!195 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!196 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!197 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!198 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!199 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!200 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!201 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!202 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!203 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!204 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!205 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!206 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!207 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!208 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!209 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!210 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!211 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!212 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!213 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!214 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!215 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!216 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!217 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!218 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!219 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!220 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!221 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!222 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!223 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !225, line: 65, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!228 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!229 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!230 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!231 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!232 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!233 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !225, line: 75, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!237 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!238 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!239 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!240 = !{i32 2, !"Dwarf Version", i32 4}
!241 = !{i32 2, !"Debug Info Version", i32 3}
!242 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!243 = distinct !DISubprogram(name: "ff_hyscale_fast_c", scope: !244, file: !244, line: 23, type: !245, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!244 = !DIFile(filename: "libswscale/hscale_fast_bilinear.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!245 = !DISubroutineType(types: !246)
!246 = !{null, !247, !416, !271, !304, !271, !271}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !250)
!250 = !{!251, !297, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !340, !344, !348, !350, !351, !352, !353, !354, !355, !356, !360, !361, !362, !364, !365, !385, !399, !405, !406, !409, !410, !411, !412, !413, !414, !415, !420, !421, !422, !423, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !446, !448, !449, !450, !454, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !494, !495, !496, !497, !498, !499, !500, !501, !502, !506, !507, !511, !513, !514, !515, !516, !517, !518, !519, !520, !523, !524, !531, !537, !542, !547, !552, !557, !562, !567, !568, !572, !576, !580, !581, !585, !589, !595, !596, !600, !604, !605, !607}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !249, file: !225, line: 284, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !256)
!256 = !{!257, !261, !266, !270, !272, !273, !274, !278, !284, !286, !290}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !255, file: !4, line: 72, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !255, file: !4, line: 78, baseType: !262, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!258, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !255, file: !4, line: 85, baseType: !267, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !255, file: !4, line: 93, baseType: !271, size: 32, align: 32, offset: 192)
!271 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !255, file: !4, line: 99, baseType: !271, size: 32, align: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !255, file: !4, line: 108, baseType: !271, size: 32, align: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !255, file: !4, line: 113, baseType: !275, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!265, !265, !265}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !255, file: !4, line: 123, baseType: !279, size: 64, align: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !255, file: !4, line: 130, baseType: !285, size: 32, align: 32, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !255, file: !4, line: 136, baseType: !287, size: 64, align: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!285, !265}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !255, file: !4, line: 142, baseType: !291, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!271, !294, !265, !258, !271}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !249, file: !225, line: 290, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!271, !302, !303, !309, !271, !271, !310, !309}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !307, line: 48, baseType: !308)
!307 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!308 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !249, file: !225, line: 291, baseType: !271, size: 32, align: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !249, file: !225, line: 292, baseType: !271, size: 32, align: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !249, file: !225, line: 293, baseType: !271, size: 32, align: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !249, file: !225, line: 294, baseType: !271, size: 32, align: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !249, file: !225, line: 295, baseType: !271, size: 32, align: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !249, file: !225, line: 296, baseType: !271, size: 32, align: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !249, file: !225, line: 297, baseType: !271, size: 32, align: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !249, file: !225, line: 298, baseType: !271, size: 32, align: 32, offset: 352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !249, file: !225, line: 298, baseType: !271, size: 32, align: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !249, file: !225, line: 299, baseType: !271, size: 32, align: 32, offset: 416)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !249, file: !225, line: 299, baseType: !271, size: 32, align: 32, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !249, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !249, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !249, file: !225, line: 302, baseType: !271, size: 32, align: 32, offset: 544)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !249, file: !225, line: 303, baseType: !271, size: 32, align: 32, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !249, file: !225, line: 304, baseType: !271, size: 32, align: 32, offset: 608)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !249, file: !225, line: 304, baseType: !271, size: 32, align: 32, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !249, file: !225, line: 305, baseType: !271, size: 32, align: 32, offset: 672)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !249, file: !225, line: 306, baseType: !271, size: 32, align: 32, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !249, file: !225, line: 307, baseType: !271, size: 32, align: 32, offset: 736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !249, file: !225, line: 308, baseType: !271, size: 32, align: 32, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !249, file: !225, line: 309, baseType: !271, size: 32, align: 32, offset: 800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !249, file: !225, line: 310, baseType: !271, size: 32, align: 32, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !249, file: !225, line: 311, baseType: !336, size: 128, align: 64, offset: 896)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 128, align: 64, elements: !338)
!337 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!338 = !{!339}
!339 = !DISubrange(count: 2)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !249, file: !225, line: 317, baseType: !341, size: 192, align: 64, offset: 1024)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 192, align: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 3)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !249, file: !225, line: 318, baseType: !345, size: 128, align: 32, offset: 1216)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, align: 32, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 4)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !249, file: !225, line: 319, baseType: !349, size: 256, align: 64, offset: 1344)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 256, align: 64, elements: !346)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !249, file: !225, line: 320, baseType: !345, size: 128, align: 32, offset: 1600)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !249, file: !225, line: 321, baseType: !349, size: 256, align: 64, offset: 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !249, file: !225, line: 322, baseType: !271, size: 32, align: 32, offset: 1984)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !249, file: !225, line: 324, baseType: !337, size: 64, align: 64, offset: 2048)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !249, file: !225, line: 325, baseType: !271, size: 32, align: 32, offset: 2112)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !249, file: !225, line: 326, baseType: !271, size: 32, align: 32, offset: 2144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !249, file: !225, line: 327, baseType: !357, size: 64, align: 64, offset: 2176)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !307, line: 49, baseType: !359)
!359 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !249, file: !225, line: 328, baseType: !357, size: 64, align: 64, offset: 2240)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !249, file: !225, line: 330, baseType: !271, size: 32, align: 32, offset: 2304)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !249, file: !225, line: 331, baseType: !363, size: 64, align: 32, offset: 2336)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 64, align: 32, elements: !338)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !249, file: !225, line: 332, baseType: !271, size: 32, align: 32, offset: 2400)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !249, file: !225, line: 333, baseType: !366, size: 64, align: 64, offset: 2432)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !367, file: !225, line: 945, baseType: !271, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !367, file: !225, line: 946, baseType: !271, size: 32, align: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !367, file: !225, line: 947, baseType: !271, size: 32, align: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !367, file: !225, line: 948, baseType: !271, size: 32, align: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !367, file: !225, line: 949, baseType: !271, size: 32, align: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !367, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !367, file: !225, line: 951, baseType: !376, size: 1024, align: 64, offset: 192)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 1024, align: 64, elements: !346)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !379)
!379 = !{!380, !381, !382, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !378, file: !225, line: 931, baseType: !271, size: 32, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !378, file: !225, line: 932, baseType: !271, size: 32, align: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !378, file: !225, line: 933, baseType: !271, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !378, file: !225, line: 934, baseType: !310, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !378, file: !225, line: 935, baseType: !310, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !249, file: !225, line: 334, baseType: !386, size: 64, align: 64, offset: 2496)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !388)
!388 = !{!389, !392, !393, !394, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !387, file: !225, line: 960, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !367)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !387, file: !225, line: 961, baseType: !390, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !387, file: !225, line: 963, baseType: !271, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !387, file: !225, line: 964, baseType: !265, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !387, file: !225, line: 967, baseType: !396, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!271, !247, !386, !271, !271}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !249, file: !225, line: 336, baseType: !400, size: 8192, align: 32, offset: 2560)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 8192, align: 32, elements: !403)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !307, line: 51, baseType: !402)
!402 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!403 = !{!404}
!404 = !DISubrange(count: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !249, file: !225, line: 337, baseType: !400, size: 8192, align: 32, offset: 10752)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !249, file: !225, line: 339, baseType: !407, size: 8192, align: 32, offset: 18944)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 8192, align: 32, elements: !403)
!408 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !249, file: !225, line: 351, baseType: !271, size: 32, align: 32, offset: 27136)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !249, file: !225, line: 352, baseType: !271, size: 32, align: 32, offset: 27168)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !249, file: !225, line: 353, baseType: !271, size: 32, align: 32, offset: 27200)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !249, file: !225, line: 354, baseType: !271, size: 32, align: 32, offset: 27232)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !249, file: !225, line: 357, baseType: !311, size: 64, align: 64, offset: 27264)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !249, file: !225, line: 358, baseType: !271, size: 32, align: 32, offset: 27328)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !249, file: !225, line: 374, baseType: !416, size: 64, align: 64, offset: 27392)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !418, line: 195, baseType: !419)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!419 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !249, file: !225, line: 375, baseType: !416, size: 64, align: 64, offset: 27456)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !249, file: !225, line: 376, baseType: !416, size: 64, align: 64, offset: 27520)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !249, file: !225, line: 377, baseType: !416, size: 64, align: 64, offset: 27584)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !249, file: !225, line: 378, baseType: !424, size: 64, align: 64, offset: 27648)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !418, line: 196, baseType: !271)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !249, file: !225, line: 379, baseType: !424, size: 64, align: 64, offset: 27712)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !249, file: !225, line: 380, baseType: !424, size: 64, align: 64, offset: 27776)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !249, file: !225, line: 381, baseType: !424, size: 64, align: 64, offset: 27840)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !249, file: !225, line: 382, baseType: !271, size: 32, align: 32, offset: 27904)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !249, file: !225, line: 383, baseType: !271, size: 32, align: 32, offset: 27936)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !249, file: !225, line: 384, baseType: !271, size: 32, align: 32, offset: 27968)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !249, file: !225, line: 385, baseType: !271, size: 32, align: 32, offset: 28000)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !249, file: !225, line: 388, baseType: !271, size: 32, align: 32, offset: 28032)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !249, file: !225, line: 389, baseType: !271, size: 32, align: 32, offset: 28064)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !249, file: !225, line: 390, baseType: !311, size: 64, align: 64, offset: 28096)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !249, file: !225, line: 391, baseType: !311, size: 64, align: 64, offset: 28160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !249, file: !225, line: 393, baseType: !271, size: 32, align: 32, offset: 28224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !249, file: !225, line: 394, baseType: !271, size: 32, align: 32, offset: 28256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !249, file: !225, line: 396, baseType: !271, size: 32, align: 32, offset: 28288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !249, file: !225, line: 397, baseType: !271, size: 32, align: 32, offset: 28320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !249, file: !225, line: 398, baseType: !265, size: 64, align: 64, offset: 28352)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !249, file: !225, line: 401, baseType: !443, size: 40960, align: 32, offset: 28416)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 40960, align: 32, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !249, file: !225, line: 402, baseType: !447, size: 81920, align: 64, offset: 69376)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 81920, align: 64, elements: !444)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !249, file: !225, line: 403, baseType: !447, size: 81920, align: 64, offset: 151296)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !249, file: !225, line: 404, baseType: !447, size: 81920, align: 64, offset: 233216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !249, file: !225, line: 405, baseType: !451, size: 5632, align: 32, offset: 315136)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 5632, align: 32, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 176)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !249, file: !225, line: 417, baseType: !455, size: 256, align: 64, offset: 320768)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 256, align: 64, elements: !346)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !249, file: !225, line: 420, baseType: !271, size: 32, align: 32, offset: 321024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !249, file: !225, line: 420, baseType: !271, size: 32, align: 32, offset: 321056)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !249, file: !225, line: 420, baseType: !271, size: 32, align: 32, offset: 321088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !249, file: !225, line: 421, baseType: !345, size: 128, align: 32, offset: 321120)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !249, file: !225, line: 422, baseType: !345, size: 128, align: 32, offset: 321248)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !249, file: !225, line: 423, baseType: !271, size: 32, align: 32, offset: 321376)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !249, file: !225, line: 424, baseType: !271, size: 32, align: 32, offset: 321408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !249, file: !225, line: 425, baseType: !271, size: 32, align: 32, offset: 321440)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !249, file: !225, line: 426, baseType: !271, size: 32, align: 32, offset: 321472)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !249, file: !225, line: 427, baseType: !271, size: 32, align: 32, offset: 321504)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !249, file: !225, line: 428, baseType: !271, size: 32, align: 32, offset: 321536)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !249, file: !225, line: 429, baseType: !271, size: 32, align: 32, offset: 321568)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !249, file: !225, line: 430, baseType: !271, size: 32, align: 32, offset: 321600)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !249, file: !225, line: 431, baseType: !271, size: 32, align: 32, offset: 321632)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !249, file: !225, line: 432, baseType: !271, size: 32, align: 32, offset: 321664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !249, file: !225, line: 433, baseType: !271, size: 32, align: 32, offset: 321696)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !249, file: !225, line: 434, baseType: !271, size: 32, align: 32, offset: 321728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !249, file: !225, line: 435, baseType: !271, size: 32, align: 32, offset: 321760)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !249, file: !225, line: 436, baseType: !271, size: 32, align: 32, offset: 321792)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !249, file: !225, line: 437, baseType: !271, size: 32, align: 32, offset: 321824)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !249, file: !225, line: 438, baseType: !271, size: 32, align: 32, offset: 321856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !249, file: !225, line: 466, baseType: !478, size: 64, align: 64, offset: 321920)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !307, line: 55, baseType: !479)
!479 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !249, file: !225, line: 467, baseType: !478, size: 64, align: 64, offset: 321984)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !249, file: !225, line: 468, baseType: !478, size: 64, align: 64, offset: 322048)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !249, file: !225, line: 470, baseType: !478, size: 64, align: 64, offset: 322112)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !249, file: !225, line: 471, baseType: !478, size: 64, align: 64, offset: 322176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !249, file: !225, line: 472, baseType: !478, size: 64, align: 64, offset: 322240)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !249, file: !225, line: 473, baseType: !478, size: 64, align: 64, offset: 322304)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !249, file: !225, line: 474, baseType: !478, size: 64, align: 64, offset: 322368)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !249, file: !225, line: 475, baseType: !478, size: 64, align: 64, offset: 322432)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !249, file: !225, line: 476, baseType: !478, size: 64, align: 64, offset: 322496)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !249, file: !225, line: 477, baseType: !478, size: 64, align: 64, offset: 322560)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !249, file: !225, line: 478, baseType: !491, size: 32768, align: 32, offset: 322624)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 32768, align: 32, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 1024)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !249, file: !225, line: 479, baseType: !491, size: 32768, align: 32, offset: 355392)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !249, file: !225, line: 480, baseType: !271, size: 32, align: 32, offset: 388160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !249, file: !225, line: 481, baseType: !478, size: 64, align: 64, offset: 388224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !249, file: !225, line: 482, baseType: !478, size: 64, align: 64, offset: 388288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !249, file: !225, line: 483, baseType: !478, size: 64, align: 64, offset: 388352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !249, file: !225, line: 484, baseType: !478, size: 64, align: 64, offset: 388416)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !249, file: !225, line: 485, baseType: !478, size: 64, align: 64, offset: 388480)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !249, file: !225, line: 486, baseType: !491, size: 32768, align: 32, offset: 388544)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !249, file: !225, line: 490, baseType: !503, size: 64, align: 64, offset: 421312)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !504, line: 149, baseType: !505)
!504 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libswscale--libswscale.a")
!505 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !249, file: !225, line: 491, baseType: !503, size: 64, align: 64, offset: 421376)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !249, file: !225, line: 492, baseType: !508, size: 128, align: 16, offset: 421440)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 128, align: 16, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !249, file: !225, line: 493, baseType: !512, size: 256, align: 32, offset: 421568)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 256, align: 32, elements: !509)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !249, file: !225, line: 495, baseType: !304, size: 64, align: 64, offset: 421824)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !249, file: !225, line: 495, baseType: !304, size: 64, align: 64, offset: 421888)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !249, file: !225, line: 508, baseType: !271, size: 32, align: 32, offset: 421952)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !249, file: !225, line: 513, baseType: !416, size: 64, align: 64, offset: 422016)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !249, file: !225, line: 514, baseType: !416, size: 64, align: 64, offset: 422080)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !249, file: !225, line: 515, baseType: !416, size: 64, align: 64, offset: 422144)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !249, file: !225, line: 516, baseType: !416, size: 64, align: 64, offset: 422208)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !249, file: !225, line: 517, baseType: !521, size: 192, align: 16, offset: 422272)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, align: 16, elements: !522)
!522 = !{!343, !347}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !249, file: !225, line: 518, baseType: !521, size: 192, align: 16, offset: 422464)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !249, file: !225, line: 521, baseType: !525, size: 64, align: 64, offset: 422656)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529, !311, !271, !304, !271}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !249, file: !225, line: 522, baseType: !532, size: 64, align: 64, offset: 422720)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !529, !271, !536, !311, !271, !304, !271}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !249, file: !225, line: 523, baseType: !538, size: 64, align: 64, offset: 422784)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !302, !529, !271, !536, !536, !311, !271}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !249, file: !225, line: 524, baseType: !543, size: 64, align: 64, offset: 422848)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !302, !529, !536, !536, !529, !311, !271, !271, !271}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !249, file: !225, line: 525, baseType: !548, size: 64, align: 64, offset: 422912)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !302, !536, !536, !536, !536, !311, !271, !271, !271, !271}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !249, file: !225, line: 526, baseType: !553, size: 64, align: 64, offset: 422976)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !302, !529, !536, !271, !529, !536, !536, !271, !536, !311, !271, !271}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !249, file: !225, line: 527, baseType: !558, size: 64, align: 64, offset: 423040)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !302, !529, !536, !271, !529, !536, !536, !271, !536, !310, !271, !271}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !249, file: !225, line: 530, baseType: !563, size: 64, align: 64, offset: 423104)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !311, !304, !304, !304, !271, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !249, file: !225, line: 533, baseType: !563, size: 64, align: 64, offset: 423168)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !249, file: !225, line: 536, baseType: !569, size: 64, align: 64, offset: 423232)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !311, !311, !304, !304, !304, !271, !566}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !249, file: !225, line: 545, baseType: !573, size: 64, align: 64, offset: 423296)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !311, !303, !271, !424}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !249, file: !225, line: 546, baseType: !577, size: 64, align: 64, offset: 423360)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !311, !311, !303, !271, !424}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !249, file: !225, line: 548, baseType: !573, size: 64, align: 64, offset: 423424)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !249, file: !225, line: 570, baseType: !582, size: 64, align: 64, offset: 423488)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !302, !416, !271, !304, !271, !271}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !249, file: !225, line: 573, baseType: !586, size: 64, align: 64, offset: 423552)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !302, !416, !416, !271, !304, !304, !271, !271}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !249, file: !225, line: 610, baseType: !590, size: 64, align: 64, offset: 423616)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !302, !416, !271, !304, !529, !593, !271}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !249, file: !225, line: 613, baseType: !590, size: 64, align: 64, offset: 423680)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !249, file: !225, line: 619, baseType: !597, size: 64, align: 64, offset: 423744)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !416, !271}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !249, file: !225, line: 621, baseType: !601, size: 64, align: 64, offset: 423808)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !416, !416, !271}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !249, file: !225, line: 623, baseType: !271, size: 32, align: 32, offset: 423872)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !249, file: !225, line: 625, baseType: !606, size: 32, align: 32, offset: 423904)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !249, file: !225, line: 627, baseType: !608, size: 32, align: 32, offset: 423936)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!609 = !{}
!610 = !DILocalVariable(name: "c", arg: 1, scope: !243, file: !244, line: 23, type: !247)
!611 = !DIExpression()
!612 = !DILocation(line: 23, column: 36, scope: !243)
!613 = !DILocalVariable(name: "dst", arg: 2, scope: !243, file: !244, line: 23, type: !416)
!614 = !DILocation(line: 23, column: 48, scope: !243)
!615 = !DILocalVariable(name: "dstWidth", arg: 3, scope: !243, file: !244, line: 23, type: !271)
!616 = !DILocation(line: 23, column: 57, scope: !243)
!617 = !DILocalVariable(name: "src", arg: 4, scope: !243, file: !244, line: 24, type: !304)
!618 = !DILocation(line: 24, column: 43, scope: !243)
!619 = !DILocalVariable(name: "srcW", arg: 5, scope: !243, file: !244, line: 24, type: !271)
!620 = !DILocation(line: 24, column: 52, scope: !243)
!621 = !DILocalVariable(name: "xInc", arg: 6, scope: !243, file: !244, line: 24, type: !271)
!622 = !DILocation(line: 24, column: 62, scope: !243)
!623 = !DILocalVariable(name: "i", scope: !243, file: !244, line: 26, type: !271)
!624 = !DILocation(line: 26, column: 9, scope: !243)
!625 = !DILocalVariable(name: "xpos", scope: !243, file: !244, line: 27, type: !402)
!626 = !DILocation(line: 27, column: 18, scope: !243)
!627 = !DILocation(line: 28, column: 12, scope: !628)
!628 = distinct !DILexicalBlock(scope: !243, file: !244, line: 28, column: 5)
!629 = !DILocation(line: 28, column: 10, scope: !628)
!630 = !DILocation(line: 28, column: 17, scope: !631)
!631 = !DILexicalBlockFile(scope: !632, file: !244, discriminator: 1)
!632 = distinct !DILexicalBlock(scope: !628, file: !244, line: 28, column: 5)
!633 = !DILocation(line: 28, column: 21, scope: !631)
!634 = !DILocation(line: 28, column: 19, scope: !631)
!635 = !DILocation(line: 28, column: 5, scope: !631)
!636 = !DILocalVariable(name: "xx", scope: !637, file: !244, line: 29, type: !402)
!637 = distinct !DILexicalBlock(scope: !632, file: !244, line: 28, column: 36)
!638 = !DILocation(line: 29, column: 31, scope: !637)
!639 = !DILocation(line: 29, column: 36, scope: !637)
!640 = !DILocation(line: 29, column: 41, scope: !637)
!641 = !DILocalVariable(name: "xalpha", scope: !637, file: !244, line: 30, type: !402)
!642 = !DILocation(line: 30, column: 31, scope: !637)
!643 = !DILocation(line: 30, column: 41, scope: !637)
!644 = !DILocation(line: 30, column: 46, scope: !637)
!645 = !DILocation(line: 30, column: 56, scope: !637)
!646 = !DILocation(line: 31, column: 23, scope: !637)
!647 = !DILocation(line: 31, column: 19, scope: !637)
!648 = !DILocation(line: 31, column: 27, scope: !637)
!649 = !DILocation(line: 31, column: 40, scope: !637)
!650 = !DILocation(line: 31, column: 43, scope: !637)
!651 = !DILocation(line: 31, column: 36, scope: !637)
!652 = !DILocation(line: 31, column: 54, scope: !637)
!653 = !DILocation(line: 31, column: 50, scope: !637)
!654 = !DILocation(line: 31, column: 48, scope: !637)
!655 = !DILocation(line: 31, column: 61, scope: !637)
!656 = !DILocation(line: 31, column: 59, scope: !637)
!657 = !DILocation(line: 31, column: 33, scope: !637)
!658 = !DILocation(line: 31, column: 18, scope: !637)
!659 = !DILocation(line: 31, column: 13, scope: !637)
!660 = !DILocation(line: 31, column: 9, scope: !637)
!661 = !DILocation(line: 31, column: 16, scope: !637)
!662 = !DILocation(line: 32, column: 17, scope: !637)
!663 = !DILocation(line: 32, column: 14, scope: !637)
!664 = !DILocation(line: 33, column: 5, scope: !637)
!665 = !DILocation(line: 28, column: 32, scope: !666)
!666 = !DILexicalBlockFile(scope: !632, file: !244, discriminator: 2)
!667 = !DILocation(line: 28, column: 5, scope: !666)
!668 = distinct !{!668, !669}
!669 = !DILocation(line: 28, column: 5, scope: !243)
!670 = !DILocation(line: 34, column: 12, scope: !671)
