; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test/[inter]test--asn1_decode_test-bin-asn1_decode_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test/[inter]test--asn1_decode_test-bin-asn1_decode_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_LONG_DATA = type { i64 }
%struct.ASN1_INT32_DATA = type { i32 }
%struct.ASN1_UINT32_DATA = type { i32 }
%struct.ASN1_INT64_DATA = type { i64 }
%struct.ASN1_UINT64_DATA = type { i64 }
%struct.ASN1_VALUE_st = type opaque

@.str = private unnamed_addr constant [10 x i8] c"test_long\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"test_int32\00", align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"test_uint32\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"test_int64\00", align 1
@.str.4 = private unnamed_addr constant [12 x i8] c"test_uint64\00", align 1
@t_invalid_zero = internal global [4 x i8] c"0\02\02\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !46)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test/[inter]test--asn1_decode_test-bin-asn1_decode_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!2 = !{}
!3 = !{!4, !5, !12, !13, !17, !25, !33, !39}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_LONG_DATA", file: !7, line: 36, baseType: !8)
!7 = !DIFile(filename: "test/asn1_decode_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 34, size: 64, align: 64, elements: !9)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "test_long", scope: !8, file: !7, line: 35, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !15, line: 213, baseType: !16)
!15 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !15, line: 213, flags: DIFlagFwdDecl)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INT32_DATA", file: !7, line: 63, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 61, size: 32, align: 32, elements: !20)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "test_int32", scope: !19, file: !7, line: 62, baseType: !22, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 196, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UINT32_DATA", file: !7, line: 89, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 87, size: 32, align: 32, elements: !28)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "test_uint32", scope: !27, file: !7, line: 88, baseType: !30, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 51, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INT64_DATA", file: !7, line: 115, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 113, size: 64, align: 64, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "test_int64", scope: !35, file: !7, line: 114, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 197, baseType: !11)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UINT64_DATA", file: !7, line: 141, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 139, size: 64, align: 64, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "test_uint64", scope: !41, file: !7, line: 140, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 55, baseType: !45)
!45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!46 = !{!47, !52, !83, !87, !88, !89, !90, !91, !92, !93, !94}
!47 = distinct !DIGlobalVariable(name: "t_invalid_zero", scope: !0, file: !7, line: 26, type: !48, isLocal: true, isDefinition: true, variable: [4 x i8]* @t_invalid_zero)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 32, align: 8, elements: !50)
!49 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!50 = !{!51}
!51 = !DISubrange(count: 4)
!52 = distinct !DIGlobalVariable(name: "ASN1_LONG_DATA_it", scope: !0, file: !7, line: 40, type: !53, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_LONG_DATA_it)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !55, line: 62, baseType: !56)
!55 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !57, line: 580, size: 448, align: 64, elements: !58)
!57 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_decode_test")
!58 = !{!59, !61, !62, !77, !78, !81, !82}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !56, file: !57, line: 581, baseType: !60, size: 8, align: 8)
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !56, file: !57, line: 583, baseType: !11, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !56, file: !57, line: 584, baseType: !63, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !15, line: 210, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !57, line: 468, size: 320, align: 64, elements: !67)
!67 = !{!68, !69, !70, !71, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !57, line: 469, baseType: !45, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !66, file: !57, line: 470, baseType: !11, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !66, file: !57, line: 471, baseType: !45, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !66, file: !57, line: 472, baseType: !72, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !66, file: !57, line: 473, baseType: !75, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !15, line: 318, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !56, file: !57, line: 586, baseType: !11, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !56, file: !57, line: 587, baseType: !79, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !57, line: 588, baseType: !11, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !56, file: !57, line: 589, baseType: !72, size: 64, align: 64, offset: 384)
!83 = distinct !DIGlobalVariable(name: "ASN1_LONG_DATA_seq_tt", scope: !0, file: !7, line: 38, type: !84, isLocal: true, isDefinition: true, variable: [1 x %struct.ASN1_TEMPLATE_st]* @ASN1_LONG_DATA_seq_tt)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 320, align: 64, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = distinct !DIGlobalVariable(name: "ASN1_INT32_DATA_it", scope: !0, file: !7, line: 67, type: !53, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_INT32_DATA_it)
!88 = distinct !DIGlobalVariable(name: "ASN1_INT32_DATA_seq_tt", scope: !0, file: !7, line: 65, type: !84, isLocal: true, isDefinition: true, variable: [1 x %struct.ASN1_TEMPLATE_st]* @ASN1_INT32_DATA_seq_tt)
!89 = distinct !DIGlobalVariable(name: "ASN1_UINT32_DATA_it", scope: !0, file: !7, line: 93, type: !53, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_UINT32_DATA_it)
!90 = distinct !DIGlobalVariable(name: "ASN1_UINT32_DATA_seq_tt", scope: !0, file: !7, line: 91, type: !84, isLocal: true, isDefinition: true, variable: [1 x %struct.ASN1_TEMPLATE_st]* @ASN1_UINT32_DATA_seq_tt)
!91 = distinct !DIGlobalVariable(name: "ASN1_INT64_DATA_it", scope: !0, file: !7, line: 119, type: !53, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_INT64_DATA_it)
!92 = distinct !DIGlobalVariable(name: "ASN1_INT64_DATA_seq_tt", scope: !0, file: !7, line: 117, type: !84, isLocal: true, isDefinition: true, variable: [1 x %struct.ASN1_TEMPLATE_st]* @ASN1_INT64_DATA_seq_tt)
!93 = distinct !DIGlobalVariable(name: "ASN1_UINT64_DATA_it", scope: !0, file: !7, line: 145, type: !53, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_UINT64_DATA_it)
!94 = distinct !DIGlobalVariable(name: "ASN1_UINT64_DATA_seq_tt", scope: !0, file: !7, line: 143, type: !84, isLocal: true, isDefinition: true, variable: [1 x %struct.ASN1_TEMPLATE_st]* @ASN1_UINT64_DATA_seq_tt)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!98 = distinct !DISubprogram(name: "setup_tests", scope: !7, file: !7, line: 163, type: !99, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!99 = !DISubroutineType(types: !100)
!100 = !{!24}
!101 = !DILocation(line: 166, column: 5, scope: !98)
!102 = !DILocation(line: 168, column: 5, scope: !98)
!103 = !DILocation(line: 169, column: 5, scope: !98)
!104 = !DILocation(line: 170, column: 5, scope: !98)
!105 = !DILocation(line: 171, column: 5, scope: !98)
!106 = !DILocation(line: 172, column: 5, scope: !98)
!107 = distinct !DISubprogram(name: "test_long", scope: !7, file: !7, line: 45, type: !99, isLocal: true, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!108 = !DILocalVariable(name: "p", scope: !107, file: !7, line: 47, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!111 = !DIExpression()
!112 = !DILocation(line: 47, column: 26, scope: !107)
!113 = !DILocalVariable(name: "dectst", scope: !107, file: !7, line: 48, type: !5)
!114 = !DILocation(line: 48, column: 21, scope: !107)
!115 = !DILocation(line: 49, column: 9, scope: !107)
!116 = !DILocation(line: 51, column: 9, scope: !117)
!117 = distinct !DILexicalBlock(scope: !107, file: !7, line: 51, column: 9)
!118 = !DILocation(line: 51, column: 16, scope: !117)
!119 = !DILocation(line: 51, column: 9, scope: !107)
!120 = !DILocation(line: 52, column: 9, scope: !117)
!121 = !DILocation(line: 54, column: 25, scope: !107)
!122 = !DILocation(line: 54, column: 5, scope: !107)
!123 = !DILocation(line: 55, column: 5, scope: !107)
