; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test/[inter]test--d2i_test-bin-d2i_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test/[inter]test--d2i_test-bin-d2i_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.error_enum = type { i8*, i32 }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.bio_st = type opaque
%struct.ASN1_VALUE_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12, globals: !15)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test/[inter]test--d2i_test-bin-d2i_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 28, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "test/d2i_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "ASN1_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "ASN1_OK", value: 1)
!8 = !DIEnumerator(name: "ASN1_BIO", value: 2)
!9 = !DIEnumerator(name: "ASN1_DECODE", value: 3)
!10 = !DIEnumerator(name: "ASN1_ENCODE", value: 4)
!11 = !DIEnumerator(name: "ASN1_COMPARE", value: 5)
!12 = !{!13, !14}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !37, !50, !82, !83}
!16 = distinct !DIGlobalVariable(name: "options", scope: !17, file: !4, line: 109, type: !34, isLocal: true, isDefinition: true, variable: [9 x %struct.options_st]* @test_get_options.options)
!17 = distinct !DISubprogram(name: "test_get_options", scope: !4, file: !4, line: 109, type: !18, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !33)
!18 = !DISubroutineType(types: !19)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !23, line: 280, baseType: !24)
!23 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !23, line: 269, size: 192, align: 64, elements: !25)
!25 = !{!26, !30, !31, !32}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !24, file: !23, line: 270, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !24, file: !23, line: 271, baseType: !14, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !24, file: !23, line: 278, baseType: !14, size: 32, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !24, file: !23, line: 279, baseType: !27, size: 64, align: 64, offset: 128)
!33 = !{}
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1728, align: 64, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 9)
!37 = distinct !DIGlobalVariable(name: "expected_errors", scope: !38, file: !4, line: 122, type: !41, isLocal: true, isDefinition: true, variable: [5 x %struct.error_enum]* @setup_tests.expected_errors)
!38 = distinct !DISubprogram(name: "setup_tests", scope: !4, file: !4, line: 115, type: !39, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !33)
!39 = !DISubroutineType(types: !40)
!40 = !{!14}
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 640, align: 64, elements: !48)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "error_enum", file: !4, line: 40, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 37, size: 128, align: 64, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !43, file: !4, line: 38, baseType: !27, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !43, file: !4, line: 39, baseType: !47, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "expected_error_t", file: !4, line: 35, baseType: !3)
!48 = !{!49}
!49 = !DISubrange(count: 5)
!50 = distinct !DIGlobalVariable(name: "item_type", scope: !0, file: !4, line: 25, type: !51, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st** @item_type)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !54, line: 62, baseType: !55)
!54 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !56, line: 580, size: 448, align: 64, elements: !57)
!56 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!57 = !{!58, !59, !61, !76, !77, !80, !81}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !55, file: !56, line: 581, baseType: !29, size: 8, align: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !55, file: !56, line: 583, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !55, file: !56, line: 584, baseType: !62, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !65, line: 210, baseType: !66)
!65 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !56, line: 468, size: 320, align: 64, elements: !67)
!67 = !{!68, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !56, line: 469, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !66, file: !56, line: 470, baseType: !60, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !66, file: !56, line: 471, baseType: !69, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !66, file: !56, line: 472, baseType: !27, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !66, file: !56, line: 473, baseType: !74, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !65, line: 318, baseType: !52)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !55, file: !56, line: 586, baseType: !60, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !55, file: !56, line: 587, baseType: !78, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !56, line: 588, baseType: !60, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !55, file: !56, line: 589, baseType: !27, size: 64, align: 64, offset: 384)
!82 = distinct !DIGlobalVariable(name: "test_file", scope: !0, file: !4, line: 26, type: !27, isLocal: true, isDefinition: true, variable: i8** @test_file)
!83 = distinct !DIGlobalVariable(name: "expected_error", scope: !0, file: !4, line: 42, type: !47, isLocal: true, isDefinition: true, variable: i32* @expected_error)
!84 = !{i32 2, !"Dwarf Version", i32 4}
!85 = !{i32 2, !"Debug Info Version", i32 3}
!86 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!87 = !DILocation(line: 109, column: 6, scope: !17)
!88 = !DILocalVariable(name: "test_type_name", scope: !38, file: !4, line: 117, type: !27)
!89 = !DIExpression()
!90 = !DILocation(line: 117, column: 17, scope: !38)
!91 = !DILocalVariable(name: "expected_error_string", scope: !38, file: !4, line: 118, type: !27)
!92 = !DILocation(line: 118, column: 17, scope: !38)
!93 = !DILocalVariable(name: "i", scope: !38, file: !4, line: 120, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 216, baseType: !69)
!95 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--d2i_test")
!96 = !DILocation(line: 120, column: 12, scope: !38)
!97 = !DILocation(line: 130, column: 101, scope: !98)
!98 = distinct !DILexicalBlock(scope: !38, file: !4, line: 130, column: 9)
!99 = !DILocation(line: 130, column: 99, scope: !98)
!100 = !DILocation(line: 130, column: 10, scope: !101)
!101 = !DILexicalBlockFile(scope: !98, file: !4, discriminator: 2)
!102 = !DILocation(line: 130, column: 10, scope: !98)
!103 = !DILocation(line: 131, column: 13, scope: !98)
!104 = !DILocation(line: 131, column: 122, scope: !105)
!105 = !DILexicalBlockFile(scope: !98, file: !4, discriminator: 1)
!106 = !DILocation(line: 131, column: 120, scope: !105)
!107 = !DILocation(line: 131, column: 17, scope: !108)
!108 = !DILexicalBlockFile(scope: !105, file: !4, discriminator: 2)
!109 = !DILocation(line: 131, column: 17, scope: !105)
!110 = !DILocation(line: 132, column: 13, scope: !98)
!111 = !DILocation(line: 132, column: 98, scope: !105)
!112 = !DILocation(line: 132, column: 96, scope: !105)
!113 = !DILocation(line: 132, column: 17, scope: !108)
!114 = !DILocation(line: 132, column: 17, scope: !105)
!115 = !DILocation(line: 130, column: 9, scope: !116)
!116 = !DILexicalBlockFile(scope: !38, file: !4, discriminator: 1)
!117 = !DILocation(line: 133, column: 9, scope: !98)
!118 = !DILocation(line: 135, column: 34, scope: !38)
!119 = !DILocation(line: 135, column: 17, scope: !38)
!120 = !DILocation(line: 135, column: 15, scope: !38)
!121 = !DILocation(line: 137, column: 9, scope: !122)
!122 = distinct !DILexicalBlock(scope: !38, file: !4, line: 137, column: 9)
!123 = !DILocation(line: 137, column: 19, scope: !122)
!124 = !DILocation(line: 137, column: 9, scope: !38)
!125 = !DILocation(line: 138, column: 63, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !4, line: 137, column: 27)
!127 = !DILocation(line: 138, column: 9, scope: !126)
!128 = !DILocation(line: 139, column: 9, scope: !126)
!129 = !DILocation(line: 140, column: 16, scope: !130)
!130 = distinct !DILexicalBlock(scope: !126, file: !4, line: 140, column: 9)
!131 = !DILocation(line: 140, column: 14, scope: !130)
!132 = !DILocalVariable(name: "it", scope: !133, file: !4, line: 141, type: !51)
!133 = distinct !DILexicalBlock(scope: !134, file: !4, line: 140, column: 27)
!134 = distinct !DILexicalBlock(scope: !130, file: !4, line: 140, column: 9)
!135 = !DILocation(line: 141, column: 30, scope: !133)
!136 = !DILocation(line: 141, column: 49, scope: !133)
!137 = !DILocation(line: 141, column: 35, scope: !133)
!138 = !DILocation(line: 143, column: 17, scope: !139)
!139 = distinct !DILexicalBlock(scope: !133, file: !4, line: 143, column: 17)
!140 = !DILocation(line: 143, column: 20, scope: !139)
