; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--fbdev_common.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--fbdev_common.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rgb_pixfmt_map_entry = type { i32, i32, i32, i32, i32, i32 }
%struct.fb_var_screeninfo = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.fb_bitfield, %struct.fb_bitfield, %struct.fb_bitfield, %struct.fb_bitfield, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32] }
%struct.fb_bitfield = type { i32, i32, i32 }
%struct.AVDeviceInfoList = type { %struct.AVDeviceInfo**, i32, i32 }
%struct.AVDeviceInfo = type { i8*, i8* }
%struct.fb_fix_screeninfo = type { [16 x i8], i64, i32, i32, i32, i32, i16, i16, i16, i32, i64, i32, i32, i16, [2 x i16] }


!125 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!126 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!127 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!128 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!129 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!130 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!131 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!132 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!133 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!134 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!135 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!136 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!137 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!138 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!139 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!140 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!141 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!142 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!143 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!144 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!145 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!146 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!147 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!148 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!149 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!150 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!151 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!152 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!153 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!154 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!155 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!156 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!157 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!158 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!159 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!160 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!161 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!162 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!163 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!164 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!165 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!166 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!167 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!168 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!169 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!170 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!171 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!172 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!173 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!174 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!175 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!176 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!177 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!178 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!179 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!180 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!181 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!182 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!183 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!184 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!185 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!186 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!187 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!188 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!189 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!190 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!191 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!192 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!193 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!194 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!195 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!196 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!197 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!198 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!199 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!200 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!201 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!202 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!205 = !{!206}
!206 = distinct !DIGlobalVariable(name: "rgb_pixfmt_map", scope: !0, file: !207, line: 37, type: !208, isLocal: true, isDefinition: true, variable: [7 x %struct.rgb_pixfmt_map_entry]* @rgb_pixfmt_map)
!207 = !DIFile(filename: "libavdevice/fbdev_common.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 1344, align: 32, elements: !219)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rgb_pixfmt_map_entry", file: !207, line: 31, size: 192, align: 32, elements: !211)
!211 = !{!212, !214, !215, !216, !217, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !210, file: !207, line: 32, baseType: !213, size: 32, align: 32)
!213 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "red_offset", scope: !210, file: !207, line: 33, baseType: !213, size: 32, align: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "green_offset", scope: !210, file: !207, line: 33, baseType: !213, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "blue_offset", scope: !210, file: !207, line: 33, baseType: !213, size: 32, align: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_offset", scope: !210, file: !207, line: 33, baseType: !213, size: 32, align: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pixfmt", scope: !210, file: !207, line: 34, baseType: !3, size: 32, align: 32, offset: 160)
!219 = !{!220}
!220 = !DISubrange(count: 7)
!221 = !{i32 2, !"Dwarf Version", i32 4}
!222 = !{i32 2, !"Debug Info Version", i32 3}
!223 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!224 = distinct !DISubprogram(name: "ff_get_pixfmt_from_fb_varinfo", scope: !207, file: !207, line: 48, type: !225, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !271)
!225 = !DISubroutineType(types: !226)
!226 = !{!3, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_var_screeninfo", file: !229, line: 238, size: 1280, align: 32, elements: !230)
!229 = !DIFile(filename: "/usr/include/linux/fb.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!230 = !{!231, !235, !236, !237, !238, !239, !240, !241, !242, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !228, file: !229, line: 239, baseType: !232, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !233, line: 26, baseType: !234)
!233 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!234 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !228, file: !229, line: 240, baseType: !232, size: 32, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xres_virtual", scope: !228, file: !229, line: 241, baseType: !232, size: 32, align: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "yres_virtual", scope: !228, file: !229, line: 242, baseType: !232, size: 32, align: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "xoffset", scope: !228, file: !229, line: 243, baseType: !232, size: 32, align: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "yoffset", scope: !228, file: !229, line: 244, baseType: !232, size: 32, align: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !228, file: !229, line: 246, baseType: !232, size: 32, align: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "grayscale", scope: !228, file: !229, line: 247, baseType: !232, size: 32, align: 32, offset: 224)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !228, file: !229, line: 249, baseType: !243, size: 96, align: 32, offset: 256)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_bitfield", file: !229, line: 185, size: 96, align: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !243, file: !229, line: 186, baseType: !232, size: 32, align: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !243, file: !229, line: 187, baseType: !232, size: 32, align: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "msb_right", scope: !243, file: !229, line: 188, baseType: !232, size: 32, align: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !228, file: !229, line: 250, baseType: !243, size: 96, align: 32, offset: 352)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !228, file: !229, line: 251, baseType: !243, size: 96, align: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !228, file: !229, line: 252, baseType: !243, size: 96, align: 32, offset: 544)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nonstd", scope: !228, file: !229, line: 254, baseType: !232, size: 32, align: 32, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !228, file: !229, line: 256, baseType: !232, size: 32, align: 32, offset: 672)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !228, file: !229, line: 258, baseType: !232, size: 32, align: 32, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !228, file: !229, line: 259, baseType: !232, size: 32, align: 32, offset: 736)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "accel_flags", scope: !228, file: !229, line: 261, baseType: !232, size: 32, align: 32, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !228, file: !229, line: 264, baseType: !232, size: 32, align: 32, offset: 800)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "left_margin", scope: !228, file: !229, line: 265, baseType: !232, size: 32, align: 32, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "right_margin", scope: !228, file: !229, line: 266, baseType: !232, size: 32, align: 32, offset: 864)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "upper_margin", scope: !228, file: !229, line: 267, baseType: !232, size: 32, align: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lower_margin", scope: !228, file: !229, line: 268, baseType: !232, size: 32, align: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_len", scope: !228, file: !229, line: 269, baseType: !232, size: 32, align: 32, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_len", scope: !228, file: !229, line: 270, baseType: !232, size: 32, align: 32, offset: 992)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !228, file: !229, line: 271, baseType: !232, size: 32, align: 32, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !228, file: !229, line: 272, baseType: !232, size: 32, align: 32, offset: 1056)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !228, file: !229, line: 273, baseType: !232, size: 32, align: 32, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !228, file: !229, line: 274, baseType: !232, size: 32, align: 32, offset: 1120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !228, file: !229, line: 275, baseType: !268, size: 128, align: 32, offset: 1152)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, align: 32, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 4)
!271 = !{}
!272 = !DILocalVariable(name: "varinfo", arg: 1, scope: !224, file: !207, line: 48, type: !227)
!273 = !DIExpression()
!274 = !DILocation(line: 48, column: 76, scope: !224)
!275 = !DILocalVariable(name: "i", scope: !224, file: !207, line: 50, type: !213)
!276 = !DILocation(line: 50, column: 9, scope: !224)
!277 = !DILocation(line: 52, column: 12, scope: !278)
!278 = distinct !DILexicalBlock(scope: !224, file: !207, line: 52, column: 5)
!279 = !DILocation(line: 52, column: 10, scope: !278)
!280 = !DILocation(line: 52, column: 17, scope: !281)
!281 = !DILexicalBlockFile(scope: !282, file: !207, discriminator: 1)
!282 = distinct !DILexicalBlock(scope: !278, file: !207, line: 52, column: 5)
!283 = !DILocation(line: 52, column: 19, scope: !281)
!284 = !DILocation(line: 52, column: 5, scope: !281)
!285 = !DILocalVariable(name: "entry", scope: !286, file: !207, line: 53, type: !287)
!286 = distinct !DILexicalBlock(scope: !282, file: !207, line: 52, column: 82)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!288 = !DILocation(line: 53, column: 44, scope: !286)
!289 = !DILocation(line: 53, column: 68, scope: !286)
!290 = !DILocation(line: 53, column: 53, scope: !286)
!291 = !DILocation(line: 54, column: 13, scope: !292)
!292 = distinct !DILexicalBlock(scope: !286, file: !207, line: 54, column: 13)
!293 = !DILocation(line: 54, column: 20, scope: !292)
!294 = !DILocation(line: 54, column: 38, scope: !292)
!295 = !DILocation(line: 54, column: 47, scope: !292)
!296 = !DILocation(line: 54, column: 35, scope: !292)
!297 = !DILocation(line: 54, column: 62, scope: !292)
!298 = !DILocation(line: 55, column: 13, scope: !292)
!299 = !DILocation(line: 55, column: 20, scope: !292)
!300 = !DILocation(line: 55, column: 34, scope: !292)
!301 = !DILocation(line: 55, column: 43, scope: !292)
!302 = !DILocation(line: 55, column: 47, scope: !292)
!303 = !DILocation(line: 55, column: 31, scope: !292)
!304 = !DILocation(line: 55, column: 54, scope: !292)
!305 = !DILocation(line: 56, column: 13, scope: !292)
!306 = !DILocation(line: 56, column: 20, scope: !292)
!307 = !DILocation(line: 56, column: 36, scope: !292)
!308 = !DILocation(line: 56, column: 45, scope: !292)
!309 = !DILocation(line: 56, column: 51, scope: !292)
!310 = !DILocation(line: 56, column: 33, scope: !292)
!311 = !DILocation(line: 56, column: 58, scope: !292)
!312 = !DILocation(line: 57, column: 13, scope: !292)
!313 = !DILocation(line: 57, column: 20, scope: !292)
!314 = !DILocation(line: 57, column: 35, scope: !292)
!315 = !DILocation(line: 57, column: 44, scope: !292)
!316 = !DILocation(line: 57, column: 49, scope: !292)
!317 = !DILocation(line: 57, column: 32, scope: !292)
!318 = !DILocation(line: 54, column: 13, scope: !319)
!319 = !DILexicalBlockFile(scope: !286, file: !207, discriminator: 1)
!320 = !DILocation(line: 58, column: 20, scope: !292)
!321 = !DILocation(line: 58, column: 27, scope: !292)
!322 = !DILocation(line: 58, column: 13, scope: !292)
!323 = !DILocation(line: 59, column: 5, scope: !286)
!324 = !DILocation(line: 52, column: 78, scope: !325)
!325 = !DILexicalBlockFile(scope: !282, file: !207, discriminator: 2)
!326 = !DILocation(line: 52, column: 5, scope: !325)
!327 = distinct !{!327, !328}
!328 = !DILocation(line: 52, column: 5, scope: !224)
!329 = !DILocation(line: 61, column: 5, scope: !224)
!330 = !DILocation(line: 62, column: 1, scope: !224)
!331 = distinct !DISubprogram(name: "ff_fbdev_default_device", scope: !207, file: !207, line: 64, type: !332, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !271)
!332 = !DISubroutineType(types: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!337 = !DILocalVariable(name: "dev", scope: !331, file: !207, line: 66, type: !334)
!338 = !DILocation(line: 66, column: 17, scope: !331)
!339 = !DILocation(line: 66, column: 23, scope: !331)
!340 = !DILocation(line: 67, column: 10, scope: !341)
!341 = distinct !DILexicalBlock(scope: !331, file: !207, line: 67, column: 9)
!342 = !DILocation(line: 67, column: 9, scope: !331)
!343 = !DILocation(line: 68, column: 13, scope: !341)
!344 = !DILocation(line: 68, column: 9, scope: !341)
!345 = !DILocation(line: 69, column: 12, scope: !331)
!346 = !DILocation(line: 69, column: 5, scope: !331)
!347 = distinct !DISubprogram(name: "ff_fbdev_get_device_list", scope: !207, file: !207, line: 72, type: !348, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !271)
!348 = !DISubroutineType(types: !349)
!349 = !{!213, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfoList", file: !352, line: 464, baseType: !353)
!352 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !352, line: 460, size: 128, align: 64, elements: !354)
!354 = !{!355, !364, !365}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !353, file: !352, line: 461, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !352, line: 455, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !352, line: 452, size: 128, align: 64, elements: !360)
!360 = !{!361, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !359, file: !352, line: 453, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !359, file: !352, line: 454, baseType: !362, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !353, file: !352, line: 462, baseType: !213, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !353, file: !352, line: 463, baseType: !213, size: 32, align: 32, offset: 96)
!366 = !DILocalVariable(name: "device_list", arg: 1, scope: !347, file: !207, line: 72, type: !350)
!367 = !DILocation(line: 72, column: 48, scope: !347)
!368 = !DILocalVariable(name: "varinfo", scope: !347, file: !207, line: 74, type: !228)
!369 = !DILocation(line: 74, column: 30, scope: !347)
!370 = !DILocalVariable(name: "fixinfo", scope: !347, file: !207, line: 75, type: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_fix_screeninfo", file: !229, line: 154, size: 640, align: 64, elements: !372)
!372 = !{!373, !377, !379, !380, !381, !382, !383, !386, !387, !388, !389, !390, !391, !392, !393}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !371, file: !229, line: 155, baseType: !374, size: 128, align: 8)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 128, align: 8, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "smem_start", scope: !371, file: !229, line: 156, baseType: !378, size: 64, align: 64, offset: 128)
!378 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "smem_len", scope: !371, file: !229, line: 158, baseType: !232, size: 32, align: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !371, file: !229, line: 159, baseType: !232, size: 32, align: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type_aux", scope: !371, file: !229, line: 160, baseType: !232, size: 32, align: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !371, file: !229, line: 161, baseType: !232, size: 32, align: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xpanstep", scope: !371, file: !229, line: 162, baseType: !384, size: 16, align: 16, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !233, line: 23, baseType: !385)
!385 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ypanstep", scope: !371, file: !229, line: 163, baseType: !384, size: 16, align: 16, offset: 336)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ywrapstep", scope: !371, file: !229, line: 164, baseType: !384, size: 16, align: 16, offset: 352)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !371, file: !229, line: 165, baseType: !232, size: 32, align: 32, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mmio_start", scope: !371, file: !229, line: 166, baseType: !378, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mmio_len", scope: !371, file: !229, line: 168, baseType: !232, size: 32, align: 32, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "accel", scope: !371, file: !229, line: 169, baseType: !232, size: 32, align: 32, offset: 544)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !371, file: !229, line: 171, baseType: !384, size: 16, align: 16, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !371, file: !229, line: 172, baseType: !394, size: 32, align: 16, offset: 592)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 32, align: 16, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 2)
!397 = !DILocation(line: 75, column: 30, scope: !347)
!398 = !DILocalVariable(name: "device_file", scope: !347, file: !207, line: 76, type: !399)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 96, align: 8, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 12)
!402 = !DILocation(line: 76, column: 10, scope: !347)
!403 = !DILocalVariable(name: "device", scope: !347, file: !207, line: 77, type: !357)
!404 = !DILocation(line: 77, column: 19, scope: !347)
!405 = !DILocalVariable(name: "i", scope: !347, file: !207, line: 78, type: !213)
!406 = !DILocation(line: 78, column: 9, scope: !347)
!407 = !DILocalVariable(name: "fd", scope: !347, file: !207, line: 78, type: !213)
!408 = !DILocation(line: 78, column: 12, scope: !347)
!409 = !DILocalVariable(name: "ret", scope: !347, file: !207, line: 78, type: !213)
!410 = !DILocation(line: 78, column: 16, scope: !347)
!411 = !DILocalVariable(name: "default_device", scope: !347, file: !207, line: 79, type: !334)
!412 = !DILocation(line: 79, column: 17, scope: !347)
!413 = !DILocation(line: 79, column: 34, scope: !347)
!414 = !DILocation(line: 81, column: 10, scope: !415)
!415 = distinct !DILexicalBlock(scope: !347, file: !207, line: 81, column: 9)
!416 = !DILocation(line: 81, column: 9, scope: !347)
!417 = !DILocation(line: 82, column: 9, scope: !415)
!418 = !DILocation(line: 84, column: 12, scope: !419)
!419 = distinct !DILexicalBlock(scope: !347, file: !207, line: 84, column: 5)
!420 = !DILocation(line: 84, column: 10, scope: !419)
!421 = !DILocation(line: 84, column: 17, scope: !422)
!422 = !DILexicalBlockFile(scope: !423, file: !207, discriminator: 1)
!423 = distinct !DILexicalBlock(scope: !419, file: !207, line: 84, column: 5)
!424 = !DILocation(line: 84, column: 19, scope: !422)
!425 = !DILocation(line: 84, column: 5, scope: !422)
!426 = !DILocation(line: 85, column: 18, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !207, line: 84, column: 31)
!428 = !DILocation(line: 85, column: 65, scope: !427)
!429 = !DILocation(line: 85, column: 9, scope: !427)
!430 = !DILocation(line: 87, column: 31, scope: !431)
!431 = distinct !DILexicalBlock(scope: !427, file: !207, line: 87, column: 13)
!432 = !DILocation(line: 87, column: 19, scope: !431)
!433 = !DILocation(line: 87, column: 17, scope: !431)
!434 = !DILocation(line: 87, column: 52, scope: !431)
!435 = !DILocation(line: 87, column: 13, scope: !427)
!436 = !DILocalVariable(name: "err", scope: !437, file: !207, line: 88, type: !213)
!437 = distinct !DILexicalBlock(scope: !431, file: !207, line: 87, column: 57)
!438 = !DILocation(line: 88, column: 17, scope: !437)
!439 = !DILocation(line: 88, column: 24, scope: !437)
!440 = !DILocation(line: 88, column: 23, scope: !437)
!441 = !DILocation(line: 89, column: 17, scope: !442)
!442 = distinct !DILexicalBlock(scope: !437, file: !207, line: 89, column: 17)
!443 = !DILocation(line: 89, column: 21, scope: !442)
!444 = !DILocation(line: 89, column: 17, scope: !437)
!445 = !DILocation(line: 91, column: 24, scope: !442)
!446 = !DILocation(line: 91, column: 58, scope: !442)
!447 = !DILocation(line: 91, column: 68, scope: !442)
!448 = !DILocation(line: 91, column: 77, scope: !442)
!449 = !DILocation(line: 91, column: 37, scope: !450)
!450 = !DILexicalBlockFile(scope: !442, file: !207, discriminator: 1)
!451 = !DILocation(line: 90, column: 17, scope: !442)
!452 = !DILocation(line: 92, column: 13, scope: !437)
!453 = !DILocation(line: 94, column: 19, scope: !454)
!454 = distinct !DILexicalBlock(scope: !427, file: !207, line: 94, column: 13)
!455 = !DILocation(line: 94, column: 13, scope: !454)
!456 = !DILocation(line: 94, column: 53, scope: !454)
!457 = !DILocation(line: 94, column: 13, scope: !427)
