; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--xcbgrab.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--xcbgrab.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!944 = !DIEnumerator(name: "XCB_CW_BORDER_PIXEL", value: 8)
!945 = !DIEnumerator(name: "XCB_CW_BIT_GRAVITY", value: 16)
!946 = !DIEnumerator(name: "XCB_CW_WIN_GRAVITY", value: 32)
!947 = !DIEnumerator(name: "XCB_CW_BACKING_STORE", value: 64)
!948 = !DIEnumerator(name: "XCB_CW_BACKING_PLANES", value: 128)
!949 = !DIEnumerator(name: "XCB_CW_BACKING_PIXEL", value: 256)
!950 = !DIEnumerator(name: "XCB_CW_OVERRIDE_REDIRECT", value: 512)
!951 = !DIEnumerator(name: "XCB_CW_SAVE_UNDER", value: 1024)
!952 = !DIEnumerator(name: "XCB_CW_EVENT_MASK", value: 2048)
!953 = !DIEnumerator(name: "XCB_CW_DONT_PROPAGATE", value: 4096)
!954 = !DIEnumerator(name: "XCB_CW_COLORMAP", value: 8192)
!955 = !DIEnumerator(name: "XCB_CW_CURSOR", value: 16384)
!956 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xcb_window_class_t", file: !939, line: 1326, size: 32, align: 32, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIEnumerator(name: "XCB_WINDOW_CLASS_COPY_FROM_PARENT", value: 0)
!959 = !DIEnumerator(name: "XCB_WINDOW_CLASS_INPUT_OUTPUT", value: 1)
!960 = !DIEnumerator(name: "XCB_WINDOW_CLASS_INPUT_ONLY", value: 2)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xcb_gc_t", file: !939, line: 2945, size: 32, align: 32, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!963 = !DIEnumerator(name: "XCB_GC_FUNCTION", value: 1)
!964 = !DIEnumerator(name: "XCB_GC_PLANE_MASK", value: 2)
!965 = !DIEnumerator(name: "XCB_GC_FOREGROUND", value: 4)
!966 = !DIEnumerator(name: "XCB_GC_BACKGROUND", value: 8)
!967 = !DIEnumerator(name: "XCB_GC_LINE_WIDTH", value: 16)
!968 = !DIEnumerator(name: "XCB_GC_LINE_STYLE", value: 32)
!969 = !DIEnumerator(name: "XCB_GC_CAP_STYLE", value: 64)
!970 = !DIEnumerator(name: "XCB_GC_JOIN_STYLE", value: 128)
!971 = !DIEnumerator(name: "XCB_GC_FILL_STYLE", value: 256)
!972 = !DIEnumerator(name: "XCB_GC_FILL_RULE", value: 512)
!973 = !DIEnumerator(name: "XCB_GC_TILE", value: 1024)
!974 = !DIEnumerator(name: "XCB_GC_STIPPLE", value: 2048)
!975 = !DIEnumerator(name: "XCB_GC_TILE_STIPPLE_ORIGIN_X", value: 4096)
!976 = !DIEnumerator(name: "XCB_GC_TILE_STIPPLE_ORIGIN_Y", value: 8192)
!977 = !DIEnumerator(name: "XCB_GC_FONT", value: 16384)
!978 = !DIEnumerator(name: "XCB_GC_SUBWINDOW_MODE", value: 32768)
!979 = !DIEnumerator(name: "XCB_GC_GRAPHICS_EXPOSURES", value: 65536)
!980 = !DIEnumerator(name: "XCB_GC_CLIP_ORIGIN_X", value: 131072)
!981 = !DIEnumerator(name: "XCB_GC_CLIP_ORIGIN_Y", value: 262144)
!982 = !DIEnumerator(name: "XCB_GC_CLIP_MASK", value: 524288)
!983 = !DIEnumerator(name: "XCB_GC_DASH_OFFSET", value: 1048576)
!984 = !DIEnumerator(name: "XCB_GC_DASH_LIST", value: 2097152)
!985 = !DIEnumerator(name: "XCB_GC_ARC_MODE", value: 4194304)
!986 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xcb_line_style_t", file: !939, line: 3113, size: 32, align: 32, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIEnumerator(name: "XCB_LINE_STYLE_SOLID", value: 0)
!989 = !DIEnumerator(name: "XCB_LINE_STYLE_ON_OFF_DASH", value: 1)
!990 = !DIEnumerator(name: "XCB_LINE_STYLE_DOUBLE_DASH", value: 2)
!991 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xcb_fill_style_t", file: !939, line: 3132, size: 32, align: 32, elements: !992)
!992 = !{!993, !994, !995, !996}
!993 = !DIEnumerator(name: "XCB_FILL_STYLE_SOLID", value: 0)
!994 = !DIEnumerator(name: "XCB_FILL_STYLE_TILED", value: 1)
!995 = !DIEnumerator(name: "XCB_FILL_STYLE_STIPPLED", value: 2)
!996 = !DIEnumerator(name: "XCB_FILL_STYLE_OPAQUE_STIPPLED", value: 3)
!997 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xcb_config_window_t", file: !939, line: 1652, size: 32, align: 32, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005}
!999 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_X", value: 1)
!1000 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_Y", value: 2)
!1001 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_WIDTH", value: 4)
!1002 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_HEIGHT", value: 8)
!1003 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_BORDER_WIDTH", value: 16)
!1004 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_SIBLING", value: 32)
!1005 = !DIEnumerator(name: "XCB_CONFIG_WINDOW_STACK_MODE", value: 64)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xcb_image_format_t", file: !939, line: 3457, size: 32, align: 32, elements: !1007)
!1007 = !{!1008, !1009, !1010}
!1008 = !DIEnumerator(name: "XCB_IMAGE_FORMAT_XY_BITMAP", value: 0)
!1009 = !DIEnumerator(name: "XCB_IMAGE_FORMAT_XY_PIXMAP", value: 1)
!1010 = !DIEnumerator(name: "XCB_IMAGE_FORMAT_Z_PIXMAP", value: 2)
!1011 = !{!1012, !1013}
!1012 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1013 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1014 = !{!1015, !2264, !2265}
!1015 = distinct !DIGlobalVariable(name: "ff_xcbgrab_demuxer", scope: !0, file: !1016, line: 693, type: !1017, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_xcbgrab_demuxer)
!1016 = !DIFile(filename: "libavdevice/xcbgrab.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1019)
!1019 = !{!1020, !1024, !1025, !1026, !1027, !1037, !1120, !1121, !1123, !1124, !1125, !1139, !2245, !2246, !2247, !2251, !2255, !2256, !2257, !2261, !2262, !2263}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !919, line: 638, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1018, file: !919, line: 645, baseType: !1021, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1018, file: !919, line: 652, baseType: !1012, size: 32, align: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1018, file: !919, line: 659, baseType: !1021, size: 64, align: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1018, file: !919, line: 661, baseType: !1028, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1033, line: 44, size: 64, align: 32, elements: !1034)
!1033 = !DIFile(filename: "./libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1032, file: !1033, line: 45, baseType: !3, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1032, file: !1033, line: 46, baseType: !1013, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1018, file: !919, line: 663, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1042)
!1042 = !{!1043, !1044, !1049, !1079, !1080, !1081, !1082, !1086, !1092, !1094, !1098}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1041, file: !486, line: 72, baseType: !1021, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1041, file: !486, line: 78, baseType: !1045, size: 64, align: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1021, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1041, file: !486, line: 85, baseType: !1050, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1075, !1076, !1077, !1078}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1052, file: !464, line: 247, baseType: !1021, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1052, file: !464, line: 253, baseType: !1021, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1052, file: !464, line: 259, baseType: !1012, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1052, file: !464, line: 271, baseType: !1059, size: 64, align: 64, offset: 192)
!1059 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1052, file: !464, line: 265, size: 64, align: 64, elements: !1060)
!1060 = !{!1061, !1065, !1067, !1068}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1059, file: !464, line: 266, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1063, line: 197, baseType: !1064)
!1063 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1064 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1059, file: !464, line: 267, baseType: !1066, size: 64, align: 64)
!1066 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1059, file: !464, line: 268, baseType: !1021, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1059, file: !464, line: 270, baseType: !1069, size: 64, align: 32)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1070, line: 61, baseType: !1071)
!1070 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1070, line: 58, size: 64, align: 32, elements: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1071, file: !1070, line: 59, baseType: !1012, size: 32, align: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1071, file: !1070, line: 60, baseType: !1012, size: 32, align: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1052, file: !464, line: 272, baseType: !1066, size: 64, align: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1052, file: !464, line: 273, baseType: !1066, size: 64, align: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !464, line: 275, baseType: !1012, size: 32, align: 32, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1052, file: !464, line: 300, baseType: !1021, size: 64, align: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1041, file: !486, line: 93, baseType: !1012, size: 32, align: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1041, file: !486, line: 99, baseType: !1012, size: 32, align: 32, offset: 224)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1041, file: !486, line: 108, baseType: !1012, size: 32, align: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1041, file: !486, line: 113, baseType: !1083, size: 64, align: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!1048, !1048, !1048}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1041, file: !486, line: 123, baseType: !1087, size: 64, align: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!1090, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1041, file: !486, line: 130, baseType: !1093, size: 32, align: 32, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1041, file: !486, line: 136, baseType: !1095, size: 64, align: 64, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!1093, !1048}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1041, file: !486, line: 142, baseType: !1099, size: 64, align: 64, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!1012, !1102, !1048, !1021, !1012}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1105)
!1105 = !{!1106, !1118, !1119}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1104, file: !464, line: 360, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1110, file: !464, line: 307, baseType: !1021, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1110, file: !464, line: 313, baseType: !1066, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1110, file: !464, line: 313, baseType: !1066, size: 64, align: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1110, file: !464, line: 318, baseType: !1066, size: 64, align: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1110, file: !464, line: 318, baseType: !1066, size: 64, align: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1110, file: !464, line: 323, baseType: !1012, size: 32, align: 32, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1104, file: !464, line: 364, baseType: !1012, size: 32, align: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1104, file: !464, line: 368, baseType: !1012, size: 32, align: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1018, file: !919, line: 670, baseType: !1021, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !919, line: 679, baseType: !1122, size: 64, align: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1018, file: !919, line: 684, baseType: !1012, size: 32, align: 32, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1018, file: !919, line: 689, baseType: !1012, size: 32, align: 32, offset: 544)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1018, file: !919, line: 696, baseType: !1126, size: 64, align: 64, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1012, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1137, !1138}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1131, file: !919, line: 449, baseType: !1021, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1131, file: !919, line: 450, baseType: !1135, size: 64, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1131, file: !919, line: 451, baseType: !1012, size: 32, align: 32, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1131, file: !919, line: 452, baseType: !1021, size: 64, align: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1018, file: !919, line: 703, baseType: !1140, size: 64, align: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!1012, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1341, !1342, !1407, !1408, !1409, !2102, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2156, !2157, !2158, !2159, !2160, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2211, !2212, !2215, !2216, !2217, !2218, !2219, !2220, !2222, !2223, !2224, !2225, !2233, !2234, !2238, !2242, !2243, !2244}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1144, file: !919, line: 1342, baseType: !1038, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1144, file: !919, line: 1349, baseType: !1122, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1144, file: !919, line: 1356, baseType: !1149, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1206, !1207, !1211, !1215, !1220, !1227, !1316, !1322, !1328, !1329, !1330, !1331, !1335}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1150, file: !919, line: 498, baseType: !1021, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1150, file: !919, line: 504, baseType: !1021, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1150, file: !919, line: 505, baseType: !1021, size: 64, align: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1150, file: !919, line: 506, baseType: !1021, size: 64, align: 64, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1150, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1150, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1150, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1150, file: !919, line: 517, baseType: !1012, size: 32, align: 32, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1150, file: !919, line: 523, baseType: !1028, size: 64, align: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1150, file: !919, line: 526, baseType: !1038, size: 64, align: 64, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1150, file: !919, line: 535, baseType: !1149, size: 64, align: 64, offset: 512)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1150, file: !919, line: 539, baseType: !1012, size: 32, align: 32, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1150, file: !919, line: 541, baseType: !1140, size: 64, align: 64, offset: 640)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1150, file: !919, line: 549, baseType: !1166, size: 64, align: 64, offset: 704)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!1012, !1143, !1169}
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1172)
!1172 = !{!1173, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1202, !1203, !1204, !1205}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1171, file: !4, line: 1451, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1176, line: 94, baseType: !1177)
!1176 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1176, line: 81, size: 192, align: 64, elements: !1178)
!1178 = !{!1179, !1183, !1187}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1177, file: !1176, line: 82, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1176, line: 73, baseType: !1182)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1176, line: 73, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !1176, line: 89, baseType: !1184, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1186, line: 48, baseType: !1136)
!1186 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !1176, line: 93, baseType: !1012, size: 32, align: 32, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1171, file: !4, line: 1461, baseType: !1062, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1171, file: !4, line: 1467, baseType: !1062, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !4, line: 1468, baseType: !1184, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1171, file: !4, line: 1469, baseType: !1012, size: 32, align: 32, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1171, file: !4, line: 1470, baseType: !1012, size: 32, align: 32, offset: 288)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !4, line: 1474, baseType: !1012, size: 32, align: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1171, file: !4, line: 1479, baseType: !1195, size: 64, align: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !4, line: 1412, baseType: !1184, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !4, line: 1413, baseType: !1012, size: 32, align: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1197, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1171, file: !4, line: 1480, baseType: !1012, size: 32, align: 32, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1171, file: !4, line: 1486, baseType: !1062, size: 64, align: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1171, file: !4, line: 1488, baseType: !1062, size: 64, align: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1171, file: !4, line: 1497, baseType: !1062, size: 64, align: 64, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1150, file: !919, line: 550, baseType: !1140, size: 64, align: 64, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1150, file: !919, line: 554, baseType: !1208, size: 64, align: 64, offset: 832)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!1012, !1143, !1169, !1169, !1012}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1150, file: !919, line: 563, baseType: !1212, size: 64, align: 64, offset: 896)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!1012, !3, !1012}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1150, file: !919, line: 565, baseType: !1216, size: 64, align: 64, offset: 960)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{null, !1143, !1012, !1219, !1219}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1150, file: !919, line: 570, baseType: !1221, size: 64, align: 64, offset: 1024)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!1012, !1143, !1012, !1048, !1224}
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1225, line: 216, baseType: !1226)
!1225 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1226 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1150, file: !919, line: 581, baseType: !1228, size: 64, align: 64, offset: 1088)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!1012, !1143, !1012, !1231, !1013}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1235)
!1235 = !{!1236, !1240, !1242, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1270, !1272, !1273, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !548, line: 282, baseType: !1237, size: 512, align: 64)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 512, align: 64, elements: !1238)
!1238 = !{!1239}
!1239 = !DISubrange(count: 8)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1234, file: !548, line: 299, baseType: !1241, size: 256, align: 32, offset: 512)
!1241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 256, align: 32, elements: !1238)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1234, file: !548, line: 315, baseType: !1243, size: 64, align: 64, offset: 768)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1234, file: !548, line: 326, baseType: !1012, size: 32, align: 32, offset: 832)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1234, file: !548, line: 326, baseType: !1012, size: 32, align: 32, offset: 864)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1234, file: !548, line: 334, baseType: !1012, size: 32, align: 32, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1234, file: !548, line: 341, baseType: !1012, size: 32, align: 32, offset: 928)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1234, file: !548, line: 346, baseType: !1012, size: 32, align: 32, offset: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1234, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1234, file: !548, line: 356, baseType: !1069, size: 64, align: 32, offset: 1024)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1234, file: !548, line: 361, baseType: !1062, size: 64, align: 64, offset: 1088)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1234, file: !548, line: 369, baseType: !1062, size: 64, align: 64, offset: 1152)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1234, file: !548, line: 377, baseType: !1062, size: 64, align: 64, offset: 1216)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1234, file: !548, line: 382, baseType: !1012, size: 32, align: 32, offset: 1280)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1234, file: !548, line: 386, baseType: !1012, size: 32, align: 32, offset: 1312)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1234, file: !548, line: 391, baseType: !1012, size: 32, align: 32, offset: 1344)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1234, file: !548, line: 396, baseType: !1048, size: 64, align: 64, offset: 1408)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1234, file: !548, line: 403, baseType: !1259, size: 512, align: 64, offset: 1472)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1260, size: 512, align: 64, elements: !1238)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1186, line: 55, baseType: !1226)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1234, file: !548, line: 410, baseType: !1012, size: 32, align: 32, offset: 1984)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1234, file: !548, line: 415, baseType: !1012, size: 32, align: 32, offset: 2016)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1234, file: !548, line: 420, baseType: !1012, size: 32, align: 32, offset: 2048)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1234, file: !548, line: 425, baseType: !1012, size: 32, align: 32, offset: 2080)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1234, file: !548, line: 435, baseType: !1062, size: 64, align: 64, offset: 2112)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1234, file: !548, line: 440, baseType: !1012, size: 32, align: 32, offset: 2176)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1234, file: !548, line: 445, baseType: !1260, size: 64, align: 64, offset: 2240)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !548, line: 459, baseType: !1269, size: 512, align: 64, offset: 2304)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 512, align: 64, elements: !1238)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1234, file: !548, line: 473, baseType: !1271, size: 64, align: 64, offset: 2816)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1234, file: !548, line: 477, baseType: !1012, size: 32, align: 32, offset: 2880)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1234, file: !548, line: 479, baseType: !1274, size: 64, align: 64, offset: 2944)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1287}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1277, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1277, file: !548, line: 203, baseType: !1184, size: 64, align: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1277, file: !548, line: 204, baseType: !1012, size: 32, align: 32, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1277, file: !548, line: 205, baseType: !1283, size: 64, align: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1285, line: 86, baseType: !1286)
!1285 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1285, line: 86, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1277, file: !548, line: 206, baseType: !1174, size: 64, align: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1234, file: !548, line: 480, baseType: !1012, size: 32, align: 32, offset: 3008)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1234, file: !548, line: 505, baseType: !1012, size: 32, align: 32, offset: 3040)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1234, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1234, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1234, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1234, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1234, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1234, file: !548, line: 532, baseType: !1062, size: 64, align: 64, offset: 3264)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1234, file: !548, line: 539, baseType: !1062, size: 64, align: 64, offset: 3328)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1234, file: !548, line: 547, baseType: !1062, size: 64, align: 64, offset: 3392)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1234, file: !548, line: 554, baseType: !1283, size: 64, align: 64, offset: 3456)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1234, file: !548, line: 563, baseType: !1012, size: 32, align: 32, offset: 3520)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1234, file: !548, line: 572, baseType: !1012, size: 32, align: 32, offset: 3552)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1234, file: !548, line: 581, baseType: !1012, size: 32, align: 32, offset: 3584)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1234, file: !548, line: 588, baseType: !1303, size: 64, align: 64, offset: 3648)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1063, line: 194, baseType: !1305)
!1305 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1234, file: !548, line: 593, baseType: !1012, size: 32, align: 32, offset: 3712)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1234, file: !548, line: 596, baseType: !1012, size: 32, align: 32, offset: 3744)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1234, file: !548, line: 599, baseType: !1174, size: 64, align: 64, offset: 3776)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1234, file: !548, line: 605, baseType: !1174, size: 64, align: 64, offset: 3840)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1234, file: !548, line: 616, baseType: !1174, size: 64, align: 64, offset: 3904)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1234, file: !548, line: 626, baseType: !1224, size: 64, align: 64, offset: 3968)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1234, file: !548, line: 627, baseType: !1224, size: 64, align: 64, offset: 4032)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1234, file: !548, line: 628, baseType: !1224, size: 64, align: 64, offset: 4096)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1234, file: !548, line: 629, baseType: !1224, size: 64, align: 64, offset: 4160)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1234, file: !548, line: 645, baseType: !1174, size: 64, align: 64, offset: 4224)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1150, file: !919, line: 587, baseType: !1317, size: 64, align: 64, offset: 1152)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!1012, !1143, !1320}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1150, file: !919, line: 592, baseType: !1323, size: 64, align: 64, offset: 1216)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!1012, !1143, !1326}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1150, file: !919, line: 597, baseType: !1323, size: 64, align: 64, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1150, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1150, file: !919, line: 608, baseType: !1140, size: 64, align: 64, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1150, file: !919, line: 617, baseType: !1332, size: 64, align: 64, offset: 1472)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{null, !1143}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1150, file: !919, line: 623, baseType: !1336, size: 64, align: 64, offset: 1536)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!1012, !1143, !1339}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1144, file: !919, line: 1365, baseType: !1048, size: 64, align: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1144, file: !919, line: 1379, baseType: !1343, size: 64, align: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351, !1352, !1353, !1357, !1358, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1374, !1375, !1379, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1397, !1398, !1399, !1400, !1404, !1405, !1406}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1345, file: !650, line: 174, baseType: !1038, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1345, file: !650, line: 226, baseType: !1135, size: 64, align: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1345, file: !650, line: 227, baseType: !1012, size: 32, align: 32, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1345, file: !650, line: 228, baseType: !1135, size: 64, align: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1345, file: !650, line: 229, baseType: !1135, size: 64, align: 64, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1345, file: !650, line: 233, baseType: !1048, size: 64, align: 64, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1345, file: !650, line: 235, baseType: !1354, size: 64, align: 64, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!1012, !1048, !1184, !1012}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1345, file: !650, line: 236, baseType: !1354, size: 64, align: 64, offset: 448)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1345, file: !650, line: 237, baseType: !1359, size: 64, align: 64, offset: 512)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1062, !1048, !1062, !1012}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1345, file: !650, line: 238, baseType: !1062, size: 64, align: 64, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1345, file: !650, line: 239, baseType: !1012, size: 32, align: 32, offset: 640)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1345, file: !650, line: 240, baseType: !1012, size: 32, align: 32, offset: 672)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1345, file: !650, line: 241, baseType: !1012, size: 32, align: 32, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1345, file: !650, line: 242, baseType: !1226, size: 64, align: 64, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1345, file: !650, line: 243, baseType: !1135, size: 64, align: 64, offset: 832)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1345, file: !650, line: 244, baseType: !1369, size: 64, align: 64, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!1226, !1226, !1372, !1013}
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1345, file: !650, line: 245, baseType: !1012, size: 32, align: 32, offset: 960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1345, file: !650, line: 249, baseType: !1376, size: 64, align: 64, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!1012, !1048, !1012}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1345, file: !650, line: 255, baseType: !1380, size: 64, align: 64, offset: 1088)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!1062, !1048, !1012, !1062, !1012}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1345, file: !650, line: 260, baseType: !1012, size: 32, align: 32, offset: 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1345, file: !650, line: 266, baseType: !1062, size: 64, align: 64, offset: 1216)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1345, file: !650, line: 273, baseType: !1012, size: 32, align: 32, offset: 1280)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1345, file: !650, line: 279, baseType: !1062, size: 64, align: 64, offset: 1344)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1345, file: !650, line: 285, baseType: !1012, size: 32, align: 32, offset: 1408)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1345, file: !650, line: 291, baseType: !1012, size: 32, align: 32, offset: 1440)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1345, file: !650, line: 298, baseType: !1012, size: 32, align: 32, offset: 1472)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1345, file: !650, line: 304, baseType: !1012, size: 32, align: 32, offset: 1504)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1345, file: !650, line: 309, baseType: !1021, size: 64, align: 64, offset: 1536)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1345, file: !650, line: 314, baseType: !1021, size: 64, align: 64, offset: 1600)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1345, file: !650, line: 319, baseType: !1394, size: 64, align: 64, offset: 1664)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!1012, !1048, !1184, !1012, !649, !1062}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1345, file: !650, line: 326, baseType: !1012, size: 32, align: 32, offset: 1728)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1345, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1345, file: !650, line: 332, baseType: !1062, size: 64, align: 64, offset: 1792)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1345, file: !650, line: 338, baseType: !1401, size: 64, align: 64, offset: 1856)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!1012, !1048}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1345, file: !650, line: 340, baseType: !1062, size: 64, align: 64, offset: 1920)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1345, file: !650, line: 346, baseType: !1135, size: 64, align: 64, offset: 1984)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1345, file: !650, line: 351, baseType: !1012, size: 32, align: 32, offset: 2048)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1144, file: !919, line: 1386, baseType: !1012, size: 32, align: 32, offset: 320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1144, file: !919, line: 1393, baseType: !1013, size: 32, align: 32, offset: 352)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1144, file: !919, line: 1405, baseType: !1410, size: 64, align: 64, offset: 384)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1888, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1988, !1994, !1995, !1999, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2031, !2032, !2033, !2034, !2035, !2036}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1413, file: !919, line: 866, baseType: !1012, size: 32, align: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1413, file: !919, line: 872, baseType: !1012, size: 32, align: 32, offset: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1413, file: !919, line: 878, baseType: !1418, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1563, !1564, !1565, !1566, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1592, !1596, !1597, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1776, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1420, file: !4, line: 1561, baseType: !1038, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1420, file: !4, line: 1562, baseType: !1012, size: 32, align: 32, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1420, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1420, file: !4, line: 1565, baseType: !1426, size: 64, align: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1433, !1434, !1435, !1438, !1441, !1444, !1447, !1450, !1451, !1452, !1460, !1461, !1462, !1464, !1468, !1474, !1479, !1483, !1484, !1528, !1535, !1539, !1540, !1544, !1548, !1552, !1556, !1557, !1558}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1428, file: !4, line: 3475, baseType: !1021, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1428, file: !4, line: 3480, baseType: !1021, size: 64, align: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1428, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1428, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1428, file: !4, line: 3487, baseType: !1012, size: 32, align: 32, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1428, file: !4, line: 3488, baseType: !1436, size: 64, align: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1428, file: !4, line: 3489, baseType: !1439, size: 64, align: 64, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1428, file: !4, line: 3490, baseType: !1442, size: 64, align: 64, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1428, file: !4, line: 3491, baseType: !1445, size: 64, align: 64, offset: 448)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1428, file: !4, line: 3492, baseType: !1448, size: 64, align: 64, offset: 512)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1260)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1428, file: !4, line: 3493, baseType: !1185, size: 8, align: 8, offset: 576)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1428, file: !4, line: 3494, baseType: !1038, size: 64, align: 64, offset: 640)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1428, file: !4, line: 3495, baseType: !1453, size: 64, align: 64, offset: 704)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1455)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1457)
!1457 = !{!1458, !1459}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1456, file: !4, line: 3402, baseType: !1012, size: 32, align: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1456, file: !4, line: 3403, baseType: !1021, size: 64, align: 64, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1428, file: !4, line: 3507, baseType: !1021, size: 64, align: 64, offset: 768)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1428, file: !4, line: 3516, baseType: !1012, size: 32, align: 32, offset: 832)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1428, file: !4, line: 3517, baseType: !1463, size: 64, align: 64, offset: 896)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1428, file: !4, line: 3527, baseType: !1465, size: 64, align: 64, offset: 960)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!1012, !1418}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1428, file: !4, line: 3535, baseType: !1469, size: 64, align: 64, offset: 1024)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!1012, !1418, !1472}
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1419)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1428, file: !4, line: 3541, baseType: !1475, size: 64, align: 64, offset: 1088)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1477)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1478)
!1478 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1428, file: !4, line: 3549, baseType: !1480, size: 64, align: 64, offset: 1152)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{null, !1463}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1428, file: !4, line: 3551, baseType: !1465, size: 64, align: 64, offset: 1216)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1428, file: !4, line: 3552, baseType: !1485, size: 64, align: 64, offset: 1280)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!1012, !1418, !1184, !1012, !1488}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1491)
!1491 = !{!1492, !1495, !1497, !1498, !1499, !1527}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1490, file: !4, line: 3921, baseType: !1493, size: 16, align: 16)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1186, line: 49, baseType: !1494)
!1494 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1490, file: !4, line: 3922, baseType: !1496, size: 32, align: 32, offset: 32)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1186, line: 51, baseType: !1013)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1490, file: !4, line: 3923, baseType: !1496, size: 32, align: 32, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1490, file: !4, line: 3924, baseType: !1013, size: 32, align: 32, offset: 96)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1490, file: !4, line: 3925, baseType: !1500, size: 64, align: 64, offset: 128)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1516, !1520, !1522, !1523, !1525, !1526}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1503, file: !4, line: 3886, baseType: !1012, size: 32, align: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1503, file: !4, line: 3887, baseType: !1012, size: 32, align: 32, offset: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1503, file: !4, line: 3888, baseType: !1012, size: 32, align: 32, offset: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1503, file: !4, line: 3889, baseType: !1012, size: 32, align: 32, offset: 96)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1503, file: !4, line: 3890, baseType: !1012, size: 32, align: 32, offset: 128)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1503, file: !4, line: 3897, baseType: !1511, size: 768, align: 64, offset: 192)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1513)
!1513 = !{!1514, !1515}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1512, file: !4, line: 3855, baseType: !1237, size: 512, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1512, file: !4, line: 3857, baseType: !1241, size: 256, align: 32, offset: 512)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1503, file: !4, line: 3903, baseType: !1517, size: 256, align: 64, offset: 960)
!1517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 256, align: 64, elements: !1518)
!1518 = !{!1519}
!1519 = !DISubrange(count: 4)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1503, file: !4, line: 3904, baseType: !1521, size: 128, align: 32, offset: 1216)
!1521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, align: 32, elements: !1518)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1503, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1503, file: !4, line: 3908, baseType: !1524, size: 64, align: 64, offset: 1408)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1503, file: !4, line: 3915, baseType: !1524, size: 64, align: 64, offset: 1472)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1503, file: !4, line: 3917, baseType: !1012, size: 32, align: 32, offset: 1536)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1490, file: !4, line: 3926, baseType: !1062, size: 64, align: 64, offset: 192)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1428, file: !4, line: 3564, baseType: !1529, size: 64, align: 64, offset: 1344)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!1012, !1418, !1169, !1532, !1534}
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1428, file: !4, line: 3566, baseType: !1536, size: 64, align: 64, offset: 1408)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!1012, !1418, !1048, !1534, !1169}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1428, file: !4, line: 3567, baseType: !1465, size: 64, align: 64, offset: 1472)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1428, file: !4, line: 3576, baseType: !1541, size: 64, align: 64, offset: 1536)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!1012, !1418, !1532}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1428, file: !4, line: 3577, baseType: !1545, size: 64, align: 64, offset: 1600)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!1012, !1418, !1169}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1428, file: !4, line: 3584, baseType: !1549, size: 64, align: 64, offset: 1664)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!1012, !1418, !1232}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1428, file: !4, line: 3589, baseType: !1553, size: 64, align: 64, offset: 1728)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{null, !1418}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1428, file: !4, line: 3594, baseType: !1012, size: 32, align: 32, offset: 1792)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1428, file: !4, line: 3600, baseType: !1021, size: 64, align: 64, offset: 1856)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1428, file: !4, line: 3609, baseType: !1559, size: 64, align: 64, offset: 1920)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1562)
!1562 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1420, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1420, file: !4, line: 1581, baseType: !1013, size: 32, align: 32, offset: 224)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1420, file: !4, line: 1583, baseType: !1048, size: 64, align: 64, offset: 256)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1420, file: !4, line: 1591, baseType: !1567, size: 64, align: 64, offset: 320)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1420, file: !4, line: 1598, baseType: !1048, size: 64, align: 64, offset: 384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1420, file: !4, line: 1606, baseType: !1062, size: 64, align: 64, offset: 448)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1420, file: !4, line: 1614, baseType: !1012, size: 32, align: 32, offset: 512)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1420, file: !4, line: 1622, baseType: !1012, size: 32, align: 32, offset: 544)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1420, file: !4, line: 1628, baseType: !1012, size: 32, align: 32, offset: 576)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1420, file: !4, line: 1636, baseType: !1012, size: 32, align: 32, offset: 608)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1420, file: !4, line: 1643, baseType: !1012, size: 32, align: 32, offset: 640)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1420, file: !4, line: 1657, baseType: !1184, size: 64, align: 64, offset: 704)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1420, file: !4, line: 1658, baseType: !1012, size: 32, align: 32, offset: 768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1420, file: !4, line: 1679, baseType: !1069, size: 64, align: 32, offset: 800)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1420, file: !4, line: 1688, baseType: !1012, size: 32, align: 32, offset: 864)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1420, file: !4, line: 1712, baseType: !1012, size: 32, align: 32, offset: 896)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1420, file: !4, line: 1729, baseType: !1012, size: 32, align: 32, offset: 928)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1420, file: !4, line: 1729, baseType: !1012, size: 32, align: 32, offset: 960)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1420, file: !4, line: 1744, baseType: !1012, size: 32, align: 32, offset: 992)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1420, file: !4, line: 1744, baseType: !1012, size: 32, align: 32, offset: 1024)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1420, file: !4, line: 1751, baseType: !1012, size: 32, align: 32, offset: 1056)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1420, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1420, file: !4, line: 1791, baseType: !1588, size: 64, align: 64, offset: 1152)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{null, !1591, !1532, !1534, !1012, !1012, !1012}
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1420, file: !4, line: 1808, baseType: !1593, size: 64, align: 64, offset: 1216)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!667, !1591, !1439}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1420, file: !4, line: 1816, baseType: !1012, size: 32, align: 32, offset: 1280)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1420, file: !4, line: 1825, baseType: !1598, size: 32, align: 32, offset: 1312)
!1598 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1420, file: !4, line: 1830, baseType: !1012, size: 32, align: 32, offset: 1344)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1420, file: !4, line: 1838, baseType: !1598, size: 32, align: 32, offset: 1376)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1420, file: !4, line: 1846, baseType: !1012, size: 32, align: 32, offset: 1408)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1420, file: !4, line: 1851, baseType: !1012, size: 32, align: 32, offset: 1440)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1420, file: !4, line: 1861, baseType: !1598, size: 32, align: 32, offset: 1472)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1420, file: !4, line: 1868, baseType: !1598, size: 32, align: 32, offset: 1504)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1420, file: !4, line: 1875, baseType: !1598, size: 32, align: 32, offset: 1536)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1420, file: !4, line: 1882, baseType: !1598, size: 32, align: 32, offset: 1568)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1420, file: !4, line: 1889, baseType: !1598, size: 32, align: 32, offset: 1600)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1420, file: !4, line: 1896, baseType: !1598, size: 32, align: 32, offset: 1632)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1420, file: !4, line: 1903, baseType: !1598, size: 32, align: 32, offset: 1664)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1420, file: !4, line: 1910, baseType: !1012, size: 32, align: 32, offset: 1696)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1420, file: !4, line: 1915, baseType: !1012, size: 32, align: 32, offset: 1728)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1420, file: !4, line: 1926, baseType: !1534, size: 64, align: 64, offset: 1792)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1420, file: !4, line: 1935, baseType: !1069, size: 64, align: 32, offset: 1856)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1420, file: !4, line: 1942, baseType: !1012, size: 32, align: 32, offset: 1920)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1420, file: !4, line: 1948, baseType: !1012, size: 32, align: 32, offset: 1952)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1420, file: !4, line: 1954, baseType: !1012, size: 32, align: 32, offset: 1984)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1420, file: !4, line: 1960, baseType: !1012, size: 32, align: 32, offset: 2016)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1420, file: !4, line: 1984, baseType: !1012, size: 32, align: 32, offset: 2048)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1420, file: !4, line: 1991, baseType: !1012, size: 32, align: 32, offset: 2080)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1420, file: !4, line: 1996, baseType: !1012, size: 32, align: 32, offset: 2112)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1420, file: !4, line: 2004, baseType: !1012, size: 32, align: 32, offset: 2144)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1420, file: !4, line: 2011, baseType: !1012, size: 32, align: 32, offset: 2176)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1420, file: !4, line: 2018, baseType: !1012, size: 32, align: 32, offset: 2208)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1420, file: !4, line: 2027, baseType: !1012, size: 32, align: 32, offset: 2240)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1420, file: !4, line: 2034, baseType: !1012, size: 32, align: 32, offset: 2272)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1420, file: !4, line: 2044, baseType: !1012, size: 32, align: 32, offset: 2304)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1420, file: !4, line: 2054, baseType: !1628, size: 64, align: 64, offset: 2368)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1420, file: !4, line: 2061, baseType: !1628, size: 64, align: 64, offset: 2432)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1420, file: !4, line: 2066, baseType: !1012, size: 32, align: 32, offset: 2496)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1420, file: !4, line: 2070, baseType: !1012, size: 32, align: 32, offset: 2528)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1420, file: !4, line: 2078, baseType: !1012, size: 32, align: 32, offset: 2560)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1420, file: !4, line: 2085, baseType: !1012, size: 32, align: 32, offset: 2592)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1420, file: !4, line: 2092, baseType: !1012, size: 32, align: 32, offset: 2624)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1420, file: !4, line: 2099, baseType: !1012, size: 32, align: 32, offset: 2656)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1420, file: !4, line: 2106, baseType: !1012, size: 32, align: 32, offset: 2688)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1420, file: !4, line: 2113, baseType: !1012, size: 32, align: 32, offset: 2720)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1420, file: !4, line: 2120, baseType: !1012, size: 32, align: 32, offset: 2752)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1420, file: !4, line: 2125, baseType: !1012, size: 32, align: 32, offset: 2784)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1420, file: !4, line: 2133, baseType: !1012, size: 32, align: 32, offset: 2816)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1420, file: !4, line: 2140, baseType: !1012, size: 32, align: 32, offset: 2848)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1420, file: !4, line: 2145, baseType: !1012, size: 32, align: 32, offset: 2880)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1420, file: !4, line: 2153, baseType: !1012, size: 32, align: 32, offset: 2912)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1420, file: !4, line: 2158, baseType: !1012, size: 32, align: 32, offset: 2944)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1420, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1420, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1420, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1420, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1420, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1420, file: !4, line: 2203, baseType: !1012, size: 32, align: 32, offset: 3136)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1420, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1420, file: !4, line: 2212, baseType: !1012, size: 32, align: 32, offset: 3200)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1420, file: !4, line: 2213, baseType: !1012, size: 32, align: 32, offset: 3232)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1420, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1420, file: !4, line: 2232, baseType: !1012, size: 32, align: 32, offset: 3296)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1420, file: !4, line: 2243, baseType: !1012, size: 32, align: 32, offset: 3328)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1420, file: !4, line: 2249, baseType: !1012, size: 32, align: 32, offset: 3360)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1420, file: !4, line: 2256, baseType: !1012, size: 32, align: 32, offset: 3392)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1420, file: !4, line: 2263, baseType: !1260, size: 64, align: 64, offset: 3456)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1420, file: !4, line: 2270, baseType: !1260, size: 64, align: 64, offset: 3520)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1420, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1420, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1420, file: !4, line: 2367, baseType: !1664, size: 64, align: 64, offset: 3648)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64, align: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!1012, !1591, !1232, !1012}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1420, file: !4, line: 2383, baseType: !1012, size: 32, align: 32, offset: 3712)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1420, file: !4, line: 2386, baseType: !1598, size: 32, align: 32, offset: 3744)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1420, file: !4, line: 2387, baseType: !1598, size: 32, align: 32, offset: 3776)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1420, file: !4, line: 2394, baseType: !1012, size: 32, align: 32, offset: 3808)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1420, file: !4, line: 2401, baseType: !1012, size: 32, align: 32, offset: 3840)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1420, file: !4, line: 2408, baseType: !1012, size: 32, align: 32, offset: 3872)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1420, file: !4, line: 2415, baseType: !1012, size: 32, align: 32, offset: 3904)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1420, file: !4, line: 2422, baseType: !1012, size: 32, align: 32, offset: 3936)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1420, file: !4, line: 2423, baseType: !1676, size: 64, align: 64, offset: 3968)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1678)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1678, file: !4, line: 827, baseType: !1012, size: 32, align: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1678, file: !4, line: 828, baseType: !1012, size: 32, align: 32, offset: 32)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1678, file: !4, line: 829, baseType: !1012, size: 32, align: 32, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1678, file: !4, line: 830, baseType: !1598, size: 32, align: 32, offset: 96)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1420, file: !4, line: 2430, baseType: !1062, size: 64, align: 64, offset: 4032)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1420, file: !4, line: 2437, baseType: !1062, size: 64, align: 64, offset: 4096)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1420, file: !4, line: 2444, baseType: !1598, size: 32, align: 32, offset: 4160)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1420, file: !4, line: 2451, baseType: !1598, size: 32, align: 32, offset: 4192)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1420, file: !4, line: 2458, baseType: !1012, size: 32, align: 32, offset: 4224)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1420, file: !4, line: 2469, baseType: !1012, size: 32, align: 32, offset: 4256)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1420, file: !4, line: 2475, baseType: !1012, size: 32, align: 32, offset: 4288)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1420, file: !4, line: 2481, baseType: !1012, size: 32, align: 32, offset: 4320)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1420, file: !4, line: 2485, baseType: !1012, size: 32, align: 32, offset: 4352)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1420, file: !4, line: 2489, baseType: !1012, size: 32, align: 32, offset: 4384)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1420, file: !4, line: 2493, baseType: !1012, size: 32, align: 32, offset: 4416)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1420, file: !4, line: 2501, baseType: !1012, size: 32, align: 32, offset: 4448)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1420, file: !4, line: 2506, baseType: !1012, size: 32, align: 32, offset: 4480)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1420, file: !4, line: 2510, baseType: !1012, size: 32, align: 32, offset: 4512)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1420, file: !4, line: 2514, baseType: !1062, size: 64, align: 64, offset: 4544)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1420, file: !4, line: 2528, baseType: !1700, size: 64, align: 64, offset: 4608)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{null, !1591, !1048, !1012, !1012}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1420, file: !4, line: 2534, baseType: !1012, size: 32, align: 32, offset: 4672)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1420, file: !4, line: 2545, baseType: !1012, size: 32, align: 32, offset: 4704)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1420, file: !4, line: 2547, baseType: !1012, size: 32, align: 32, offset: 4736)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1420, file: !4, line: 2549, baseType: !1012, size: 32, align: 32, offset: 4768)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1420, file: !4, line: 2551, baseType: !1012, size: 32, align: 32, offset: 4800)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1420, file: !4, line: 2553, baseType: !1012, size: 32, align: 32, offset: 4832)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1420, file: !4, line: 2555, baseType: !1012, size: 32, align: 32, offset: 4864)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1420, file: !4, line: 2557, baseType: !1012, size: 32, align: 32, offset: 4896)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1420, file: !4, line: 2559, baseType: !1012, size: 32, align: 32, offset: 4928)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1420, file: !4, line: 2563, baseType: !1012, size: 32, align: 32, offset: 4960)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1420, file: !4, line: 2571, baseType: !1524, size: 64, align: 64, offset: 4992)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1420, file: !4, line: 2579, baseType: !1524, size: 64, align: 64, offset: 5056)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1420, file: !4, line: 2586, baseType: !1012, size: 32, align: 32, offset: 5120)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1420, file: !4, line: 2615, baseType: !1012, size: 32, align: 32, offset: 5152)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1420, file: !4, line: 2627, baseType: !1012, size: 32, align: 32, offset: 5184)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1420, file: !4, line: 2637, baseType: !1012, size: 32, align: 32, offset: 5216)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1420, file: !4, line: 2681, baseType: !1012, size: 32, align: 32, offset: 5248)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1420, file: !4, line: 2709, baseType: !1062, size: 64, align: 64, offset: 5312)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1420, file: !4, line: 2716, baseType: !1722, size: 64, align: 64, offset: 5376)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64, align: 64)
!1723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1724)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1725)
!1725 = !{!1726, !1727, !1728, !1729, !1730, !1731, !1732, !1736, !1740, !1741, !1742, !1743, !1749, !1750, !1751, !1752, !1753}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1724, file: !4, line: 3642, baseType: !1021, size: 64, align: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1724, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1724, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1724, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1724, file: !4, line: 3669, baseType: !1012, size: 32, align: 32, offset: 160)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1724, file: !4, line: 3682, baseType: !1549, size: 64, align: 64, offset: 192)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1724, file: !4, line: 3698, baseType: !1733, size: 64, align: 64, offset: 256)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64, align: 64)
!1734 = !DISubroutineType(types: !1735)
!1735 = !{!1012, !1418, !1372, !1496}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1724, file: !4, line: 3712, baseType: !1737, size: 64, align: 64, offset: 320)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DISubroutineType(types: !1739)
!1739 = !{!1012, !1418, !1012, !1372, !1496}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1724, file: !4, line: 3726, baseType: !1733, size: 64, align: 64, offset: 384)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1724, file: !4, line: 3737, baseType: !1465, size: 64, align: 64, offset: 448)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1724, file: !4, line: 3746, baseType: !1012, size: 32, align: 32, offset: 512)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1724, file: !4, line: 3757, baseType: !1744, size: 64, align: 64, offset: 576)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DISubroutineType(types: !1746)
!1746 = !{null, !1747}
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1724, file: !4, line: 3766, baseType: !1465, size: 64, align: 64, offset: 640)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1724, file: !4, line: 3774, baseType: !1465, size: 64, align: 64, offset: 704)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1724, file: !4, line: 3780, baseType: !1012, size: 32, align: 32, offset: 768)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1724, file: !4, line: 3785, baseType: !1012, size: 32, align: 32, offset: 800)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1724, file: !4, line: 3795, baseType: !1754, size: 64, align: 64, offset: 832)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1755, size: 64, align: 64)
!1755 = !DISubroutineType(types: !1756)
!1756 = !{!1012, !1418, !1174}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1420, file: !4, line: 2728, baseType: !1048, size: 64, align: 64, offset: 5440)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1420, file: !4, line: 2735, baseType: !1259, size: 512, align: 64, offset: 5504)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1420, file: !4, line: 2742, baseType: !1012, size: 32, align: 32, offset: 6016)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1420, file: !4, line: 2755, baseType: !1012, size: 32, align: 32, offset: 6048)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1420, file: !4, line: 2776, baseType: !1012, size: 32, align: 32, offset: 6080)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1420, file: !4, line: 2783, baseType: !1012, size: 32, align: 32, offset: 6112)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1420, file: !4, line: 2791, baseType: !1012, size: 32, align: 32, offset: 6144)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1420, file: !4, line: 2802, baseType: !1232, size: 64, align: 64, offset: 6208)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1420, file: !4, line: 2811, baseType: !1012, size: 32, align: 32, offset: 6272)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1420, file: !4, line: 2821, baseType: !1012, size: 32, align: 32, offset: 6304)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1420, file: !4, line: 2830, baseType: !1012, size: 32, align: 32, offset: 6336)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1420, file: !4, line: 2840, baseType: !1012, size: 32, align: 32, offset: 6368)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1420, file: !4, line: 2851, baseType: !1770, size: 64, align: 64, offset: 6400)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64, align: 64)
!1771 = !DISubroutineType(types: !1772)
!1772 = !{!1012, !1591, !1773, !1048, !1534, !1012, !1012}
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64, align: 64)
!1774 = !DISubroutineType(types: !1775)
!1775 = !{!1012, !1591, !1048}
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1420, file: !4, line: 2871, baseType: !1777, size: 64, align: 64, offset: 6464)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{!1012, !1591, !1780, !1048, !1534, !1012}
!1780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1781, size: 64, align: 64)
!1781 = !DISubroutineType(types: !1782)
!1782 = !{!1012, !1591, !1048, !1012, !1012}
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1420, file: !4, line: 2878, baseType: !1012, size: 32, align: 32, offset: 6528)
