; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--oss_dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--oss_dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !537, line: 199, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882}
!876 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!877 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!878 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!879 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!880 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!881 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!882 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !940, !941}
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!943 = !{!944, !2220, !2221}
!944 = distinct !DIGlobalVariable(name: "ff_oss_demuxer", scope: !0, file: !945, line: 135, type: !946, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_oss_demuxer)
!945 = !DIFile(filename: "libavdevice/oss_dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !948)
!948 = !{!949, !953, !954, !955, !956, !966, !1049, !1050, !1052, !1053, !1054, !1068, !2201, !2202, !2203, !2207, !2211, !2212, !2213, !2217, !2218, !2219}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !947, file: !919, line: 638, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !947, file: !919, line: 645, baseType: !950, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !947, file: !919, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !947, file: !919, line: 659, baseType: !950, size: 64, align: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !947, file: !919, line: 661, baseType: !957, size: 64, align: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !962, line: 44, size: 64, align: 32, elements: !963)
!962 = !DIFile(filename: "./libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !961, file: !962, line: 45, baseType: !3, size: 32, align: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !961, file: !962, line: 46, baseType: !940, size: 32, align: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !947, file: !919, line: 663, baseType: !967, size: 64, align: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !971)
!971 = !{!972, !973, !978, !1008, !1009, !1010, !1011, !1015, !1021, !1023, !1027}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !970, file: !486, line: 72, baseType: !950, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !970, file: !486, line: 78, baseType: !974, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!950, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !970, file: !486, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !1004, !1005, !1006, !1007}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !464, line: 247, baseType: !950, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !981, file: !464, line: 253, baseType: !950, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !981, file: !464, line: 259, baseType: !939, size: 32, align: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !981, file: !464, line: 271, baseType: !988, size: 64, align: 64, offset: 192)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !464, line: 265, size: 64, align: 64, elements: !989)
!989 = !{!990, !994, !996, !997}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !988, file: !464, line: 266, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !992, line: 40, baseType: !993)
!992 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!993 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !988, file: !464, line: 267, baseType: !995, size: 64, align: 64)
!995 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !988, file: !464, line: 268, baseType: !950, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !988, file: !464, line: 270, baseType: !998, size: 64, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !999, line: 61, baseType: !1000)
!999 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !999, line: 58, size: 64, align: 32, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1000, file: !999, line: 59, baseType: !939, size: 32, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1000, file: !999, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !981, file: !464, line: 272, baseType: !995, size: 64, align: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !981, file: !464, line: 273, baseType: !995, size: 64, align: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !464, line: 275, baseType: !939, size: 32, align: 32, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !981, file: !464, line: 300, baseType: !950, size: 64, align: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !970, file: !486, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !970, file: !486, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !970, file: !486, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !970, file: !486, line: 113, baseType: !1012, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!977, !977, !977}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !970, file: !486, line: 123, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !970, file: !486, line: 130, baseType: !1022, size: 32, align: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !970, file: !486, line: 136, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1022, !977}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !970, file: !486, line: 142, baseType: !1028, size: 64, align: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!939, !1031, !977, !950, !939}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1034)
!1034 = !{!1035, !1047, !1048}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1033, file: !464, line: 360, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1039, file: !464, line: 307, baseType: !950, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1039, file: !464, line: 313, baseType: !995, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1039, file: !464, line: 313, baseType: !995, size: 64, align: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1039, file: !464, line: 318, baseType: !995, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1039, file: !464, line: 318, baseType: !995, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1039, file: !464, line: 323, baseType: !939, size: 32, align: 32, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1033, file: !464, line: 364, baseType: !939, size: 32, align: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1033, file: !464, line: 368, baseType: !939, size: 32, align: 32, offset: 96)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !947, file: !919, line: 670, baseType: !950, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !919, line: 679, baseType: !1051, size: 64, align: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !947, file: !919, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !947, file: !919, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !947, file: !919, line: 696, baseType: !1055, size: 64, align: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!939, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1066, !1067}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1060, file: !919, line: 449, baseType: !950, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1060, file: !919, line: 450, baseType: !1064, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1060, file: !919, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1060, file: !919, line: 452, baseType: !950, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !947, file: !919, line: 703, baseType: !1069, size: 64, align: 64, offset: 640)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!939, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1298, !1299, !1364, !1365, !1366, !2058, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2112, !2113, !2114, !2115, !2116, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2167, !2168, !2171, !2172, !2173, !2174, !2175, !2176, !2178, !2179, !2180, !2181, !2189, !2190, !2194, !2198, !2199, !2200}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1073, file: !919, line: 1342, baseType: !967, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1073, file: !919, line: 1349, baseType: !1051, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1073, file: !919, line: 1356, baseType: !1078, size: 64, align: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1134, !1135, !1139, !1143, !1148, !1155, !1244, !1263, !1285, !1286, !1287, !1288, !1292}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1079, file: !919, line: 498, baseType: !950, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1079, file: !919, line: 504, baseType: !950, size: 64, align: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1079, file: !919, line: 505, baseType: !950, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1079, file: !919, line: 506, baseType: !950, size: 64, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1079, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1079, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1079, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !919, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1079, file: !919, line: 523, baseType: !957, size: 64, align: 64, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1079, file: !919, line: 526, baseType: !967, size: 64, align: 64, offset: 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !919, line: 535, baseType: !1078, size: 64, align: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1079, file: !919, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1079, file: !919, line: 541, baseType: !1069, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1079, file: !919, line: 549, baseType: !1095, size: 64, align: 64, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!939, !1072, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1101)
!1101 = !{!1102, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1130, !1131, !1132, !1133}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1100, file: !4, line: 1451, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1105, line: 94, baseType: !1106)
!1105 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1105, line: 81, size: 192, align: 64, elements: !1107)
!1107 = !{!1108, !1112, !1115}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1106, file: !1105, line: 82, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1105, line: 73, baseType: !1111)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1105, line: 73, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !1105, line: 89, baseType: !1113, size: 64, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !992, line: 48, baseType: !1065)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !1105, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1100, file: !4, line: 1461, baseType: !991, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1100, file: !4, line: 1467, baseType: !991, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !4, line: 1468, baseType: !1113, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1100, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1100, file: !4, line: 1479, baseType: !1123, size: 64, align: 64, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !4, line: 1412, baseType: !1113, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1125, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1125, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1100, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1100, file: !4, line: 1486, baseType: !991, size: 64, align: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1100, file: !4, line: 1488, baseType: !991, size: 64, align: 64, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1100, file: !4, line: 1497, baseType: !991, size: 64, align: 64, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1079, file: !919, line: 550, baseType: !1069, size: 64, align: 64, offset: 768)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1079, file: !919, line: 554, baseType: !1136, size: 64, align: 64, offset: 832)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!939, !1072, !1098, !1098, !939}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1079, file: !919, line: 563, baseType: !1140, size: 64, align: 64, offset: 896)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!939, !3, !939}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1079, file: !919, line: 565, baseType: !1144, size: 64, align: 64, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !1072, !939, !1147, !1147}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1079, file: !919, line: 570, baseType: !1149, size: 64, align: 64, offset: 1024)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!939, !1072, !939, !977, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1153, line: 216, baseType: !1154)
!1153 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1154 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1079, file: !919, line: 581, baseType: !1156, size: 64, align: 64, offset: 1088)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!939, !1072, !939, !1159, !940}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1163)
!1163 = !{!1164, !1168, !1170, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1200, !1201, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !548, line: 282, baseType: !1165, size: 512, align: 64)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 512, align: 64, elements: !1166)
!1166 = !{!1167}
!1167 = !DISubrange(count: 8)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1162, file: !548, line: 299, baseType: !1169, size: 256, align: 32, offset: 512)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1166)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1162, file: !548, line: 315, baseType: !1171, size: 64, align: 64, offset: 768)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1162, file: !548, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1162, file: !548, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1162, file: !548, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1162, file: !548, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1162, file: !548, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1162, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1162, file: !548, line: 356, baseType: !998, size: 64, align: 32, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1162, file: !548, line: 361, baseType: !991, size: 64, align: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1162, file: !548, line: 369, baseType: !991, size: 64, align: 64, offset: 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1162, file: !548, line: 377, baseType: !991, size: 64, align: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1162, file: !548, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1162, file: !548, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1162, file: !548, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1162, file: !548, line: 396, baseType: !977, size: 64, align: 64, offset: 1408)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1162, file: !548, line: 403, baseType: !1187, size: 512, align: 64, offset: 1472)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 512, align: 64, elements: !1166)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !992, line: 55, baseType: !1154)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1162, file: !548, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1162, file: !548, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1162, file: !548, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1162, file: !548, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1162, file: !548, line: 435, baseType: !991, size: 64, align: 64, offset: 2112)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1162, file: !548, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1162, file: !548, line: 445, baseType: !1188, size: 64, align: 64, offset: 2240)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1162, file: !548, line: 459, baseType: !1197, size: 512, align: 64, offset: 2304)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 512, align: 64, elements: !1166)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1162, file: !548, line: 473, baseType: !1199, size: 64, align: 64, offset: 2816)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1162, file: !548, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1162, file: !548, line: 479, baseType: !1202, size: 64, align: 64, offset: 2944)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1215}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1205, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !548, line: 203, baseType: !1113, size: 64, align: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !548, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1205, file: !548, line: 205, baseType: !1211, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1213, line: 86, baseType: !1214)
!1213 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1213, line: 86, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1205, file: !548, line: 206, baseType: !1103, size: 64, align: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1162, file: !548, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1162, file: !548, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1162, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1162, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1162, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1162, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1162, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1162, file: !548, line: 532, baseType: !991, size: 64, align: 64, offset: 3264)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1162, file: !548, line: 539, baseType: !991, size: 64, align: 64, offset: 3328)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1162, file: !548, line: 547, baseType: !991, size: 64, align: 64, offset: 3392)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1162, file: !548, line: 554, baseType: !1211, size: 64, align: 64, offset: 3456)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1162, file: !548, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1162, file: !548, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1162, file: !548, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1162, file: !548, line: 588, baseType: !1231, size: 64, align: 64, offset: 3648)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !992, line: 36, baseType: !1233)
!1233 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1162, file: !548, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1162, file: !548, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1162, file: !548, line: 599, baseType: !1103, size: 64, align: 64, offset: 3776)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1162, file: !548, line: 605, baseType: !1103, size: 64, align: 64, offset: 3840)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1162, file: !548, line: 616, baseType: !1103, size: 64, align: 64, offset: 3904)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1162, file: !548, line: 626, baseType: !1152, size: 64, align: 64, offset: 3968)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1162, file: !548, line: 627, baseType: !1152, size: 64, align: 64, offset: 4032)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1162, file: !548, line: 628, baseType: !1152, size: 64, align: 64, offset: 4096)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1162, file: !548, line: 629, baseType: !1152, size: 64, align: 64, offset: 4160)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1162, file: !548, line: 645, baseType: !1103, size: 64, align: 64, offset: 4224)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1079, file: !919, line: 587, baseType: !1245, size: 64, align: 64, offset: 1152)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!939, !1072, !1248}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !1250, line: 460, size: 128, align: 64, elements: !1251)
!1250 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1251 = !{!1252, !1261, !1262}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1249, file: !1250, line: 461, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !1250, line: 455, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !1250, line: 452, size: 128, align: 64, elements: !1257)
!1257 = !{!1258, !1260}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1256, file: !1250, line: 453, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1256, file: !1250, line: 454, baseType: !1259, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1249, file: !1250, line: 462, baseType: !939, size: 32, align: 32, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1249, file: !1250, line: 463, baseType: !939, size: 32, align: 32, offset: 96)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1079, file: !919, line: 592, baseType: !1264, size: 64, align: 64, offset: 1216)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!939, !1072, !1267}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !1250, line: 400, size: 576, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1268, file: !1250, line: 401, baseType: !967, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1268, file: !1250, line: 402, baseType: !1272, size: 64, align: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1073)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1268, file: !1250, line: 403, baseType: !3, size: 32, align: 32, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1268, file: !1250, line: 404, baseType: !649, size: 32, align: 32, offset: 160)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1268, file: !1250, line: 405, baseType: !666, size: 32, align: 32, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1268, file: !1250, line: 406, baseType: !939, size: 32, align: 32, offset: 224)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1268, file: !1250, line: 407, baseType: !939, size: 32, align: 32, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1268, file: !1250, line: 408, baseType: !991, size: 64, align: 64, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1268, file: !1250, line: 409, baseType: !939, size: 32, align: 32, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1268, file: !1250, line: 410, baseType: !939, size: 32, align: 32, offset: 416)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1268, file: !1250, line: 411, baseType: !939, size: 32, align: 32, offset: 448)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1268, file: !1250, line: 412, baseType: !939, size: 32, align: 32, offset: 480)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1268, file: !1250, line: 413, baseType: !998, size: 64, align: 32, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1079, file: !919, line: 597, baseType: !1264, size: 64, align: 64, offset: 1280)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1079, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1079, file: !919, line: 608, baseType: !1069, size: 64, align: 64, offset: 1408)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1079, file: !919, line: 617, baseType: !1289, size: 64, align: 64, offset: 1472)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !1072}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1079, file: !919, line: 623, baseType: !1293, size: 64, align: 64, offset: 1536)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!939, !1072, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1073, file: !919, line: 1365, baseType: !977, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1073, file: !919, line: 1379, baseType: !1300, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !866, line: 352, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !866, line: 161, size: 2112, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1314, !1315, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1331, !1332, !1336, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1354, !1355, !1356, !1357, !1361, !1362, !1363}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1302, file: !866, line: 174, baseType: !967, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1302, file: !866, line: 226, baseType: !1064, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1302, file: !866, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1302, file: !866, line: 228, baseType: !1064, size: 64, align: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1302, file: !866, line: 229, baseType: !1064, size: 64, align: 64, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1302, file: !866, line: 233, baseType: !977, size: 64, align: 64, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1302, file: !866, line: 235, baseType: !1311, size: 64, align: 64, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!939, !977, !1113, !939}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1302, file: !866, line: 236, baseType: !1311, size: 64, align: 64, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1302, file: !866, line: 237, baseType: !1316, size: 64, align: 64, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!991, !977, !991, !939}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1302, file: !866, line: 238, baseType: !991, size: 64, align: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1302, file: !866, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1302, file: !866, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1302, file: !866, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1302, file: !866, line: 242, baseType: !1154, size: 64, align: 64, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1302, file: !866, line: 243, baseType: !1064, size: 64, align: 64, offset: 832)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1302, file: !866, line: 244, baseType: !1326, size: 64, align: 64, offset: 896)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!1154, !1154, !1329, !940}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1302, file: !866, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1302, file: !866, line: 249, baseType: !1333, size: 64, align: 64, offset: 1024)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!939, !977, !939}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1302, file: !866, line: 255, baseType: !1337, size: 64, align: 64, offset: 1088)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!991, !977, !939, !991, !939}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1302, file: !866, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1302, file: !866, line: 266, baseType: !991, size: 64, align: 64, offset: 1216)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1302, file: !866, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1302, file: !866, line: 279, baseType: !991, size: 64, align: 64, offset: 1344)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1302, file: !866, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1302, file: !866, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1302, file: !866, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1302, file: !866, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1302, file: !866, line: 309, baseType: !950, size: 64, align: 64, offset: 1536)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1302, file: !866, line: 314, baseType: !950, size: 64, align: 64, offset: 1600)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1302, file: !866, line: 319, baseType: !1351, size: 64, align: 64, offset: 1664)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!939, !977, !1113, !939, !865, !991}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1302, file: !866, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1302, file: !866, line: 331, baseType: !865, size: 32, align: 32, offset: 1760)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1302, file: !866, line: 332, baseType: !991, size: 64, align: 64, offset: 1792)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1302, file: !866, line: 338, baseType: !1358, size: 64, align: 64, offset: 1856)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!939, !977}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1302, file: !866, line: 340, baseType: !991, size: 64, align: 64, offset: 1920)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1302, file: !866, line: 346, baseType: !1064, size: 64, align: 64, offset: 1984)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1302, file: !866, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1073, file: !919, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1073, file: !919, line: 1393, baseType: !940, size: 32, align: 32, offset: 352)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1073, file: !919, line: 1405, baseType: !1367, size: 64, align: 64, offset: 384)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1371)
!1371 = !{!1372, !1373, !1374, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1844, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1944, !1950, !1951, !1955, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1987, !1988, !1989, !1990, !1991, !1992}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1370, file: !919, line: 866, baseType: !939, size: 32, align: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1370, file: !919, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1370, file: !919, line: 878, baseType: !1375, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1519, !1520, !1521, !1522, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1548, !1552, !1553, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1732, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1377, file: !4, line: 1561, baseType: !967, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1377, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1377, file: !4, line: 1564, baseType: !874, size: 32, align: 32, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1377, file: !4, line: 1565, baseType: !1383, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1395, !1398, !1401, !1404, !1407, !1408, !1409, !1417, !1418, !1419, !1421, !1425, !1431, !1436, !1440, !1441, !1484, !1491, !1495, !1496, !1500, !1504, !1508, !1512, !1513, !1514}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1385, file: !4, line: 3475, baseType: !950, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1385, file: !4, line: 3480, baseType: !950, size: 64, align: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1385, file: !4, line: 3481, baseType: !874, size: 32, align: 32, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1385, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1385, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1385, file: !4, line: 3488, baseType: !1393, size: 64, align: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1385, file: !4, line: 3489, baseType: !1396, size: 64, align: 64, offset: 320)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1385, file: !4, line: 3490, baseType: !1399, size: 64, align: 64, offset: 384)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1385, file: !4, line: 3491, baseType: !1402, size: 64, align: 64, offset: 448)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1385, file: !4, line: 3492, baseType: !1405, size: 64, align: 64, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1385, file: !4, line: 3493, baseType: !1114, size: 8, align: 8, offset: 576)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1385, file: !4, line: 3494, baseType: !967, size: 64, align: 64, offset: 640)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1385, file: !4, line: 3495, baseType: !1410, size: 64, align: 64, offset: 704)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1412)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1414)
!1414 = !{!1415, !1416}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1413, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1413, file: !4, line: 3403, baseType: !950, size: 64, align: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1385, file: !4, line: 3507, baseType: !950, size: 64, align: 64, offset: 768)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1385, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1385, file: !4, line: 3517, baseType: !1420, size: 64, align: 64, offset: 896)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1385, file: !4, line: 3527, baseType: !1422, size: 64, align: 64, offset: 960)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!939, !1375}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1385, file: !4, line: 3535, baseType: !1426, size: 64, align: 64, offset: 1024)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!939, !1375, !1429}
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1385, file: !4, line: 3541, baseType: !1432, size: 64, align: 64, offset: 1088)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1435)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1385, file: !4, line: 3549, baseType: !1437, size: 64, align: 64, offset: 1152)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{null, !1420}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1385, file: !4, line: 3551, baseType: !1422, size: 64, align: 64, offset: 1216)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1385, file: !4, line: 3552, baseType: !1442, size: 64, align: 64, offset: 1280)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!939, !1375, !1113, !939, !1445}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1448)
!1448 = !{!1449, !1452, !1454, !1455, !1456, !1483}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1447, file: !4, line: 3921, baseType: !1450, size: 16, align: 16)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !992, line: 49, baseType: !1451)
!1451 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1447, file: !4, line: 3922, baseType: !1453, size: 32, align: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !992, line: 51, baseType: !940)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1447, file: !4, line: 3923, baseType: !1453, size: 32, align: 32, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1447, file: !4, line: 3924, baseType: !940, size: 32, align: 32, offset: 96)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1447, file: !4, line: 3925, baseType: !1457, size: 64, align: 64, offset: 128)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1461)
!1461 = !{!1462, !1463, !1464, !1465, !1466, !1467, !1473, !1477, !1479, !1480, !1481, !1482}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1460, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1460, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1460, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1460, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1460, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1460, file: !4, line: 3897, baseType: !1468, size: 768, align: 64, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1470)
!1470 = !{!1471, !1472}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1469, file: !4, line: 3855, baseType: !1165, size: 512, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1469, file: !4, line: 3857, baseType: !1169, size: 256, align: 32, offset: 512)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1460, file: !4, line: 3903, baseType: !1474, size: 256, align: 64, offset: 960)
!1474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 256, align: 64, elements: !1475)
!1475 = !{!1476}
!1476 = !DISubrange(count: 4)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1460, file: !4, line: 3904, baseType: !1478, size: 128, align: 32, offset: 1216)
!1478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1475)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1460, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1460, file: !4, line: 3908, baseType: !1259, size: 64, align: 64, offset: 1408)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1460, file: !4, line: 3915, baseType: !1259, size: 64, align: 64, offset: 1472)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1460, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1447, file: !4, line: 3926, baseType: !991, size: 64, align: 64, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1385, file: !4, line: 3564, baseType: !1485, size: 64, align: 64, offset: 1344)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!939, !1375, !1098, !1488, !1490}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1161)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1385, file: !4, line: 3566, baseType: !1492, size: 64, align: 64, offset: 1408)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!939, !1375, !977, !1490, !1098}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1385, file: !4, line: 3567, baseType: !1422, size: 64, align: 64, offset: 1472)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1385, file: !4, line: 3576, baseType: !1497, size: 64, align: 64, offset: 1536)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!939, !1375, !1488}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1385, file: !4, line: 3577, baseType: !1501, size: 64, align: 64, offset: 1600)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!939, !1375, !1098}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1385, file: !4, line: 3584, baseType: !1505, size: 64, align: 64, offset: 1664)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!939, !1375, !1160}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1385, file: !4, line: 3589, baseType: !1509, size: 64, align: 64, offset: 1728)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{null, !1375}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1385, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1385, file: !4, line: 3600, baseType: !950, size: 64, align: 64, offset: 1856)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1385, file: !4, line: 3609, baseType: !1515, size: 64, align: 64, offset: 1920)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1377, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1377, file: !4, line: 1581, baseType: !940, size: 32, align: 32, offset: 224)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1377, file: !4, line: 1583, baseType: !977, size: 64, align: 64, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1377, file: !4, line: 1591, baseType: !1523, size: 64, align: 64, offset: 320)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1377, file: !4, line: 1598, baseType: !977, size: 64, align: 64, offset: 384)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1377, file: !4, line: 1606, baseType: !991, size: 64, align: 64, offset: 448)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1377, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1377, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1377, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1377, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1377, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1377, file: !4, line: 1657, baseType: !1113, size: 64, align: 64, offset: 704)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1377, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1377, file: !4, line: 1679, baseType: !998, size: 64, align: 32, offset: 800)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1377, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1377, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1377, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1377, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1377, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1377, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1377, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1377, file: !4, line: 1766, baseType: !666, size: 32, align: 32, offset: 1088)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1377, file: !4, line: 1791, baseType: !1544, size: 64, align: 64, offset: 1152)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{null, !1547, !1488, !1490, !939, !939, !939}
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1377, file: !4, line: 1808, baseType: !1549, size: 64, align: 64, offset: 1216)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!666, !1547, !1396}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1377, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1377, file: !4, line: 1825, baseType: !1554, size: 32, align: 32, offset: 1312)
!1554 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1377, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1377, file: !4, line: 1838, baseType: !1554, size: 32, align: 32, offset: 1376)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1377, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1377, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1377, file: !4, line: 1861, baseType: !1554, size: 32, align: 32, offset: 1472)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1377, file: !4, line: 1868, baseType: !1554, size: 32, align: 32, offset: 1504)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1377, file: !4, line: 1875, baseType: !1554, size: 32, align: 32, offset: 1536)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1377, file: !4, line: 1882, baseType: !1554, size: 32, align: 32, offset: 1568)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1377, file: !4, line: 1889, baseType: !1554, size: 32, align: 32, offset: 1600)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1377, file: !4, line: 1896, baseType: !1554, size: 32, align: 32, offset: 1632)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1377, file: !4, line: 1903, baseType: !1554, size: 32, align: 32, offset: 1664)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1377, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1377, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1377, file: !4, line: 1926, baseType: !1490, size: 64, align: 64, offset: 1792)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1377, file: !4, line: 1935, baseType: !998, size: 64, align: 32, offset: 1856)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1377, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1377, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1377, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1377, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1377, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1377, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1377, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1377, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1377, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1377, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1377, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1377, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1377, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1377, file: !4, line: 2054, baseType: !1584, size: 64, align: 64, offset: 2368)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1377, file: !4, line: 2061, baseType: !1584, size: 64, align: 64, offset: 2432)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1377, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1377, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1377, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1377, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1377, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1377, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1377, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1377, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1377, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1377, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1377, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1377, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1377, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1377, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1377, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1377, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1377, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1377, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1377, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1377, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1377, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1377, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1377, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1377, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1377, file: !4, line: 2220, baseType: !649, size: 32, align: 32, offset: 3264)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1377, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1377, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1377, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1377, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1377, file: !4, line: 2263, baseType: !1188, size: 64, align: 64, offset: 3456)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1377, file: !4, line: 2270, baseType: !1188, size: 64, align: 64, offset: 3520)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1377, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1377, file: !4, line: 2285, baseType: !649, size: 32, align: 32, offset: 3616)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1377, file: !4, line: 2367, baseType: !1620, size: 64, align: 64, offset: 3648)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!939, !1547, !1160, !939}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1377, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1377, file: !4, line: 2386, baseType: !1554, size: 32, align: 32, offset: 3744)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1377, file: !4, line: 2387, baseType: !1554, size: 32, align: 32, offset: 3776)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1377, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1377, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1377, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1377, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1377, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1377, file: !4, line: 2423, baseType: !1632, size: 64, align: 64, offset: 3968)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1634)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1639}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1634, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1634, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1634, file: !4, line: 829, baseType: !939, size: 32, align: 32, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1634, file: !4, line: 830, baseType: !1554, size: 32, align: 32, offset: 96)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1377, file: !4, line: 2430, baseType: !991, size: 64, align: 64, offset: 4032)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1377, file: !4, line: 2437, baseType: !991, size: 64, align: 64, offset: 4096)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1377, file: !4, line: 2444, baseType: !1554, size: 32, align: 32, offset: 4160)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1377, file: !4, line: 2451, baseType: !1554, size: 32, align: 32, offset: 4192)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1377, file: !4, line: 2458, baseType: !939, size: 32, align: 32, offset: 4224)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1377, file: !4, line: 2469, baseType: !939, size: 32, align: 32, offset: 4256)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1377, file: !4, line: 2475, baseType: !939, size: 32, align: 32, offset: 4288)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1377, file: !4, line: 2481, baseType: !939, size: 32, align: 32, offset: 4320)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1377, file: !4, line: 2485, baseType: !939, size: 32, align: 32, offset: 4352)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1377, file: !4, line: 2489, baseType: !939, size: 32, align: 32, offset: 4384)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1377, file: !4, line: 2493, baseType: !939, size: 32, align: 32, offset: 4416)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1377, file: !4, line: 2501, baseType: !939, size: 32, align: 32, offset: 4448)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1377, file: !4, line: 2506, baseType: !939, size: 32, align: 32, offset: 4480)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1377, file: !4, line: 2510, baseType: !939, size: 32, align: 32, offset: 4512)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1377, file: !4, line: 2514, baseType: !991, size: 64, align: 64, offset: 4544)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1377, file: !4, line: 2528, baseType: !1656, size: 64, align: 64, offset: 4608)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1547, !977, !939, !939}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1377, file: !4, line: 2534, baseType: !939, size: 32, align: 32, offset: 4672)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1377, file: !4, line: 2545, baseType: !939, size: 32, align: 32, offset: 4704)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1377, file: !4, line: 2547, baseType: !939, size: 32, align: 32, offset: 4736)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1377, file: !4, line: 2549, baseType: !939, size: 32, align: 32, offset: 4768)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1377, file: !4, line: 2551, baseType: !939, size: 32, align: 32, offset: 4800)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1377, file: !4, line: 2553, baseType: !939, size: 32, align: 32, offset: 4832)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1377, file: !4, line: 2555, baseType: !939, size: 32, align: 32, offset: 4864)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1377, file: !4, line: 2557, baseType: !939, size: 32, align: 32, offset: 4896)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1377, file: !4, line: 2559, baseType: !939, size: 32, align: 32, offset: 4928)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1377, file: !4, line: 2563, baseType: !939, size: 32, align: 32, offset: 4960)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1377, file: !4, line: 2571, baseType: !1259, size: 64, align: 64, offset: 4992)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1377, file: !4, line: 2579, baseType: !1259, size: 64, align: 64, offset: 5056)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1377, file: !4, line: 2586, baseType: !939, size: 32, align: 32, offset: 5120)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1377, file: !4, line: 2615, baseType: !939, size: 32, align: 32, offset: 5152)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1377, file: !4, line: 2627, baseType: !939, size: 32, align: 32, offset: 5184)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1377, file: !4, line: 2637, baseType: !939, size: 32, align: 32, offset: 5216)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1377, file: !4, line: 2681, baseType: !939, size: 32, align: 32, offset: 5248)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1377, file: !4, line: 2709, baseType: !991, size: 64, align: 64, offset: 5312)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1377, file: !4, line: 2716, baseType: !1678, size: 64, align: 64, offset: 5376)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1681)
!1681 = !{!1682, !1683, !1684, !1685, !1686, !1687, !1688, !1692, !1696, !1697, !1698, !1699, !1705, !1706, !1707, !1708, !1709}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1680, file: !4, line: 3642, baseType: !950, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1680, file: !4, line: 3649, baseType: !874, size: 32, align: 32, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1680, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1680, file: !4, line: 3663, baseType: !666, size: 32, align: 32, offset: 128)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1680, file: !4, line: 3669, baseType: !939, size: 32, align: 32, offset: 160)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1680, file: !4, line: 3682, baseType: !1505, size: 64, align: 64, offset: 192)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1680, file: !4, line: 3698, baseType: !1689, size: 64, align: 64, offset: 256)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!939, !1375, !1329, !1453}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1680, file: !4, line: 3712, baseType: !1693, size: 64, align: 64, offset: 320)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!939, !1375, !939, !1329, !1453}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1680, file: !4, line: 3726, baseType: !1689, size: 64, align: 64, offset: 384)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1680, file: !4, line: 3737, baseType: !1422, size: 64, align: 64, offset: 448)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1680, file: !4, line: 3746, baseType: !939, size: 32, align: 32, offset: 512)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1680, file: !4, line: 3757, baseType: !1700, size: 64, align: 64, offset: 576)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{null, !1703}
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1680, file: !4, line: 3766, baseType: !1422, size: 64, align: 64, offset: 640)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1680, file: !4, line: 3774, baseType: !1422, size: 64, align: 64, offset: 704)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1680, file: !4, line: 3780, baseType: !939, size: 32, align: 32, offset: 768)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1680, file: !4, line: 3785, baseType: !939, size: 32, align: 32, offset: 800)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1680, file: !4, line: 3795, baseType: !1710, size: 64, align: 64, offset: 832)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
