; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--oss.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--oss.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{i32 2, !"Dwarf Version", i32 4}
!939 = !{i32 2, !"Debug Info Version", i32 3}
!940 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!941 = distinct !DISubprogram(name: "ff_oss_audio_open", scope: !942, file: !942, line: 40, type: !943, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2134)
!942 = !DIFile(filename: "libavdevice/oss.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !946, !945, !957}
!945 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !949)
!949 = !{!950, !1036, !1170, !1313, !1314, !1379, !1380, !1381, !2011, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2065, !2066, !2067, !2068, !2069, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2100, !2101, !2104, !2105, !2106, !2107, !2108, !2109, !2111, !2112, !2113, !2114, !2122, !2123, !2127, !2131, !2132, !2133}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !948, file: !919, line: 1342, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !955)
!955 = !{!956, !960, !965, !995, !996, !997, !998, !1002, !1008, !1010, !1014}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !954, file: !26, line: 72, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !954, file: !26, line: 78, baseType: !961, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!957, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !954, file: !26, line: 85, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !991, !992, !993, !994}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !4, line: 247, baseType: !957, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !968, file: !4, line: 253, baseType: !957, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !968, file: !4, line: 259, baseType: !945, size: 32, align: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !968, file: !4, line: 271, baseType: !975, size: 64, align: 64, offset: 192)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !4, line: 265, size: 64, align: 64, elements: !976)
!976 = !{!977, !981, !983, !984}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !975, file: !4, line: 266, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !979, line: 40, baseType: !980)
!979 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!980 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !975, file: !4, line: 267, baseType: !982, size: 64, align: 64)
!982 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !975, file: !4, line: 268, baseType: !957, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !975, file: !4, line: 270, baseType: !985, size: 64, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !986, line: 61, baseType: !987)
!986 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !986, line: 58, size: 64, align: 32, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !987, file: !986, line: 59, baseType: !945, size: 32, align: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !987, file: !986, line: 60, baseType: !945, size: 32, align: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !968, file: !4, line: 272, baseType: !982, size: 64, align: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !968, file: !4, line: 273, baseType: !982, size: 64, align: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !4, line: 275, baseType: !945, size: 32, align: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !968, file: !4, line: 300, baseType: !957, size: 64, align: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !954, file: !26, line: 93, baseType: !945, size: 32, align: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !954, file: !26, line: 99, baseType: !945, size: 32, align: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !954, file: !26, line: 108, baseType: !945, size: 32, align: 32, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !954, file: !26, line: 113, baseType: !999, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!964, !964, !964}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !954, file: !26, line: 123, baseType: !1003, size: 64, align: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1006, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !954, file: !26, line: 130, baseType: !1009, size: 32, align: 32, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !954, file: !26, line: 136, baseType: !1011, size: 64, align: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!1009, !964}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !954, file: !26, line: 142, baseType: !1015, size: 64, align: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!945, !1018, !964, !957, !945}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1021)
!1021 = !{!1022, !1034, !1035}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1020, file: !4, line: 360, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1026, file: !4, line: 307, baseType: !957, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1026, file: !4, line: 313, baseType: !982, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1026, file: !4, line: 313, baseType: !982, size: 64, align: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1026, file: !4, line: 318, baseType: !982, size: 64, align: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1026, file: !4, line: 318, baseType: !982, size: 64, align: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1026, file: !4, line: 323, baseType: !945, size: 32, align: 32, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1020, file: !4, line: 364, baseType: !945, size: 32, align: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1020, file: !4, line: 368, baseType: !945, size: 32, align: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !948, file: !919, line: 1349, baseType: !1037, size: 64, align: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1050, !1051, !1052, !1053, !1054, !1055, !1069, !1074, !1114, !1115, !1119, !1124, !1125, !1126, !1130, !1149, !1169}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !919, line: 638, baseType: !957, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1038, file: !919, line: 645, baseType: !957, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1038, file: !919, line: 652, baseType: !945, size: 32, align: 32, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1038, file: !919, line: 659, baseType: !957, size: 64, align: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1038, file: !919, line: 661, baseType: !1045, size: 64, align: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1038, file: !919, line: 663, baseType: !951, size: 64, align: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1038, file: !919, line: 670, baseType: !957, size: 64, align: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1038, file: !919, line: 679, baseType: !1037, size: 64, align: 64, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1038, file: !919, line: 684, baseType: !945, size: 32, align: 32, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1038, file: !919, line: 689, baseType: !945, size: 32, align: 32, offset: 544)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1038, file: !919, line: 696, baseType: !1056, size: 64, align: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!945, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1067, !1068}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1061, file: !919, line: 449, baseType: !957, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1061, file: !919, line: 450, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1061, file: !919, line: 451, baseType: !945, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1061, file: !919, line: 452, baseType: !957, size: 64, align: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1038, file: !919, line: 703, baseType: !1070, size: 64, align: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!945, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1038, file: !919, line: 714, baseType: !1075, size: 64, align: 64, offset: 704)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!945, !1073, !1078}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1081)
!1081 = !{!1082, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1110, !1111, !1112, !1113}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1080, file: !47, line: 1451, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1085, line: 94, baseType: !1086)
!1085 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1085, line: 81, size: 192, align: 64, elements: !1087)
!1087 = !{!1088, !1092, !1095}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1086, file: !1085, line: 82, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1085, line: 73, baseType: !1091)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1085, line: 73, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1086, file: !1085, line: 89, baseType: !1093, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !979, line: 48, baseType: !1066)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1086, file: !1085, line: 93, baseType: !945, size: 32, align: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1080, file: !47, line: 1461, baseType: !978, size: 64, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1080, file: !47, line: 1467, baseType: !978, size: 64, align: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1080, file: !47, line: 1468, baseType: !1093, size: 64, align: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1080, file: !47, line: 1469, baseType: !945, size: 32, align: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1080, file: !47, line: 1470, baseType: !945, size: 32, align: 32, offset: 288)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !47, line: 1474, baseType: !945, size: 32, align: 32, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1080, file: !47, line: 1479, baseType: !1103, size: 64, align: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1106)
!1106 = !{!1107, !1108, !1109}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1105, file: !47, line: 1412, baseType: !1093, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !47, line: 1413, baseType: !945, size: 32, align: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1105, file: !47, line: 1414, baseType: !46, size: 32, align: 32, offset: 96)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1080, file: !47, line: 1480, baseType: !945, size: 32, align: 32, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1080, file: !47, line: 1486, baseType: !978, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1080, file: !47, line: 1488, baseType: !978, size: 64, align: 64, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1080, file: !47, line: 1497, baseType: !978, size: 64, align: 64, offset: 640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1038, file: !919, line: 720, baseType: !1070, size: 64, align: 64, offset: 768)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1038, file: !919, line: 730, baseType: !1116, size: 64, align: 64, offset: 832)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!945, !1073, !945, !978, !945}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1038, file: !919, line: 737, baseType: !1120, size: 64, align: 64, offset: 896)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!978, !1073, !945, !1123, !978}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1038, file: !919, line: 744, baseType: !1070, size: 64, align: 64, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1038, file: !919, line: 750, baseType: !1070, size: 64, align: 64, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1038, file: !919, line: 758, baseType: !1127, size: 64, align: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!945, !1073, !945, !978, !978, !978, !945}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1038, file: !919, line: 764, baseType: !1131, size: 64, align: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!945, !1073, !1134}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !1136, line: 460, size: 128, align: 64, elements: !1137)
!1136 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1137 = !{!1138, !1147, !1148}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1135, file: !1136, line: 461, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !1136, line: 455, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !1136, line: 452, size: 128, align: 64, elements: !1143)
!1143 = !{!1144, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1142, file: !1136, line: 453, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1142, file: !1136, line: 454, baseType: !1145, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1135, file: !1136, line: 462, baseType: !945, size: 32, align: 32, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1135, file: !1136, line: 463, baseType: !945, size: 32, align: 32, offset: 96)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1038, file: !919, line: 770, baseType: !1150, size: 64, align: 64, offset: 1216)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!945, !1073, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !1136, line: 400, size: 576, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1154, file: !1136, line: 401, baseType: !951, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1154, file: !1136, line: 402, baseType: !946, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1154, file: !1136, line: 403, baseType: !77, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1154, file: !1136, line: 404, baseType: !536, size: 32, align: 32, offset: 160)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1154, file: !1136, line: 405, baseType: !553, size: 32, align: 32, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1154, file: !1136, line: 406, baseType: !945, size: 32, align: 32, offset: 224)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1154, file: !1136, line: 407, baseType: !945, size: 32, align: 32, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1154, file: !1136, line: 408, baseType: !978, size: 64, align: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1154, file: !1136, line: 409, baseType: !945, size: 32, align: 32, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1154, file: !1136, line: 410, baseType: !945, size: 32, align: 32, offset: 416)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1154, file: !1136, line: 411, baseType: !945, size: 32, align: 32, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1154, file: !1136, line: 412, baseType: !945, size: 32, align: 32, offset: 480)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1154, file: !1136, line: 413, baseType: !985, size: 64, align: 32, offset: 512)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1038, file: !919, line: 776, baseType: !1150, size: 64, align: 64, offset: 1280)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !948, file: !919, line: 1356, baseType: !1171, size: 64, align: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1197, !1201, !1208, !1298, !1299, !1300, !1301, !1302, !1303, !1307}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1172, file: !919, line: 498, baseType: !957, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1172, file: !919, line: 504, baseType: !957, size: 64, align: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1172, file: !919, line: 505, baseType: !957, size: 64, align: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1172, file: !919, line: 506, baseType: !957, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1172, file: !919, line: 508, baseType: !77, size: 32, align: 32, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1172, file: !919, line: 509, baseType: !77, size: 32, align: 32, offset: 288)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1172, file: !919, line: 510, baseType: !77, size: 32, align: 32, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1172, file: !919, line: 517, baseType: !945, size: 32, align: 32, offset: 352)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1172, file: !919, line: 523, baseType: !1045, size: 64, align: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1172, file: !919, line: 526, baseType: !951, size: 64, align: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1172, file: !919, line: 535, baseType: !1171, size: 64, align: 64, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1172, file: !919, line: 539, baseType: !945, size: 32, align: 32, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1172, file: !919, line: 541, baseType: !1070, size: 64, align: 64, offset: 640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1172, file: !919, line: 549, baseType: !1075, size: 64, align: 64, offset: 704)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1172, file: !919, line: 550, baseType: !1070, size: 64, align: 64, offset: 768)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1172, file: !919, line: 554, baseType: !1190, size: 64, align: 64, offset: 832)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!945, !1073, !1078, !1078, !945}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1172, file: !919, line: 563, baseType: !1194, size: 64, align: 64, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!945, !77, !945}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1172, file: !919, line: 565, baseType: !1198, size: 64, align: 64, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{null, !1073, !945, !1123, !1123}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1172, file: !919, line: 570, baseType: !1202, size: 64, align: 64, offset: 1024)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!945, !1073, !945, !964, !1205}
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1206, line: 216, baseType: !1207)
!1206 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1207 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1172, file: !919, line: 581, baseType: !1209, size: 64, align: 64, offset: 1088)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!945, !1073, !945, !1212, !1297}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !765, line: 646, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !765, line: 268, size: 4288, align: 64, elements: !1216)
!1216 = !{!1217, !1221, !1223, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1251, !1253, !1254, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !765, line: 282, baseType: !1218, size: 512, align: 64)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, align: 64, elements: !1219)
!1219 = !{!1220}
!1220 = !DISubrange(count: 8)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1215, file: !765, line: 299, baseType: !1222, size: 256, align: 32, offset: 512)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 32, elements: !1219)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1215, file: !765, line: 315, baseType: !1224, size: 64, align: 64, offset: 768)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1215, file: !765, line: 326, baseType: !945, size: 32, align: 32, offset: 832)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1215, file: !765, line: 326, baseType: !945, size: 32, align: 32, offset: 864)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1215, file: !765, line: 334, baseType: !945, size: 32, align: 32, offset: 896)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1215, file: !765, line: 341, baseType: !945, size: 32, align: 32, offset: 928)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1215, file: !765, line: 346, baseType: !945, size: 32, align: 32, offset: 960)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1215, file: !765, line: 351, baseType: !753, size: 32, align: 32, offset: 992)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1215, file: !765, line: 356, baseType: !985, size: 64, align: 32, offset: 1024)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1215, file: !765, line: 361, baseType: !978, size: 64, align: 64, offset: 1088)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1215, file: !765, line: 369, baseType: !978, size: 64, align: 64, offset: 1152)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1215, file: !765, line: 377, baseType: !978, size: 64, align: 64, offset: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1215, file: !765, line: 382, baseType: !945, size: 32, align: 32, offset: 1280)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1215, file: !765, line: 386, baseType: !945, size: 32, align: 32, offset: 1312)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1215, file: !765, line: 391, baseType: !945, size: 32, align: 32, offset: 1344)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1215, file: !765, line: 396, baseType: !964, size: 64, align: 64, offset: 1408)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1215, file: !765, line: 403, baseType: !1240, size: 512, align: 64, offset: 1472)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 512, align: 64, elements: !1219)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !979, line: 55, baseType: !1207)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1215, file: !765, line: 410, baseType: !945, size: 32, align: 32, offset: 1984)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1215, file: !765, line: 415, baseType: !945, size: 32, align: 32, offset: 2016)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1215, file: !765, line: 420, baseType: !945, size: 32, align: 32, offset: 2048)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1215, file: !765, line: 425, baseType: !945, size: 32, align: 32, offset: 2080)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1215, file: !765, line: 435, baseType: !978, size: 64, align: 64, offset: 2112)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1215, file: !765, line: 440, baseType: !945, size: 32, align: 32, offset: 2176)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1215, file: !765, line: 445, baseType: !1241, size: 64, align: 64, offset: 2240)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1215, file: !765, line: 459, baseType: !1250, size: 512, align: 64, offset: 2304)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 512, align: 64, elements: !1219)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1215, file: !765, line: 473, baseType: !1252, size: 64, align: 64, offset: 2816)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1215, file: !765, line: 477, baseType: !945, size: 32, align: 32, offset: 2880)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1215, file: !765, line: 479, baseType: !1255, size: 64, align: 64, offset: 2944)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !765, line: 207, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !765, line: 201, size: 320, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1268}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1258, file: !765, line: 202, baseType: !764, size: 32, align: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1258, file: !765, line: 203, baseType: !1093, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1258, file: !765, line: 204, baseType: !945, size: 32, align: 32, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1258, file: !765, line: 205, baseType: !1264, size: 64, align: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1266, line: 86, baseType: !1267)
!1266 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1266, line: 86, flags: DIFlagFwdDecl)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1258, file: !765, line: 206, baseType: !1083, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1215, file: !765, line: 480, baseType: !945, size: 32, align: 32, offset: 3008)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1215, file: !765, line: 505, baseType: !945, size: 32, align: 32, offset: 3040)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1215, file: !765, line: 512, baseType: !788, size: 32, align: 32, offset: 3072)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1215, file: !765, line: 514, baseType: !794, size: 32, align: 32, offset: 3104)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1215, file: !765, line: 516, baseType: !812, size: 32, align: 32, offset: 3136)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1215, file: !765, line: 523, baseType: !836, size: 32, align: 32, offset: 3168)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1215, file: !765, line: 525, baseType: !855, size: 32, align: 32, offset: 3200)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1215, file: !765, line: 532, baseType: !978, size: 64, align: 64, offset: 3264)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1215, file: !765, line: 539, baseType: !978, size: 64, align: 64, offset: 3328)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1215, file: !765, line: 547, baseType: !978, size: 64, align: 64, offset: 3392)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1215, file: !765, line: 554, baseType: !1264, size: 64, align: 64, offset: 3456)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1215, file: !765, line: 563, baseType: !945, size: 32, align: 32, offset: 3520)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1215, file: !765, line: 572, baseType: !945, size: 32, align: 32, offset: 3552)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1215, file: !765, line: 581, baseType: !945, size: 32, align: 32, offset: 3584)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1215, file: !765, line: 588, baseType: !1284, size: 64, align: 64, offset: 3648)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !979, line: 36, baseType: !1286)
!1286 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1215, file: !765, line: 593, baseType: !945, size: 32, align: 32, offset: 3712)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1215, file: !765, line: 596, baseType: !945, size: 32, align: 32, offset: 3744)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1215, file: !765, line: 599, baseType: !1083, size: 64, align: 64, offset: 3776)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1215, file: !765, line: 605, baseType: !1083, size: 64, align: 64, offset: 3840)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1215, file: !765, line: 616, baseType: !1083, size: 64, align: 64, offset: 3904)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1215, file: !765, line: 626, baseType: !1205, size: 64, align: 64, offset: 3968)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1215, file: !765, line: 627, baseType: !1205, size: 64, align: 64, offset: 4032)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1215, file: !765, line: 628, baseType: !1205, size: 64, align: 64, offset: 4096)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1215, file: !765, line: 629, baseType: !1205, size: 64, align: 64, offset: 4160)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1215, file: !765, line: 645, baseType: !1083, size: 64, align: 64, offset: 4224)
!1297 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1172, file: !919, line: 587, baseType: !1131, size: 64, align: 64, offset: 1152)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1172, file: !919, line: 592, baseType: !1150, size: 64, align: 64, offset: 1216)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1172, file: !919, line: 597, baseType: !1150, size: 64, align: 64, offset: 1280)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1172, file: !919, line: 598, baseType: !77, size: 32, align: 32, offset: 1344)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1172, file: !919, line: 608, baseType: !1070, size: 64, align: 64, offset: 1408)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1172, file: !919, line: 617, baseType: !1304, size: 64, align: 64, offset: 1472)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{null, !1073}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1172, file: !919, line: 623, baseType: !1308, size: 64, align: 64, offset: 1536)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!945, !1073, !1311}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !948, file: !919, line: 1365, baseType: !964, size: 64, align: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !948, file: !919, line: 1379, baseType: !1315, size: 64, align: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !866, line: 352, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !866, line: 161, size: 2112, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1330, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1346, !1347, !1351, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1369, !1370, !1371, !1372, !1376, !1377, !1378}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1317, file: !866, line: 174, baseType: !951, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1317, file: !866, line: 226, baseType: !1065, size: 64, align: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1317, file: !866, line: 227, baseType: !945, size: 32, align: 32, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1317, file: !866, line: 228, baseType: !1065, size: 64, align: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1317, file: !866, line: 229, baseType: !1065, size: 64, align: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1317, file: !866, line: 233, baseType: !964, size: 64, align: 64, offset: 320)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1317, file: !866, line: 235, baseType: !1326, size: 64, align: 64, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!945, !964, !1093, !945}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1317, file: !866, line: 236, baseType: !1326, size: 64, align: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1317, file: !866, line: 237, baseType: !1331, size: 64, align: 64, offset: 512)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!978, !964, !978, !945}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1317, file: !866, line: 238, baseType: !978, size: 64, align: 64, offset: 576)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1317, file: !866, line: 239, baseType: !945, size: 32, align: 32, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1317, file: !866, line: 240, baseType: !945, size: 32, align: 32, offset: 672)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1317, file: !866, line: 241, baseType: !945, size: 32, align: 32, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1317, file: !866, line: 242, baseType: !1207, size: 64, align: 64, offset: 768)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1317, file: !866, line: 243, baseType: !1065, size: 64, align: 64, offset: 832)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1317, file: !866, line: 244, baseType: !1341, size: 64, align: 64, offset: 896)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!1207, !1207, !1344, !1297}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1317, file: !866, line: 245, baseType: !945, size: 32, align: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1317, file: !866, line: 249, baseType: !1348, size: 64, align: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!945, !964, !945}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1317, file: !866, line: 255, baseType: !1352, size: 64, align: 64, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!978, !964, !945, !978, !945}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1317, file: !866, line: 260, baseType: !945, size: 32, align: 32, offset: 1152)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1317, file: !866, line: 266, baseType: !978, size: 64, align: 64, offset: 1216)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1317, file: !866, line: 273, baseType: !945, size: 32, align: 32, offset: 1280)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1317, file: !866, line: 279, baseType: !978, size: 64, align: 64, offset: 1344)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1317, file: !866, line: 285, baseType: !945, size: 32, align: 32, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1317, file: !866, line: 291, baseType: !945, size: 32, align: 32, offset: 1440)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1317, file: !866, line: 298, baseType: !945, size: 32, align: 32, offset: 1472)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1317, file: !866, line: 304, baseType: !945, size: 32, align: 32, offset: 1504)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1317, file: !866, line: 309, baseType: !957, size: 64, align: 64, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1317, file: !866, line: 314, baseType: !957, size: 64, align: 64, offset: 1600)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1317, file: !866, line: 319, baseType: !1366, size: 64, align: 64, offset: 1664)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!945, !964, !1093, !945, !865, !978}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1317, file: !866, line: 326, baseType: !945, size: 32, align: 32, offset: 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1317, file: !866, line: 331, baseType: !865, size: 32, align: 32, offset: 1760)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1317, file: !866, line: 332, baseType: !978, size: 64, align: 64, offset: 1792)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1317, file: !866, line: 338, baseType: !1373, size: 64, align: 64, offset: 1856)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!945, !964}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1317, file: !866, line: 340, baseType: !978, size: 64, align: 64, offset: 1920)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1317, file: !866, line: 346, baseType: !1065, size: 64, align: 64, offset: 1984)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1317, file: !866, line: 351, baseType: !945, size: 32, align: 32, offset: 2048)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !948, file: !919, line: 1386, baseType: !945, size: 32, align: 32, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !948, file: !919, line: 1393, baseType: !1297, size: 32, align: 32, offset: 352)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !948, file: !919, line: 1405, baseType: !1382, size: 64, align: 64, offset: 384)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1859, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1959, !1965, !1966, !1970, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2002, !2003, !2004, !2005, !2006, !2007}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1385, file: !919, line: 866, baseType: !945, size: 32, align: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1385, file: !919, line: 872, baseType: !945, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1385, file: !919, line: 878, baseType: !1390, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1534, !1535, !1536, !1537, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1563, !1567, !1568, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1747, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1392, file: !47, line: 1561, baseType: !951, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1392, file: !47, line: 1562, baseType: !945, size: 32, align: 32, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1392, file: !47, line: 1564, baseType: !874, size: 32, align: 32, offset: 96)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1392, file: !47, line: 1565, baseType: !1398, size: 64, align: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1410, !1413, !1416, !1419, !1422, !1423, !1424, !1432, !1433, !1434, !1436, !1440, !1446, !1451, !1455, !1456, !1499, !1506, !1510, !1511, !1515, !1519, !1523, !1527, !1528, !1529}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1400, file: !47, line: 3475, baseType: !957, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1400, file: !47, line: 3480, baseType: !957, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !47, line: 3481, baseType: !874, size: 32, align: 32, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1400, file: !47, line: 3482, baseType: !77, size: 32, align: 32, offset: 160)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1400, file: !47, line: 3487, baseType: !945, size: 32, align: 32, offset: 192)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1400, file: !47, line: 3488, baseType: !1408, size: 64, align: 64, offset: 256)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1400, file: !47, line: 3489, baseType: !1411, size: 64, align: 64, offset: 320)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1400, file: !47, line: 3490, baseType: !1414, size: 64, align: 64, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1400, file: !47, line: 3491, baseType: !1417, size: 64, align: 64, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1400, file: !47, line: 3492, baseType: !1420, size: 64, align: 64, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1400, file: !47, line: 3493, baseType: !1094, size: 8, align: 8, offset: 576)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1400, file: !47, line: 3494, baseType: !951, size: 64, align: 64, offset: 640)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1400, file: !47, line: 3495, baseType: !1425, size: 64, align: 64, offset: 704)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1429)
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1428, file: !47, line: 3402, baseType: !945, size: 32, align: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1428, file: !47, line: 3403, baseType: !957, size: 64, align: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1400, file: !47, line: 3507, baseType: !957, size: 64, align: 64, offset: 768)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1400, file: !47, line: 3516, baseType: !945, size: 32, align: 32, offset: 832)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1400, file: !47, line: 3517, baseType: !1435, size: 64, align: 64, offset: 896)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1400, file: !47, line: 3527, baseType: !1437, size: 64, align: 64, offset: 960)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!945, !1390}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1400, file: !47, line: 3535, baseType: !1441, size: 64, align: 64, offset: 1024)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!945, !1390, !1444}
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1391)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1400, file: !47, line: 3541, baseType: !1447, size: 64, align: 64, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1449)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1450)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1400, file: !47, line: 3549, baseType: !1452, size: 64, align: 64, offset: 1152)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !1435}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1400, file: !47, line: 3551, baseType: !1437, size: 64, align: 64, offset: 1216)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1400, file: !47, line: 3552, baseType: !1457, size: 64, align: 64, offset: 1280)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!945, !1390, !1093, !945, !1460}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1463)
!1463 = !{!1464, !1467, !1469, !1470, !1471, !1498}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1462, file: !47, line: 3921, baseType: !1465, size: 16, align: 16)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !979, line: 49, baseType: !1466)
!1466 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1462, file: !47, line: 3922, baseType: !1468, size: 32, align: 32, offset: 32)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !979, line: 51, baseType: !1297)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1462, file: !47, line: 3923, baseType: !1468, size: 32, align: 32, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1462, file: !47, line: 3924, baseType: !1297, size: 32, align: 32, offset: 96)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1462, file: !47, line: 3925, baseType: !1472, size: 64, align: 64, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480, !1481, !1482, !1488, !1492, !1494, !1495, !1496, !1497}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1475, file: !47, line: 3886, baseType: !945, size: 32, align: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1475, file: !47, line: 3887, baseType: !945, size: 32, align: 32, offset: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1475, file: !47, line: 3888, baseType: !945, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1475, file: !47, line: 3889, baseType: !945, size: 32, align: 32, offset: 96)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1475, file: !47, line: 3890, baseType: !945, size: 32, align: 32, offset: 128)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1475, file: !47, line: 3897, baseType: !1483, size: 768, align: 64, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1485)
!1485 = !{!1486, !1487}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1484, file: !47, line: 3855, baseType: !1218, size: 512, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1484, file: !47, line: 3857, baseType: !1222, size: 256, align: 32, offset: 512)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1475, file: !47, line: 3903, baseType: !1489, size: 256, align: 64, offset: 960)
!1489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 256, align: 64, elements: !1490)
!1490 = !{!1491}
!1491 = !DISubrange(count: 4)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1475, file: !47, line: 3904, baseType: !1493, size: 128, align: 32, offset: 1216)
!1493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, align: 32, elements: !1490)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1475, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1475, file: !47, line: 3908, baseType: !1145, size: 64, align: 64, offset: 1408)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1475, file: !47, line: 3915, baseType: !1145, size: 64, align: 64, offset: 1472)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1475, file: !47, line: 3917, baseType: !945, size: 32, align: 32, offset: 1536)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1462, file: !47, line: 3926, baseType: !978, size: 64, align: 64, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1400, file: !47, line: 3564, baseType: !1500, size: 64, align: 64, offset: 1344)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!945, !1390, !1078, !1503, !1505}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1400, file: !47, line: 3566, baseType: !1507, size: 64, align: 64, offset: 1408)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!945, !1390, !964, !1505, !1078}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1400, file: !47, line: 3567, baseType: !1437, size: 64, align: 64, offset: 1472)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1400, file: !47, line: 3576, baseType: !1512, size: 64, align: 64, offset: 1536)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!945, !1390, !1503}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1400, file: !47, line: 3577, baseType: !1516, size: 64, align: 64, offset: 1600)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!945, !1390, !1078}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1400, file: !47, line: 3584, baseType: !1520, size: 64, align: 64, offset: 1664)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!945, !1390, !1213}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1400, file: !47, line: 3589, baseType: !1524, size: 64, align: 64, offset: 1728)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !1390}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1400, file: !47, line: 3594, baseType: !945, size: 32, align: 32, offset: 1792)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1400, file: !47, line: 3600, baseType: !957, size: 64, align: 64, offset: 1856)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1400, file: !47, line: 3609, baseType: !1530, size: 64, align: 64, offset: 1920)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1533)
!1533 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1392, file: !47, line: 1566, baseType: !77, size: 32, align: 32, offset: 192)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1392, file: !47, line: 1581, baseType: !1297, size: 32, align: 32, offset: 224)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1392, file: !47, line: 1583, baseType: !964, size: 64, align: 64, offset: 256)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1392, file: !47, line: 1591, baseType: !1538, size: 64, align: 64, offset: 320)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1392, file: !47, line: 1598, baseType: !964, size: 64, align: 64, offset: 384)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1392, file: !47, line: 1606, baseType: !978, size: 64, align: 64, offset: 448)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1392, file: !47, line: 1614, baseType: !945, size: 32, align: 32, offset: 512)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1392, file: !47, line: 1622, baseType: !945, size: 32, align: 32, offset: 544)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1392, file: !47, line: 1628, baseType: !945, size: 32, align: 32, offset: 576)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1392, file: !47, line: 1636, baseType: !945, size: 32, align: 32, offset: 608)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1392, file: !47, line: 1643, baseType: !945, size: 32, align: 32, offset: 640)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1392, file: !47, line: 1657, baseType: !1093, size: 64, align: 64, offset: 704)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1392, file: !47, line: 1658, baseType: !945, size: 32, align: 32, offset: 768)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1392, file: !47, line: 1679, baseType: !985, size: 64, align: 32, offset: 800)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1392, file: !47, line: 1688, baseType: !945, size: 32, align: 32, offset: 864)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1392, file: !47, line: 1712, baseType: !945, size: 32, align: 32, offset: 896)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1392, file: !47, line: 1729, baseType: !945, size: 32, align: 32, offset: 928)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1392, file: !47, line: 1729, baseType: !945, size: 32, align: 32, offset: 960)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1392, file: !47, line: 1744, baseType: !945, size: 32, align: 32, offset: 992)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1392, file: !47, line: 1744, baseType: !945, size: 32, align: 32, offset: 1024)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1392, file: !47, line: 1751, baseType: !945, size: 32, align: 32, offset: 1056)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1392, file: !47, line: 1766, baseType: !553, size: 32, align: 32, offset: 1088)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1392, file: !47, line: 1791, baseType: !1559, size: 64, align: 64, offset: 1152)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{null, !1562, !1503, !1505, !945, !945, !945}
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1392, file: !47, line: 1808, baseType: !1564, size: 64, align: 64, offset: 1216)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!553, !1562, !1411}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1392, file: !47, line: 1816, baseType: !945, size: 32, align: 32, offset: 1280)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1392, file: !47, line: 1825, baseType: !1569, size: 32, align: 32, offset: 1312)
!1569 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1392, file: !47, line: 1830, baseType: !945, size: 32, align: 32, offset: 1344)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1392, file: !47, line: 1838, baseType: !1569, size: 32, align: 32, offset: 1376)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1392, file: !47, line: 1846, baseType: !945, size: 32, align: 32, offset: 1408)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1392, file: !47, line: 1851, baseType: !945, size: 32, align: 32, offset: 1440)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1392, file: !47, line: 1861, baseType: !1569, size: 32, align: 32, offset: 1472)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1392, file: !47, line: 1868, baseType: !1569, size: 32, align: 32, offset: 1504)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1392, file: !47, line: 1875, baseType: !1569, size: 32, align: 32, offset: 1536)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1392, file: !47, line: 1882, baseType: !1569, size: 32, align: 32, offset: 1568)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1392, file: !47, line: 1889, baseType: !1569, size: 32, align: 32, offset: 1600)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1392, file: !47, line: 1896, baseType: !1569, size: 32, align: 32, offset: 1632)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1392, file: !47, line: 1903, baseType: !1569, size: 32, align: 32, offset: 1664)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1392, file: !47, line: 1910, baseType: !945, size: 32, align: 32, offset: 1696)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1392, file: !47, line: 1915, baseType: !945, size: 32, align: 32, offset: 1728)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1392, file: !47, line: 1926, baseType: !1505, size: 64, align: 64, offset: 1792)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1392, file: !47, line: 1935, baseType: !985, size: 64, align: 32, offset: 1856)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1392, file: !47, line: 1942, baseType: !945, size: 32, align: 32, offset: 1920)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1392, file: !47, line: 1948, baseType: !945, size: 32, align: 32, offset: 1952)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1392, file: !47, line: 1954, baseType: !945, size: 32, align: 32, offset: 1984)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1392, file: !47, line: 1960, baseType: !945, size: 32, align: 32, offset: 2016)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1392, file: !47, line: 1984, baseType: !945, size: 32, align: 32, offset: 2048)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1392, file: !47, line: 1991, baseType: !945, size: 32, align: 32, offset: 2080)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1392, file: !47, line: 1996, baseType: !945, size: 32, align: 32, offset: 2112)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1392, file: !47, line: 2004, baseType: !945, size: 32, align: 32, offset: 2144)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1392, file: !47, line: 2011, baseType: !945, size: 32, align: 32, offset: 2176)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1392, file: !47, line: 2018, baseType: !945, size: 32, align: 32, offset: 2208)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1392, file: !47, line: 2027, baseType: !945, size: 32, align: 32, offset: 2240)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1392, file: !47, line: 2034, baseType: !945, size: 32, align: 32, offset: 2272)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1392, file: !47, line: 2044, baseType: !945, size: 32, align: 32, offset: 2304)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1392, file: !47, line: 2054, baseType: !1599, size: 64, align: 64, offset: 2368)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1392, file: !47, line: 2061, baseType: !1599, size: 64, align: 64, offset: 2432)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1392, file: !47, line: 2066, baseType: !945, size: 32, align: 32, offset: 2496)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1392, file: !47, line: 2070, baseType: !945, size: 32, align: 32, offset: 2528)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1392, file: !47, line: 2078, baseType: !945, size: 32, align: 32, offset: 2560)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1392, file: !47, line: 2085, baseType: !945, size: 32, align: 32, offset: 2592)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1392, file: !47, line: 2092, baseType: !945, size: 32, align: 32, offset: 2624)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1392, file: !47, line: 2099, baseType: !945, size: 32, align: 32, offset: 2656)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1392, file: !47, line: 2106, baseType: !945, size: 32, align: 32, offset: 2688)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1392, file: !47, line: 2113, baseType: !945, size: 32, align: 32, offset: 2720)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1392, file: !47, line: 2120, baseType: !945, size: 32, align: 32, offset: 2752)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1392, file: !47, line: 2125, baseType: !945, size: 32, align: 32, offset: 2784)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1392, file: !47, line: 2133, baseType: !945, size: 32, align: 32, offset: 2816)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1392, file: !47, line: 2140, baseType: !945, size: 32, align: 32, offset: 2848)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1392, file: !47, line: 2145, baseType: !945, size: 32, align: 32, offset: 2880)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1392, file: !47, line: 2153, baseType: !945, size: 32, align: 32, offset: 2912)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1392, file: !47, line: 2158, baseType: !945, size: 32, align: 32, offset: 2944)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1392, file: !47, line: 2166, baseType: !794, size: 32, align: 32, offset: 2976)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1392, file: !47, line: 2173, baseType: !812, size: 32, align: 32, offset: 3008)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1392, file: !47, line: 2180, baseType: !836, size: 32, align: 32, offset: 3040)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1392, file: !47, line: 2187, baseType: !788, size: 32, align: 32, offset: 3072)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1392, file: !47, line: 2194, baseType: !855, size: 32, align: 32, offset: 3104)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1392, file: !47, line: 2203, baseType: !945, size: 32, align: 32, offset: 3136)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1392, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1392, file: !47, line: 2212, baseType: !945, size: 32, align: 32, offset: 3200)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1392, file: !47, line: 2213, baseType: !945, size: 32, align: 32, offset: 3232)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1392, file: !47, line: 2220, baseType: !536, size: 32, align: 32, offset: 3264)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1392, file: !47, line: 2232, baseType: !945, size: 32, align: 32, offset: 3296)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1392, file: !47, line: 2243, baseType: !945, size: 32, align: 32, offset: 3328)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1392, file: !47, line: 2249, baseType: !945, size: 32, align: 32, offset: 3360)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1392, file: !47, line: 2256, baseType: !945, size: 32, align: 32, offset: 3392)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1392, file: !47, line: 2263, baseType: !1241, size: 64, align: 64, offset: 3456)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1392, file: !47, line: 2270, baseType: !1241, size: 64, align: 64, offset: 3520)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1392, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1392, file: !47, line: 2285, baseType: !536, size: 32, align: 32, offset: 3616)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1392, file: !47, line: 2367, baseType: !1635, size: 64, align: 64, offset: 3648)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!945, !1562, !1213, !945}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1392, file: !47, line: 2383, baseType: !945, size: 32, align: 32, offset: 3712)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1392, file: !47, line: 2386, baseType: !1569, size: 32, align: 32, offset: 3744)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1392, file: !47, line: 2387, baseType: !1569, size: 32, align: 32, offset: 3776)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1392, file: !47, line: 2394, baseType: !945, size: 32, align: 32, offset: 3808)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1392, file: !47, line: 2401, baseType: !945, size: 32, align: 32, offset: 3840)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1392, file: !47, line: 2408, baseType: !945, size: 32, align: 32, offset: 3872)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1392, file: !47, line: 2415, baseType: !945, size: 32, align: 32, offset: 3904)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1392, file: !47, line: 2422, baseType: !945, size: 32, align: 32, offset: 3936)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1392, file: !47, line: 2423, baseType: !1647, size: 64, align: 64, offset: 3968)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1650)
!1650 = !{!1651, !1652, !1653, !1654}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1649, file: !47, line: 827, baseType: !945, size: 32, align: 32)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1649, file: !47, line: 828, baseType: !945, size: 32, align: 32, offset: 32)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1649, file: !47, line: 829, baseType: !945, size: 32, align: 32, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1649, file: !47, line: 830, baseType: !1569, size: 32, align: 32, offset: 96)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1392, file: !47, line: 2430, baseType: !978, size: 64, align: 64, offset: 4032)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1392, file: !47, line: 2437, baseType: !978, size: 64, align: 64, offset: 4096)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1392, file: !47, line: 2444, baseType: !1569, size: 32, align: 32, offset: 4160)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1392, file: !47, line: 2451, baseType: !1569, size: 32, align: 32, offset: 4192)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1392, file: !47, line: 2458, baseType: !945, size: 32, align: 32, offset: 4224)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1392, file: !47, line: 2469, baseType: !945, size: 32, align: 32, offset: 4256)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1392, file: !47, line: 2475, baseType: !945, size: 32, align: 32, offset: 4288)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1392, file: !47, line: 2481, baseType: !945, size: 32, align: 32, offset: 4320)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1392, file: !47, line: 2485, baseType: !945, size: 32, align: 32, offset: 4352)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1392, file: !47, line: 2489, baseType: !945, size: 32, align: 32, offset: 4384)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1392, file: !47, line: 2493, baseType: !945, size: 32, align: 32, offset: 4416)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1392, file: !47, line: 2501, baseType: !945, size: 32, align: 32, offset: 4448)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1392, file: !47, line: 2506, baseType: !945, size: 32, align: 32, offset: 4480)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1392, file: !47, line: 2510, baseType: !945, size: 32, align: 32, offset: 4512)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1392, file: !47, line: 2514, baseType: !978, size: 64, align: 64, offset: 4544)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1392, file: !47, line: 2528, baseType: !1671, size: 64, align: 64, offset: 4608)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{null, !1562, !964, !945, !945}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1392, file: !47, line: 2534, baseType: !945, size: 32, align: 32, offset: 4672)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1392, file: !47, line: 2545, baseType: !945, size: 32, align: 32, offset: 4704)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1392, file: !47, line: 2547, baseType: !945, size: 32, align: 32, offset: 4736)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1392, file: !47, line: 2549, baseType: !945, size: 32, align: 32, offset: 4768)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1392, file: !47, line: 2551, baseType: !945, size: 32, align: 32, offset: 4800)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1392, file: !47, line: 2553, baseType: !945, size: 32, align: 32, offset: 4832)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1392, file: !47, line: 2555, baseType: !945, size: 32, align: 32, offset: 4864)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1392, file: !47, line: 2557, baseType: !945, size: 32, align: 32, offset: 4896)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1392, file: !47, line: 2559, baseType: !945, size: 32, align: 32, offset: 4928)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1392, file: !47, line: 2563, baseType: !945, size: 32, align: 32, offset: 4960)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1392, file: !47, line: 2571, baseType: !1145, size: 64, align: 64, offset: 4992)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1392, file: !47, line: 2579, baseType: !1145, size: 64, align: 64, offset: 5056)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1392, file: !47, line: 2586, baseType: !945, size: 32, align: 32, offset: 5120)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1392, file: !47, line: 2615, baseType: !945, size: 32, align: 32, offset: 5152)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1392, file: !47, line: 2627, baseType: !945, size: 32, align: 32, offset: 5184)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1392, file: !47, line: 2637, baseType: !945, size: 32, align: 32, offset: 5216)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1392, file: !47, line: 2681, baseType: !945, size: 32, align: 32, offset: 5248)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1392, file: !47, line: 2709, baseType: !978, size: 64, align: 64, offset: 5312)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1392, file: !47, line: 2716, baseType: !1693, size: 64, align: 64, offset: 5376)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1695)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1696)
!1696 = !{!1697, !1698, !1699, !1700, !1701, !1702, !1703, !1707, !1711, !1712, !1713, !1714, !1720, !1721, !1722, !1723, !1724}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1695, file: !47, line: 3642, baseType: !957, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1695, file: !47, line: 3649, baseType: !874, size: 32, align: 32, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1695, file: !47, line: 3656, baseType: !77, size: 32, align: 32, offset: 96)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1695, file: !47, line: 3663, baseType: !553, size: 32, align: 32, offset: 128)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1695, file: !47, line: 3669, baseType: !945, size: 32, align: 32, offset: 160)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1695, file: !47, line: 3682, baseType: !1520, size: 64, align: 64, offset: 192)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1695, file: !47, line: 3698, baseType: !1704, size: 64, align: 64, offset: 256)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!945, !1390, !1344, !1468}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1695, file: !47, line: 3712, baseType: !1708, size: 64, align: 64, offset: 320)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DISubroutineType(types: !1710)
!1710 = !{!945, !1390, !945, !1344, !1468}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1695, file: !47, line: 3726, baseType: !1704, size: 64, align: 64, offset: 384)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1695, file: !47, line: 3737, baseType: !1437, size: 64, align: 64, offset: 448)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1695, file: !47, line: 3746, baseType: !945, size: 32, align: 32, offset: 512)
