; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--lavfi.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a/[inter]libavdevice--lavfi.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !940, file: !939, line: 503, size: 32, align: 32, elements: !1285)
!939 = !DIFile(filename: "./libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !939, line: 439, size: 493504, align: 64, elements: !941)
!941 = !{!942, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1168, !1169, !1170, !1171, !1175, !1176, !1177, !1178, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !940, file: !939, line: 440, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !939, line: 67, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !939, line: 338, size: 1344, align: 64, elements: !946)
!946 = !{!947, !1034, !1083, !1084, !1086, !1090, !1092, !1093, !1094, !1095, !1096, !1127, !1128, !1132, !1135, !1136, !1137, !1139, !1140, !1155, !1156, !1157}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !945, file: !939, line: 339, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !952)
!952 = !{!953, !957, !962, !993, !994, !995, !996, !1000, !1006, !1008, !1012}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !951, file: !486, line: 72, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !951, file: !486, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!954, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !951, file: !486, line: 85, baseType: !963, size: 64, align: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !966)
!966 = !{!967, !968, !969, !971, !972, !989, !990, !991, !992}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !965, file: !464, line: 247, baseType: !954, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !965, file: !464, line: 253, baseType: !954, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !965, file: !464, line: 259, baseType: !970, size: 32, align: 32, offset: 128)
!970 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !965, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !965, file: !464, line: 271, baseType: !973, size: 64, align: 64, offset: 192)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !965, file: !464, line: 265, size: 64, align: 64, elements: !974)
!974 = !{!975, !979, !981, !982}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !973, file: !464, line: 266, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !977, line: 40, baseType: !978)
!977 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!978 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !973, file: !464, line: 267, baseType: !980, size: 64, align: 64)
!980 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !973, file: !464, line: 268, baseType: !954, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !973, file: !464, line: 270, baseType: !983, size: 64, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !984, line: 61, baseType: !985)
!984 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !984, line: 58, size: 64, align: 32, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !985, file: !984, line: 59, baseType: !970, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !985, file: !984, line: 60, baseType: !970, size: 32, align: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !965, file: !464, line: 272, baseType: !980, size: 64, align: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !965, file: !464, line: 273, baseType: !980, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !965, file: !464, line: 275, baseType: !970, size: 32, align: 32, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !965, file: !464, line: 300, baseType: !954, size: 64, align: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !951, file: !486, line: 93, baseType: !970, size: 32, align: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !951, file: !486, line: 99, baseType: !970, size: 32, align: 32, offset: 224)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !951, file: !486, line: 108, baseType: !970, size: 32, align: 32, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !951, file: !486, line: 113, baseType: !997, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!961, !961, !961}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !951, file: !486, line: 123, baseType: !1001, size: 64, align: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !951, file: !486, line: 130, baseType: !1007, size: 32, align: 32, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !951, file: !486, line: 136, baseType: !1009, size: 64, align: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1007, !961}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !951, file: !486, line: 142, baseType: !1013, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!970, !1016, !961, !954, !970}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1019)
!1019 = !{!1020, !1032, !1033}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1018, file: !464, line: 360, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1024, file: !464, line: 307, baseType: !954, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1024, file: !464, line: 313, baseType: !980, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1024, file: !464, line: 313, baseType: !980, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1024, file: !464, line: 318, baseType: !980, size: 64, align: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1024, file: !464, line: 318, baseType: !980, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1024, file: !464, line: 323, baseType: !970, size: 32, align: 32, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1018, file: !464, line: 364, baseType: !970, size: 32, align: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1018, file: !464, line: 368, baseType: !970, size: 32, align: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !945, file: !939, line: 341, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !939, line: 328, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !939, line: 144, size: 1024, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1047, !1048, !1049, !1050, !1054, !1055, !1064, !1068, !1069, !1070, !1071, !1073, !1078, !1082}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !939, line: 148, baseType: !954, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1038, file: !939, line: 155, baseType: !954, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1038, file: !939, line: 164, baseType: !1043, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !939, line: 69, baseType: !1046)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !939, line: 69, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1038, file: !939, line: 172, baseType: !1043, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1038, file: !939, line: 182, baseType: !948, size: 64, align: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1038, file: !939, line: 187, baseType: !970, size: 32, align: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !1038, file: !939, line: 210, baseType: !1051, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!970, !943}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1038, file: !939, line: 233, baseType: !1051, size: 64, align: 64, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !1038, file: !939, line: 246, baseType: !1056, size: 64, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!970, !943, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1062, line: 86, baseType: !1063)
!1062 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1062, line: 86, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1038, file: !939, line: 258, baseType: !1065, size: 64, align: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{null, !943}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !1038, file: !939, line: 282, baseType: !1051, size: 64, align: 64, offset: 640)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !1038, file: !939, line: 284, baseType: !970, size: 32, align: 32, offset: 704)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !1038, file: !939, line: 286, baseType: !970, size: 32, align: 32, offset: 736)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1038, file: !939, line: 292, baseType: !1072, size: 64, align: 64, offset: 768)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !1038, file: !939, line: 306, baseType: !1074, size: 64, align: 64, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!970, !943, !954, !954, !1077, !970, !970}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !1038, file: !939, line: 313, baseType: !1079, size: 64, align: 64, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!970, !943, !961}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !1038, file: !939, line: 327, baseType: !1051, size: 64, align: 64, offset: 960)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !939, line: 343, baseType: !1077, size: 64, align: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !945, file: !939, line: 345, baseType: !1085, size: 64, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !945, file: !939, line: 346, baseType: !1087, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !939, line: 68, baseType: !940)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !945, file: !939, line: 347, baseType: !1091, size: 32, align: 32, offset: 320)
!1091 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !945, file: !939, line: 349, baseType: !1085, size: 64, align: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !945, file: !939, line: 350, baseType: !1087, size: 64, align: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !945, file: !939, line: 351, baseType: !1091, size: 32, align: 32, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !945, file: !939, line: 353, baseType: !961, size: 64, align: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !945, file: !939, line: 355, baseType: !1097, size: 64, align: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !939, line: 840, size: 768, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1103, !1104, !1105, !1106, !1107, !1108, !1112, !1113, !1123, !1124, !1125, !1126}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1098, file: !939, line: 841, baseType: !948, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1098, file: !939, line: 842, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !1098, file: !939, line: 843, baseType: !1091, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !1098, file: !939, line: 845, baseType: !1077, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !1098, file: !939, line: 847, baseType: !1077, size: 64, align: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1098, file: !939, line: 862, baseType: !970, size: 32, align: 32, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !1098, file: !939, line: 869, baseType: !970, size: 32, align: 32, offset: 352)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1098, file: !939, line: 874, baseType: !1109, size: 64, align: 64, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !939, line: 809, baseType: !1111)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !939, line: 809, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1098, file: !939, line: 881, baseType: !961, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1098, file: !939, line: 895, baseType: !1114, size: 64, align: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !939, line: 837, baseType: !1116)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!970, !943, !1118, !961, !1122, !970}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !939, line: 823, baseType: !1120)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!970, !943, !961, !970, !970}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !1098, file: !939, line: 897, baseType: !1077, size: 64, align: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !1098, file: !939, line: 906, baseType: !1087, size: 64, align: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !1098, file: !939, line: 907, baseType: !970, size: 32, align: 32, offset: 704)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !1098, file: !939, line: 909, baseType: !1091, size: 32, align: 32, offset: 736)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !945, file: !939, line: 373, baseType: !970, size: 32, align: 32, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !945, file: !939, line: 378, baseType: !1129, size: 64, align: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !939, line: 335, baseType: !1131)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !939, line: 335, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !945, file: !939, line: 380, baseType: !1133, size: 64, align: 64, offset: 832)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !939, line: 380, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !945, file: !939, line: 382, baseType: !1077, size: 64, align: 64, offset: 896)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !945, file: !939, line: 383, baseType: !961, size: 64, align: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !945, file: !939, line: 384, baseType: !1138, size: 64, align: 64, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !945, file: !939, line: 385, baseType: !970, size: 32, align: 32, offset: 1088)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !945, file: !939, line: 394, baseType: !1141, size: 64, align: 64, offset: 1152)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1143, line: 94, baseType: !1144)
!1143 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1143, line: 81, size: 192, align: 64, elements: !1145)
!1145 = !{!1146, !1150, !1154}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1144, file: !1143, line: 82, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1143, line: 73, baseType: !1149)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1143, line: 73, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !1143, line: 89, baseType: !1151, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !977, line: 48, baseType: !1153)
!1153 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !1143, line: 93, baseType: !970, size: 32, align: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !945, file: !939, line: 401, baseType: !970, size: 32, align: 32, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !945, file: !939, line: 408, baseType: !1091, size: 32, align: 32, offset: 1248)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !945, file: !939, line: 424, baseType: !970, size: 32, align: 32, offset: 1280)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !940, file: !939, line: 441, baseType: !1085, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !940, file: !939, line: 443, baseType: !943, size: 64, align: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !940, file: !939, line: 444, baseType: !1085, size: 64, align: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !940, file: !939, line: 446, baseType: !874, size: 32, align: 32, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !940, file: !939, line: 449, baseType: !970, size: 32, align: 32, offset: 288)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !940, file: !939, line: 450, baseType: !970, size: 32, align: 32, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !940, file: !939, line: 451, baseType: !983, size: 64, align: 32, offset: 352)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !940, file: !939, line: 453, baseType: !1166, size: 64, align: 64, offset: 448)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !977, line: 55, baseType: !1167)
!1167 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !940, file: !939, line: 454, baseType: !970, size: 32, align: 32, offset: 512)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !940, file: !939, line: 456, baseType: !970, size: 32, align: 32, offset: 544)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !940, file: !939, line: 465, baseType: !983, size: 64, align: 32, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !940, file: !939, line: 481, baseType: !1172, size: 64, align: 64, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !939, line: 70, baseType: !1174)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !939, line: 70, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !940, file: !939, line: 482, baseType: !1172, size: 64, align: 64, offset: 704)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !940, file: !939, line: 488, baseType: !1172, size: 64, align: 64, offset: 768)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !940, file: !939, line: 489, baseType: !1172, size: 64, align: 64, offset: 832)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !940, file: !939, line: 490, baseType: !1179, size: 64, align: 64, offset: 896)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !939, line: 490, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !940, file: !939, line: 491, baseType: !1179, size: 64, align: 64, offset: 960)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !940, file: !939, line: 500, baseType: !970, size: 32, align: 32, offset: 1024)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !940, file: !939, line: 507, baseType: !938, size: 32, align: 32, offset: 1056)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !940, file: !939, line: 512, baseType: !1097, size: 64, align: 64, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !940, file: !939, line: 518, baseType: !976, size: 64, align: 64, offset: 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !940, file: !939, line: 524, baseType: !976, size: 64, align: 64, offset: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !940, file: !939, line: 529, baseType: !970, size: 32, align: 32, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !940, file: !939, line: 542, baseType: !983, size: 64, align: 32, offset: 1312)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !940, file: !939, line: 547, baseType: !1190, size: 64, align: 64, offset: 1408)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1193)
!1193 = !{!1194, !1198, !1200, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1229, !1230, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1259, !1260, !1261, !1262, !1263, !1264, !1267, !1268, !1269, !1270}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !548, line: 282, baseType: !1195, size: 512, align: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 512, align: 64, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 8)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1192, file: !548, line: 299, baseType: !1199, size: 256, align: 32, offset: 512)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 256, align: 32, elements: !1196)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1192, file: !548, line: 315, baseType: !1201, size: 64, align: 64, offset: 768)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1192, file: !548, line: 326, baseType: !970, size: 32, align: 32, offset: 832)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1192, file: !548, line: 326, baseType: !970, size: 32, align: 32, offset: 864)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1192, file: !548, line: 334, baseType: !970, size: 32, align: 32, offset: 896)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1192, file: !548, line: 341, baseType: !970, size: 32, align: 32, offset: 928)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1192, file: !548, line: 346, baseType: !970, size: 32, align: 32, offset: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1192, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1192, file: !548, line: 356, baseType: !983, size: 64, align: 32, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1192, file: !548, line: 361, baseType: !976, size: 64, align: 64, offset: 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1192, file: !548, line: 369, baseType: !976, size: 64, align: 64, offset: 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1192, file: !548, line: 377, baseType: !976, size: 64, align: 64, offset: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1192, file: !548, line: 382, baseType: !970, size: 32, align: 32, offset: 1280)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1192, file: !548, line: 386, baseType: !970, size: 32, align: 32, offset: 1312)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1192, file: !548, line: 391, baseType: !970, size: 32, align: 32, offset: 1344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1192, file: !548, line: 396, baseType: !961, size: 64, align: 64, offset: 1408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1192, file: !548, line: 403, baseType: !1217, size: 512, align: 64, offset: 1472)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1166, size: 512, align: 64, elements: !1196)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1192, file: !548, line: 410, baseType: !970, size: 32, align: 32, offset: 1984)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1192, file: !548, line: 415, baseType: !970, size: 32, align: 32, offset: 2016)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1192, file: !548, line: 420, baseType: !970, size: 32, align: 32, offset: 2048)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1192, file: !548, line: 425, baseType: !970, size: 32, align: 32, offset: 2080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1192, file: !548, line: 435, baseType: !976, size: 64, align: 64, offset: 2112)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1192, file: !548, line: 440, baseType: !970, size: 32, align: 32, offset: 2176)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1192, file: !548, line: 445, baseType: !1166, size: 64, align: 64, offset: 2240)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1192, file: !548, line: 459, baseType: !1226, size: 512, align: 64, offset: 2304)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 512, align: 64, elements: !1196)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1192, file: !548, line: 473, baseType: !1228, size: 64, align: 64, offset: 2816)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1192, file: !548, line: 477, baseType: !970, size: 32, align: 32, offset: 2880)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1192, file: !548, line: 479, baseType: !1231, size: 64, align: 64, offset: 2944)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1240}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !548, line: 203, baseType: !1151, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !548, line: 204, baseType: !970, size: 32, align: 32, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1234, file: !548, line: 205, baseType: !1060, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !548, line: 206, baseType: !1141, size: 64, align: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1192, file: !548, line: 480, baseType: !970, size: 32, align: 32, offset: 3008)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1192, file: !548, line: 505, baseType: !970, size: 32, align: 32, offset: 3040)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1192, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1192, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1192, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1192, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1192, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1192, file: !548, line: 532, baseType: !976, size: 64, align: 64, offset: 3264)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1192, file: !548, line: 539, baseType: !976, size: 64, align: 64, offset: 3328)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1192, file: !548, line: 547, baseType: !976, size: 64, align: 64, offset: 3392)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1192, file: !548, line: 554, baseType: !1060, size: 64, align: 64, offset: 3456)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1192, file: !548, line: 563, baseType: !970, size: 32, align: 32, offset: 3520)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1192, file: !548, line: 572, baseType: !970, size: 32, align: 32, offset: 3552)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1192, file: !548, line: 581, baseType: !970, size: 32, align: 32, offset: 3584)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1192, file: !548, line: 588, baseType: !1256, size: 64, align: 64, offset: 3648)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !977, line: 36, baseType: !1258)
!1258 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1192, file: !548, line: 593, baseType: !970, size: 32, align: 32, offset: 3712)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1192, file: !548, line: 596, baseType: !970, size: 32, align: 32, offset: 3744)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1192, file: !548, line: 599, baseType: !1141, size: 64, align: 64, offset: 3776)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1192, file: !548, line: 605, baseType: !1141, size: 64, align: 64, offset: 3840)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1192, file: !548, line: 616, baseType: !1141, size: 64, align: 64, offset: 3904)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1192, file: !548, line: 626, baseType: !1265, size: 64, align: 64, offset: 3968)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1266, line: 216, baseType: !1167)
!1266 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1192, file: !548, line: 627, baseType: !1265, size: 64, align: 64, offset: 4032)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1192, file: !548, line: 628, baseType: !1265, size: 64, align: 64, offset: 4096)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1192, file: !548, line: 629, baseType: !1265, size: 64, align: 64, offset: 4160)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1192, file: !548, line: 645, baseType: !1141, size: 64, align: 64, offset: 4224)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !940, file: !939, line: 553, baseType: !970, size: 32, align: 32, offset: 1472)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !940, file: !939, line: 562, baseType: !970, size: 32, align: 32, offset: 1504)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !940, file: !939, line: 568, baseType: !970, size: 32, align: 32, offset: 1536)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !940, file: !939, line: 573, baseType: !970, size: 32, align: 32, offset: 1568)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !939, line: 578, baseType: !1091, size: 32, align: 32, offset: 1600)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !940, file: !939, line: 583, baseType: !976, size: 64, align: 64, offset: 1664)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !940, file: !939, line: 583, baseType: !976, size: 64, align: 64, offset: 1728)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !940, file: !939, line: 588, baseType: !961, size: 64, align: 64, offset: 1792)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !940, file: !939, line: 595, baseType: !970, size: 32, align: 32, offset: 1856)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !940, file: !939, line: 601, baseType: !1141, size: 64, align: 64, offset: 1920)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !940, file: !939, line: 610, baseType: !1282, size: 491520, align: 8, offset: 1984)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 491520, align: 8, elements: !1283)
!1283 = !{!1284}
!1284 = !DISubrange(count: 61440)
!1285 = !{!1286, !1287, !1288}
!1286 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!1287 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!1288 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!1289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !1290, line: 79, size: 32, align: 32, elements: !1291)
!1290 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1291 = !{!1292, !1293, !1294, !1295, !1296, !1297}
!1292 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!1293 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!1294 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!1295 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!1296 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!1297 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!1298 = !{!1091, !970, !961, !1299, !980, !1301}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1302 = !{!1303, !2387, !2388}
!1303 = distinct !DIGlobalVariable(name: "ff_lavfi_demuxer", scope: !0, file: !1304, line: 504, type: !1305, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_lavfi_demuxer)
!1304 = !DIFile(filename: "libavdevice/lavfi.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !1312, !1322, !1323, !1324, !1326, !1327, !1328, !1341, !2368, !2369, !2370, !2374, !2378, !2379, !2380, !2384, !2385, !2386}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1306, file: !919, line: 638, baseType: !954, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1306, file: !919, line: 645, baseType: !954, size: 64, align: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1306, file: !919, line: 652, baseType: !970, size: 32, align: 32, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1306, file: !919, line: 659, baseType: !954, size: 64, align: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1306, file: !919, line: 661, baseType: !1313, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1315)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1318, line: 44, size: 64, align: 32, elements: !1319)
!1318 = !DIFile(filename: "./libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1319 = !{!1320, !1321}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1317, file: !1318, line: 45, baseType: !3, size: 32, align: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1317, file: !1318, line: 46, baseType: !1091, size: 32, align: 32, offset: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1306, file: !919, line: 663, baseType: !948, size: 64, align: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1306, file: !919, line: 670, baseType: !954, size: 64, align: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1306, file: !919, line: 679, baseType: !1325, size: 64, align: 64, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1306, file: !919, line: 684, baseType: !970, size: 32, align: 32, offset: 512)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1306, file: !919, line: 689, baseType: !970, size: 32, align: 32, offset: 544)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1306, file: !919, line: 696, baseType: !1329, size: 64, align: 64, offset: 576)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!970, !1332}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1339, !1340}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1334, file: !919, line: 449, baseType: !954, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1334, file: !919, line: 450, baseType: !1338, size: 64, align: 64, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1334, file: !919, line: 451, baseType: !970, size: 32, align: 32, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1334, file: !919, line: 452, baseType: !954, size: 64, align: 64, offset: 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1306, file: !919, line: 703, baseType: !1342, size: 64, align: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!970, !1345}
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1470, !1471, !1534, !1535, !1536, !2226, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2280, !2281, !2282, !2283, !2284, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2335, !2336, !2339, !2340, !2341, !2342, !2343, !2344, !2346, !2347, !2348, !2349, !2356, !2357, !2361, !2365, !2366, !2367}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1346, file: !919, line: 1342, baseType: !948, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1346, file: !919, line: 1349, baseType: !1325, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1346, file: !919, line: 1356, baseType: !1351, size: 64, align: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1394, !1395, !1399, !1403, !1408, !1412, !1417, !1435, !1457, !1458, !1459, !1460, !1464}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1352, file: !919, line: 498, baseType: !954, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1352, file: !919, line: 504, baseType: !954, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1352, file: !919, line: 505, baseType: !954, size: 64, align: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1352, file: !919, line: 506, baseType: !954, size: 64, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1352, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1352, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1352, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1352, file: !919, line: 517, baseType: !970, size: 32, align: 32, offset: 352)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1352, file: !919, line: 523, baseType: !1313, size: 64, align: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1352, file: !919, line: 526, baseType: !948, size: 64, align: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1352, file: !919, line: 535, baseType: !1351, size: 64, align: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1352, file: !919, line: 539, baseType: !970, size: 32, align: 32, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1352, file: !919, line: 541, baseType: !1342, size: 64, align: 64, offset: 640)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1352, file: !919, line: 549, baseType: !1368, size: 64, align: 64, offset: 704)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!970, !1345, !1371}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1390, !1391, !1392, !1393}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1373, file: !4, line: 1451, baseType: !1141, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1373, file: !4, line: 1461, baseType: !976, size: 64, align: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1373, file: !4, line: 1467, baseType: !976, size: 64, align: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1373, file: !4, line: 1468, baseType: !1151, size: 64, align: 64, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1373, file: !4, line: 1469, baseType: !970, size: 32, align: 32, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1373, file: !4, line: 1470, baseType: !970, size: 32, align: 32, offset: 288)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1373, file: !4, line: 1474, baseType: !970, size: 32, align: 32, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1373, file: !4, line: 1479, baseType: !1383, size: 64, align: 64, offset: 384)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1386)
!1386 = !{!1387, !1388, !1389}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1385, file: !4, line: 1412, baseType: !1151, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1385, file: !4, line: 1413, baseType: !970, size: 32, align: 32, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1385, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1373, file: !4, line: 1480, baseType: !970, size: 32, align: 32, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1373, file: !4, line: 1486, baseType: !976, size: 64, align: 64, offset: 512)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1373, file: !4, line: 1488, baseType: !976, size: 64, align: 64, offset: 576)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1373, file: !4, line: 1497, baseType: !976, size: 64, align: 64, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1352, file: !919, line: 550, baseType: !1342, size: 64, align: 64, offset: 768)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1352, file: !919, line: 554, baseType: !1396, size: 64, align: 64, offset: 832)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!970, !1345, !1371, !1371, !970}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1352, file: !919, line: 563, baseType: !1400, size: 64, align: 64, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!970, !3, !970}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1352, file: !919, line: 565, baseType: !1404, size: 64, align: 64, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !1345, !970, !1407, !1407}
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1352, file: !919, line: 570, baseType: !1409, size: 64, align: 64, offset: 1024)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!970, !1345, !970, !961, !1265}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1352, file: !919, line: 581, baseType: !1413, size: 64, align: 64, offset: 1088)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!970, !1345, !970, !1416, !1091}
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1352, file: !919, line: 587, baseType: !1418, size: 64, align: 64, offset: 1152)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!970, !1345, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !1423, line: 460, size: 128, align: 64, elements: !1424)
!1423 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[lib]libavdevice--libavdevice.a")
!1424 = !{!1425, !1433, !1434}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1422, file: !1423, line: 461, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !1423, line: 455, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !1423, line: 452, size: 128, align: 64, elements: !1430)
!1430 = !{!1431, !1432}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1429, file: !1423, line: 453, baseType: !1077, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1429, file: !1423, line: 454, baseType: !1077, size: 64, align: 64, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1422, file: !1423, line: 462, baseType: !970, size: 32, align: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1422, file: !1423, line: 463, baseType: !970, size: 32, align: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1352, file: !919, line: 592, baseType: !1436, size: 64, align: 64, offset: 1216)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!970, !1345, !1439}
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !1423, line: 400, size: 576, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1440, file: !1423, line: 401, baseType: !948, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1440, file: !1423, line: 402, baseType: !1444, size: 64, align: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1346)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1440, file: !1423, line: 403, baseType: !3, size: 32, align: 32, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1440, file: !1423, line: 404, baseType: !649, size: 32, align: 32, offset: 160)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1440, file: !1423, line: 405, baseType: !666, size: 32, align: 32, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1440, file: !1423, line: 406, baseType: !970, size: 32, align: 32, offset: 224)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1440, file: !1423, line: 407, baseType: !970, size: 32, align: 32, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1440, file: !1423, line: 408, baseType: !976, size: 64, align: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1440, file: !1423, line: 409, baseType: !970, size: 32, align: 32, offset: 384)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1440, file: !1423, line: 410, baseType: !970, size: 32, align: 32, offset: 416)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1440, file: !1423, line: 411, baseType: !970, size: 32, align: 32, offset: 448)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1440, file: !1423, line: 412, baseType: !970, size: 32, align: 32, offset: 480)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1440, file: !1423, line: 413, baseType: !983, size: 64, align: 32, offset: 512)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1352, file: !919, line: 597, baseType: !1436, size: 64, align: 64, offset: 1280)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1352, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1352, file: !919, line: 608, baseType: !1342, size: 64, align: 64, offset: 1408)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1352, file: !919, line: 617, baseType: !1461, size: 64, align: 64, offset: 1472)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !1345}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1352, file: !919, line: 623, baseType: !1465, size: 64, align: 64, offset: 1536)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!970, !1345, !1468}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1372)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1346, file: !919, line: 1365, baseType: !961, size: 64, align: 64, offset: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1346, file: !919, line: 1379, baseType: !1472, size: 64, align: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !866, line: 352, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !866, line: 161, size: 2112, align: 64, elements: !1475)
!1475 = !{!1476, !1477, !1478, !1479, !1480, !1481, !1482, !1486, !1487, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1501, !1502, !1506, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1524, !1525, !1526, !1527, !1531, !1532, !1533}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1474, file: !866, line: 174, baseType: !948, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1474, file: !866, line: 226, baseType: !1338, size: 64, align: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1474, file: !866, line: 227, baseType: !970, size: 32, align: 32, offset: 128)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1474, file: !866, line: 228, baseType: !1338, size: 64, align: 64, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1474, file: !866, line: 229, baseType: !1338, size: 64, align: 64, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1474, file: !866, line: 233, baseType: !961, size: 64, align: 64, offset: 320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1474, file: !866, line: 235, baseType: !1483, size: 64, align: 64, offset: 384)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!970, !961, !1151, !970}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1474, file: !866, line: 236, baseType: !1483, size: 64, align: 64, offset: 448)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1474, file: !866, line: 237, baseType: !1488, size: 64, align: 64, offset: 512)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!976, !961, !976, !970}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1474, file: !866, line: 238, baseType: !976, size: 64, align: 64, offset: 576)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1474, file: !866, line: 239, baseType: !970, size: 32, align: 32, offset: 640)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1474, file: !866, line: 240, baseType: !970, size: 32, align: 32, offset: 672)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1474, file: !866, line: 241, baseType: !970, size: 32, align: 32, offset: 704)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1474, file: !866, line: 242, baseType: !1167, size: 64, align: 64, offset: 768)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1474, file: !866, line: 243, baseType: !1338, size: 64, align: 64, offset: 832)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1474, file: !866, line: 244, baseType: !1498, size: 64, align: 64, offset: 896)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!1167, !1167, !1299, !1091}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1474, file: !866, line: 245, baseType: !970, size: 32, align: 32, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1474, file: !866, line: 249, baseType: !1503, size: 64, align: 64, offset: 1024)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!970, !961, !970}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1474, file: !866, line: 255, baseType: !1507, size: 64, align: 64, offset: 1088)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!976, !961, !970, !976, !970}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1474, file: !866, line: 260, baseType: !970, size: 32, align: 32, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1474, file: !866, line: 266, baseType: !976, size: 64, align: 64, offset: 1216)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1474, file: !866, line: 273, baseType: !970, size: 32, align: 32, offset: 1280)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1474, file: !866, line: 279, baseType: !976, size: 64, align: 64, offset: 1344)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1474, file: !866, line: 285, baseType: !970, size: 32, align: 32, offset: 1408)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1474, file: !866, line: 291, baseType: !970, size: 32, align: 32, offset: 1440)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1474, file: !866, line: 298, baseType: !970, size: 32, align: 32, offset: 1472)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1474, file: !866, line: 304, baseType: !970, size: 32, align: 32, offset: 1504)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1474, file: !866, line: 309, baseType: !954, size: 64, align: 64, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1474, file: !866, line: 314, baseType: !954, size: 64, align: 64, offset: 1600)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1474, file: !866, line: 319, baseType: !1521, size: 64, align: 64, offset: 1664)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!970, !961, !1151, !970, !865, !976}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1474, file: !866, line: 326, baseType: !970, size: 32, align: 32, offset: 1728)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1474, file: !866, line: 331, baseType: !865, size: 32, align: 32, offset: 1760)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1474, file: !866, line: 332, baseType: !976, size: 64, align: 64, offset: 1792)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1474, file: !866, line: 338, baseType: !1528, size: 64, align: 64, offset: 1856)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!970, !961}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1474, file: !866, line: 340, baseType: !976, size: 64, align: 64, offset: 1920)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1474, file: !866, line: 346, baseType: !1338, size: 64, align: 64, offset: 1984)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1474, file: !866, line: 351, baseType: !970, size: 32, align: 32, offset: 2048)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1346, file: !919, line: 1386, baseType: !970, size: 32, align: 32, offset: 320)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1346, file: !919, line: 1393, baseType: !1091, size: 32, align: 32, offset: 352)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1346, file: !919, line: 1405, baseType: !1537, size: 64, align: 64, offset: 384)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !2013, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2112, !2118, !2119, !2123, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2155, !2156, !2157, !2158, !2159, !2160}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1540, file: !919, line: 866, baseType: !970, size: 32, align: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1540, file: !919, line: 872, baseType: !970, size: 32, align: 32, offset: 32)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1540, file: !919, line: 878, baseType: !1545, size: 64, align: 64, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1547)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1552, !1688, !1689, !1690, !1691, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1717, !1721, !1722, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1901, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1547, file: !4, line: 1561, baseType: !948, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1547, file: !4, line: 1562, baseType: !970, size: 32, align: 32, offset: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1547, file: !4, line: 1564, baseType: !874, size: 32, align: 32, offset: 96)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1547, file: !4, line: 1565, baseType: !1553, size: 64, align: 64, offset: 128)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1555)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1556)
!1556 = !{!1557, !1558, !1559, !1560, !1561, !1562, !1565, !1568, !1571, !1574, !1577, !1578, !1579, !1587, !1588, !1589, !1591, !1595, !1601, !1606, !1610, !1611, !1654, !1660, !1664, !1665, !1669, !1673, !1677, !1681, !1682, !1683}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1555, file: !4, line: 3475, baseType: !954, size: 64, align: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1555, file: !4, line: 3480, baseType: !954, size: 64, align: 64, offset: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1555, file: !4, line: 3481, baseType: !874, size: 32, align: 32, offset: 128)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1555, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1555, file: !4, line: 3487, baseType: !970, size: 32, align: 32, offset: 192)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1555, file: !4, line: 3488, baseType: !1563, size: 64, align: 64, offset: 256)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1555, file: !4, line: 3489, baseType: !1566, size: 64, align: 64, offset: 320)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1555, file: !4, line: 3490, baseType: !1569, size: 64, align: 64, offset: 384)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1555, file: !4, line: 3491, baseType: !1572, size: 64, align: 64, offset: 448)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1555, file: !4, line: 3492, baseType: !1575, size: 64, align: 64, offset: 512)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1555, file: !4, line: 3493, baseType: !1152, size: 8, align: 8, offset: 576)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1555, file: !4, line: 3494, baseType: !948, size: 64, align: 64, offset: 640)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1555, file: !4, line: 3495, baseType: !1580, size: 64, align: 64, offset: 704)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1582)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1584)
!1584 = !{!1585, !1586}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1583, file: !4, line: 3402, baseType: !970, size: 32, align: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1583, file: !4, line: 3403, baseType: !954, size: 64, align: 64, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1555, file: !4, line: 3507, baseType: !954, size: 64, align: 64, offset: 768)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1555, file: !4, line: 3516, baseType: !970, size: 32, align: 32, offset: 832)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1555, file: !4, line: 3517, baseType: !1590, size: 64, align: 64, offset: 896)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1555, file: !4, line: 3527, baseType: !1592, size: 64, align: 64, offset: 960)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!970, !1545}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1555, file: !4, line: 3535, baseType: !1596, size: 64, align: 64, offset: 1024)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!970, !1545, !1599}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1546)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1555, file: !4, line: 3541, baseType: !1602, size: 64, align: 64, offset: 1088)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1604)
!1604 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1605)
!1605 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1555, file: !4, line: 3549, baseType: !1607, size: 64, align: 64, offset: 1152)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{null, !1590}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1555, file: !4, line: 3551, baseType: !1592, size: 64, align: 64, offset: 1216)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1555, file: !4, line: 3552, baseType: !1612, size: 64, align: 64, offset: 1280)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!970, !1545, !1151, !970, !1615}
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1618)
!1618 = !{!1619, !1622, !1624, !1625, !1626, !1653}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1617, file: !4, line: 3921, baseType: !1620, size: 16, align: 16)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !977, line: 49, baseType: !1621)
!1621 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1617, file: !4, line: 3922, baseType: !1623, size: 32, align: 32, offset: 32)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !977, line: 51, baseType: !1091)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1617, file: !4, line: 3923, baseType: !1623, size: 32, align: 32, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1617, file: !4, line: 3924, baseType: !1091, size: 32, align: 32, offset: 96)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1617, file: !4, line: 3925, baseType: !1627, size: 64, align: 64, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635, !1636, !1637, !1643, !1647, !1649, !1650, !1651, !1652}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1630, file: !4, line: 3886, baseType: !970, size: 32, align: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1630, file: !4, line: 3887, baseType: !970, size: 32, align: 32, offset: 32)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1630, file: !4, line: 3888, baseType: !970, size: 32, align: 32, offset: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1630, file: !4, line: 3889, baseType: !970, size: 32, align: 32, offset: 96)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1630, file: !4, line: 3890, baseType: !970, size: 32, align: 32, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1630, file: !4, line: 3897, baseType: !1638, size: 768, align: 64, offset: 192)
!1638 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1639)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1640)
!1640 = !{!1641, !1642}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1639, file: !4, line: 3855, baseType: !1195, size: 512, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1639, file: !4, line: 3857, baseType: !1199, size: 256, align: 32, offset: 512)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1630, file: !4, line: 3903, baseType: !1644, size: 256, align: 64, offset: 960)
!1644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 256, align: 64, elements: !1645)
!1645 = !{!1646}
!1646 = !DISubrange(count: 4)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1630, file: !4, line: 3904, baseType: !1648, size: 128, align: 32, offset: 1216)
!1648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 128, align: 32, elements: !1645)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1630, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1630, file: !4, line: 3908, baseType: !1077, size: 64, align: 64, offset: 1408)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1630, file: !4, line: 3915, baseType: !1077, size: 64, align: 64, offset: 1472)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1630, file: !4, line: 3917, baseType: !970, size: 32, align: 32, offset: 1536)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1617, file: !4, line: 3926, baseType: !976, size: 64, align: 64, offset: 192)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1555, file: !4, line: 3564, baseType: !1655, size: 64, align: 64, offset: 1344)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{!970, !1545, !1371, !1658, !1122}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1191)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1555, file: !4, line: 3566, baseType: !1661, size: 64, align: 64, offset: 1408)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!970, !1545, !961, !1122, !1371}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1555, file: !4, line: 3567, baseType: !1592, size: 64, align: 64, offset: 1472)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1555, file: !4, line: 3576, baseType: !1666, size: 64, align: 64, offset: 1536)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!970, !1545, !1658}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1555, file: !4, line: 3577, baseType: !1670, size: 64, align: 64, offset: 1600)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!970, !1545, !1371}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1555, file: !4, line: 3584, baseType: !1674, size: 64, align: 64, offset: 1664)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!970, !1545, !1190}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1555, file: !4, line: 3589, baseType: !1678, size: 64, align: 64, offset: 1728)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1545}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1555, file: !4, line: 3594, baseType: !970, size: 32, align: 32, offset: 1792)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1555, file: !4, line: 3600, baseType: !954, size: 64, align: 64, offset: 1856)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1555, file: !4, line: 3609, baseType: !1684, size: 64, align: 64, offset: 1920)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1687)
!1687 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1547, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1547, file: !4, line: 1581, baseType: !1091, size: 32, align: 32, offset: 224)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1547, file: !4, line: 1583, baseType: !961, size: 64, align: 64, offset: 256)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1547, file: !4, line: 1591, baseType: !1692, size: 64, align: 64, offset: 320)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1547, file: !4, line: 1598, baseType: !961, size: 64, align: 64, offset: 384)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1547, file: !4, line: 1606, baseType: !976, size: 64, align: 64, offset: 448)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1547, file: !4, line: 1614, baseType: !970, size: 32, align: 32, offset: 512)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1547, file: !4, line: 1622, baseType: !970, size: 32, align: 32, offset: 544)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1547, file: !4, line: 1628, baseType: !970, size: 32, align: 32, offset: 576)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1547, file: !4, line: 1636, baseType: !970, size: 32, align: 32, offset: 608)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1547, file: !4, line: 1643, baseType: !970, size: 32, align: 32, offset: 640)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1547, file: !4, line: 1657, baseType: !1151, size: 64, align: 64, offset: 704)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1547, file: !4, line: 1658, baseType: !970, size: 32, align: 32, offset: 768)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1547, file: !4, line: 1679, baseType: !983, size: 64, align: 32, offset: 800)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1547, file: !4, line: 1688, baseType: !970, size: 32, align: 32, offset: 864)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1547, file: !4, line: 1712, baseType: !970, size: 32, align: 32, offset: 896)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1547, file: !4, line: 1729, baseType: !970, size: 32, align: 32, offset: 928)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1547, file: !4, line: 1729, baseType: !970, size: 32, align: 32, offset: 960)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1547, file: !4, line: 1744, baseType: !970, size: 32, align: 32, offset: 992)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1547, file: !4, line: 1744, baseType: !970, size: 32, align: 32, offset: 1024)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1547, file: !4, line: 1751, baseType: !970, size: 32, align: 32, offset: 1056)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1547, file: !4, line: 1766, baseType: !666, size: 32, align: 32, offset: 1088)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1547, file: !4, line: 1791, baseType: !1713, size: 64, align: 64, offset: 1152)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{null, !1716, !1658, !1122, !970, !970, !970}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1547, file: !4, line: 1808, baseType: !1718, size: 64, align: 64, offset: 1216)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DISubroutineType(types: !1720)
!1720 = !{!666, !1716, !1566}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1547, file: !4, line: 1816, baseType: !970, size: 32, align: 32, offset: 1280)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1547, file: !4, line: 1825, baseType: !1723, size: 32, align: 32, offset: 1312)
!1723 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1547, file: !4, line: 1830, baseType: !970, size: 32, align: 32, offset: 1344)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1547, file: !4, line: 1838, baseType: !1723, size: 32, align: 32, offset: 1376)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1547, file: !4, line: 1846, baseType: !970, size: 32, align: 32, offset: 1408)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1547, file: !4, line: 1851, baseType: !970, size: 32, align: 32, offset: 1440)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1547, file: !4, line: 1861, baseType: !1723, size: 32, align: 32, offset: 1472)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1547, file: !4, line: 1868, baseType: !1723, size: 32, align: 32, offset: 1504)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1547, file: !4, line: 1875, baseType: !1723, size: 32, align: 32, offset: 1536)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1547, file: !4, line: 1882, baseType: !1723, size: 32, align: 32, offset: 1568)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1547, file: !4, line: 1889, baseType: !1723, size: 32, align: 32, offset: 1600)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1547, file: !4, line: 1896, baseType: !1723, size: 32, align: 32, offset: 1632)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1547, file: !4, line: 1903, baseType: !1723, size: 32, align: 32, offset: 1664)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1547, file: !4, line: 1910, baseType: !970, size: 32, align: 32, offset: 1696)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1547, file: !4, line: 1915, baseType: !970, size: 32, align: 32, offset: 1728)
