; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test/[inter]test--poly1305_internal_test-bin-poly1305_internal_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test/[inter]test--poly1305_internal_test-bin-poly1305_internal_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TESTDATA = type { %struct.SIZED_DATA, %struct.SIZED_DATA, %struct.SIZED_DATA }
%struct.SIZED_DATA = type { i64, [1024 x i8] }
%struct.poly1305_context = type { [24 x double], [4 x i32], [16 x i8], i64, %struct.anon }
%struct.anon = type { void (i8*, i8*, i64, i32)*, void (i8*, i8*, i32*)* }

@.str = private unnamed_addr constant [14 x i8] c"test_poly1305\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test/[inter]test--poly1305_internal_test-bin-poly1305_internal_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test")
!2 = !{}
!3 = !{!4}
!4 = distinct !DIGlobalVariable(name: "tests", scope: !0, file: !5, line: 37, type: !6, isLocal: true, isDefinition: true, variable: [35 x %struct.TESTDATA]* @tests)
!5 = !DIFile(filename: "test/poly1305_internal_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test")
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 866880, align: 64, elements: !26)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "TESTDATA", file: !5, line: 29, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 25, size: 24768, align: 64, elements: !9)
!9 = !{!10, !24, !25}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !8, file: !5, line: 26, baseType: !11, size: 8256, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIZED_DATA", file: !5, line: 23, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 20, size: 8256, align: 64, elements: !13)
!13 = !{!14, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !5, line: 21, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 216, baseType: !17)
!16 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test")
!17 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !5, line: 22, baseType: !19, size: 8192, align: 8, offset: 64)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, align: 8, elements: !22)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!22 = !{!23}
!23 = !DISubrange(count: 1024)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !8, file: !5, line: 27, baseType: !11, size: 8256, align: 64, offset: 8256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !8, file: !5, line: 28, baseType: !11, size: 8256, align: 64, offset: 16512)
!26 = !{!27}
!27 = !DISubrange(count: 35)
!28 = !{i32 2, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!31 = distinct !DISubprogram(name: "setup_tests", scope: !5, file: !5, line: 1572, type: !32, isLocal: false, isDefinition: true, scopeLine: 1573, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!32 = !DISubroutineType(types: !33)
!33 = !{!34}
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DILocation(line: 1574, column: 5, scope: !31)
!36 = !DILocation(line: 1575, column: 5, scope: !31)
!37 = distinct !DISubprogram(name: "test_poly1305", scope: !5, file: !5, line: 1507, type: !38, isLocal: true, isDefinition: true, scopeLine: 1508, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{!34, !34}
!40 = !DILocalVariable(name: "idx", arg: 1, scope: !37, file: !5, line: 1507, type: !34)
!41 = !DIExpression()
!42 = !DILocation(line: 1507, column: 30, scope: !37)
!43 = !DILocalVariable(name: "poly1305", scope: !37, file: !5, line: 1509, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLY1305", file: !45, line: 16, baseType: !46)
!45 = !DIFile(filename: "crypto/include/internal/poly1305.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "poly1305_context", file: !47, line: 15, size: 1984, align: 64, elements: !48)
!47 = !DIFile(filename: "test/../crypto/poly1305/poly1305_local.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--poly1305_internal_test")
!48 = !{!49, !54, !59, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !46, file: !47, line: 16, baseType: !50, size: 1536, align: 64)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1536, align: 64, elements: !52)
!51 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!52 = !{!53}
!53 = !DISubrange(count: 24)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !46, file: !47, line: 20, baseType: !55, size: 128, align: 32, offset: 1536)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, align: 32, elements: !57)
!56 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!57 = !{!58}
!58 = !DISubrange(count: 4)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !47, line: 21, baseType: !60, size: 128, align: 8, offset: 1664)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, align: 8, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 16)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !46, file: !47, line: 22, baseType: !15, size: 64, align: 64, offset: 1792)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !46, file: !47, line: 26, baseType: !65, size: 128, align: 64, offset: 1856)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !47, line: 23, size: 128, align: 64, elements: !66)
!66 = !{!67, !74}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !65, file: !47, line: 24, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "poly1305_blocks_f", file: !47, line: 10, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !73, !15, !56}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !65, file: !47, line: 25, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "poly1305_emit_f", file: !47, line: 12, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !72, !79, !80}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!82 = !DILocation(line: 1509, column: 14, scope: !37)
!83 = !DILocalVariable(name: "test", scope: !37, file: !5, line: 1510, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!85 = !DILocation(line: 1510, column: 20, scope: !37)
!86 = !DILocation(line: 1510, column: 33, scope: !37)
!87 = !DILocation(line: 1510, column: 27, scope: !37)
!88 = !DILocalVariable(name: "in", scope: !37, file: !5, line: 1511, type: !73)
!89 = !DILocation(line: 1511, column: 26, scope: !37)
!90 = !DILocation(line: 1511, column: 36, scope: !37)
!91 = !DILocation(line: 1511, column: 42, scope: !37)
!92 = !DILocation(line: 1511, column: 31, scope: !37)
!93 = !DILocalVariable(name: "inlen", scope: !37, file: !5, line: 1512, type: !15)
!94 = !DILocation(line: 1512, column: 12, scope: !37)
!95 = !DILocation(line: 1512, column: 25, scope: !37)
!96 = !DILocation(line: 1512, column: 31, scope: !37)
!97 = !DILocalVariable(name: "key", scope: !37, file: !5, line: 1513, type: !73)
!98 = !DILocation(line: 1513, column: 26, scope: !37)
!99 = !DILocation(line: 1513, column: 37, scope: !37)
!100 = !DILocation(line: 1513, column: 41, scope: !37)
!101 = !DILocation(line: 1513, column: 32, scope: !37)
!102 = !DILocalVariable(name: "expected", scope: !37, file: !5, line: 1514, type: !73)
!103 = !DILocation(line: 1514, column: 26, scope: !37)
!104 = !DILocation(line: 1514, column: 42, scope: !37)
!105 = !DILocation(line: 1514, column: 51, scope: !37)
!106 = !DILocation(line: 1514, column: 37, scope: !37)
!107 = !DILocalVariable(name: "expectedlen", scope: !37, file: !5, line: 1515, type: !15)
!108 = !DILocation(line: 1515, column: 12, scope: !37)
!109 = !DILocation(line: 1515, column: 31, scope: !37)
!110 = !DILocation(line: 1515, column: 40, scope: !37)
!111 = !DILocalVariable(name: "out", scope: !37, file: !5, line: 1516, type: !60)
!112 = !DILocation(line: 1516, column: 19, scope: !37)
!113 = !DILocation(line: 1518, column: 94, scope: !114)
!114 = distinct !DILexicalBlock(scope: !37, file: !5, line: 1518, column: 9)
!115 = !DILocation(line: 1518, column: 10, scope: !114)
!116 = !DILocation(line: 1518, column: 9, scope: !37)
!117 = !DILocation(line: 1519, column: 9, scope: !114)
!118 = !DILocation(line: 1521, column: 30, scope: !37)
!119 = !DILocation(line: 1521, column: 5, scope: !37)
!120 = !DILocation(line: 1522, column: 32, scope: !37)
!121 = !DILocation(line: 1522, column: 36, scope: !37)
!122 = !DILocation(line: 1522, column: 5, scope: !37)
!123 = !DILocation(line: 1523, column: 31, scope: !37)
!124 = !DILocation(line: 1523, column: 5, scope: !37)
!125 = !DILocation(line: 1525, column: 80, scope: !126)
!126 = distinct !DILexicalBlock(scope: !37, file: !5, line: 1525, column: 9)
!127 = !DILocation(line: 1525, column: 85, scope: !126)
!128 = !DILocation(line: 1525, column: 98, scope: !126)
!129 = !DILocation(line: 1525, column: 108, scope: !126)
!130 = !DILocation(line: 1525, column: 10, scope: !126)
!131 = !DILocation(line: 1525, column: 9, scope: !37)
!132 = !DILocation(line: 1526, column: 87, scope: !133)
!133 = distinct !DILexicalBlock(scope: !126, file: !5, line: 1525, column: 122)
!134 = !DILocation(line: 1526, column: 9, scope: !133)
!135 = !DILocation(line: 1527, column: 9, scope: !133)
!136 = !DILocation(line: 1530, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !37, file: !5, line: 1530, column: 9)
