; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test/[inter]test--ssl_test_ctx_test-bin-ssl_test_ctx_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test/[inter]test--ssl_test_ctx_test-bin-ssl_test_ctx_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.options_st = type { i8*, i32, i32, i8* }
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, {}*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.ssl_test_ctx_test_fixture = type { i8*, i8*, %struct.SSL_TEST_CTX* }
%struct.SSL_TEST_CTX = type { i32, i32, i32, i32, i32, %struct.SSL_TEST_EXTRA_CONF, %struct.SSL_TEST_EXTRA_CONF, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, i32, i32, i32, %struct.stack_st_X509_NAME*, i32, i32, i32, %struct.stack_st_X509_NAME*, i32, i32, i32, i32, i8*, i8* }
%struct.SSL_TEST_EXTRA_CONF = type { %struct.SSL_TEST_CLIENT_CONF, %struct.SSL_TEST_SERVER_CONF, %struct.SSL_TEST_SERVER_CONF }

!4 = !DIFile(filename: "test/ssl_test_ctx.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "SSL_TEST_METHOD_TLS", value: 0)
!7 = !DIEnumerator(name: "SSL_TEST_METHOD_DTLS", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 70, size: 32, align: 32, elements: !9)
!9 = !{!10, !11, !12, !13, !14, !15, !16}
!10 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_SIMPLE", value: 0)
!11 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_RESUME", value: 1)
!12 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_RENEG_SERVER", value: 2)
!13 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_RENEG_CLIENT", value: 3)
!14 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_KEY_UPDATE_SERVER", value: 4)
!15 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_KEY_UPDATE_CLIENT", value: 5)
!16 = !DIEnumerator(name: "SSL_TEST_HANDSHAKE_POST_HANDSHAKE_AUTH", value: 6)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 25, size: 32, align: 32, elements: !18)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "SSL_TEST_VERIFY_NONE", value: 0)
!20 = !DIEnumerator(name: "SSL_TEST_VERIFY_ACCEPT_ALL", value: 1)
!21 = !DIEnumerator(name: "SSL_TEST_VERIFY_REJECT_ALL", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_NONE", value: 0)
!25 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_SERVER1", value: 1)
!26 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_SERVER2", value: 2)
!27 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_INVALID", value: 3)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 80, size: 32, align: 32, elements: !29)
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_NONE", value: 0)
!31 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_PERMISSIVE", value: 1)
!32 = !DIEnumerator(name: "SSL_TEST_CT_VALIDATION_STRICT", value: 2)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40}
!35 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CB_NONE", value: 0)
!36 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_IGNORE_MISMATCH", value: 1)
!37 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_REJECT_MISMATCH", value: 2)
!38 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_IGNORE_MISMATCH", value: 3)
!39 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_REJECT_MISMATCH", value: 4)
!40 = !DIEnumerator(name: "SSL_TEST_SERVERNAME_CLIENT_HELLO_NO_V12", value: 5)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 86, size: 32, align: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_NONE", value: 0)
!44 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_GOOD_RESPONSE", value: 1)
!45 = !DIEnumerator(name: "SSL_TEST_CERT_STATUS_BAD_RESPONSE", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !47)
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIEnumerator(name: "SSL_TEST_SUCCESS", value: 0)
!49 = !DIEnumerator(name: "SSL_TEST_SERVER_FAIL", value: 1)
!50 = !DIEnumerator(name: "SSL_TEST_CLIENT_FAIL", value: 2)
!51 = !DIEnumerator(name: "SSL_TEST_INTERNAL_ERROR", value: 3)
!52 = !DIEnumerator(name: "SSL_TEST_FIRST_HANDSHAKE_FAILED", value: 4)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_IGNORE", value: 0)
!56 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_YES", value: 1)
!57 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_NO", value: 2)
!58 = !DIEnumerator(name: "SSL_TEST_SESSION_TICKET_BROKEN", value: 3)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 59, size: 32, align: 32, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_IGNORE", value: 0)
!62 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_YES", value: 1)
!63 = !DIEnumerator(name: "SSL_TEST_SESSION_ID_NO", value: 2)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 54, size: 32, align: 32, elements: !65)
!65 = !{!66, !67}
!66 = !DIEnumerator(name: "SSL_TEST_COMPRESSION_NO", value: 0)
!67 = !DIEnumerator(name: "SSL_TEST_COMPRESSION_YES", value: 1)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!70 = !{!71, !94, !153}
!71 = distinct !DIGlobalVariable(name: "options", scope: !72, file: !73, line: 243, type: !91, isLocal: true, isDefinition: true, variable: [9 x %struct.options_st]* @test_get_options.options)
!72 = distinct !DISubprogram(name: "test_get_options", scope: !73, file: !73, line: 243, type: !74, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!73 = !DIFile(filename: "test/ssl_test_ctx_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test")
!74 = !DISubroutineType(types: !75)
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPTIONS", file: !79, line: 280, baseType: !80)
!79 = !DIFile(filename: "apps/include/opt.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "options_st", file: !79, line: 269, size: 192, align: 64, elements: !81)
!81 = !{!82, !86, !88, !89}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !79, line: 270, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !80, file: !79, line: 271, baseType: !87, size: 32, align: 32, offset: 64)
!87 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "valtype", scope: !80, file: !79, line: 278, baseType: !87, size: 32, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "helpstr", scope: !80, file: !79, line: 279, baseType: !83, size: 64, align: 64, offset: 128)
!90 = !{}
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1728, align: 64, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 9)
!94 = distinct !DIGlobalVariable(name: "conf", scope: !0, file: !73, line: 26, type: !95, isLocal: true, isDefinition: true, variable: %struct.conf_st** @conf)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !97, line: 144, baseType: !98)
!97 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !99, line: 103, size: 192, align: 64, elements: !100)
!99 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test")
!100 = !{!101, !141, !142}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !98, file: !99, line: 104, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !99, line: 35, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !99, line: 37, size: 640, align: 64, elements: !105)
!105 = !{!106, !107, !111, !115, !116, !117, !126, !132, !136, !137}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !99, line: 38, baseType: !83, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !104, file: !99, line: 39, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!95, !102}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !104, file: !99, line: 40, baseType: !112, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!87, !95}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !104, file: !99, line: 41, baseType: !112, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !104, file: !99, line: 42, baseType: !112, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !104, file: !99, line: 43, baseType: !118, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!87, !95, !121, !124}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !97, line: 79, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !97, line: 79, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !104, file: !99, line: 44, baseType: !127, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!87, !130, !121}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !104, file: !99, line: 45, baseType: !133, size: 64, align: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!87, !130, !85}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !104, file: !99, line: 46, baseType: !133, size: 64, align: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !104, file: !99, line: 47, baseType: !138, size: 64, align: 64, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!87, !95, !83, !124}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !98, file: !99, line: 105, baseType: !69, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !99, line: 106, baseType: !143, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !99, line: 31, size: 64, align: 64, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !144, file: !99, line: 31, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !99, line: 31, size: 64, align: 64, elements: !148)
!148 = !{!149, !150, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !147, file: !99, line: 31, baseType: !69, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !147, file: !99, line: 31, baseType: !151, size: 64, align: 64)
!151 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !147, file: !99, line: 31, baseType: !87, size: 32, align: 32)
!153 = distinct !DIGlobalVariable(name: "bad_configurations", scope: !0, file: !73, line: 211, type: !154, isLocal: true, isDefinition: true, variable: [16 x i8*]* @bad_configurations)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 1024, align: 64, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !{i32 2, !"Dwarf Version", i32 4}
!158 = !{i32 2, !"Debug Info Version", i32 3}
!159 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!160 = !DILocation(line: 243, column: 6, scope: !72)
!161 = distinct !DISubprogram(name: "setup_tests", scope: !73, file: !73, line: 245, type: !162, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!162 = !DISubroutineType(types: !163)
!163 = !{!87}
!164 = !DILocation(line: 247, column: 85, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !73, line: 247, column: 9)
!166 = !DILocation(line: 247, column: 83, scope: !165)
!167 = !DILocation(line: 247, column: 78, scope: !165)
!168 = !DILocation(line: 247, column: 10, scope: !169)
!169 = !DILexicalBlockFile(scope: !165, file: !73, discriminator: 1)
!170 = !DILocation(line: 247, column: 10, scope: !165)
!171 = !DILocation(line: 247, column: 9, scope: !161)
!172 = !DILocation(line: 248, column: 9, scope: !165)
!173 = !DILocation(line: 250, column: 119, scope: !174)
!174 = distinct !DILexicalBlock(scope: !161, file: !73, line: 250, column: 9)
!175 = !DILocation(line: 250, column: 125, scope: !174)
!176 = !DILocation(line: 250, column: 108, scope: !177)
!177 = !DILexicalBlockFile(scope: !174, file: !73, discriminator: 1)
!178 = !DILocation(line: 250, column: 10, scope: !179)
!179 = !DILexicalBlockFile(scope: !174, file: !73, discriminator: 2)
!180 = !DILocation(line: 250, column: 10, scope: !174)
!181 = !DILocation(line: 250, column: 9, scope: !161)
!182 = !DILocation(line: 251, column: 9, scope: !174)
!183 = !DILocation(line: 253, column: 5, scope: !161)
!184 = !DILocation(line: 254, column: 5, scope: !161)
!185 = !DILocation(line: 255, column: 5, scope: !161)
!186 = !DILocation(line: 256, column: 5, scope: !161)
!187 = !DILocation(line: 257, column: 1, scope: !161)
!188 = distinct !DISubprogram(name: "test_empty_configuration", scope: !73, file: !73, line: 150, type: !162, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!189 = !DILocalVariable(name: "fixture", scope: !188, file: !73, line: 152, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CTX_TEST_FIXTURE", file: !73, line: 33, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_test_ctx_test_fixture", file: !73, line: 28, size: 192, align: 64, elements: !193)
!193 = !{!194, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "test_case_name", scope: !192, file: !73, line: 29, baseType: !83, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "test_section", scope: !192, file: !73, line: 30, baseType: !83, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "expected_ctx", scope: !192, file: !73, line: 32, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CTX", file: !4, line: 226, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 139, size: 4480, align: 64, elements: !200)
!200 = !{!201, !203, !205, !206, !207, !208, !246, !247, !249, !250, !251, !252, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !267, !268, !269, !270, !271, !272, !273, !274, !276, !277}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !199, file: !4, line: 144, baseType: !202, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_method_t", file: !4, line: 68, baseType: !3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_mode", scope: !199, file: !4, line: 146, baseType: !204, size: 32, align: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_handshake_mode_t", file: !4, line: 78, baseType: !8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "app_data_size", scope: !199, file: !4, line: 151, baseType: !87, size: 32, align: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "max_fragment_size", scope: !199, file: !4, line: 153, baseType: !87, size: 32, align: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "key_update_type", scope: !199, file: !4, line: 155, baseType: !87, size: 32, align: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !199, file: !4, line: 161, baseType: !209, size: 1600, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_EXTRA_CONF", file: !4, line: 137, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 133, size: 1600, align: 64, elements: !211)
!211 = !{!212, !230, !245}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !210, file: !4, line: 134, baseType: !213, size: 576, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_CLIENT_CONF", file: !4, line: 113, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 96, size: 576, align: 64, elements: !215)
!215 = !{!216, !218, !220, !221, !223, !224, !226, !227, !228, !229}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "verify_callback", scope: !214, file: !4, line: 98, baseType: !217, size: 32, align: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_verify_callback_t", file: !4, line: 29, baseType: !17)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "servername", scope: !214, file: !4, line: 100, baseType: !219, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_servername_t", file: !4, line: 36, baseType: !22)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max_fragment_len_mode", scope: !214, file: !4, line: 102, baseType: !87, size: 32, align: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "npn_protocols", scope: !214, file: !4, line: 104, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_protocols", scope: !214, file: !4, line: 105, baseType: !222, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ct_validation", scope: !214, file: !4, line: 106, baseType: !225, size: 32, align: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_ct_validation_t", file: !4, line: 84, baseType: !28)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reneg_ciphers", scope: !214, file: !4, line: 108, baseType: !222, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "srp_user", scope: !214, file: !4, line: 109, baseType: !222, size: 64, align: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "srp_password", scope: !214, file: !4, line: 110, baseType: !222, size: 64, align: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "enable_pha", scope: !214, file: !4, line: 112, baseType: !87, size: 32, align: 32, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !210, file: !4, line: 135, baseType: !231, size: 512, align: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_TEST_SERVER_CONF", file: !4, line: 131, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 115, size: 512, align: 64, elements: !233)
!233 = !{!234, !236, !237, !238, !239, !241, !242, !243, !244}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "servername_callback", scope: !232, file: !4, line: 117, baseType: !235, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_servername_callback_t", file: !4, line: 45, baseType: !33)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "npn_protocols", scope: !232, file: !4, line: 119, baseType: !222, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_protocols", scope: !232, file: !4, line: 120, baseType: !222, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "broken_session_ticket", scope: !232, file: !4, line: 122, baseType: !87, size: 32, align: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cert_status", scope: !232, file: !4, line: 124, baseType: !240, size: 32, align: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_cert_status_t", file: !4, line: 90, baseType: !41)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "srp_user", scope: !232, file: !4, line: 126, baseType: !222, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "srp_password", scope: !232, file: !4, line: 127, baseType: !222, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "force_pha", scope: !232, file: !4, line: 129, baseType: !87, size: 32, align: 32, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_app_data", scope: !232, file: !4, line: 130, baseType: !222, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "server2", scope: !210, file: !4, line: 136, baseType: !231, size: 512, align: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "resume_extra", scope: !199, file: !4, line: 163, baseType: !209, size: 1600, align: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "expected_result", scope: !199, file: !4, line: 169, baseType: !248, size: 32, align: 32, offset: 3392)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_test_result_t", file: !4, line: 23, baseType: !46)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_alert", scope: !199, file: !4, line: 173, baseType: !87, size: 32, align: 32, offset: 3424)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_alert", scope: !199, file: !4, line: 175, baseType: !87, size: 32, align: 32, offset: 3456)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "expected_protocol", scope: !199, file: !4, line: 178, baseType: !87, size: 32, align: 32, offset: 3488)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "expected_servername", scope: !199, file: !4, line: 189, baseType: !219, size: 32, align: 32, offset: 3520)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "session_ticket_expected", scope: !199, file: !4, line: 190, baseType: !254, size: 32, align: 32, offset: 3552)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_session_ticket_t", file: !4, line: 52, baseType: !53)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "compression_expected", scope: !199, file: !4, line: 191, baseType: !87, size: 32, align: 32, offset: 3584)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "expected_npn_protocol", scope: !199, file: !4, line: 193, baseType: !222, size: 64, align: 64, offset: 3648)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "expected_alpn_protocol", scope: !199, file: !4, line: 194, baseType: !222, size: 64, align: 64, offset: 3712)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "resumption_expected", scope: !199, file: !4, line: 196, baseType: !87, size: 32, align: 32, offset: 3776)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "expected_tmp_key_type", scope: !199, file: !4, line: 198, baseType: !87, size: 32, align: 32, offset: 3808)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_cert_type", scope: !199, file: !4, line: 200, baseType: !87, size: 32, align: 32, offset: 3840)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_sign_hash", scope: !199, file: !4, line: 202, baseType: !87, size: 32, align: 32, offset: 3872)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_sign_type", scope: !199, file: !4, line: 204, baseType: !87, size: 32, align: 32, offset: 3904)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "expected_server_ca_names", scope: !199, file: !4, line: 206, baseType: !264, size: 64, align: 64, offset: 3968)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME", file: !266, line: 77, flags: DIFlagFwdDecl)
!266 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ssl_test_ctx_test")
!267 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_cert_type", scope: !199, file: !4, line: 208, baseType: !87, size: 32, align: 32, offset: 4032)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_sign_hash", scope: !199, file: !4, line: 210, baseType: !87, size: 32, align: 32, offset: 4064)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_sign_type", scope: !199, file: !4, line: 212, baseType: !87, size: 32, align: 32, offset: 4096)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "expected_client_ca_names", scope: !199, file: !4, line: 214, baseType: !264, size: 64, align: 64, offset: 4160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "use_sctp", scope: !199, file: !4, line: 216, baseType: !87, size: 32, align: 32, offset: 4224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "enable_client_sctp_label_bug", scope: !199, file: !4, line: 218, baseType: !87, size: 32, align: 32, offset: 4256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "enable_server_sctp_label_bug", scope: !199, file: !4, line: 220, baseType: !87, size: 32, align: 32, offset: 4288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_expected", scope: !199, file: !4, line: 222, baseType: !275, size: 32, align: 32, offset: 4320)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_session_id_t", file: !4, line: 63, baseType: !59)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "expected_cipher", scope: !199, file: !4, line: 223, baseType: !222, size: 64, align: 64, offset: 4352)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "expected_session_ticket_app_data", scope: !199, file: !4, line: 225, baseType: !222, size: 64, align: 64, offset: 4416)
!278 = !DIExpression()
!279 = !DILocation(line: 152, column: 32, scope: !188)
!280 = !DILocation(line: 152, column: 42, scope: !188)
!281 = !DILocalVariable(name: "result", scope: !188, file: !73, line: 152, type: !87)
!282 = !DILocation(line: 152, column: 64, scope: !188)
!283 = !DILocation(line: 153, column: 9, scope: !284)
!284 = distinct !DILexicalBlock(scope: !188, file: !73, line: 153, column: 9)
!285 = !DILocation(line: 153, column: 17, scope: !284)
!286 = !DILocation(line: 153, column: 9, scope: !188)
!287 = !DILocation(line: 154, column: 9, scope: !284)
!288 = !DILocation(line: 155, column: 5, scope: !188)
!289 = !DILocation(line: 155, column: 14, scope: !188)
!290 = !DILocation(line: 155, column: 27, scope: !188)
!291 = !DILocation(line: 156, column: 5, scope: !188)
!292 = !DILocation(line: 156, column: 14, scope: !188)
!293 = !DILocation(line: 156, column: 28, scope: !188)
!294 = !DILocation(line: 156, column: 44, scope: !188)
!295 = !DILocation(line: 157, column: 9, scope: !296)
!296 = distinct !DILexicalBlock(scope: !188, file: !73, line: 157, column: 9)
!297 = !DILocation(line: 157, column: 17, scope: !296)
!298 = !DILocation(line: 157, column: 9, scope: !188)
!299 = !DILocation(line: 157, column: 30, scope: !300)
!300 = !DILexicalBlockFile(scope: !301, file: !73, discriminator: 1)
!301 = distinct !DILexicalBlock(scope: !296, file: !73, line: 157, column: 6)
!302 = !DILocation(line: 157, column: 17, scope: !300)
!303 = !DILocation(line: 157, column: 15, scope: !300)
!304 = !DILocation(line: 157, column: 50, scope: !300)
!305 = !DILocation(line: 157, column: 40, scope: !306)
!306 = !DILexicalBlockFile(scope: !300, file: !73, discriminator: 2)
!307 = !DILocation(line: 157, column: 60, scope: !300)
!308 = !DILocation(line: 158, column: 12, scope: !188)
!309 = !DILocation(line: 158, column: 5, scope: !188)
!310 = !DILocation(line: 159, column: 1, scope: !188)
!311 = distinct !DISubprogram(name: "test_good_configuration", scope: !73, file: !73, line: 161, type: !162, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!312 = !DILocalVariable(name: "fixture", scope: !311, file: !73, line: 163, type: !190)
!313 = !DILocation(line: 163, column: 32, scope: !311)
!314 = !DILocation(line: 163, column: 42, scope: !311)
!315 = !DILocalVariable(name: "result", scope: !311, file: !73, line: 163, type: !87)
!316 = !DILocation(line: 163, column: 64, scope: !311)
!317 = !DILocation(line: 164, column: 9, scope: !318)
!318 = distinct !DILexicalBlock(scope: !311, file: !73, line: 164, column: 9)
!319 = !DILocation(line: 164, column: 17, scope: !318)
!320 = !DILocation(line: 164, column: 9, scope: !311)
!321 = !DILocation(line: 165, column: 9, scope: !318)
!322 = !DILocation(line: 166, column: 5, scope: !311)
!323 = !DILocation(line: 166, column: 14, scope: !311)
!324 = !DILocation(line: 166, column: 27, scope: !311)
!325 = !DILocation(line: 167, column: 5, scope: !311)
!326 = !DILocation(line: 167, column: 14, scope: !311)
!327 = !DILocation(line: 167, column: 28, scope: !311)
!328 = !DILocation(line: 167, column: 35, scope: !311)
!329 = !DILocation(line: 168, column: 5, scope: !311)
!330 = !DILocation(line: 168, column: 14, scope: !311)
!331 = !DILocation(line: 168, column: 28, scope: !311)
!332 = !DILocation(line: 168, column: 43, scope: !311)
!333 = !DILocation(line: 169, column: 5, scope: !311)
!334 = !DILocation(line: 169, column: 14, scope: !311)
!335 = !DILocation(line: 169, column: 28, scope: !311)
!336 = !DILocation(line: 169, column: 42, scope: !311)
!337 = !DILocation(line: 170, column: 5, scope: !311)
!338 = !DILocation(line: 170, column: 14, scope: !311)
!339 = !DILocation(line: 170, column: 28, scope: !311)
!340 = !DILocation(line: 170, column: 46, scope: !311)
