; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test/[inter]test--asn1_time_test-bin-asn1_time_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test/[inter]test--asn1_time_test-bin-asn1_time_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.testdata = type { i8*, i32, i32, i32, i64, i32, i32 }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.compare_testdata = type { %struct.asn1_string_st, %struct.asn1_string_st, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [15 x i8] c"test_table_pos\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"test/asn1_time_test.c\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"Adding negative-sign time_t tests\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"test_table_neg\00", align 1
@.str.4 = private unnamed_addr constant [27 x i8] c"Adding 64-bit time_t tests\00", align 1
@.str.5 = private unnamed_addr constant [21 x i8] c"test_table_pos_64bit\00", align 1
@.str.6 = private unnamed_addr constant [41 x i8] c"Adding negative-sign 64-bit time_t tests\00", align 1
@.str.7 = private unnamed_addr constant [21 x i8] c"test_table_neg_64bit\00", align 1
@.str.8 = private unnamed_addr constant [19 x i8] c"test_table_compare\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !10)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test/[inter]test--asn1_time_test-bin-asn1_time_test.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test")
!2 = !{}
!3 = !{!4, !5, !7, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!9 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!10 = !{!11, !23, !28, !41, !45, !49, !53, !62, !64, !68, !69}
!11 = distinct !DIGlobalVariable(name: "gtime", scope: !0, file: !12, line: 102, type: !13, isLocal: true, isDefinition: true, variable: %struct.asn1_string_st* @gtime)
!12 = !DIFile(filename: "test/asn1_time_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !14, line: 51, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !16, line: 146, size: 192, align: 64, elements: !17)
!16 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test")
!17 = !{!18, !20, !21, !22}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !15, file: !16, line: 147, baseType: !19, size: 32, align: 32)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !16, line: 148, baseType: !19, size: 32, align: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !15, file: !16, line: 149, baseType: !5, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !16, line: 155, baseType: !9, size: 64, align: 64, offset: 128)
!23 = distinct !DIGlobalVariable(name: "gtime_t", scope: !0, file: !12, line: 108, type: !24, isLocal: true, isDefinition: true, variable: i64* @gtime_t)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !25, line: 75, baseType: !26)
!25 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 139, baseType: !9)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--asn1_time_test")
!28 = distinct !DIGlobalVariable(name: "tbl_testdata_pos", scope: !0, file: !12, line: 31, type: !29, isLocal: true, isDefinition: true, variable: [46 x %struct.testdata]* @tbl_testdata_pos)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 14720, align: 64, elements: !39)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "testdata", file: !12, line: 21, size: 320, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !12, line: 22, baseType: !7, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !12, line: 23, baseType: !19, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "expected_type", scope: !30, file: !12, line: 24, baseType: !19, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "check_result", scope: !30, file: !12, line: 25, baseType: !19, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !30, file: !12, line: 26, baseType: !24, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cmp_result", scope: !30, file: !12, line: 27, baseType: !19, size: 32, align: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "convert_result", scope: !30, file: !12, line: 28, baseType: !19, size: 32, align: 32, offset: 288)
!39 = !{!40}
!40 = !DISubrange(count: 46)
!41 = distinct !DIGlobalVariable(name: "tbl_testdata_neg", scope: !0, file: !12, line: 81, type: !42, isLocal: true, isDefinition: true, variable: [3 x %struct.testdata]* @tbl_testdata_neg)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 960, align: 64, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 3)
!45 = distinct !DIGlobalVariable(name: "tbl_testdata_pos_64bit", scope: !0, file: !12, line: 88, type: !46, isLocal: true, isDefinition: true, variable: [4 x %struct.testdata]* @tbl_testdata_pos_64bit)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1280, align: 64, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 4)
!49 = distinct !DIGlobalVariable(name: "tbl_testdata_neg_64bit", scope: !0, file: !12, line: 96, type: !50, isLocal: true, isDefinition: true, variable: [2 x %struct.testdata]* @tbl_testdata_neg_64bit)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 640, align: 64, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 2)
!53 = distinct !DIGlobalVariable(name: "tbl_compare_testdata", scope: !0, file: !12, line: 294, type: !54, isLocal: true, isDefinition: true, variable: [16 x %struct.compare_testdata]* @tbl_compare_testdata)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 7168, align: 64, elements: !60)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "compare_testdata", file: !12, line: 278, size: 448, align: 64, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !55, file: !12, line: 279, baseType: !13, size: 192, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !55, file: !12, line: 280, baseType: !13, size: 192, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !55, file: !12, line: 281, baseType: !19, size: 32, align: 32, offset: 384)
!60 = !{!61}
!61 = !DISubrange(count: 16)
!62 = distinct !DIGlobalVariable(name: "TODAY_GEN_STR", scope: !0, file: !12, line: 284, type: !63, isLocal: true, isDefinition: true, variable: [16 x i8]* @TODAY_GEN_STR)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, align: 8, elements: !60)
!64 = distinct !DIGlobalVariable(name: "TODAY_UTC_STR", scope: !0, file: !12, line: 286, type: !65, isLocal: true, isDefinition: true, variable: [14 x i8]* @TODAY_UTC_STR)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 112, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 14)
!68 = distinct !DIGlobalVariable(name: "TOMORROW_GEN_STR", scope: !0, file: !12, line: 285, type: !63, isLocal: true, isDefinition: true, variable: [16 x i8]* @TOMORROW_GEN_STR)
!69 = distinct !DIGlobalVariable(name: "TOMORROW_UTC_STR", scope: !0, file: !12, line: 287, type: !65, isLocal: true, isDefinition: true, variable: [14 x i8]* @TOMORROW_UTC_STR)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!73 = distinct !DISubprogram(name: "setup_tests", scope: !12, file: !12, line: 323, type: !74, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!74 = !DISubroutineType(types: !75)
!75 = !{!19}
!76 = !DILocalVariable(name: "t", scope: !73, file: !12, line: 333, type: !24)
!77 = !DIExpression()
!78 = !DILocation(line: 333, column: 12, scope: !73)
!79 = !DILocalVariable(name: "ptm", scope: !73, file: !12, line: 339, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !25, line: 133, size: 448, align: 64, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !81, file: !25, line: 135, baseType: !19, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !81, file: !25, line: 136, baseType: !19, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !81, file: !25, line: 137, baseType: !19, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !81, file: !25, line: 138, baseType: !19, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !81, file: !25, line: 139, baseType: !19, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !81, file: !25, line: 140, baseType: !19, size: 32, align: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !81, file: !25, line: 141, baseType: !19, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !81, file: !25, line: 142, baseType: !19, size: 32, align: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !81, file: !25, line: 143, baseType: !19, size: 32, align: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !81, file: !25, line: 146, baseType: !9, size: 64, align: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !81, file: !25, line: 147, baseType: !94, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!96 = !DILocation(line: 339, column: 16, scope: !73)
!97 = !DILocation(line: 339, column: 22, scope: !73)
!98 = !DILocation(line: 341, column: 5, scope: !73)
!99 = !DILocation(line: 342, column: 11, scope: !100)
!100 = distinct !DILexicalBlock(scope: !73, file: !12, line: 342, column: 9)
!101 = !DILocation(line: 342, column: 13, scope: !100)
!102 = !DILocation(line: 342, column: 18, scope: !100)
!103 = !DILocation(line: 342, column: 21, scope: !104)
!104 = !DILexicalBlockFile(scope: !100, file: !12, discriminator: 1)
!105 = !DILocation(line: 342, column: 25, scope: !104)
!106 = !DILocation(line: 342, column: 9, scope: !104)
!107 = !DILocation(line: 343, column: 9, scope: !108)
!108 = distinct !DILexicalBlock(scope: !100, file: !12, line: 342, column: 33)
!109 = !DILocation(line: 344, column: 9, scope: !108)
!110 = !DILocation(line: 345, column: 5, scope: !108)
!111 = !DILocation(line: 347, column: 9, scope: !112)
!112 = distinct !DILexicalBlock(scope: !113, file: !12, line: 346, column: 44)
!113 = distinct !DILexicalBlock(scope: !73, file: !12, line: 346, column: 9)
!114 = !DILocation(line: 348, column: 9, scope: !112)
!115 = !DILocation(line: 350, column: 15, scope: !116)
!116 = distinct !DILexicalBlock(scope: !112, file: !12, line: 350, column: 13)
!117 = !DILocation(line: 350, column: 17, scope: !116)
!118 = !DILocation(line: 350, column: 22, scope: !116)
!119 = !DILocation(line: 350, column: 25, scope: !120)
!120 = !DILexicalBlockFile(scope: !116, file: !12, discriminator: 1)
!121 = !DILocation(line: 350, column: 29, scope: !120)
!122 = !DILocation(line: 350, column: 13, scope: !120)
!123 = !DILocation(line: 351, column: 13, scope: !124)
!124 = distinct !DILexicalBlock(scope: !116, file: !12, line: 350, column: 37)
!125 = !DILocation(line: 352, column: 13, scope: !124)
!126 = !DILocation(line: 353, column: 9, scope: !124)
!127 = !DILocation(line: 356, column: 5, scope: !73)
!128 = !DILocation(line: 357, column: 5, scope: !73)
!129 = distinct !DISubprogram(name: "test_table_pos", scope: !12, file: !12, line: 258, type: !130, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !19}
!132 = !DILocalVariable(name: "idx", arg: 1, scope: !129, file: !12, line: 258, type: !19)
!133 = !DILocation(line: 258, column: 31, scope: !129)
!134 = !DILocation(line: 260, column: 41, scope: !129)
!135 = !DILocation(line: 260, column: 12, scope: !129)
!136 = !DILocation(line: 260, column: 5, scope: !129)
!137 = distinct !DISubprogram(name: "test_table_neg", scope: !12, file: !12, line: 263, type: !130, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!138 = !DILocalVariable(name: "idx", arg: 1, scope: !137, file: !12, line: 263, type: !19)
!139 = !DILocation(line: 263, column: 31, scope: !137)
!140 = !DILocation(line: 265, column: 41, scope: !137)
!141 = !DILocation(line: 265, column: 12, scope: !137)
!142 = !DILocation(line: 265, column: 5, scope: !137)
!143 = distinct !DISubprogram(name: "test_table_pos_64bit", scope: !12, file: !12, line: 268, type: !130, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!144 = !DILocalVariable(name: "idx", arg: 1, scope: !143, file: !12, line: 268, type: !19)
!145 = !DILocation(line: 268, column: 37, scope: !143)
!146 = !DILocation(line: 270, column: 47, scope: !143)
!147 = !DILocation(line: 270, column: 12, scope: !143)
!148 = !DILocation(line: 270, column: 5, scope: !143)
